{
    "article": "After three days of hearing about machine translation, machine-aided translation, terminology, lexicography, in fact about the methodology and techniques that are making it possible to escalate the information flow to unprecedented proportions, I am astounded at my temerity in agreeing to speak about so pedestrian a subject as the role of the human translator. In vindication, may I say that I have spent a considerable number of years in training future generations of translators, so that this is perhaps an act of self-justification. I might add that what I have heard this week has not led me to believe that the translator's skills, unlike the compositor's, have become obsolete. I am convinced, however, that these skills must be adapted and expanded so that the translator can continue to play his vital role in the dissemination of information and as a \"keeper of the language\". Who is this translator? Why is he a translator? What skills does he have and how has he acquired them? What is his professional status? How can he achieve job satisfaction? Will he have any part to play in the development and application of machine and machine-aided translation? Must the established translator learn new tricks and should the translator-in-training be offered an entirely new training programme? These were only some of the questions that sprang to mind when I was asked to present the translator's view to wind up this conference. It will be useful to find answers to some of these questions before going on to the main body of my paper. Let us take a look at the average freelance translator today. Although working conditions may well differ greatly from country to country, translators probably concur in regard to professional ethos. (For guidance and support the translator can refer to FIT'S Translator's Charter as well as UNESCO's \"Recommendation on the legal protection of translators and translations and the practical means to improve the status of translators' adopted in 1976.) In this connection I should perhaps mention the special case of a translator who works in a country where his mother tongue is not spoken. As an English native speaker, for example, I work in an entirely German-speaking environment. This has the disadvantage of the ear and eye both being more readily attuned to German, my source language, and the danger of succumbing to its structures and idiom is exacerbated. I have chosen to take the freelance as an example of the average translator because again the bulk of my experience is in that area. The working environment apart, however, there is not much to choose between the work done by a freelance and that done by either a staff or an agency translator. To return to my earlier questions: why does the translator translate and how has he acquired his skills? Up to the 1950's, the translator usually came from either an academic language background and then moved on to special subjects like engineering, law or banking; or his background was economics, for example, or metallurgy, and he used his specialized knowledge of a subject in association with his language skills -so that quite often he entered the translating profession quite by chance. During the past twenty years an increasing number of translation institutes and university departments has been established to train future translators either at undergraduate or at graduate level -the latter often catering for postgraduates with a good command of foreign languages, but a degree in a scientific or business discipline. Translators today could have any of these backgrounds, but specialized training is increasingly in demand so that in future this will probably be the rule rather than the exception. Why translate? Obviously because the translator has a natural facility in languages; enjoys working with them; finds satisfaction in rendering a text in a foreign language into something that reads like an original in his mother tongue. He will only enjoy translation if he has certain qualities: self-discipline, an enquiring mind, some humility, a certain degree of pedantry, the ability to work alone but still keep in touch, not only self-criticism and knowing his own limitations, but being able to accept criticism. He must have a good grounding in the culture, life and institutions of the countries of both his source and his target languages (SL/TL) and be prepared to invest time and effort not only in keeping his languages really up to date but also in staying abreast of developments in his various fields of specialization and in working up new subjects. Versatility, flexibility and reliability should be his hallmarks. And this paragon is to be replaced by a mere machine? Well, no, that is hardly likely. From what I have heard here this week and from my own very limited experience of MT and text processing, the machine should make it easier for the translator to demonstrate his virtues, to highlight them as it were. He must, however, learn to accept and to use the machines as the aids they are intended to be. As a part-time freelance translator myself (the rest of my time is taken up with teaching my future peers) I am convinced that the translator's profession cannot but benefit from the advent of new technology, be this in the form of fully automatic high quality machine translation systems or machine aided translation including the whole range of equipment and software now available on the market -which will probably increase considerably in the next few years. I should like to digress here to discuss briefly what I consider will be the main positive impact for the translator of machine aids in the broadest sense. It seems to me that in the future the translator will be expected to wear two hats: the translator's and the translation consultant's. In the latter guise he will advise the client on the best method of solving his particular translation problem. This means first of all that the text itself will undergo much more careful scrutiny than has often been the case hitherto, with the main focus on the reasons for commissioning the translation. Advice can then be given on the most cost-effective translation in terms of user requirements. Repetitive tasks such as texts listing testing specifications, describing assembly procedures, giving directions for use, etc. can safely be ready stored as \"boiler-plate\" information in a particular format and adapted as required. This has two advantages: it relieves the translator of an exceedingly tedious task (I speak from bitter experience) and ensures that no unnecessary errors creep in. (I am convinced that had I always been supplied with standard machine-translated instructions for certain foreign appliances I should have managed to blow less fuses and cut fewer fingers in trying to get them to work.) Translation texts that are intended for information only, particularly those that will simply be scanned for the information they contain and then discarded, are often a waste of the translator's skills. Nor would it be cost-effective to employ such skills for this purpose. The style is of little consequence, and the quality of the presentation is usually also not important. Naturally if the job is not repetitive there can be no standard format, but standard vocabulary should be available and a machine or machine-aided translation could be supplied as a computer printout, for example, marked \"for information only\". The advantages of using machine translation for large-scale jobs, particularly where the time factor is of the essence, has already been clearly demonstrated during the course of this conference. As a result, the translator will have time to concentrate on those texts intended for publication, including radio and TV, advertising, slide shows, etc. But even if the translator's work is confined to texts that can be said to merit his skills, he will still be well advised to use machine aids. He can use a word processor on which to prepare his translation, with all the editing facilities that it offers. This means that he can spend much more time polishing his first draft without needing to retype. (This is particularly important for the translator working abroad, who invariably has to do his own typing -the local typists make too many errors when working from dictation.) There is no doubt at all that a wp is an invaluable aid to improving the quality of a translation. If the translator uses a micro computer he can have all the advantages of a wp (though perhaps it is not always quite as convenient to use editing software as it is to use a dedicated wp) with the added plus of having an incredibly wide choice of applications software ranging from spelling checks and style control to a program for recognizing split infinitives! A further advantage here is that if he feels he would like to arrange his personal glossaries in a certain way with certains forms of cross referencing, he can commission programs to be written or, ideally, write them himself. After all, he would really only need to learn another language! I started experimenting with micros and wps last autumn, and found that the final printed version of the texts I submitted to my clients were certainly more polished than I had previously managed, given the usual \"for yesterday\" deadline. This was only partly because the actual typing was a one-off chore. More important, revising and editing were almost a pleasure (the beginner's admiration for 'clever' equipment is very much to the fore here). The total time spent, however, was generally even less than I would have spent on previous similar jobs, and this despite my lack of experience in the use of such equipment. For me there is no question at all that given the tight deadlines invariably set, the freelance translator using machine aids intelligently can easily increase his volume of output and probably also improve the quality -if only from the point of view of presentation. He can save time by building up his own retrieval system, and by accessing national and international term banks such as Eurodicautom. In the long run, of course, he will also benefit from electronic publishing, especially if dictionaries and other reference works are no longer necessarily produced as hard copy. I have found that word-processed work is infinitely more acceptable to the client, so that it seems likely that the translator who has adjusted early to the electronic age will find that his clients multiply -particularly if he can supply his work on diskette compatible with his client's equipment. The translator's working procedures must change, and the resulting streamlining will mean greater speed and higher quality. This can only add up to more job satisfaction, and it is to be expected that earnings will also rise -what more could one wish for? This panegyric on machine aids is, of course, only theory. I have not considered the financial investments required, the running and servicing costs, nor indeed the possible competition between man and machine -though I doubt very much whether the \"quality\" translator is in any danger. But there is one fear that I have heard expressed repeatedly in \"old-fashioned\" translator circles, and one that has also been voiced by many -discriminating -clients: What is going to happen to the language? They are afraid that through machine translation language, style and perhaps also ideas will become arid, stereotyped. The scenario they so often envisage is a mixture of Alice at cross purposes with Humpty Dumpty and Syme extolling the virtues of Newspeak to Winston Smith in Nineteen Eighty-Four; not to mention the somewhat odd statements that are issued from the Pentagon and other sources in Washington, which the average English native speaker finds so hard to decode. I can understand their fear. If we take Through the Looking-Glass, for example, Humpty Dumpty explains: \"When I use a word, it means just what I choose it to mean -neither more nor less.\" Alice naturally wonders \"whether you can make words mean different things\", whereupon Humpty Dumpty states: \"The question is which is to be master ...\". The machine, perhaps? Or if we look at Nineteen Eighty-Four Syme asks Winston Smith: \"Don't you see that the whole aim of Newspeak is to narrow the range of thought? ... Every concept that can ever be needed will be expressed in exactly one word, with its meaning rigidly defined and all its subsidiary meanings rubbed out and forgotten.\" One envisages pages and pages of translated text being churned out by the machine using a specific limited vocabulary and a standard set of structures. Style will have become a non-word, so of course we shall not miss it. Is this threat to language, thought and culture real or imaginary? The scenario suggests two aspects of language development: Language evolving naturally in a multi-media society, and language adjusted artificially to expedite batch processing. When we talk about language we usually mean both written and spoken language. New vocabulary, different shades of meaning and alternative structures can be introduced into either, and the two forms influence each other. In this context we are mainly concerned with the written language, the language which is so often criticized as growing increasingly slovenly or, indeed, incomprehensible. Look at the letter page in The Times, for example, almost any day of the week and there will be some comment on incorrect usage, lack of respect for established rules, a general decline of the language. The English language has been 'going to the dogs' for several centuries nowmore than 250 years ago, in 1712, Jonathan Swift wrote in a letter to Harley that he had a Proposal for correcting, improving and ascertaining the English Tongue with the aim of \"fixing our language for ever\" and establishing an academy to ensure a permanent standard. Swift was certainly a great stylist, but I am glad that his Proposal was not taken up. Language is a living thing moulded both by its own inner laws of evolution and by the outside influences of the human society it serves. It is linked to a certain cultural environment and will inevitably reflect changes and developments that take place. The high degree of literacy in the late 20th century and the parallel growth of variant forms of English in territories overseas together with a wide range of information media has inevitably had some impact on the written word. Major events can always be traced in language usage, and it is naive to assume that the new Industrial Revolution which has ushered in the microelectronic age will not leave its mark on the language. Before the Second World War developments were considerably slower than they are now, so that changes in language were less clearly perceptible. Developments today in communications and information transfer are so rapid that the changes are more striking and we are aware of them, and consequently less ready to accept them. They no longer insinuate themselves into our subconscious as they used to; instead we are bombarded with new expressions by all the media collectively. This mass assault immediately calls for defensive action so that the improvements which would lead to greater clarity and simplicity are also under fire. It seems that almost every day we are expected to assimilate new acronyms, technical terms, euphemisms and jargon although the previous day's quota has not yet been digested. Management consultants indulge in \"headhunting\", the tax-man suggests \"revenue enhancements\" and in Pennsylvania chickens are \"depopulated\" in an attempt to contain an influenza virus. Naturally no-one working with language would champion a statement like \"micromanaging a country intelligencewise until about a certain time frame\" because of the decoding process required, but I can see no objection to the use of \"editorialize\" in preference to \"expressing an opinion in the form of an editorial\". Some terms and phrases will become established but many, particularly the euphemisms, will be supplanted as they begin to take on the connotations of the terms they were coined to replace. It is unlikely that they will find their way into computer dictionaries and term banks. T.S. Eliot summed up the whole process: \"Our language, or any civilized language, is like the phoenix: it springs anew from its own ashes.\" Now let us take a look at the other aspect. It appears to be generally accepted that most MT systems require either pre-editing or post-editing to a lesser or greater degree. As I understand it, pre-editing entails writing or adapting a text for translation using a certain vocabulary and a limited number of structures -a kind of \"machinespeak\" which could well develop along the same lines as any other form of jargon and insinuate itself into standard usage. Where post-editing is required, the machine does the preparatory work, and the translator (post-editor) disambiguates and/or restructures the translated text. Both approaches, then, retain some form of human involvement with the final product and it is up to the linguist, be he translator, post-editor or revisor, to accept responsibility for \"the state of the language\". At the beginning of this paper I asked whether the translator was likely to be involved in MT. Apart from highly sophisticated algorithms the system essentially comprises regularly updated dictionaries. In the latter, surely, the translator's help should be sought and given. Obviously, post-editors must supply regular feedback so that the system and its dictionaries can be continually improved. It would seem to me that post-editing is a new field for which the translator must be specially trained but where he could, with some experience, make a real contribution to upgrading the first machine draft. There is always the danger, of course, that through dint of repetition, the post-editor will no longer perceive aberrations of style, unsatisfactory structures or poor vocabulary and thus accept a form of machinespeak as standard usage. Here again, if the post-editor is working in a country where his native tongue is not the spoken language this danger increases. My ears have been assailed for so many years with what I call Swinglish (Swiss English) that when I now catch myself about to use a German structure or preposition the warning signals are very faint. Of course every translator is aware of the dangers inherent in long periods of exposure to a foreign language, and if this compounded by his also being confronted with \"mother-tongue machinespeak\" the native language could well suffer. Regular post experience translation workshops, etc. could be of real help here, and they could also be used to counteract yet another threat looming to trap the translator. The more text on screen becomes a commonplace (we might call it computerspeak or videospeak), and the more we learn to accept it in its natural environment, the more difficult it will be to remember that it is not -yet -acceptable in print or as the spoken work. My thesis is that the translator in future will have the dual role of monitoring changes in the language and disseminating information. And this means that much thought must be given to training translators to fit that role. The teaching programmes in translation institutes and university departments must be adapted accordingly. I do not believe that radical changes need be introduced, because most institutes and departments do supply the translators with the basic tools of the trade -but too often they are the tools for yesterday's trade, perhaps even for today's, rarely if ever are they for tomorrow's. What I envisage is a shift of emphasis, a greater degree of specialization, a much keener awareness of the market. Students and staff must recognize that additional demands will be made on the translator, that the traditional skills of analysis and language may still constitute the corner-stone of their teaching programme but cannot be regarded as the complete structure. In translation, as in so many other disciplines, new technology is revolutionizing both job description and work procedures. Certain skills are almost obsolete, others in greater demand. The budding translator must be equipped to carry out his new tasks using the wide range of aids available and increasing emphasis must be laid on information storage and retrieval. But all this, excellent though it may be, must never be regarded as a substitute for mastery of the translator's mother tongue. In practical terms, I imagine that the translation institutes and university departments will develop a broader range of courses so that their students are given the opportunity to specialize according to their talents and inclinations. Terminologists and lexicographers are just as much a part of the translation scene as post-editors and technical translators. The volume of translation will increase as will its variety, and as more specialized systems and equipment are developed specialized personnel must be available to ensure that the right products are used in the right place at the right time. For this it is essential to have the full cooperation of the machine translation industry, the hard and software companies, national and international term banks, etc. Without their support, it is unlikely that really efficient teaching programmes will be developed, suitable equipment acquired or practical training courses set up. Translation is now a recognized profession, machine and machine-aided translation is being developed and refined at a breathtaking speed: it is up to all of us to ensure that the status of the translator is recognized and that highly trained specialists in all aspects of translation are available in a growing market.",
    "abstract": "After three days of hearing about machine translation, machine-aided translation, terminology, lexicography, in fact about the methodology and techniques that are making it possible to escalate the information flow to unprecedented proportions, I am astounded at my temerity in agreeing to speak about so pedestrian a subject as the role of the human translator. In vindication, may I say that I have spent a considerable number of years in training future generations of translators, so that this is perhaps an act of self-justification. I might add that what I have heard this week has not led me to believe that the translator's skills, unlike the compositor's, have become obsolete. I am convinced, however, that these skills must be adapted and expanded so that the translator can continue to play his vital role in the dissemination of information and as a \"keeper of the language\".",
    "countries": [
        "Switzerland"
    ],
    "languages": [
        "English",
        "German"
    ],
    "numcitedby": "1",
    "year": "1984",
    "month": "February 13-15",
    "title": "Language or information: a new role for the translator"
}