{
    "article": "In this paper we demonstrate that for an adequate translation of an utterance spoken in a dialogue the dialogue act it performs has to be determined. We introduce an approach that automatically assigns types of dialogue acts to utterances on the basis of both micro-and macro-structural information. Technically, this assignment is realized by modeling preference rules as weighted defaults in the Description Logic system FLEX. The dialogue-act type of an utterance is determined by qualitatively minimizing the exceptions to these defaults. The results described here have been developed within the VERB-MOBIL project, a project concerned with face-to-face dialogue interpreting funded by the German Federal Ministry of Education, Science, Research and Technology (BMBF). We present the rather positive results of a first evaluation of this implementation showing the accuracy of dialogue act assignment. Introduction One of the fundamental prerequisites in the design of a Machine Translation (MT) system consists in the determination of the translation objective [20], [9]. Roughly speaking, the translation objective specifies those aspects of the source-language expression which are considered to be relevant and therefore are to be rendered by the target-language expression. Obviously, the translation objective can only be determined with respect to a particular class of text types, i.e. the aspects relevant in translating poetry differ from the aspects relevant in translating technical documents. Nevertheless, there seems to be a tendency in MT research to tacitly assume that the meaning of an expression is its most relevant aspect in the context of translation. Though not an unreasonable assumption at first sight, it is problematic due to the fact that the notion of meaning itself is far from being uncontroversial in linguistic research. According to truth-conditional semantics, one of the most popular branches in semantics, the meaning of an expression are the conditions under which the expression is true. Since these conditions are supposed to be extralinguistic, i.e. conditions obtaining in the world, it is tempting to consider these truth conditions as translation objective. More precisely, one might say that to translate an expression we have to determine its truth conditions and then choose an expression of the target language expressing the same truth conditions. Such an approach thus treats truth conditions as an invariant or equivalent of translation. In this article we argue that, at least in the context of dialogue interpreting, dialogue acts 1 constitute a much more appropriate equivalent of translation then truth conditions do. 2 In Section 2 we develop our notion of dialogue acts and describe their status in the context of MT. We also present a classification of dialogue acts for a particular domain, namely appointment scheduling, and illustrate the classification with examples in Section 3. In Section 4 we show how dialogue acts are used in the translation process and explain their relationship to the translation objective. Section 5 describes the automatic determination of dialogue acts as implemented in the VERBMOBIL demonstrator. Finally, we present the rather positive results of a first evaluation of this implementation showing the accuracy of dialogue-act assignment. The Status of Dialogue Acts Though we do not subscribe to the naive truth-conditional approach as sketched above, we think that it contains an important methodological insight, namely the notion of an equivalent or invariant of translation which we see related to the concept of abstraction. 3 A formal semantic representation of an expression's truth conditions abstracts from the particular linguistic form used to express these conditions. Note that this abstraction is not only restricted to a single language, as shown by the following examples: (1) a. Mary kissed John. b. John was kissed by Mary. c. Mary hat John geküsst. When saying that all sentences in this example express the same truth conditions, we abstract from the particular linguistic forms and create an equivalence class. 4 Whereas the above example illustrates the abstraction occurring on a semantic level, it is also possible to perform abstraction on the pragmatic level: 5 (2) a. Can you pass the salt? b. Pass the salt, please! c. I need the salt. Two things are important to note. For one thing, saying that these utterances are pragmatically equivalent in the sense that they all express the same request does not only abstract from their linguistic form but also from their truth conditions. 6 Second, the abstraction is again not restricted to a single language but can be performed across languages as well. Roughly speaking, we call the result of such a pragmatic-oriented abstraction a dialogue act. For dialogue processing this type of information seems to be a very useful abstraction as it allows us to represent utterance like (3)  a. What about Thursday? b. I would suggest Thursday. by the same type, namely a proposal of a date. We doubt that it is possible to construct a truth-conditional semantics of (3a) without taking into account the fact that (3a) expresses such a proposal. 7 The type 'proposal of a date' therefore combines information about the type of the referents occurring in the utterance (here a date) with the information that the utterance expresses a proposal. Our dialogue acts thus combine illocutionary and propositional information. Traditional illocutionary acts, on the other hand, as they were termed by Austin and later integrated into Searle's theory of speech acts aim at a rather coarse-grained typology. Illocutionary acts like asserting, questioning, commanding, etc. are detached from their propositional content and therefore comprise a type of information that is too abstract for automatic dialogue processing, as it can hardly be determined automatically. In using some kind of illocutionary acts in a system the main problem is the automatic classification of utterances with respect to these illocutionary acts. According to both Austin and Searle this classification is a matter of convention. Austin writes that for a \"happy\" functioning of a performative there must exist an accepted conventional procedure having a certain conventional effect, that procedure to include the uttering of certain words by certain persons in certain circumstances ... [2, p.14]   Since different types of dialogues and underlying domains have different conventions, it only makes sense to classify utterances with respect to the illocutionary act they perform for a fixed scenario and domain. In a fixed domain and type of dialogue there is usually a domain-characteristic set of types of referents and predications as well as a specific set of types of illocutionary acts. By combining these types of information we obtain our dialogue acts. Take, for example, appointment-scheduling dialogues between two business partners. For this scenario and domain it is much more plausible to classify the utterances with respect to types like \"propose a date\", \"reject a proposed date\" or \"accept a proposed date\", than with respect to general types like asserting, questioning, commanding or even proposing, declining or accepting. Obviously the conventions for proposing a date to a business partner are much more specific than the general convention of proposing some unspecified thing. Only these specific conventions allow for a successful automatic classification of utterances as described in Section 5. Now that our notion of dialogue acts is introduced the question of the number of dialogue acts has to be settled. In Wittgenstein's terminology the dialogue acts are called language games. According to him there is an infinite number of language games [23,  §23]. The number of dialogue acts can best be restricted by only dealing with those that are characteristic for a certain domain and type of dialogue, since -as we argued above -only then is an automatic assignment of dialogue acts to utterances possible. Dialogue Acts for Appointment Scheduling In its first phase the VERBMOBIL project has been dealing with appointment-scheduling dialogues. The data basis is a corpus of recorded and transliterated dialogues of students who play the role of business partners making an appointment. The set of dialogue acts we are dealing with for the moment consists of those types that are characteristic for this domain and type of dialogue. The domain is described by the following properties: • The domain is very limited (appointment-scheduling dialogues). • The dialogue partners primarily focus on potential dates for appointments, i.e. temporal discourse referents. • Over and above that, hardly any information is conveyed. The type of dialogue is characterized by the following properties: • The dialogue partners act cooperatively. • They have a common goal, namely finding a date that suits both of them. They both try to gradually attain their goal. • Their social relation is symmetrical. • They do not know each other personally, therefore they perform on a certain level of politeness. The dialogue acts we propose for this type of appointment-scheduling dialogues are the following: These types only cover the main topic of the dialogue, namely the appointment scheduling. In addition we have types like greeting, saying good-bye and introducing oneself, confirming the appointment and thanking the dialogue partner for the conversation, that exclusively occur in the opening or closing phases of the dialogue. The Purpose of Dialogue Acts As we stated above, dialogue acts represent information that is highly useful in the analysis of dialogues. This will be illustrated by several examples arising from the task of dialogue interpreting. First we are concerned with the selection of an adequate translation for certain verbal phrases, then we will deal with the general problem of stating a translation objective. It will be demonstrated what dialogue acts contribute to the solution of these problems. Verbs Used for Appointment Scheduling A whole class of German verbs is used to express either the neutral possibility to meet at a particular date or an assessment of that possibility. One of these verbs is the German 'gehen' that occurs in utterances expressing different dialogue acts. (4) geht's bei Ihnen da? would that suit you?/ would that be all right with you?/ does that work for you? (5) da hat leider meine Mutter Geburtstag da ginge es nich' I'm sorry, but that's my mother's birthday. (6) ja das würd' gehen yes, that would be fine. In utterance (4) 'gehen' is used to request the dialogue partner to comment on a proposed date (request_comment).( 5 ) consists of two utterances: the first one gives a reason (give_reason) for the declination of a proposed date in the second utterance. Here 'gehen' is used to perform the dialogue act reject_date. 9 Utterance(6) performs the dialogue act accept_date. 'gehen' can obviously be translated in different ways. The selection of an adequate translation is triggered by information about the dialogue act of the utterance in which it occurs. In order to translate utterance (4) one only has to know that it is a request to comment on a previously introduced date. From this information an adequate corresponding English utterance can be generated. Other examples of verbs that are to be translated on the basis of the information about the dialogue act of the corresponding utterance are 'davon halten', 'Zeit haben', 'es machen', 'sich einigen', 'sich treffen' und 'recht sein'. The Translation Objective Translation is a decision making process. The decisions should be directed by a global translation objective. This objective constitutes a general strategy by defining which information explicitly or implicitly expressed in the source-language text should be rendered into the target language. There are several reasons why such an objective is particularly crucial for automatic dialogue interpreting. The main reason arises from the fact that a system for automatic dialogue interpreting must handle incomplete information. This incompleteness stems from different sources: • Usually an utterance is not a complete sentence, but only one or more concatenated phrases. • The speech recognizer might not recognize all parts of an utterance. • Like in any other NLP system the implemented set of rules is restricted and therefore incomplete. It is evident that a fragmentary representation of the input utterance makes a literal word-by-word translation impossible in most cases and pragmatically highly inadequate. Moreover spoken language typically contains hesitation phenomena or repair strategies like repetitions, undue breaks and new starts. It is obviously not adequate to render all these \"performance\" phenomena word-by-word into the target language, since the hearer might take this as a sign of the interpreter's incompetence. The question now is what determines a suitable translation objective. Human interpreters usually have someone who gives them the job and informs them in advance about the particular interpreting situation, namely the domain of the dialogue and the social status of the dialogue partners. From that and from their general experience they can derive a translation objective. For automatic dialogue interpreting the translation objective results from the type of the dialogue and the domain. Therefore we propose the following translation objective for appointment-scheduling dialogues as they are described above: • the precise rendition of all expressions referring to temporal referents, • the rendition of the dialogue act, 10 The German dialogue partner NAD rejects a previously proposed date, Friday, with three utterances, all expressing the same thing pragmatically. The interpreter CHR does not render this repetition into the target language, she expresses the declination of the Friday by one single utterance, namely 'Friday is impossible'. Figures 1 and 2 show the representations of the source-language utterance and its interpretation in the Description Logic (DL) system FLEX. 11 The source-language turn as represented by object 'tu_l' consists of five utterances. The first three utterances all refer to the same temporal referent, namely a Friday, and they all perform the same dialogue act, namely reject_date. According to the translation objective the information about a declination referring to a certain Friday is transferred to the generation component that generates from this information an utterance like 'Friday is impossible.' So, the dialogue act proves to be an appropriate type of information with respect to the translation objective. The Determination of Dialogue Acts We argued above that the dialogue acts represent a very useful type of information for the analysis of dialogues. The crucial question now is how to determine the dialogue act of an utterance. According to Austin we have to investigate the conventions that allow an utterance to express a certain dialogue act. These conventions are effective on two complementary levels. There are conventions that determine which syntactic and semantic structures can be used in order to express a certain dialogue act. This is rather local or micro-structural information, since here the focus is on a single utterance. There are other conventions concerning the global structure of the dialogue. They express preferences for the type of the next dialogue act on the basis of the macro structure of the dialogue. There are various types of macro-structural conventions. Adjacency pairs like a request to propose a date (request_suggest_date), followed by a proposal of a date (suggest_date) or a greeting, followed by greeting reflect the conventions about an order of dialogue acts. 2. There are conventions about the order of certain phases in a dialogue. Typical phases are an opening phase, a phase that deals with the main topic and a closing phase. Most dialogue acts exclusively occur in a particular phase. 3. There are conventions about the use of temporal referents. The referent of a date in a proposal of a date (suggest_date) must either be introduced into the discourse by this proposal or it must be a specification of a previously introduced referent. For an acceptance (accept_date) or a declination of a date (reject_date) the temporal referent must already have been introduced by a previous proposal of a date. In our approach we exploit all kinds of conventions in order to determine the dialogue act of an utterance. 12 These conventions are encoded in terms of preference rules. Note that the approach described in the following is thus based on the strategy of preferential interpretation. This strategy has been applied, for example, for anaphora resolution in the FAST project [16], and has been formalized and generalized in [17, 18]. The basic idea is to homogeneously model preference rules, which take into account information from various sources, e.g. syntax, semantics, world knowledge. The respective degree of relevance of these rules is captured by the notion of weighted defaults. Given the task of dialogue-act assignment, these weighted defaults have the form: if there is a piece of information X in the representation of the utterance, then there is a preference of weight w for the utterance to be of type Y. The information represented on the left-hand side of a default concerns different types of knowledge, namely: • syntactic information (e.g. sentence type, 13 voice of the verb), • keywords (certain discourse markers like German 'leider' or 'schon'), • semantic information (the conceptual content of expressions, the conceptual type of referents), • macrostructural information (up to now only the dialogue act of the previous utterance). As an example let us consider the following opening turn of a dialogue, consisting of two utterances, (7) und (8).  (8) Wann war's Ihnen denn recht? When would it suit you? 14 Figure 3 shows how the second utterance is represented as 'object_28' in the FLEX system. 'object_28' is described by syntactic and semantic information and additional information about the occurrence of certain keywords. In this way each utterance is partially represented by a DL concept, i.e. roughly speaking by a list of feature-value pairs. Part of these feature values are provided by the syntactic component, namely those concerning keywords, the sentence type and the voice of the verb, others are semantic information. The semantics in the VERBMOBIL project is based on Discourse Representation Theory (DRT) [13]. Thus semantic information is represented in discourse representation structures (DRS's) [4]. Each DRS consists of a list of conditions that express predicate-argument-structures. We transform this DRT-style representation into a flat semantic representation. In the process of the semantic evaluation each predicate is linked to a concept in the domain model. The FLEX concept some(cond,conc:gut_passen) in the representation of 'object_28' shown in Figure 3 means that there is a condition that contains a predicate linked to the concept gut_passen denoting the positive assessment of the possibility to meet at a particular date. The feature value keyword:whtemp_wann combined with the information about the interrogative sentence type (satz_typ:int) represents the information that the utterance is a temporal wh-question. verb_modus:conj means that the mood of the verb is subjunctive, no(temp_ref) represents the information that the utterance has no temporal referent. In addition to that the dialogue act of the previous utterance is represented. On the basis of this information and the set of defaults represented in the right-hand box in Figure 3 the dialogue act of 'object_28' is inferred. Consider an abstract example illustrating the technical realization of this inference. Suppose object 'o' has the properties subsumed by the left-hand sides of defaults δ 1 , ...,δ 8 . Suppose further that these defaults encode preferences for three different dialogue acts, e. g. t 1 : {δ 1 , δ 4 , δ 7 }, t 2 : {δ 2 , δ 3 , δ 6 , δ 8 }, t 3 : {δ 5 }. We add the weights of the defaults, thereby obtain a score for each type, and then assign the type yielding the highest score. Note that this is a rather simplified presentation. The model-theoretic semantics and the proof theory for weighted defaults are described in detail in [19]. Evaluation of the Method Finally, we present the results of a first evaluation of our implementation. The current implementation works with 83 rules, of which 64 are defaults and 19 strict. 22 of the defaults rely on keyword information alone, 9 are exclusively based on syntactic information, whereas 27 use only semantic information. The remaining defaults draw on a combination of these types of information. We worked with a corpus of 15 transliterated dialogues, six of these interpreted, eight monolingual and one constructed from a monolingual dialogue plus its translation. 15 Each utterance occurring in these data was annotated with two sorts of information: on the one hand with its dialogue act, on the other with tags representing syntactic, semantic and keyword information. For an evaluation of our method we compared for each utterance its annotated dialogue act with the dialogue act automatically inferred on the basis of the annotated tags and the default rules. Figure 4 presents the encouraging results: the general recognition rate is 84 percent. The column titled as \"in the set\" means that the algorithm derived not a unique dialogue act but a set of types and the annotated dialogue act is a member of this set. Note that the environment used for evaluation was also used to determine the relevant defaults and their weights. The testing environment offered the facility to output all instances of a dialogue act and all kinds of correlations of dialogue acts and any subset of the tag set. From this list of correlations we inferred the default rules, an additional quantitative evaluation suggested the adequate corresponding weights. Conclusion In this paper we have presented an approach for the automatic assignment of dialogue acts in dialogue interpreting. We have argued that dialogue acts, as defined in this paper, provide an adequate invariant of translation for dialogue interpreting. For a particular domain, namely appointment scheduling, we have described a set of dialogue acts, have sketched the information relevant for automatic assignment, and have presented rather positive results of a first evaluation showing the accuracy of an implementation used in the VERBMOBIL demonstrator. In the next phase of the VERBMOBIL project, the scenario will be extended in the direction of travel planning. This raises the important question whether our approach is confined to the scenario of appointment scheduling or whether it is applicable to other scenarios as well. According to a distinction introduced by Bunt [5] we can classify the dialogue acts into dialogue control acts and task-oriented acts. Obviously the dialogue control acts are domain-independent, whereas task-oriented acts vary for different tasks. Our general methodology, however, as well as the underlying algorithm computing the preferred dialogue act are not restricted to any particular scenario but are straightforwardly applicable to other scenarios. We thus see no principle obstacle in adapting the current implementation to the extended VERBMO-BIL scenario. Finally, it should be noted that dialogue acts are not only relevant in the context of Machine Translation, but are also useful for other NLP application, such as dialogue systems. Acknowledgements This work was funded by the German Federal Ministry of Education, Science, Research and Technology (BMBF) in the framework of the Verbmobil Project under Grant 01 IV 101 Q 8. The responsibility for the contents of this study lies with the authors.",
    "abstract": "In this paper we demonstrate that for an adequate translation of an utterance spoken in a dialogue the dialogue act it performs has to be determined. We introduce an approach that automatically assigns types of dialogue acts to utterances on the basis of both micro-and macro-structural information. Technically, this assignment is realized by modeling preference rules as weighted defaults in the Description Logic system FLEX. The dialogue-act type of an utterance is determined by qualitatively minimizing the exceptions to these defaults. The results described here have been developed within the VERB-MOBIL project, a project concerned with face-to-face dialogue interpreting funded by the German Federal Ministry of Education, Science, Research and Technology (BMBF). We present the rather positive results of a first evaluation of this implementation showing the accuracy of dialogue act assignment.",
    "countries": [
        "Germany"
    ],
    "languages": [
        "German",
        "English"
    ],
    "numcitedby": "26",
    "year": "1995",
    "month": "July 5-7",
    "title": "Dialogue Acts in Automatic Dialogue Interpreting"
}