{
    "article": "This research is aimed at developing a valency dictionary architecture to comprehensively list the full range of alternations associated with a given predicate sense, both efficiently and robustly. The architecture is designed to incorporate all information available in current on-line resources, as well as additional features such as argument status, grammatical relations, and an augmented case-role representation. Words are divided into senses, which are distinguished on semantic grounds, depending on the core lexical meaning of the verb. Each sense may have one or more alternations, thus keeping the number of senses manageable, while allowing for systematic variation in the lexical realization. Individual syntactic case frames are indexed back to the basic semantic argument component of the given predicate sense. Introduction In this paper we propose a sense-based dictionary structure capable of describing both Japanese and English mono-lingual lexicons, and a set of transfer links devised to indicate correspondences between Japanese and English. Many existing transfer systems store entries as source/target language pairs, such as NTT's Goi-Taikei (Ikehara et al. 1997) . A major attraction of structuring a dictionary in this way is the fact that it obviates the need to choose mono-lingual senses: a word has as many senses as it has translation equivalents. Despite the obvious successes of dictionaries such as this, the combination of Japanese and English correlates within a single entry has meant that unnecessarily finegrained sense distinctions have had to be made in both languages. By considering the two languages separately, we are able to broaden our handling of mono-lingual predicate senses to a level more cognitively justifiable, reducing the number of dictionary entries. Also, by clustering lexical alternates, we are able to employ inheritance for the core pool of semantic and lexical data, improving maintainability, alleviating redundancy of annotation, and enhancing scalability by way of reducing the informational requirement when annotating new alternates and predicate senses. In a pair-based architecture, the linking of inter-language sense within a single structure leads to the generation of extraneous senses. It is certainly true for closely related language pairs that overlap of senses for corresponding lexemes in the two languages can partially release us from consideration of word sense disambiguation. However, in the case of Japanese-English machine translation, we are not able to rely on the same effect. Rather, for a given source-target language translation pair, we are commonly faced with the situation of having only partial sense overlap for either Figure 1 : Japanese-English sense correspondence a single sense or a restricted number of senses in the source language. Here, the exact degree of overlap must be described through selectional preferences, and alternative translations found for any sub-usages of the source language lexeme not covered by the original translation. An example of this phenomenon can be seen for the Japanese verb atumeru \"gather\". Within Goi-Taikei, atumeru is associated with 12 distinct Japanese-to-English translation pairs, 2 of which are depicted in Figure 1 , with usage p 2 sense-subsumed by p 1 according to the selectional preferences on corresponding argument slots A-D and B-E. The reason for the partitioning off of a sub-usage of p 1 is that the \"gather\" translation of atumeru is inappropriate for the semantic region described by p 2 . As such, p 2 is an artificial sense of atumeru used to increase accuracy in translation, and an unavoidable side-effect of having Japanese and English described within a single dictionary framework. By separating the descriptions of the two languages, we are able to remove such artificial senses, and relocate interlingual sense-based idiosyncrasies to the linking lexicon. Looking further to translation pairs p 3 and p 4 for syūketu-suru \"gather\", we notice that p 4 is the causative/inchoative alternate of p 3 . In a pair-based dictionary formulation, no explicit representation of this alternation relation between p 3 and p 4 is possible. That the corresponding case slots (G-I and H-J, respectively) bear identical selectional restrictions reflects more on the skill of the lexicographer than the inherent dictionary structure. Within our proposed architecture, however, p 3 and p 4 would be clustered together at the sense level and the alternation-based relation that exists between them explicitly expressed, producing co-indexing of the corresponding case slots. For this purpose, we clearly require a well-defined set of Japanese predicate alternations, in the manner of Levin's 80-fold set of alternation types for English (Levin 1993) . The fleshing out of such a full set of Japanese alternations remains a longer-term aim of this research, with Fukui et al. (1985) providing a good start in this direction. For the time being, we have placed emphasis on the most readily occurring and well-documented alternations, namely the object/argument, causative/inchoative, passive (-rare) and causative (-sase) alternations. A longer-term advantage of maintaining the various dictionaries separately is that it becomes considerably easier to maintain the dictionaries; reverse the translation direction; and incorporate new languages into a single system architecture. More information is kept in the monolingual dictionaries, which can be maintained by monolinguals. The linking lexicons are basically reversible, although it is likely that different constraints may be more useful for different directions. There will still be 2C n 2 linking lexicons for n languages, but the overhead for constructing a linking lexicon is considerably less than that for constructing a disambiguated transfer dictionary. In order to develop our architecture, we examined several existing resources: Goi-Taikei (Ikehara et al. 1997) , COMLEX (Grishman et al. 1994) , WordNet (Fellbaum 1998) , EVCA (English Verb Classes and Alternations: Levin (1993) ) and Jing & McKeown's (1998) combined lexicon, which incorporates information from COMLEX, Word-Net and EVCA. The remainder of this paper is structured as follows. Section 2 describes several linguistic resources. Section 3 discusses what the appropriate granularity is for monolingual senses. Section 4 describes the proposed dictionary architecture and the interrelation between the various levels of representation. Section 5 details a number of implementation issues related to the linking lexicon. Linguistic resources There are now several large-scale machine tractable resources for English, in this section we compare four of them, showing the strengths and weaknesses of each. Goi-Taikei's Japanese/English valency dictionary Goi-Taikei's valency dictionary is made up of pairs of linked Japanese and English sentence patterns, as shown in Figure 2 . 1 Each pair of patterns is considered to be a different sense. In principle, this means that there is a well motivated test for how many senses a word should have: a word has as many senses as it has different translations. In practice there are two problems. The first is that the dictionary is uni-directional, so that even though two Japanese words may map to the same word in English, the English words are considered to be different. In a computational lexicon where each word has a great deal of information associated with it, this redundancy is undesirable and there is a real risk that relevant information may only be entered for one of the entries. The second is that semantic constraints on the Japanese side are used for word sense disambiguation in both Japanese analysis and transfer into English. If two patterns have the same syntactic structure but different constraints on their arguments, the one whose constraints match those of the actual arguments best will be chosen. Because of this dual use, entries have to be retuned whenever a new translation is added, making extension of the dictionary difficult and time-consuming. In addition, many of the distinctions made cannot be motivated on mono-lingual grounds. Aside from these problems, Goi-Taikei contains many features that most dictionaries lack. The most obvious are the bilingual links and the semantic constraints on verb complements. In addition Goi-Taikei also contains many idiomatic constructions (such as come and go \"be intermittent\" in the pain comes and goes), as well as marking of case-roles, domain, genre and many other features. The COMLEX syntax dictionary The COMLEX verb dictionary contains a rich source of syntactic information about the possible patterns verbs can appear in. This makes it very useful for syntactic analysis. Another strength of the dictionary is that it has been extensively checked against a corpus, and is annotated with many examples. The entry for gather (without its examples) is given in Figure 3 . Unfortunately, the syntactic frames are not grouped into senses: only gather \"understand\" (I gather he won't be coming) can take a sentential complement, while only gather \"collect\" (They gathered around their teacher) takes around, but this distinction is not made by COMLEX. The WordNet on-line lexical database WordNet is an online resource which lists a number of different senses for nouns, adjectives and verbs as well as numerous links between them. This makes WordNet a useful resource for a variety of semantic tasks, in particular Word Sense Disambiguation. However we claim that many of these senses are unnecessary distinctions and lead to difficulties in sense disambiguation. For example, WordNet senses 1-4 and 7 of gather have the same core meaning \"collect\", while 5 and 8 have the meaning \"understand\" and 6 is a different meaning again (shown in Figure 4 , with senses grouped together by us). We discuss this further in the next section. Levin (1993) proposes the use of alternations as a useful tool in the study of a verb's meaning and its syntactic behaviour. An alternation is a relation between pair of similar syntactic frames, involving a rearrangement or change in the number of arguments. A typical alternation is the causative/inchoative alternation: in verbs that undergo this alternation the subject of the intransitive verb is related to the object of the transitive. For example: I gathered the students ↔ The students gathered. Alternations involving sentence or verb phrase arguments were not considered. English Verb Classes and Alternations Levin divides verbs into classes on the basis of which syntactic alternations they can take, and proposes that these classes also reflect a common core in meaning. The classes are grouped into 49 families. Verbs are not explicitly separated into senses. However, we hypothesize that the different classes can be used to disambiguate verbs. For example, the word gather appears in three classes: the \"Get\" subclass of the \"Verbs of Change of Possession\" family, the \"Shake\" class of the \"Verbs of Combining and Attaching\" and the \"Herd\" subclass of the \"Verbs of Existence\" family. Jing & McKeown's (1998) combined lexicon Jing & McKeown's (1998) dictionary incorporates syntactic frames from COMLEX and alternation pairs from EVCA into WordNet senses, along with frequency of occurrence of each sense in the Brown corpus. The combined dictionary has the strengths of all three resources, and has been successfully used in generation (Jing 1998) . It has some rudimentary semantic constraints on arguments, but only at the level of something or somebody. There has been other research combining EVCA and WordNet, notably Kohl et al. (1998) and related work. In this work, frames are added to WordNet sense, along with prototypical fillers, to allow example sentences to be generated. Some semantic constraints are given on arguments, but they are still quite limited. A definition of sense In order to avoid spurious ambiguities, we keep the number of senses to a minimum, as argued for by Wierzbicka (1996:244 ). 2 This is in line with the current trend toward under-specified representations where the meaning is created in context, such as Pustejovsky's (1995) Generative Lexicon, or Construction Grammar's semantic parsimony (Goldberg 1995) . Each sense has a core meaning, the \"semantic invariant\" but can be realized in different frames (or constructions), which may differ in their thematic properties, aspect or even valency. Our architecture therefore stores information about the core meaning, such as semantic constraints, at the sense level. This definition of sense allows us to make the following claims. Claim 1 EVCA alternations do not alter the sense of a verb. Claim 2 If two apparent senses have the same sets of alternations, then they are in fact a single sense. Claim 3 If a case-slot S1 in frame F1 of an alternation has certain semantic constraints C 1 then the corresponding slot S 2 in the other frame F 2 of the alternation has the same semantic constraints C 2 =C 1 . Claim 3 is almost certainly too strong as it stands. However, if we add the proviso that an alternation itself may add further constraints, à la construction grammar (Goldberg 1995) , then it should hold. We are currently investigating to what it extent it does hold in the Goi-Taikei lexicon. Nomura et al. (1994) go further in creating a lexical architecture where verb frames are projected from core meanings. We are investigating to what extent this is possible, using templates to go from core meanings to frames. Whether this can be done generally is an empirical question we will answer after creating the entire lexicon. Figure 5 : A fragment of the dictionary entry for syūketu-suru \"gather\" Dictionary architecture The proposed dictionary architecture comprises of, in descending order, the word, sense and frame levels; these correspond to entries being clustered according to lexical stem, sense, and argument content, respectively. Word level At the highest level, entries sharing a common predicate stem are lexically clustered, as for conventional dictionaries. This enables us to give a single annotation of the basic stem orthography, part-of-speech (verb, adjective or adjectival noun) and conjugational class. Additionally, in the case of Japanese, a regular expression representation of the predicate stem is given to counter the effects of systematic variation in the Japanese orthography through the mixed use of kanji and kana (maze-gaki). Sense level At the second level of description, entries are clustered into senses, again in the manner of a conventional dictionary. Senses contain a sense ID, a list of sentences and/or indices to sentences in a corpus exemplifying the basic predicate sense, and a set of features including characteristic domains/genres of use of that sense. Most importantly, however, senses contain a description of the maximum argument content of that verb sense (:sem), by way of selectional preferences (:res) and/or a list of lexical fillers (: lexarg). This represents the core meaning of the sense. This core meaning can be used as a standard frame representation for semantic analysis. The LISP style list representation of argument content allows us to describe complex structures by way of nested structures, including optional or obligatory modifiability of arguments, and the manner of modification. By including arguments at the sense level, we are taking the stance that, within the context of a single sense, a given argument has the same basic scope for lexical/semantic variance irrespective of its lexical realization. That is not to say that the full range of arguments must appear in all usages of that sense, but simply that, given argument compatibility with a given alternation, that argument will be associated with a fixed set of selectional preferences and/or lexical fillers. That pragmatic effects such as empathy can affect the relative acceptability of differing lexical contexts is not seen as a threat to this claim, but more evidence that pragmatics can override semantics in determining the felicity of an utterance. It is possible, however, to override the selectional preferences at the frame level. As with the Goi-Taikei lexicon, selectional preferences are indicated by way of a list of indices to nodes in the Goi-Taikei thesaurus (Ikehara et al. 1997) . Frame level The lowest level in the dictionary describes each individual frame realization. Frames are listed with an index, optional inflectional constraints, an optional description of the alternation types the current lexical realization takes linked to the alternating frames, a list of example sentences characterising the alternation, and a list of features of the expression including its set of verbal semantic attributes (Nakaiwa et al. 1994) . What is undoubtedly the most integral component of alternation description, however, is a listing of individual case slots and associated features. Case slots are presented in canonical ordering and annotated with: constituent structure (: cs), including case marker and an optional obligatoriness flag for Japanese, prepositional marker in the case of English, and a phrase-level part-of-speech; grammatical relation (:gs); case-role (:role -24 roles), and argument status (:stat -7 levels), based on the case grid representation and valency binding hierarchy proposed by Somers (1987) (see Baldwin & Tanaka (1999) for more detail); and an index back to the sense-level list of argument constraints (:sem-arg). The dictionary used in the Mikrokosmos project (Viegas et al. 1998) , appears to have a comparable amount of information, but does not, as far as we are aware, treat the core meaning separately from its alternations. In order to use mono-lingual alternation-based lexicons for machine translation, it must be linked together. To do this we use a linking lexicon. The basic idea is that lexical choice is left to the generation stage, but constrained by the input text. This allows for flexible, fluent generation. There are also several practical advantages. The lexicon is easy to update -for example a single sense entry may be adjusted rather than changing several pattern entries. All frames of a single verb or a single verb sense can be viewed at a glance, allowing errors and inconsistencies to be detected easily. Ideally, verbs are linked at the sense level, and information about which frame was used is passed along with the verb. The source language frame-type does not determine the frame used in the target language. Rather, a table of cross-lingual equivalences between alternations is incorporated into the linking lexicon as a general constraint on lexical selection. The target language frame is then determined within the linking lexicon from this equivalence table, based upon the target language frame-type. This has the dual benefits of minimising the number of links and providing for flexibility in lexical selection. Note, however, that the architecture allows links to be placed at any level, with the proviso that they must be equi-potential (i.e. cannot extend between different levels). This provides a facility for the direct linking of frames in the case that semantic/focus effects in either language are not adequately captured by the generalised alternation correspondences. Where equivalent alternations exist in both languages, the choice of one alternate in the source suggests the choice of its equivalent in the target language. Sometimes, however, an alternation will only exist in one language (such as the ga-o/ni-ga alternation in Japanese, which has no equivalent in English), and its nuance will be lost in translation. There is no guarantee that the mapping from source to target language frame types will be 1-to-l or truly lossless. The links allow for additional syntactic and semantic constraints. For example the verb warau \"smile/laugh\" should be translated as smile if it is modified by the adverb nikoniko \"smilingly\". There is no need to create an additional sense in the Japanese lexicon, it is sufficient to mark the relationship in Japanese as a case of restricted lexical co-occurrence (Viegas et al. 1998) , which is needed for monolingual analysis anyway, and create an entry in the linking lexicon. Many constraints useful for word selection during translation can effectively be deduced from the target language information. Consider atumeru in Figure 1 . If atumeru has a subject who is an organization and an object who is a person, then either gather or recruit are possible translations. Because recruit is a better match, it will be selected by the generation process. This is done without adding extra constraints in the linking lexicon, or producing spurious senses in the source language lexicon. Finally, the linking lexicon, like the monolingual lexicons, allows for pragmatic constraints on genre, domain and politeness. Conclusion In this paper we compared the strengths and weaknesses of four large scale computational English lexicons. We then introduced an alternation-based valency dictionary structure for Japanese with the strengths of all four resources. In addition we discussed the relative merits of the proposed structure and separate linking lexicon over a transfer-style dictionary structure. The new lexicon offers both theoretical and practical advantages. All senses are motivated: different senses will only be created if they allow different syntactic realizations. Previous verb sense entries can act as templates for new sense entries leading to fewer errors in dictionary production. Using templates entry can be done on a sense, rather than frame, level, ensuring that all possible frames are considered. Further work is required to extend our set of Japanese alternation types. Once this set begins to grow in size, it should be possible to apply it in the analysis of the syntax/semantics interface, after Levin (1993) , and also lexical selection in generation (Dorr & Olsen 1996; Jing 1998 ). These are left as matters for future research. Acknowledgements We would like to thank NTT for allowing access to the on-line version of Goi-Taikei, Jing & McKeown for sharing their dictionary with us, Adam Meyers for sharing the COMLEX documentation source files, and the members of the NTT Machine Translation Research Group for their comments and support. This work was carried out while Ben Hutchinson was visiting the NTT Communication Science Laboratories in Kyoto.",
    "abstract": "This research is aimed at developing a valency dictionary architecture to comprehensively list the full range of alternations associated with a given predicate sense, both efficiently and robustly. The architecture is designed to incorporate all information available in current on-line resources, as well as additional features such as argument status, grammatical relations, and an augmented case-role representation. Words are divided into senses, which are distinguished on semantic grounds, depending on the core lexical meaning of the verb. Each sense may have one or more alternations, thus keeping the number of senses manageable, while allowing for systematic variation in the lexical realization. Individual syntactic case frames are indexed back to the basic semantic argument component of the given predicate sense.",
    "countries": [
        "Japan"
    ],
    "languages": [
        "English",
        "Japanese"
    ],
    "numcitedby": "21",
    "year": "1999",
    "month": "August 23-25",
    "title": "A valency dictionary architecture for Machine Translation"
}