{
    "article": "Dans cet article nous présentons les premiers résultats de l'exploitation d'un Corpus français arboré (Abeillé et al., 2001) . Le corpus comprend 1 million de mots entièrement annotés et validé pour les parties du discours, la morphologie, les mots composés et les lemmes, et partiellement annotés pour les constituants syntaxiques. Il comprend des extraits de journaux parus entre 1989 et 1993 et écrits par divers auteurs, et couvre différents thèmes (économie, littérature, politique, etc.). Après avoir expliqué comment ce corpus a été construit, et comment l'exploiter à l'aide d'un outil de recherche spécifique, nous exposerons quelques résultats linguistiques concernant les fréquences et les préférences lexicales et syntaxiques. Nous expliquerons pourquoi nous pensons que certains de ces résultats sont pertinents en linguistique théorique et en psycholinguistique. This paper presents the first linguistic results exploiting a new treebank for French (Abeillé et al., 2001) . The corpus comprises 1 million words fully annotated and disambiguated for parts of speech, inflectional morphology, compounds and lemmas, and partially annotated with syntactic constituents. It is made of extracts from newspapers ranging from 1989 to 1993 and written by different authors, and covers a variety of subjects (economy, literature, politics, etc.). After explaining how this corpus was built, and how it can be used with a specific search tool, we present some linguistic results obtained when searching the corpus for lexical or syntactic frequencies and preferences, and explain why we think some of these results are relevant both for theoretical linguistics and psycholinguistics. Choix du corpus Les textes que nous avons choisi d'étiqueter sont extraits d'un ensemble d'articles du journal Le Monde de 1989 à 1993 compilés par Linguistic Data Consortium (LDC). Nous avons sélectionné 1 million de mots (875 000 mots sans ponctuation, 920 000 mots avec les mots composés regroupés, 17 000 lemmes différents, 33 000 phrases) en puisant de façon aléatoire dans l'ensemble de la base pour faire varier les dates de parution des articles, leurs auteurs et leurs thèmes. Sans être représentatif des différentes variétés de français, le corpus couvre différents domaines puisque les pages culturelles, économiques ou sportives n'ont pas été exclues. Les choix d'annotation Nous souhaitons que le corpus annoté puisse servir aussi bien aux informaticiens (à des fins d'évaluation ou d'entraînement de parseur, d'extraction de lexique ou de grammaire) qu'aux linguistes ou aux psycholinguistes (pour connaître les distributions fines de certains mots ou de certaines catégories, ou connaître la fréquence relative de certaines constructions, etc.). Contrairement à d'autres projets (Prague Dependency Treebank, Penn Treebank), nous ne souhaitons pas appliquer fidèlement telle ou telle théorie syntaxique, forcément éphémère, mais contribuer à l'émergence d'un standard de découpage en constituants, sans doute un peu grossier mais suffisamment consensuel, et traduisible dans différents cadres théoriques. Nous distinguons les choix d'étiquetage (des mots ou des syntagmes) des choix de découpage (des mots ou des syntagmes). Les choix d'étiquetage Nous avons 14 catégories lexicales présentes dans le corpus, pour les mots simples ou composés : A (adjectif), Adv (adverbe), D (déterminant), CC (conj de coordination), CL (pronom personnel clitique= forme faible), CS (conj de subordination), NC (nom commun), NP (nom propre), P (préposition), PRO (pronom non clitique), V (verbe), I (interjection), ET (mot étranger dont on ne peut deviner la catégorie en contexte), PONCT (ponctuation). Nous avons retenu 12 types de syntagmes : syntagmes adjectival (AP), adverbial (AdP), coordonné (COORD), nominal (NP), prépositionnel (PP) ; propositions participiale (VPpart), infinitive (VPinf), relative (Srel), subordonnée (Ssub), conjuguée interne (Sint) ; noyau verbal (verbes avec les clitiques, auxiliaires, faire : VN) ; et phrase indépendante (SENT). Les pronoms clitiques, les déterminants, les ponctuations, les mots étrangers, ne projettent pas de syntagmes. Nous n'avons pas de syntagme verbal (VP), car en français, la séquence postverbale inclut aussi bien des compléments que des circonstants (1) ou des sujets inversés (2) : (1) Les actionnaires décideront certainement une augmentation de capital. (2) Les actions qu'a mises IBM sur le marché. Donc, soit VP englobe tout et il est inutile, soit il n'inclut que les compléments et il est discontinu. Pour distinguer compléments et circonstants, on notera des fonctions, dans une seconde phase d'annotation (non pertinente ici). Nous n'avons pas de syntagme déterminatif (DP) non plus. Les prédéterminants (adverbes : environ, presque etc. ou prépositions composées : près de...) ne sont pas enchâssés, les déterminants coordonnés donnent lieu à un sous-constituant COORD : <NP> presque:Adv tous:A les:D enfants:NC </NP> <NP> près-de:P trois-cents:D personnes </NP> <NP> deux:D <COORD> ou:CC trois:D </COORD> enfants:NC </NP> Le jeu d'étiquettes 1 est assez fin pour marquer la catégorie, la sous-catégorie et la morphologie flexionnelle. Il est principalement inspiré des projets Multext et GRACE (Lecomte & Paroubek, 1996) et suit les recommandations du projet EAGLES (von Rekowski, 1996) . Les choix de découpage Pour le découpage en mots, nous utilisons un dictionnaire de mots composés, qui est maximal pour les mots composés grammaticaux (les moins controversés) et minimal pour les mots composés lexicaux (qui sont les plus flous). Nous suivons en général les critères de G. Gross (voir (Gross, 1996) ). Le marquage en constituants majeurs est la première étape d'un marquage syntaxique qui comprendra ensuite le marquage des principales fonctions grammaticales. Certains choix que nous avons dû prendre concernent un certain nombre de cas réputés difficiles, celui des constituants discontinus, des éléments vides, des syntagmes exocentriques (sans tête) ou unaires, des ambiguités résiduelles. Pas de constituants discontinus On fait l'hypothèse qu'on n'a pas de constituants discontinus ni de syntagmes croisés. Toutefois, l'annotation des fonctions grammaticales permettra de marquer liens de dépendance entre des éléments à distance. On ne note pas non plus de catégorie vide pour les constituants absents ou déplacés. C'est à un autre niveau qu'on pourra noter une fonction à distance (dans : que veux-tu voir ? que est objet de voir et non de veux) ou une double fonction (dans : je le laisse entrer, le est à la fois objet de laisser et sujet d'entrer). Les syntagmes exocentriques On ne note pas de catégorie vide pour les syntagmes elliptiques ou \"sans têtes\". Pour l'étiquetage lexical, on a évité de recatégoriser les mots qui n'avaient pas leur fonction canonique car il en serait résulté un grand arbitraire au niveau lexical. Tous les adjectifs peuvent être employés comme têtes de groupe nominal et il serait artificiel de noter comme ambigus (N ou Adj) seulement ceux rencontrés dans cet emploi dans le corpus. Les noms peuvent aussi être employés comme épithètes ou attributs (un ingénieur maison, il est très famille). On a donc des NP sans Nom, et on n'ajoute pas un N vide qui serait artificiel. On a des phrases sans verbe (relatives ou subordonnées) pour les tours elliptiques (que toi, ou dont trois idiots). On ne créé pas de syntagmes adjectivaux à tête nominale (sans adjectif), car on autorise les groupes nominaux à avoir la fonction épithète ou attribut. On ne crée pas d'adverbiales à tête adjectivale non plus, car on autorise les adjectivales à être mobiles dans la phrase (c'est à dire qu'on découpe: laver plus blanc, comme partir content, ou voter utile). Pas d'ambiguïté résiduelle On a fait l'expérience qu'une lecture suffisamment attentive permettait généralement de désambiguer les phrases du corpus. Dans certains cas, il ne faut pas hésiter à faire appel à des connaissances encyclopédiques. Dans certains cas, l'interprétation est exactement la même et on a le choix entre deux découpages. Si les tests syntaxiques marchent aussi bien pour les deux (pronominalisation, clivée et c'est . . . que, etc.), on opte pour celui qui comporte le moins d'enchâssements (principe du rattachement minimum). C'est le cas par exemple pour la plupart des constructions à verbe support, dans Jean <VN> a commis </VN> <NP> une agression </NP> <PP> contre <NP> Marie </NP> </PP> on peut inclure ou non le PP (contre Marie) dans le NP (une agression), sans différence d'interprétation, on choisit donc de ne pas l'inclure. Les syntagmes unaires A des fins de simplification et de lisibilité, on essaie de limiter les syntagmes unaires. On considère que certaines catégories peuvent projeter des syntagmes à elles toutes seules. On dit qu'on a affaire à des syntagmes unaires. C'est le cas des noms propres, des pronoms (non clitiques), des verbes (sauf participe passé), des adjectifs, mais ce n'est pas systématique. A chaque fois on doit se demander si on peut remplacer le mot seul par une séquence de mots tout en gardant le même découpage syntagmatique. Les noms employés en apposition correspondent à des NP, mais pas les noms employés comme épithète. Méthodologie Nous procédons en deux étapes : une étape d'annotation morpho-syntaxique, qui comprend segmentation en mots et en phrase, désambiguation catégorielle et morphologique (tagging), regroupement des mots composés et lemmatisation, une étape d'annotation syntaxique (qui comprend le marquage en constituants et l'assignation de fonctions grammaticales à ces constituants). A chaque étape, nous distinguons un marquage automatique et une validation/correction humaine systématique, afin de minimiser le risque d'erreurs. La première étape est aujourd'hui achevée. Seule la première phase de la seconde étape (marquage en constituants) est actuellement opérationnelle. Validation du corpus étiqueté Un guide d'annotation très précis a été écrit et complété durant la correction manuelle du corpus (Abeillé & Clément, 1997) . L'intégralité du corpus à été relu et validé deux fois par deux personnes différentes. Et des petits programmes ont été utilisés pour corriger semiautomatiquement les erreurs résiduelles. Pour les mots composés, nous avons utilisé le système INTEX (Silberztein, 1993) , en ôtant nombre de mots composés lexicaux et en ajoutant nombre de mots composés grammaticaux. Le corpus ne contient aucune ambiguïté morphologique résiduelle. Validation du corpus parsé Le corpus étiqueté corrigé a été analysé automatiquement par l'analyseur de surface développé par A. Kinyon (adapté pour le format et les choix d'annotation par F. Toussenel) et corrigé à la main par des annotateurs. L'analyseur de surface est incrémental, déterministe, à base de règles 2 et inspiré de celui d'Abney 1992 pour l'importance qu'il accorde aux mots fonctionnels (introducteurs de syntagmes) mais cependant différent de ce dernier en ce qu'il autorise certains enchâssements. Le taux de réussite de l'analyseur de surface est estimé à 92% de frontières ouvrantes correctes, et 62% de frontières fermantes correctes. Ce qui est cohérent avec notre parti-pris d'attachement minimal des syntagmes. Quelques résultats Nous montrons d'abord, sur quelques statistiques globales, comment les différents niveaux d'annotations, permettent d'enrichir les calculs de fréquences sur corpus. Puis, en comparant certaines fréquences relatives pour des formes possiblement ambiguës, nous dégageons quelques principes de préférence, qui sont nouveaux ou confirment des principes observés par ailleurs en linguistique générale ou en psycholinguistique. Fréquences Les fréquences lexicales du français ont souvent été calculées à partir de données brutes (Catach 84, Julliand 70). Comme le montre l'exemple de Silberztein 1993, de tels calculs sont nécessairement erronés du fait de la proportion élevée de formes ambiguës. Voyons comment la désambiguation des parties du discours opérée sur notre corpus améliore ces calculs. Si nous trions ces formes par ordre de fréquence, nous obtenons la liste de la seconde colonne (tableau 1) comme les formes les plus courantes, qui comprennent seulement des mots fonctionnels (prépositions, déterminants, conjonctions) et qui sont comparables avec ce que d'autres auteurs trouvent dans différents corpus français. Mais la plupart de ces formes sont en fait ambiguës : de peut être une préposition ou un déterminant, le peut être un déterminant ou un pronom, en peut être une préposition ou un pronom clitique. Si on s'intéresse aux mots les plus courants dans le corpus, il est donc nécessaire, d'une part de distinguer ces formes ambiguës et, d'autre part de rassembler différentes flexions du même mot (d' et de pour la préposition DE, le, la, les, l' pour le déterminant LE, etc.). En faisant cela et en triant les formes par lemmes (désambiguïsés), nous obtenons la liste dans la troisième colonne qui est tout à fait différente. Le mot le plus courant est le déterminant LE et quelques verbes (être, avoir) se trouvent parmi les 10 mots les plus fréquents. La préférence lexicale pour les mots composés Lors de la phase de segmentation en mots, nous avons d'abord vérifié les préférences pour les mots composés bien connues (des psycholinguistes, cf (Gibs, 1985) La préférence lexicale pour les catégories grammaticales Quand on considère les formes ambiguës syntaxiquement, les probabilités des différentes parties du discours sont généralement très inégales (cf (Church, 1988) ). Indépendamment des préférences syntaxiques qui peuvent être associées à telle ou telle unité lexicale (par exemple ferme est plutôt verbe que nom ou adjectif en contexte de langue générale), nous avons cherché des principes de préférence plus généraux, qui peuvent être utiles pour développer des étiqueteurs en partie du discours automatiques mais qui peuvent aussi mettre en lumière des stratégies humaines d'analyse. Au niveau de l'étiquetage (ou de la désambiguation des parties du discours), nous avons trouvé une forte préférence pour les catégories grammaticales par rapport aux catégories lexicales. Préférences pour l'attachement des propositions relatives Nous avons recherché les occurrences de propositions relatives dans le contexte suivant : N1 (adj) prep (det) (adj) N2 (adj) relative. Sur 370 relatives trouvées, 52,2% sont attachées au premier nom, et on trouve la préférence inverse (44%) pour les relatives courtes (< 6 mots). Ces résultats confirment les travaux de (Zagar et al., 1997) et de (Pynte, 1998) sur la préférence pour l'attachement haut en français (à la différence de l'anglais) et le rôle de la longueur de la relative. Bien qu'il faille être prudent sur la reproductibilité de ce type de résultats, ceux-ci sont prometteurs pour la contribution de la linguistique de corpus à la psycholinguistique (contra (Gibson & Schütze, 1999)). Conclusion Nous A Échantillon du corpus arboré <SENT> <VN> <w lemma=\"il\" ei=\"CL3ms\" ee=\"CL-suj-3ms\" cat=\"CL\" subcat=\"suj\" mph=\"3ms\">Il</w> <w lemma=\"être\" ei=\"VP3s\" ee=\"V-P3s\" cat=\"V\" subcat=\"\" mph=\"P3s\">est</w> <w lemma=\"entendre\" ei=\"VKms\" ee=\"V-Kms\" cat=\"V\" subcat=\"\" mph=\"Kms\">entendu</w> </VN> <Ssub> <w lemma=\"que\" ei=\"CS\" ee=\"C-S\" cat=\"C\" subcat=\"S\">que</w> <NP> <w lemma=\"le\" ei=\"Dfp\" ee=\"D-def-fp\" cat=\"D\" subcat=\"def\" mph=\"fp\">les</w> <w lemma=\"fonction publique\" ei=\"NCfp\" ee=\"N-C-fp\" cat=\"N\" subcat=\"C\" mph=\"fp\"> <w catint=\"N\">fonctions</w> <w catint=\"A\">publiques</w> </w> </NP> <VN> <w lemma=\"rester\" ei=\"VP3p\" ee=\"V-P3p\" cat=\"V\" subcat=\"\" mph=\"P3p\">restent</w> </VN> <AP> <w lemma=\"ouvert\" ei=\"Afp\" ee=\"A-qual-fp\" cat=\"A\" subcat=\"qual\" mph=\"fp\">ouvertes</w> <PP> <w lemma=\"à\" ei=\"P\" ee=\"P\" cat=\"P\">à</w> <NP> <w lemma=\"tout\" ei=\"Amp\" ee=\"A-ind-mp\" cat=\"A\" subcat=\"ind\" mph=\"mp\">tous</w> <w lemma=\"le\" ei=\"Dmp\" ee=\"D-def-mp\" cat=\"D\" subcat=\"def\" mph=\"mp\">les</w> <w lemma=\"citoyen\" ei=\"NCmp\" ee=\"N-C-mp\" cat=\"N\" subcat=\"C\" mph=\"mp\">citoyens</w> </NP></PP></AP> </Ssub> <w lemma=\".\" ei=\"PONCTS\" ee=\"PONCT-S\" cat=\"PONCT\" subcat=\"S\">.</w> </SENT> Il est entendu",
    "abstract": "Dans cet article nous présentons les premiers résultats de l'exploitation d'un Corpus français arboré (Abeillé et al., 2001) . Le corpus comprend 1 million de mots entièrement annotés et validé pour les parties du discours, la morphologie, les mots composés et les lemmes, et partiellement annotés pour les constituants syntaxiques. Il comprend des extraits de journaux parus entre 1989 et 1993 et écrits par divers auteurs, et couvre différents thèmes (économie, littérature, politique, etc.). Après avoir expliqué comment ce corpus a été construit, et comment l'exploiter à l'aide d'un outil de recherche spécifique, nous exposerons quelques résultats linguistiques concernant les fréquences et les préférences lexicales et syntaxiques. Nous expliquerons pourquoi nous pensons que certains de ces résultats sont pertinents en linguistique théorique et en psycholinguistique. This paper presents the first linguistic results exploiting a new treebank for French (Abeillé et al., 2001) . The corpus comprises 1 million words fully annotated and disambiguated for parts of speech, inflectional morphology, compounds and lemmas, and partially annotated with syntactic constituents. It is made of extracts from newspapers ranging from 1989 to 1993 and written by different authors, and covers a variety of subjects (economy, literature, politics, etc.). After explaining how this corpus was built, and how it can be used with a specific search tool, we present some linguistic results obtained when searching the corpus for lexical or syntactic frequencies and preferences, and explain why we think some of these results are relevant both for theoretical linguistics and psycholinguistics.",
    "countries": [
        "France"
    ],
    "languages": [
        "French"
    ],
    "numcitedby": "10",
    "year": "2001",
    "month": "July",
    "title": "Un corpus fran{\\c{c}}ais arbor{\\'e} : quelques interrogations"
}