{
    "article": "The paper presents a system for querying (in natural language) a set of text documents from a limited domain. The domain knowledge, represented in description logics (DL), is used for filtering the documents returned as answer and it is extended dynamically (when new concepts are identified in the texts), as result of DL inference mechanisms. The conceptual hierarchy is built semi-automatically from the texts. Concept instances are identified using shallow natural language parsing techniques. Introduction The increasing amount of texts available in electronic format (Web pages, CD-ROMs) from limited domains requires precise answers from Information Retrieval (IR) systems. Users have various expectations about the result provided by IR systems for various corpora: medical corpus contains information about precise diagnostic or treatment, while the news corpora contain information about persons, places, names. The main goal of this project is to investigate several approaches of integrating semantic information into an Information Retrieval system, for querying in natural language a set of documents from a limited domain. Purely statistical search engines provide bad recall and low precision (the answers contain an important amount of irrelevant information), because they ignore hyponyms, hyperonyms and synonyms. We consider that the use of semantics is a good solution for improving IR systems performances. We integrate a dynamically-modified ontology extracted from texts into an IR system, for investigating the possible improvements of recall or precision. The information extracted from the text is used for building semi-automatically a hierarchy of domain concepts. The domain hierarchy is represented in description logic (DL), providing efficiency and fault tolerance when incomplete or erroneous data are processed. Logic inference mechanisms provided by DL reasoner are used to extend dynamically the domain model, and to complete and to correct missing information extracted from the user query. The system could be easily ported for another domain, due to the dynamic maintenance of the domain knowledge base. Other systems consulting DL ontologies used fixed, manually build domain hierarchies (Welty, Ide, 1999) , and they accept searches on a few fields (author, title, book). NLP techniques have been applied for eliminating some of the drawbacks of IR systems. NLP tools are used to extract index terms, or to develop linguistic resources dedicated to IR systems. Terms are identified by robust methods: finite state automata, POS taggers, shallow syntactic parsers (S.Ait-Mokhtar, J.-P. Chanod, 1997) . Another solution for extracting a better interpretation of the user query and documents is based on the use of semantic resources (as filters or for identifying index terms) for improving search results: multiple-word terms ((Riloff, Lorenzen, 1998) , (Zhou, 1999) ), their semantic variations (Jacquemin, 1998 ), thesauri (Corelex (Buitelaar, 1998 ), EuroWordnet (Vossen, 1998) ) or lists of synonyms (Read, Barcena, 1998 ), concepts (Ambroziak, Woods, 1998) . (Jacquemin, 1998) proposes a small grammar for term identification. Existing semantic resources (WordNet, MRD, CoreLex) contain redundant information, but are often incomplete. These resources are useful for general search, on unrestricted texts, but must be reorganised to be integrated into an IR system. Searching a text base for a given domain requires domain-dependent resources. Domain-specific ontologies might help in understanding user queries and documents. Words might have specific senses, not available in general-purpose resources. For these reasons, we proposed a method for extracting the ontology from texts and several possibilities of integrating it into an IR system. Description Logics Description logics (DL) are formalisms dedicated to knowledge representation (Baader, Hollunder, 1991) , more flexible than frame systems, but providing rigurous semantics and syntax. DL structures the domain knowledge on two levels: a terminological level (T-Box), containing the classes of domain objects (concepts), with their properties (roles) and an assertional level, (A-Box), containing individuals of the abstract objects (instances). The terminological level provides some powerful inference tests: the satisfiability of a concept definition (there is an interpretation of the concept which is true in the set of domain facts), the detection of the subsumption relation between two concepts (detecting which concept is more general than the other one) and classification (ordering the new concepts in the hierarchy). The A-Box provides consistency test (i.e. contradiction-free) or instantiation test (i.e. concept subsuming the instance) for the individual descriptions, or retrieval inference (retrieving for a given concept all its individuals). Among knowledge representation formalisms, Description Logics (DL) are suitable for IR applications because they handle erroneous or incomplete data, together with the possibility of organising hierarchically the knowledge (used for ). CLASSIC has been used for indexing a digital library (Welty, Ide, 1999) , but it requires manual indexation and limited search on some fields. The ontology was fixed and it was built off-line. Some methods based on DL mechanisms were applied to extract terms or relations between terms (Capponi and Toussaint, 2000) , but no IR system integrates a DL ontology, updated dynamically. DLs handle semi-structured data, they do not define the exclusive list of roles for their individuals (they accept implicit definitions). DL accepts also incomplete definitions. ¡ £¢ ¥¤ §¦ §¢ © ¥ ¥ § ¢ ¥ §¦ §¦ ! ¥\" $# £¢ % £ & ' ( ¥) 0 $1 £2 £ 3 ¢ 4 3 ¢ £5 ' ( ) 0 $1 £2 £ 6 ¥¡ ¢ 2 47 £ ¦ 8 9 @¦ £3 £5 5 5 ¦ § £2 ¥ § ¢ 4A £B C ! \" $ £ @¦ @¦ & ' ( ) 0 $1 £2 £ 3 ¢ 4D £B 5 5 5 In the example, the instance y0 of the concept Alpinist defines only the role hasAge, while the concept has some other roles, like hasIdeal. The concepts are defined by define-concept and the logical operators AND, OR, NOT and the DL operators SOME (existential quantifier) and ALL (the universal quantifier). A specific DL, CICLOP 1 (Rudloff et all, 1998), was chosen for representing the domain knowledge because it deals with role hierarchy, inverse roles and transitive roles. It accepts reasoning simultaneously in several hierarchies (multiple T-Boxes) and implements an A-Box. Some of the expressiveness (the features defining concepts and roles, role hierarchy, transitive roles) are necessary for representing domain knowledge into an IR system. Some tests like are useful for checking inferred facts. System Architecture The prototype integrates several natural language processing modules (Figure 1 ) as well as the DL classifier. We implement the prototype and we use for tests small experimental French corpora on heart surgery -MENELAS (83600 words), newspaper articles (300000 words) and NLP articles (250000 words). The system is partially implemented in Java, in Perl and in CLIPS (the rules combining domain-specific terms). The aim of these modules is to identify domainspecific terms and eventually relations between terms. From the set of terms and relations, the system updates a domain-specific hierarchy. The automatic extraction of ontologies was the object of the TAI group (Terminology for Artificial Intelligence), defining principles for ontologies (Bouaud and all, 2000) , and developping tools for identifying terms and relations. A bottom-up approach for building a hierarchy was adopted by several systems: identifying terms and assigning them to concepts (Bachimont, 2000) , generalising predicate structures to DL concepts (Capponi and Toussaint, 2000) . Our ontology definition is a simplified hierarchical model of the terminological knowledge from a given domain. Our approach starts also from texts in order to identify terms. Cue phrases (functional words, clause markers) are used to identify potential relations between terms (and also between concepts). A link between candidate terms and DL representations is proposed, and the conceptual representations are validated by DL tests. We adopt a shallow, fault-tolerant approach for identifying term candidates; we need to recognize only the most relevant pieces of information in the text, even if some small errors occur in the input. NLP Modules Semantic chunk identification Semantic chunk identification The main goal of this module is to identify the word sequences corresponding to the most significant domain concepts (semantic chunks). A semantic chunk contains a simple syntactic pattern (simple noun phrase, verb) and it is delimited by two border words. Border words are functional words, auxiliaries, some prepositional syntagms. The semantic chunk, as we defined in our system, might contain some errors, which are ignored by the processing modules. Example. \"la victime, emportée par l'avalanche\" [the victim, taken from the avalanche] In this example, \"la victime\" and \"l'avalanche\" are semantic chunks, containing the relevant information. This module uses several tools: a POS tagger, a sense tagger, a border identifier and a pattern matcher. The identification of the semantic chunks is based on lexical information, provided by the POS tagger. a) The POS tagging (using WinBrill, trained for French with a set of data provided by Institut National pour la Langue Franc ¸aise (Lecomte, 1998)) identifies the content words (nouns, adjectives, verbs) and functional words (prepositions, conjunctions etc.). Brill's tagger uses a set of contextual and lexical rules (based on prefixes and suffixes identification) learned from annotated texts, for guessing the POS for the unknown words. It was chosen because it provides good results (95 %) and it was available, with the French language model. b) The sense tagger contains a pattern matcher, consulting a set of idiomatic phrases (their sense could not be composed from the component parts) and their conceptual descriptions assigned by a human expert. The sense is represented by DL conceptual descriptions. The pattern matcher annotates each known word or idiomatic phrase with its semantic description. c) A module for border identification. It identifies the words and the syntactic constructions delimiting the semantic chunks. This module uses the output of POS tagger (identifying the functional words), as well as a set of cue phrases (syntactic phrases containing auxiliaries, composed prepositions). The set of cue phrases is built as a result of studies on experimental corpora. The determiners and prepositions are best candidates for chunk border. d) Pattern matcher. The goal of this module is to identify the core of the semantic chunks, which is represented by simple noun phrases and verb phrases, between two consecutive borders. Examples. A simple noun phrase is identified by the following rules: ¢¡ ¤£ ¥ §¦ , © § §¡ £ §¦ , § ¡ £ ¥ §¦ Errors might occur between two consecutive borders, and these cases are handled by patterns like the last one. '*' replaces anything in the input text, so errors might be ignored. e) DLgen interprets the information provided by the POS tagger and generates automatically a concept definition. A human expert must check the output of this module. A few examples of rules proposed for generating simple DL descriptions: -S1/N S2/ADJ is associated to the definition ¥! #\" $ % ! & #' #( % )' 0! 01 #2 ¤3 54 6 ¥3 #7 ¢ 8 #9 #@ A3 54 ¤ 3 #B 0C #D E F G 8 #2 ¥H I 3 #7 )I P ¥P #P Q R 5S T 0U VR W 0T 0U U YX a`b dc #b b e ¥f `c 0g h i pg e Yg q h ri h s 5t `g `e #t ! 0\" 5$ % 5! ¥& ¥' 0( 0% 5' #! 1 ¥2 ¤3 4 3 ¥B C ¥D E 5F ¥G 9 F 0u ! I 3 ¥7 5I 0P #P Q R 5S T 0v w yx VR W 0T 0U `b §c 0b b e ¥f `c g h i Vg e g q h i h s 5t `g `e #t ! 0\" 5$ % 5! ¥& ¥' 0( 0% 5' #! 1 ¥2 ¤3 #7 ¥6 #3 54 ¤ 8 #9 #@ 3 #7 3 ¥B C ¥D E F G 8 #2 ¥H I 3 4 I P ¥P #P Q rq h Y #h b c 0 h Yg c #t b c g h i `t 0g e e # h Yt c # h b rR 5S T Y V`b rc 0b b e ¥f `c g h i g e g q h y e 0 h hasS1 There are also some simple patterns for describing phenomena like negation, in particular, even if it is impossible to enumerate all the possibilities, to detect correctly the scope of the negation: -sans/ADV S1/N is associated to the definition ¥! #\" $ % ! & #' #( % )' 0! 01 #2 A% 5( 2 56 #3 54 9 B 3 4 #P #P Q c 0 f t 5T v Yw R 5S 0T U d`b c 0b b e ¥f `c g h i ag e §g q h b c # h i h s 5t `g `e #t ! 0\" 5$ % 5! ¥& ¥' 0( 0% 5' #! 1 ¥2 A% 5( 2 56 #3 54 9 B 3 54 0P ¥P Of course, not all the negations might be handled. The output of DLgen module provides only 61 % right annotations. Its output is checked by the human expert with the use of the DL classifier to see if the concept definitions generated automatically are correct or not, due to input errors: determiners starting the sentence, some patterns which are not coded by the system. Relations between terms This module applies DL inference mechanisms, as well as syntax-based rules, in order to combine the conceptual descriptions associated to each semantic chunk. 1) Relevance chunker. We consider two classes of chunks: main chunks and secondary chunks. Main chunks are similar to the notion of heads proposed by classical linguistic theories. Secondary chunks play the role of a modifier, which just add more information to the sense of the head, which might be absent. We interpreted the order and the position of the chunks in the sentence, used for combining concepts. Some examples of rules defines various chunks: -semantic chunks following after a gerund verb, an auxiliary plus a past participle verb or a preposition are secondary chunks; -verbs are always Main chunks; -chunks following after a conjunction are annotated by the same tag as the previous one. Example. '[Main Les contrebandiers Main] [Main ont commencé Main] [Second á utiliser ces \" monstres \" Second]' 'The trafficants have started to use monsters' The main chunks identified here are \"les contrebandiers\" (the first chunk in the sentence), and the \"ont commencé\" (comme verb principal). The last chunk is marked as secondary because it follows after the preposition \"à\". 2) Heuristic rules. The rules are established by a human expert as a result of corpora studies. The corpora were POS tagged and manually annotated with conceptual descriptions. The set of heuristic rules is established after a list of patterns extracted from corpora. Example of syntactic heuristic rules: if a preposition is a delimiter between two semantic chunks and the preposition is relating a noun to its modifier, then we can combine the conceptual descriptions of the two chunks into a more complex semantic description. ¡ £¢ ¤ ¥ §¦ § §© ¤ \"! # $ % # & ¤ ' % §( © \") 0 1 ¦ $ 2¢ 3 §! 4 5¥ \"¦ © 0 1 ¦ $ 2¢ ¥ \"! $ \" ¡ \" % # 4 4' % §( © \") 1 6 §% 4( ! 7 8 \" §% 9¢ @ % 7 A¢ ¥ \"¦ © 0 1 &B C@ % 7 D¢ ' % §( © \") 1 1 E DF G H PI §F Q Q R S T PU V WF T PF G Q U X F Q U Y T `G Y T §a §U Q U Y T cb Y S dQ H §R eS f §g R h pi DS R I Y V U Q U Y T §V q I §F V Q eI §F S Q U G U I §g R WX R S r §V q F S R WV Y s tR pR u §F s tI §g R V AY b 9r \"Y S a §R S Av AY S a §V q \"U T §G g f §a §R a cU T tQ H §R pF G Q U X F Q U Y T tG Y T §a §U Q U Y T §V AY b 0Q H §R pH §R f §S U V Q U G S f g R V h ti 9F Q Q R S T §V eF V V Y G U F Q R a Pv dU Q H wF cx U X R T PQ S U x x R S dv yY S a H §F V eF V V Y G U F Q R a wF v yR U x H Q q 9R u Q S F G Q R a b S Y s 4G Y S I Y S F §h 9 5T f §s er R S AY b & eS f §g R V AH §F V Ar \"R R T a §R V G S U r R a U T A & i A \"h \" Y s tR dS f §g R V d G Y T Q F U T §U T §x I §S R I \"Y V U Q U Y T §V 0Y S 0x R S f §T §a §V 0F S R Ds tY S R &b S R f §R T Q &Q H §F T pQ H §Y V R 9Q S U x x R S R a pr eG Y T f §T §G Q U Y T §V q V Y yX F S U Y f §V V F g U R T §G R V yF S R pF V V U x T §R a Q Y Q H §R V R pS f §g R V h CICLOP classifier. R yf §V R yQ H §R dR u §I §S R V V U X R T §R V V yF T §a Q H §R dg Y x U G F g U T b R S R T §G R V 9b Y S 9G H §R G U T §x pQ H §R X F g U a §U Q pY b \"Q H §R AT §R v CU T b R S S R a pb F G Q V h 9 yH §R yY f Q I §f Q DY b \"H §R f §S U V Q U G DS f §g R V &U V &S R \"T §R a F T §a eG g F V V U \"R a eF T §a ¡ £¢ £¤ £¥ ¦ ¨ § © ¡ § ¤ § ¦ \"! # ¨ $ # % ¨& (' ($ )$ 0 § 0 ¥ ¤ £ © § ¤ © 1 ¤ § $ ¨ 2 £2 3 © ¦ \"© § 0 ) $ ¤ £ )¤ 42 £ ¡ § ) ¥ ¤ £ © £¡ ¨! 5 3 ¡ \" $ 3 © 1 § © £¡ § & 76 5 § 8 # ¡ 2 9 $ ¥ ¤ © ¡ 3 $ ¡ @ $ \" 0 ¥ 1¤ £ \"¦ A B¡ ¦ C% 1 ¤ £¡ 9 © D$ ¤ ¢ \"¤ E ¨© 8 ¦ © £% 1¤ ¡ F ¦ B ¡ ¦ ¡ 4 0 ¥ & HG PI G PQ SR 7T ¡ 8 ¡ § ¨% 1 § $ ¤ ¡ % 1 9¤ ¨0 ¦ @ © E A B¡ 4 $ ¨ © ¥ 4¦ A B¡ © £¡ 5U P § $ § V ¡ 2 E $ ¨ § © ¡ § 1¤ ¡ ¦ $ ( 0 ! 0 % 1 ¥ ¤ £ ¦ ¨! # 4 $ © £¥ & W % 1© £¡ 2 ¨ $ 1 0 ¥ © ¢ ¦ ¦ D! # X $ 4$ 0 § 0 ¥ U Y© £¡ ¥ # Ea \"b c¤ 1¤ £ § § ¦ @! £# E $ 1d 7Q § ¥ ¤ £ A B U ! B § ¤ 0 ( © £% 1 P© £8 B $ P ¡ 8 ¦ 9 § © £¡ § e¤ £ (¡ © e § © £¡ ¡ £ 3 $ $ ( f ¡ 2 7¦ A B¡ F © ¡ U £© £ Y! B § ¤ 0 e $ Pd 7Q ¨$ ¤ £ § $ # ) S ¥ ¥ ¡ § © £% 1 ¥ & S' ($ ( 0 ¥ ¡ 2 7 § © ¡ § Y¤ £ e¢ £¤ ¥ ¦ ¤ ¦ ! £# 4 $ f ¡ 2 9V ¡ © 3 ¥ ¦ 2 © £¡ ¥ # ¨ 8 S $ © £¡ © £¥ © 2 # 4 ( § © £% 1 ¥ & 3.3 Functionality ' ($ 9g 7Q hT i% 1© ¦ 0 ¥ 7¦ § ! B ¦ X¤ ! B© ¢ 1 © § 70 p 0 © £ 7¦ © § 0 % 1 ¡ © ¨! B 9 ¡ § ¥ 0 ¦ ¦ X ¡ $ ! ¤ & ' ($ 9¦ © § 0 % 1 ¡ £ ) (A B © § ¦ E! £# X¤ 4 © £V £ ¡ q U h ¦ ¡ 8 # ¡ 2 1 $ 9¥ 7© 8 e $ 9% 1© £ 78 p 0 ¡ £ 3 © ¦ & )r B© ¤ £ § $ 3 © ¦ \"8 © % s $ 9¥ U 3 9 f ¤ £ § 7 $ 9¥ 8 7¤ ¡ ¦ \" $ 9 2 £$ 7 § © £¡ f 1t ¤ ¨¥ % 1 ¦ ¡ 0 % 9! B 7© £8 3 © ¦ F 7u 9 © Xv w x & r B © £% y $ 7¥ U 3 9 f ¤ £ § 7 $ 9% 1© £ 78 p 0 ¡ £ ) § © £¡ ¡ 3 © £ ¦ t ¡ © 0 ¡ U ¤ ¦ § ¢ U 5¤ £¡ ¦ 4¢ ! x & P' ($ 7 § © £¡ f © 8 S $ § © ¡ £ ¡ £ 3 © ¦ (¤ 7 © § ¦ \"! £# 4 $ g Q hT X% 1© ¦ 0 ¥ 58 © h¡ 3 § © £¡ § Y ¦ ¡ £ A B § ¤ © ¡ 5& S' ($ ed 7Q 4% 1© ¦ 0 ¥ S¢ £¤ ¥ ¦ ¤ 5 $ e¡ 3 § © £¡ § 0 ¤ ¥ ¦ A B¡ © £¡ (¤ £¡ ¦ ¨ $ # \"¤ £ ¤ £¦ ¦ ¦ 4 © 9 $ ¦ © £% 1¤ ¡ 4$ ¤ £ § $ # £& r Y U $ ¤ £ ¡ \"% 1¤ £ § $ ¦ ¡ A B ( $ 5 § A B § $ ¤ 7 ¡ 4 $ ¡ 0 f U B¤ ¡ ¦ ¨ $ ¡ ¤ £2 £2 S¥ ¤ ! B ¥ h $ PV ¡ © 3 ¡ 3 © ¦ Y¤ £¡ ¦ ) $ P ¦ ¡ A B ¦ 9 $ ¤ £ 3 $ $ ( § © ¡ § 0 ¤ £¥ ¦ § © £¡ & Q h f § ¤ ¥ 5 ¡ 8 © % 1¤ © ¡ 1 (¤ 2 £¡ ¦ 4 © 1 ¤ § $ 3 © ¦ ¨! # 4 $ T PR 6 1 ¤ 2 £2 & g f U S $ 4 % 1¤ ¡ £ § 1 § $ 0 ¡ V 1¤ £ 1 ¦ ¡ £ A B ¦ D ¡ X $ 4 ¡ 0 f & Xr B© £ ¤ £ § $ @ § $ 0 ¡ V BU 3 1$ ¤ ¢ 4¤ § © £¡ § 0 ¤ ¥ e¦ § © £¡ 5& ¨' ($ 1$ 0 § 9 0 ¥ 3 ¥ ¥ e! B 10 ¦ E8 © £ § © £% 9! ¡ ¡ 2 ¨ ¤ £ ¤ ¥ Y % 1¤ ¡ £ § ¦ § © ¡ & \" D ¨ ¦ ¡ 8 # E¤ X 1© £8 ¡ 3 § © ¡ § 0 ¤ £¥ (¦ § © £¡ 4t ¤ 9¤ \" 0 ¥ 9© £8 $ 0 § 0 ¥ x U h § $ § V £ ¦ @! £# X $ 9d 7Q § ¥ ¤ A B & 9I 8 3 1¤ £ 9 © § ¡ 2 \"0 ¡ 0 U h $ ¡ X $ 1 ¡ ¤ £¡ § © 8 Y $ 9 § © ¡ § 7¤ ) ¢ ¦ 5& I 8 P¡ 3 ¦ © § 0 % 1 ¡ £ 3 9 © § ¦ X © 4! B 9¤ £¦ ¦ ¦ \" © 1 $ f ! ¤ £ U $ ¦ © % 1¤ £ ¡ ¨$ ¤ § $ £# ¨ ( f ¡ ¦ ¦ 3 $ ¨¡ 3 § © ¡ § & 4 DL for Indexing d 7Q X © ¢ ¦ ( 5© 3 8 0 ¥ 5 ¡ 8 ¡ § 7% 1 § $ ¤ ¡ % 1 e8 © P$ ¤ ¡ ¦ ¥ ¡ 2 ) ¡ § © % 1 ¥ 7¤ £¡ ¦ ¨ % 1 F 0 § 0 ¦ ¦ ¤ ¤ U (¤ 3 ¥ ¥ ¤ 9¢ £¤ £¥ ¦ # D 18 © 1¡ 3 ¡ 8 ¦ @8 ¤ § & R 7¡ @ $ \"© $ 1$ ¤ ¡ ¦ 5U (I y # % 1 $ ¤ £¡ ¦ ¥ 7 ¡ § © % 1 ¥ 7© £ ( © £¡ © £0 ¡ 0 (¦ ¤ £ ¤ 9¤ 3 ¥ ¥ 5¤ P8 0 q q # ¨¦ © £% 1¤ ¡ 4V ¡ © 3 ¥ ¦ 2 £ £& er B© e $ ¤ £ © ¡ U d 7Q X e § $ © £ ¡ 1¤ e¤ ¦ © % 1¤ £ ¡ 1V ¡ © 3 ¥ ¦ 2 £ ¡ ¤ © ¡ 98 © % 1¤ £¥ % 8 © £ e© £0 eI # % ¨& ' ($ 4 ¡ ¦ f ¡ 2 X% 1 $ © ¦ D )¤ XQ h¤ £ ¡ 16 % 1¤ £¡ § 1I ¡ ¦ f ¡ 2 X© ¡ Xt d 70 % 1¤ £ U (v £x U 3 $ 1 % 1 $ ¤ ¢ 7! 5 ¡ \" ¥ ¤ § ¦ ¨! # ¨ § © ¡ § & P' ($ % 1¤ £ f 4© 8 Y¦ © § 0 % 1 ¡ (¤ ¡ ¦ ¨ § © £¡ § ( ¦ 0 § ¦ \" § © % 9F 0 ¡ 2 1 0 ! 0 % 1 © ¡ \" ¥ ¤ © ¡ (! 5 3 ¡ X § © £¡ § ¤ £¡ ¦ ¨ $ ) § © £¡ § 3 2 $ £ 9t ¥ © § ¤ ¥ h© £ 2 ¥ © £! ¤ ¥ 8 p 0 ¡ § x & ¢¡ ¤£ ¥ ¦ §£ © £ © £ ¡ © § ! \" #© $ % & ' !( ¡ ¤£ \" !¡ )$ !¥ ¡ 0 1 ¥ ¡ © £ & 2 !3 4 ! © & 2 \" !& ¡ ¥ © ¥ \" ¦ 5 !' ! £ 6 ¤¡ 2 !¡ ¡ 4 7© § © ( ( % ¡ £ 0 8$ !¥ & & £ & 9 ¡ 2 ! ¡ $ £ ¤£ £ © ¥ £ )¡ @ £ ¡ 2 !4 !& 2 !3 & £ A 4.1.1 Manual building B ¤\" ¡ C )D E\" !& ¡ ¥ © ¥ \" ¦ F0 G£ \" !¡ 4 ! © & 2 7\" !© H© H& £ H ¥ ¡ §© I © 2 !© ( ( ¦ F' ! !& ( £ H& 2 !& £ & © ( 1\" !& ¡ ¥ © ¥ \" ¦ A B ¤\" !¡ & 2 & £ & © ( 2 ! ¡ $ £ G© ¥ ¡ & 4 !¡ 2 £ & P Q¡ 4 §' ¦ © H\" ! © 2 ¡ @ $ %¡ ¥ £ & 2 H£ \" !¡ ( & £ G¨0 %¥ ¡ $ %¡ © £ ¡ 4 § ¡ 3 ¡ 2 £ G¡ @ £ ¥ © £ ¡ 4 0 ¥ R© ¡ £ ¤¨0 1& 2 !& £ & © ( £ ¡ @ £ A GB ¤\" !¡ )& 2 !& £ & © ( £ ¡ @ £ G6 ¤¡ ¥ ¡ ) ¡ ( ¡ £ ¡ 4 # © 2 !© ( ( ¦ §0 ¥ S© ¡ £ ¤0 T¥ ¡ !( £ ¨0 U ¡ ¦ 6 ¤¥ 4 ¢ ¡ © ¥ \" EV $ !¥ $ Q ¡ 4 W' ¦ F£ \" !¡ ¡ @ !$ Q¡ ¥ £ )£ Ï' Q¡ ¥ ¡ $ !¥ ¡ ¡ 2 £ © £ & 9 ¡ §0 ¥ £ \" !¡ 4 ! © & 2 QX ¤¥ ¡ £ !¥ 2 !¡ 4 ' ¦ `Y )3 ( ¡ A FB ¤\" !¡ #¡ @ $ %¡ ¥ £ 4 !¡ P Q2 !¡ © ( 7£ \" !¡ #¥ ¡ ( © £ & 2 ! ' %¡ £ 6 ¡ ¡ 2 `£ \" !¡ # 2 ! ¡ $ £ A ¢B ¤\" !¡ 0 ( ( ¨6 & 2 !3 £ © ' !( ¡ )$ !¥ ¡ ¡ 2 £ 9 © ¥ & ! ¤\" !& ¡ ¥ © ¥ \" ¦ I & a ¡ )0 ¥ 9 © ¥ & ! ¤ ¥ $ ! ! b 4.1.2 Modifying the hierarchy c\" ¡ 2 W© I2 !¡ 6 S4 ! ! ¡ 2 £ & )© 4 !4 !¡ 4 W£ #£ \" !¡ §& 2 !4 !¡ @ W' !© ¡ 5 TP Q¥ £ & £ & )$ !¥ ¡ $ !¥ ¡ ¡ 4 ¢' ¦ W© I 4 ! !( ¡ ¡ @ £ ¥ © £ & 2 !3 £ \" !¡ £ 0 ¥ ¡ d !¡ 2 £ H 2 £ ¡ 2 £ )6 ¤¥ 4 ! §V 2 ! !2 %5 %© 4 e ¡ £ & 9 ¡ 5 Q9 ¡ ¥ ' ! X © 2 !4 I£ \" !¡ & ¥ 2 £ ¡ @ £ A B ¤\" ¡ f D 1g c 4 ! !( ¡ )$ !© ¥ ¡ §£ \" !¡ § 2 £ ¡ @ £ V h i p h 6 ¤¥ 4 ! X )© 2 !4 F¡ @ £ ¥ © £ 2 !¡ 6 S 2 ! ¡ $ £ A q Q¥ )¡ © \" 2 ! ¡ $ £ 5 Q© C )D ¢4 !¡ ¥ & $ £ & 2 I& ' ! !& ( £ ¤© 2 !4 I& £ & ¤© 4 !4 !¡ 4 #£ §£ \" !¡ H¡ @ !& £ & 2 !3 §\" !& ¡ ¥ © ¥ \" ¦ A r ¡ 2 ! ¡ £ © 3 3 & 2 !3 7© & 3 2 ! H6 ¥ 4 ! §© 2 !4 `& 4 !& © £ & §$ !\" !¥ © ¡ 6 & £ \" W£ \" !¡ & ¥ C )D c4 !¡ ¥ & $ £ & 2 ! A Fg 8© ¥ £ & © ( ¡ © 2 £ & )4 !¡ ¥ & $ £ & 2 ! ¤© ¥ ¡ H ' !& 2 !¡ 4 I' ¦ I© $ !$ !( ¦ !& 2 !3 §¥ !( ¡ ¤¡ 2 ! 4 !& 2 !3 ¦ 2 £ © £ & U 2 !¨6 ( ¡ 4 !3 ¡ A q Q¥ ¡ @ © $ !( ¡ 5 Q& £ ¤& ¤$ % & ' !( ¡ )£ § §' !& 2 !¡ ) 2 ! ¡ $ £ !© ( T4 !¡ ¥ & $ £ & 2 ! 0 ¥ ¤© 2 ! !2 I© 2 !4 7& £ ¤ 4 !& P Q¡ ¥ A ¢¡ ¤£ ¦¥ § ©© ¢ © © ¢ © © ¢ ! \"¥ § ©# # $ % %& ' ©( ) 0 © $ %1 ) 2# % 3 © ©4 ¢ 5 6 ©7 % & ¢8 8 9 @£ ¦¥ § ©© ¢ © © ¢ © © ¢ ! \"¥ ' ©A B ©C D$ ¢ & ©' ( ©) ©0 ©$ ¢1 ) E¥ %A F 2# ©3 4 % %5 6 7 % © %& G8 ©8 8 H PI Q SR T VU XW %Q Y ¢%a R a U %b Evaluation H U XI %c ©Q c hd Q c ©s a Xc © Q fU R I %Q Q d Xe a Q %e g y GT VQ %Q Q W R U XR Q b R SR I %Q fb g %b R Q qU ©s c d ©Q fe U ©d p ¢U ©d c w uH PI %Q e uf g DR U U s b %b Q W h U ©d fa W %Q R a g %a % hR Q d Xb fc ©%W id Q s c R a U %b f GQ R T VQ Q ìR Q d Xb fT PQ d Q hQ c ©s %c R Q W U ©d fc b Q R VU j XU ©W % %s Q ip %d U %a W %Q b c b Q R iU up s q qU ud a I ©R c %%U R c R a U ©%b y GQ e c %b Q ha R p %d U ©p ¢U ©b Q b c b Q R iU uc W I %U e d s Q b w H PI %Q d Q b %s R X Xa I ©R i ¢Q ha Xp %d U ©Q W ia ue U © Xp %s Q id %s Q b i %b R i GQ hW %Q b e d a ¢Q W Gw ht ©u q \"U PR I %Q d Q b %s R a % e U %e Q p R F.Baader, B.Hollunder A terminological Knowledge Representation systems with Complete Inference Algorithms ¡ ¢ ¤£ ¦¥ § ¦¨© £ ¦ £ ¥ £ ¨¨! \" $# % & ' ¦¥ ' ( ! ) ¦ 10 1 £ 2 3& 4 \" ¦ ¡ # %0 65 7 8 9",
    "abstract": "The paper presents a system for querying (in natural language) a set of text documents from a limited domain. The domain knowledge, represented in description logics (DL), is used for filtering the documents returned as answer and it is extended dynamically (when new concepts are identified in the texts), as result of DL inference mechanisms. The conceptual hierarchy is built semi-automatically from the texts. Concept instances are identified using shallow natural language parsing techniques.",
    "countries": [
        "Romania"
    ],
    "languages": [
        "French"
    ],
    "numcitedby": "3",
    "year": "2001",
    "month": "July",
    "title": "Ontologies for Information Retrieval"
}