{
    "article": "As the translation industry is faced with ever more challenging deadlines to meet and production costs to keep under tight control, translation companies need to find efficient ways of managing their work processes. CLS Corporate Language Services AG, a translation provider for the financial services and telecoms industries has tackled this issue by developing their own workflow application based on Lotus Notes. The system's various modules have been developed and enhanced over the last four years. Current enhancement projects include interfaces to the accounting tool used in the company, web-based information systems for clients and translation providers and the close integration of some of the CAT tools the company uses. CLS Corporate Language Services CLS Corporate Language Services operates from five locations in Switzerland (Basel, Zurich, Berne, Lausanne and Chiasso) and has just opened a subsidiary in London and a branch in New York by the name of CLS Communication Ltd. and CLS Communication Inc., respectively. CLS' 200+ employees provide language services to the financial services and telecoms industries in Switzerland, Germany, UK and USA. The company has about 150 inhouse translators, working from five locations in Switzerland or as tele-workers from their home. There are roughly 150 external partners who are closely integrated in CLS' work processes. Another 300 external translation providers take assignments on a less regular basis. CLS offers its clients services in German, French, Italian, English and Spanish, outsourcing other language combinations to external partners. Over the last few years the company has earned a reputation for managing large multilingual translation projects through translation project managers especially trained in an in-house project management course. Based on its experience in insourcing a number of language services, CLS management also takes on consulting mandates related to the organisation of language services or outsourcing projects. Typically, CLS concludes service level agreements with its clients, which mean that the client assigns all language services work to CLS and CLS provides all language services required by the client. As a consequence of this business practice, CLS is faced not only with longterm and large translation projects, but also with a great number of small and very small translation tasks of less than 2 pages. Given CLS' customer base in the financial services and telecoms industries, deadlines for some projects have to be met by the hour, and security requirements for data transfer and storage have to be equivalent to those of the Swiss banks. CLS and Language Technologies The company has always shown a keen interest in supporting its work processes by appropriate technologies. A pioneer user of computer-assisted translation systems, such as translation memories and alignment, CLS has recently become involved in machine translation, customising a machine translation system to the needs of the financial services and telecoms industries and offering machine translation services to its clients. Five years ago, CLS, which had just been founded, was looking for an appropriate translation workflow system. The evaluation of the products then available proved unsuccessful. Some programmes did not support installations including more than one office. Others did not allow a deputy to take on the tasks of a person who was absent or had fallen ill. Still others were geared to longterm translation projects, not allowing efficient processing of smaller jobs of 1 to 5 pages. This is what made CLS decide to have its own translation workflow tool developed. It was to be based on Lotus Notes, as the company already used Notes as an e-mail system. Computer Solutions Facility, the company which provides CLS' IT services and support, was chosen for this task, as they knew CLS' business processes very well already, their office was situated close to CLS' head office and they were working with a skilled Lotus Notes specialist. The basic Work Processes The basic work processes CLS Workflow mirrors are as follows: The client posts an order via a web interface, entering his contact details, information about the job as well as the files containing the text material to be translated. This information and the files are routed to the account manager responsible for this particular client. The account manager establishes the volume, the text type and the difficulty of the text and draws up an offer for the client. The account manager then assigns the text to the 'right' translator and a translator responsible for quality assurance (QA). The translator and the QA person have to be 'right' in terms of language combination, availability, text type and previous work. They are either working inhouse or from their home. In some cases the text has to be split up between two or more translators. The translator then translates the text using, amongst other sources of information, the clientspecific translation memory and terminology database. The text is passed on to the QA person for a 'second opinion', who makes suggestions to the translator as to how the translation could be improved. The translator incorporates the changes into the translation, performs the cleanup procedure in the translation memory, and stores the final version in an archive for further reference, sending it to the client at the same time. Translator and QA person make a note of the time they spent on the project. Based on the account manager's offer and the translator's time entries, Management Services create an electronic or paper invoice for the client. CLS Workflow and its modules CLS Workflow consists of a number of different integrated modules within Lotus Notes, and increasingly interfaces with other tools. 4.1. CLS Client This database hosts contact information about clients including names of contacts, e-mail addresses, the language versions a particular client usually requires, special linguistic rules the client may wish CLS to observe, larger projects we are working on, translation memories and glossaries that the translator must consider for any work for this client. Moreover, CLS Client stores information about CLS employees designated to a particular client: account manager and language operations manager, assigned translators, and it is designed to manage relevant client documents, such as service level agreements, offers, minutes of visits, client feedback, glossaries, relevant newspaper articles. CLS HR CLS HR is the module to store information about in-house and external language service providers, such as contact information, language versions, specialist areas, technical infrastructure, skills. For CLS employees organisational information, such as group head, deputy, date of entry, contact details are also stored in this module. For external translators the translation memories sent to them are listed and their expiry dates, the account information on our translation server and the prices agreed. 4.3. CLS Tools CLS Tools is a module to manage information about translation memories, terminology databases and useful internet links for Translators. This module lists where CLS' 600 translation memories are located in the network, when their data was last synchronized between locations, or which translators have access to a particular memory. CLS Tools is integrated with CLS Client in the sense that for each client the translation memory to be used can directly be specified. The integration with CLS HR allows us to register the memories sent to each external translator. CLS Time CLS Time is a calendar module where all CLS employees enter the times they are free to take on more translation work or booked out. All absences from the workplace are entered as well as appointments. CLS Time is the main source of information used to locate CLS employees. CLS Workflow CLS Workflow is the central component storing all the information relevant to a particular project and linking it to the information contained in the other modules. Part of this module is an interface between the clients' intranet and CLS' workflow server, which allows the files as well as the project information to be transferred in 128-bit encoding. For each project a database entry is generated in the workflow database and completed by the account manager in charge. This project document serves as a central source of information about this particular project throughout the translation process. Once the translation is completed, the project document enters into an archive database. The project document contains the actual source text files as well as relevant information from CLS Client about the client, the exact deadline, text length, proportion of repetitive text and translation memory matches, the translator(s) and persons responsible for Quality Assurance (QA person). In order to assign a particular order to the best translator for this job, the account managers have a filtering tool at their disposal to combine information from other project documents, CLS HR and CLS Time. Moreover, there is a possibility for interaction between account manager and translator/QA person: once a new order is assigned by an account manager, the translator and the QA person receive a notice informing them of their new task, which they can accept or refuse. If they accept a particular order, they can inform the account manager by means of a status button of the progress of their work. When the translator has finished his work, he attaches his text to the project document and the QA person is informed that the text is ready for re-reading. Finally, there is a timesheet in the project document where translator and QA person can enter the time spent on the project for billing. CLS Approval This module controls all processes requiring an approval by the group head: demands for holidays, compensation days or unpaid leave. The programme with all training courses offered in-house is managed in this module and free spaces can be booked and approved. CLS Approval is integrated with CLS Time in the sense that holidays and courses approved by the group head are automatically displayed in CLS Time. CLS Help The CLS Help module consists of a database containing directives or other knowledge of the teams within CLS. It is designed to store all relevant information of all work groups that does not relate to a specific client. Information relevant to a specific client is stored in CLS Client. Interfaces to other applications Honoris Honoris is primarily an accounting tool used to store information on time spent for each translation job and generate invoices accordingly. Given that, to people outside the accounting department, Honoris has never been very user-friendly, an interface to CLS Workflow has been built, in order that translators and account managers no longer need to use Honoris and can enter their information via CLS Workflow. At certain intervals (depending on the type of information, this can vary between between every five minutes up to every night) relevant information contained in CLS Workflow is transferred to Honoris in order to prevent double entries of one and the same piece of information. SQL-Server There is an interface to SQL-Server in order to publish data contained in CLS Workflow and Honoris over the Web for the benefit of three different interest groups. First, our client information system named KIS (Kundeninformationssystem) is designed to give clients the possibility to look up the orders they have placed with CLS. Amongst other things, they can find out if their order has already been processed or invoiced, how many orders they have placed within, say, the last three months or the amount invoiced between, for example, January and April this year. Second, our capacity tool named Kapi tool (Kapazitätstool) draws on the data entered in the Workflow and CLS Time modules, creating a centralised source of information for account managers allocating projects to translators. The Kapi tool shows for example that a French translator has already been assigned five hours worth of translation projects for Thursday, November, 21 (data from CLS Workflow) and that she is seeing her dentist for two hours in the afternoon (data from CLS Time). On the basis of this information, the account manager can quickly find out that this translator still has time to do a project of half a page for that particular day. Third, our management information system named MIS allows members of the management team to gather many kinds of information about translation projects. It is for example possible to see how many projects from German into English the translators specialised in telecommunications completed during the first quarter of 2002. If this figure is very high, and, say, the number of projects translated by the insurance team is at the same time rather low, then maybe one of the insurance translators should be trained to be able to do telecommunications texts as well. Advantages and Disadvantages of CLS Workflow Lotus Notes as a Platform There were a number of reasons for CLS to choose Lotus Notes as a platform for their workflow system. The main reason was that Notes offers a wide range of out-of-the-box modules that can be adapted to a company's needs. In doing so, CLS was able to avoid having to program an entirely new application from scratch, which saved time and costs, and did not require the programmers to be familiar with a specific programming language. Another advantage of the Lotus Notes platform is the fact that it can be used as an e-mail and personal organiser system, including replication possibilities for personal digital assistants. Moreover, Notes supports database replication between locations, which is crucial to a company like CLS, operating from seven locations in three countries and employing thirty teleworkers, who need to replicate their data from home. The system lends itself very well for archiving, as it allows project files to be saved as attachments directly in project documents. The main disadvantage of Lotus Notes at the moment is the fact that an attached file, which has been launched from a project document, cannot be directly saved back into the same project document. Each file has to be detached to a working folder first and the final version has to be re-attached to the project document. New releases of Notes are to be designed to overcome this problem. Development team The growth of CLS over the last four years is mirrored in the Workflow development team: There are two Lotus Notes programmers as well as a number of representatives from all business areas within CLS: Chief Operations Officer, account managers, translators, CAT assistants, terminologists. The development process, however, has remained the same: A request for change or enhancement can quickly be discussed with the programmers. Given their thorough knowledge of the work processes within CLS, they are able to point out the problems that could arise from such a change. If the person requesting the change is still interested to have it implemented, the programmers will make the new parameter or function available within a short time. As there is not a very sophisticated approval procedure of such changes or enhancements, they can be implemented very quickly, which is motivating for the users and people requesting changes. However, some changes may still interfere with other user groups or might not prove useful after all and need to be undone. The experience gained from such albeit rare cases, is still valuable for further developments. For CLS Workflow this method of development has proven very satisfactory, as it allows for the greatest possible flexibility and encourages interaction between users and programmers. Planned developments Current developments revolve around integrating the separate modules of CLS Workflow as well as building intelligent interfaces to the accounting tool as well as the programmes used for computer assisted translation. In order to improve the quality of translation memory content, translation memories should automatically be started from within CLS Workflow. The risk of choosing the wrong one of CLS's 600 translation memories would thus be minimized. Account managers will save time if procedures like the analysis of new source texts and their pretranslation can be started directly from CLS Workflow. Moreover, a large development effort is being invested in the SQL server-based tools in order that the data pool can be queried more efficiently.",
    "abstract": "As the translation industry is faced with ever more challenging deadlines to meet and production costs to keep under tight control, translation companies need to find efficient ways of managing their work processes. CLS Corporate Language Services AG, a translation provider for the financial services and telecoms industries has tackled this issue by developing their own workflow application based on Lotus Notes. The system's various modules have been developed and enhanced over the last four years. Current enhancement projects include interfaces to the accounting tool used in the company, web-based information systems for clients and translation providers and the close integration of some of the CAT tools the company uses.",
    "countries": [
        "Switzerland"
    ],
    "languages": [
        "Italian",
        "French",
        "German",
        "Spanish",
        "English"
    ],
    "numcitedby": "1",
    "year": "2002",
    "month": "November 21-22",
    "title": "{CLS} Workflow - a translation workflow system"
}