{
    "article": "Small screen devices change the parameters for translation. Where paper and web texts have only marginal space constraints, small screen devices are severely space constrained. Dynamic sizing of menu items is no longer the solution for translation of texts in small screen devices. There is no extra space that longer translations could roll into. Where descriptions could be given for words or phrases that lacked exact conceptual or lexical equivalents, no descriptions are possible. There is no extra space that could accommodate a lengthy description or even a short description. Abbreviations are often the only solution in the source language which makes it even harder for target languages. Besides space the context defines whether abbreviations or full text is necessary and which part of the displayed text may be abbreviated and which one has to be full text. What is allowed in one context may be reversed in another. This challenges not only translators but machine translation and translation memories also. They all have to deal with the varying degrees of space available and the varying needs for abbreviations. Rules have to be developed and implemented that allow unambiguous understandability for the user and at the same time make optimal use of the available space. Absolute space is a new measuring stick for both, the source and the target language, i.e. the designers, writers and programmers, translators, translation memory and machine translation. Introduction Small screen devices are plentiful in our daily lives: printers, copiers, gas pumps, checkout counters, alarm clocks, mobile phones etc. They can be seen as threatening, undermining human interaction, or as beneficial, saving us time and costs. The challenges that they present when we interact with them and through them have to be overcome, no matter what our attitude towards them may be. Mental Models We, as human beings, clamor to know our position in life, be it with regard to the country we live in, the time in history that we are part of, or the group of people that we work with. We use context to determine our position. We learn about the world and the differences that exist therein and determine how we stack up against our neighbors. We learn what happened before our time and judge whether we are better off or worse. We build a mental model and place ourselves within it. The mental model usually is a set of concepts that is organized hierarchically where each concept is represented through one or more terms. The terms, in turn, reflect the conceptual relations. Nomenclature is the visible representation of mental models and it allows us to communicate. The mental model provides us with expectations of how things should be (what they should be called). The unexpected, that which is not provided for in our mental model, may push us off balance and we may feel lost. The mental model and the strife for position awareness also applies to the manmachine interfaces (MMIs) that we deal with. A user-friendly MMI acts and responds the way the user expects it to act and respond, in other words, it meets the user's mental model. If it also talks with the user's terminology, we have a perfect match. Steve Krug, in his book Don't Make Me Think, identifies the misalignment of mental models as a typical problem on websites. He calls it \"The words they're looking for aren't there.\" He is talking about websites displayed on computer screens, now imagine a website displayed on a mobile phone screen. There are two types of small screen devices, those that are stationary and those that are mobile. The stationary small screen devices often are single purpose devices that focus on a very specific user need. The actionable items displayed on the small screens of such stationary devices are therefore supplemented easily through inferences on the part of the user. A printer screen that provides the user with the options \"Letter\" and \"Legal\" does not need to explain that these terms refer to paper size, the users will infer the relation from their experience and their existing mental model. The mobile small screen device is usually a multi-purpose device and such inferences can easily lead to miscommunication and frustration on the side of the user. The relationship between the area available for information and the potential for misinterpretation of the information provided in the allotted space has to be managed through terminology and the hierarchical concept structure that it represents. Information Organization Small screen devices do not have the luxury of paper-based texts to elaborately provide context, for example information on previous and future actions, and they do not have the luxury of websites to graphically show the location and the path the users have taken. Small screen mobile devices in particular bank on the users' ability to utilize hierarchical structures, and user-friendly small screen devices employ nomenclature and graphics to facilitate location awareness within those hierarchical structures. Most mobile phones employ hierarchical menus, utilizing the most important method to determine mental and physical positions. Each feature, or top level menu item, follows a tree structure with branches and leaves. The following example shows two branches of a feature. Each new column represents a new level or node and a new page on the display screen. The leaves on each of the branches in the sound setting menu are exactly the same. When looking at the entire table, this does not seem to be very confusing, since we see the context it occurs in. However, in reality we only see one screen page (or portion of a screen page) at a time. Location awareness is built by navigating from trunk to branch to twig to leave without opportunity for jumping from one tree to another tree. Even though the actual underlying database allows for poly-hierarchical structures, the interface has to follow a mono-hierarchical structure in order to avoid loss of location awareness. The navigable hierarchical structure provides the context for that location awareness. The terminology as shown in the example above is carried through the tree as an additional connector, terminology is the red line that shows that these things belong together. Color may be used as an additional concept tree marker. All Settings screens, for example, could have a blue background or a blue border, a subtle hint that you have not left the tree that you started to climb. Information Reduction However, in small screen devices there is barely ever enough room for such repetition. As a result the information amount has to be reduced. The hierarchical structure allows us to reduce information in a controlled fashion. One of the mechanisms used is \"confirm and drop\". This method confirms a user's top level or node selection by displaying that selection in the title line of the next screen. This term is then dropped from the items that are available under that title. The users are asked to carry the term over to each of the items in their heads. This method of \"confirm and drop\" works quite well in English but what about languages that compound words by creating single new words? They may encounter space restrictions and the frequent repetition of the head word, though very useful for the user's orientation, may get annoying. In German, for example, the term for Sound would be \"Ton\". (Since the list includes more than one type of \"Ton\", we would probably use the plural \"Tone\" in German.) This term is shorter than the English but German creates new single words when it compounds. So, where is the catch? The translator receives a resource file that includes the English terms: Ringer, Alert, etc. without any indication that they actually mean Ringer Sound, Alert Sound, etc. The machine translation program will read the terms Ringer, Alert, etc. and its dictionary will recognize the words and translate them as such, not realizing that they mean Ringer Sound, Alert Sound, etc. A translation memory will retrieve the translation for Ringer, Sound, etc. How are they all supposed to know that, due to the small screen size, part of the information was dropped? How are they supposed to know what information needs to be added before a meaningful translation can take place? Different information may be added to the same term at different points in the menu. Ringer and Alert, for example, will also appear in the Volume branch. In those cases not \"Sound\" but \"Volume\" needs to be added as the required information. How are translators, machine translation programs or translation memories supposed to know when to add what? The terms Ringer and Alert are used in their own right in the phone also. We have to find a way to indicate when a term is used as such and when it is used as part of a compound term. If it is used as part of a compound term, we have to indicate which one it is or which ones they are. We also have to make sure the designers and programmers use different IDs for each item so that the same English term can be translated differently in each case without creating re-use problems. Fill in the Spaces Dropping the higher concept term is not enough in some cases to make the menu item fit on one row of visible display screen without panning or otherwise moving. Where dropping an entire term gains us a large amount of space at once, no other mechanisms will be able to bring in that much without relatively little information loss. Spaces (the empty characters between words) easily emerge as a Confirm and Drop Hopefully, this is not a problem for a human translator. Machine translation and translation memory, however, will require some additional rules to allow recognition of a camelbacked term as the sum of its parts, whereby the parts are the ones that need to be processed. The problem of camelbacking recognition may be compounded for languages like Italian that already use capital letters within individual terms. Camelbacking may not be an option for languages that already use capitalization as an identifier for a certain part-of-speech. In those languages camelbacking may change the meaning of the word and cannot be used at all. Machine translation programs and translation memories will have to be trained to recognize the need for camelbacking in the target language even if it is not necessary in the source language. Localization discussions in this paper assume that translators as well as machine translation programs and translation memories can incorporate the font that is used in the mobile device and apply the size limitations of the display area in their translation process. Abbreviate If camelbacking does not create enough space, we have to abbreviate. A rule of thumb is: • keep what's new or different in its entirety, abbreviate what's a repetition from a previous screen or menu item. If a language calls for an indicator to identify an abbreviated word, that indicator should be used in order to minimize cognitive work load on the user. In American English we generally use a period (.) to indicate a word has been abbreviated. In the above example, the word \"Call\" is listed in full in the title. Again, we are relying on the user to be aware of the hierarchical structure and to recognize the relationship between the abbreviation and the full term in the title. Abbreviations may not only be necessary in menu structures but also in feedback texts and help instructions. Keeping the number of key presses that the user has to perform to a minimum is one of the usability design goals for small screen mobile devices. To achieve this goal it is sometimes target when a word or set of words is just a bit too long to fit on the row. Camelbacking, as it is sometimes referred to, becomes a desirable method to ensure maximum space utilization. preferable to keep a feedback text to three lines instead of four or four lines instead of five -the difference being an extra key press. The user may have just sent an email message and the following feedback text is displayed: The msg. could not be sent. Copy saved in Drafts folder. Spelling out the word \"message\" would have meant adding another line. Abbreviating the word \"message\" seems justifiable, since the user has just gone through a large portion of the Messaging tree and it is not unlikely that he or she has seen this abbreviation before. If at all possible, the same abbreviation should be used for a particular word throughout. If necessary, a list of abbreviations can be added as a menu item. Abbreviations pose problems for translation in two ways: • Conveying the full term • Deciding whether an abbreviation is necessary in the translation also Aggressive/Progressive Spelling Rules None of the space saver methods listed above should be started without first determining if there are terms that can be spelled in a space saver fashion. For English those terms would be compound words that have been established themselves as household words and may therefore be spelled as one word rather than two: voicemail instead of voice mail, phonebook instead of phone book, website instead of web site. In all cases, we save a space character and, whenever capitalization is called for, we save extra pixels because upper case letters use more room than lower case letters. Hyphenated words are also a good target for space saver spelling rules: email instead of e-mail, mailbox instead of mail-box. Use a single consonant whenever possible: dialing instead of dialling, canceling instead of cancelling. Combine the Information Reduction Methods as Necessary As a last resort we can combine two or more of the information reduction methods. Method Information Substitution If the information that we deem necessary still does not fit into the allotted space, we have to look for other presentation methods. We have to substitute text for something else. Icons \"A picture is worth a thousand words.\" Well, not always, as William Norton states in his Icon Book, \"People's reactions to icons are twofold: either they delight in clever helpful images, or they find them obscure enigmas, frustrating and pointless.\" Icons are space savers but they should only be used if all target audiences will interpret them as intended. Showing a steaming cup of coffee to represent \"work place\" may be interpreted correctly by a coffee shop worker but probably not by a deep sea diver. Showing a mobile phone icon with an arrow pointing towards the icon followed by a phone number, however, will probably be interpreted by the majority of the phone users as a record of an incoming phone call. Icons can be great space savers but they can also cause great confusion. We cannot assume that icons can be used as designed for source language in all target languages. They may have to be translated just like words. At a minimum, an icon glossary should be provided to allow the user to learn about the intended meaning of the icon. Audio So far, we have only addressed textual and graphic information. However, information can be communicated other ways also, for example through sound. In fact, telecommunications is all about sounds, speaking and hearing. Not all small screen devices can easily take advantage of this medium, since not all of them are equipped for sound input/output, printers and ATM machines for example. We have different types of sounds at our disposal which we use for different purposes: melodies for ringers, beeps for error notification and spoken words to prompt users for action. Within those categories we can differentiate again (just like we do in our hierarchical menu structure). We have different melodies for different types of calls (voice calls and fax calls) and for different callers (Mom, the boss, etc.). We have different beeps for different notifications (success, failure, wait, state change, new item received, etc.). We have spoken words, a voice telling us who is calling and asking whether we want to answer the call or not. Translations are necessary for audio as well. Not only of the spoken words but of the melodies that are offered to the users. The notification sounds have to be adjusted to convey the same information. A da-'da da-'da may need a change in emphasis from the second to the first da and a failure notification sound that resembles a slap against the forehead may not be appropriate may need to be changed to something more benign. The interpretation of sounds, just like the interpretation of icons, utilizes the user's world knowledge which is determined, among other things, by the country they grow up/live in, their religion, their language, their gender, age and standard of living. In other words, translation of sounds is necessary. Machine translation, translation memories take note! Voice technology is rapidly advancing into utilizing dynamic rather than canned speech, posing an increased challenge to machine translation and to the mobile phone which, in addition to suffering from limited information display space, also suffers from limited memory capacity. Haptics Substituting text with pictures and sounds leaves out another dimension: touch. Replacing a visual display with a physical or virtual-physical experience may hold new simplified and unambiguous methods of information communication. It may also hold more and more complicated challenges for clear interaction between man and machine. What does it mean for translation? Maybe nothing, maybe everything. Information Expansion Information reduction and substitution methods do not release us from providing the full information but it allows us to package and store that information such that it does not impede the user when interacting with the small screen device. In stationary small screen devices we can post that additional information on other parts of the device that are not used for display, buttons and such. For stationary devices additional information can also be posted on walls around the device or in books that are placed on the device or in close proximity. For mobile small screen devices we can also provide additional information in manuals and start-up guides. However, we need to be aware that those will likely not be accessible when the user needs to consult them. Breadth To compensate for the loss of information, we should provide reference lists. The user may look for the full term of an abbreviation or for an explanation of an icon. The user may also look for instructions on how to accomplish a task. Such information is best provided in lists which are best added to the phone's menu in a separate tree: a Help menu. Consolidating reference information under a menu item expands the number of menu items and thus the breadth of the menu. Depth It is also possible to add supplementary information directly to already existing nodes and leaves by adding another level. The user would be provided a kind of \"Help\" button that could be exercised at all times and that would provide context sensitive help at each level of the MMI. On Demand Considering the fact that more and more mobile devices are constantly connected to information sources like the Internet, we may want to place supplementary information out on the web. For the \"connected\" mobile device user this means information requests can be exercised at any time without burdening the limited available memory capacities of the phone and without limiting the amount of information. An argument could be made to supply all three, and all at the same time, to serve the broadest range of users well. Conclusion Small screen devices challenge current translation procedures and standards. They also pose new challenges to machine translation and translation memories. Identifying the new challenges is the first step in developing new processes and rules, and expanding best practices.",
    "abstract": "Small screen devices change the parameters for translation. Where paper and web texts have only marginal space constraints, small screen devices are severely space constrained. Dynamic sizing of menu items is no longer the solution for translation of texts in small screen devices. There is no extra space that longer translations could roll into. Where descriptions could be given for words or phrases that lacked exact conceptual or lexical equivalents, no descriptions are possible. There is no extra space that could accommodate a lengthy description or even a short description. Abbreviations are often the only solution in the source language which makes it even harder for target languages. Besides space the context defines whether abbreviations or full text is necessary and which part of the displayed text may be abbreviated and which one has to be full text. What is allowed in one context may be reversed in another. This challenges not only translators but machine translation and translation memories also. They all have to deal with the varying degrees of space available and the varying needs for abbreviations. Rules have to be developed and implemented that allow unambiguous understandability for the user and at the same time make optimal use of the available space. Absolute space is a new measuring stick for both, the source and the target language, i.e. the designers, writers and programmers, translators, translation memory and machine translation.",
    "countries": [
        "United States"
    ],
    "languages": [
        "English",
        "German",
        "Italian"
    ],
    "numcitedby": "0",
    "year": "2002",
    "month": "November 21-22",
    "title": "Small-Screen Devices and Translation"
}