{
    "article": "This paper introduces the concept of controlled translation as the new working environment for the professional translator, and advances the idea that a new teaching scenario should emerge to cater for the needs of this controlled environment. In this context, we present how such scenario can be tailor-made to answer the needs of the translation industry. Namely, we concentrate on the introduction of controlled languages techniques to students, on training in pre-editing skills for machine translation use, and on postediting practice. Introduction The translation industry has dramatically changed over the last ten years as the gradual process of introducing translation memory (TM) and machine translation (MT) systems in the documentation and translation workflow has been gaining momentum. Also, the burgeoning development of the software localization business in an increasingly globalized world presents a significant challenge to the translation industry by multiplying the number of languages that need to be translated and by expecting shorter turnaround time of translations. Online documentation and web delivery call for a responsive translation industry ready to deliver in a highly competitive environment. In this scenario, the use of MT systems in the industry has spawned two additional fields that require careful consideration by the professional translator: the use of controlled languages in specific industries (aeronautics, automotive industry, heavy-equipment manufacturers, software companies, etc.) and the post-editing needs of documents translated with MT systems. Future professional translators need to be aware of issues and skills such as what minimum post-editing entails, which standard metrics are starting to be developed to score machine translation output, which controlled languages are used in the industry, how to write documents in controlled language to get better results when using MT systems, etc. They also need to have a thorough exposure to different professional and online MT systems, not only from the user's viewpoint but also from the developer's since only by a good understanding of the complexity of these systems can the future translator judge the quality of the output and foresee what errors will be frequent. Key Elements in Controlled Translation This triad of use of controlled languages, MT systems and post-editing processes coupled with the ever-increasing use of translation memory, CAT tools, terminology management systems, etc. depict a new working environment for the professional translator that we call Controlled Translation. Controlled Languages Controlled languages (CLs) have become more prevalent in the industry in recent years. They are used in technical documentation systems in large corporations since they improve the readability of the documents by imposing clear and direct writing, they reduce syntactic and lexical ambiguities by applying grammatical and lexical constraints, and they also increase the translatability of the text, making it amenable to MT (Mitamura & Nyberg, 1995) . The resulting effect is consistency in the style of the documents, the reusability of texts, and the corresponding savings in authoring and translation processes along with higher customer satisfaction because of better documentation and translation. CLs impose a controlled vocabulary and a controlled grammar. The size of the vocabulary and the meanings per word are restricted to avoid lexical ambiguities. This is very advantageous when the translation is performed by MT systems (Baker et al. 1994) . The rules for controlled grammar are intended to enforce a clear style where elliptical constructions, multiple coordinated sentences, syntactic ambiguity (prepositional phrase attachments, adjectival modifiers, anaphoric expressions, etc.) are reduced to a minimum. Usually, checkers are developed and integrated in the documentation environment along with editing software, TM and MT, terminology management systems and CAT tools. Mitamura (1999) provides a set of criteria that must be met in a specific application domain for a successful deployment of a CL for MT: the translation should be for dissemination or outbound translation, the authors should be highly trained, the CL should be enforced by a checker, and the domain should be technical and very specific. It is not a coincidence that one of the first CLs to be developed was AECMA Simplified English (Farrington, 1996) , which is employed in the aeronautic industry to tackle the increasing complexity of the aircraft's technical documentation. An extension of AECMA Simplified English is Boeing Technical English (BTE) which is used at Boeing to improve the readability and consistency of the technical documentation (Wojcik, et al. 1998) . A checker is used to help authors write text in BTE and maintain a consistent style (Wojcik, et al. 1990 ). The French aerospace industries association (GIFAS) has also developed a CL in French (\"le français rationalisé\") which allows easy translation into Simplified English while improving readability for French speakers (Barthe, 1998) . Caterpillar Inc., which manufactures heavy-equipment machinery, uses Caterpillar Technical English (CTE) as CL for all English technical documentation (Kamprath, et al., 1998) . CTE consists of a controlled terminology inventory (over 70,000 terms) and a controlled grammar complex enough to write in a technical domain. The automotive industry has also followed the path initiated by the aeronautic and heavy-equipment industry. General Motors, for instance, started in 1993 the CASL Project (Controlled Automotive Service Language) for technical documentation (Godden, 2000) . CASL is a subset of English that consists of 62 grammar rules and controlled terminology. The Swedish manufacturer Scannia also explored the feasibility of defining a controlled Swedish for truck maintenance documentation (Sagvall & Amqvist, 1996) . BMW is considering a controlled German application developed by the Institute of Applied Information Sciences (IAI) from Saarbrücken (Reuther & Schmidt-Wigger, 2000) . It is expected that the use of CLs for technical documentation will expand in years to come beyond the fields described above to cover other areas such as software and hardware documentation, software localization, information technology, telecommunications, digital technologies, web content, etc. Pre-editing Pre-editing technical texts is also part of the working environment of Controlled Translation. Translators need to have the skills to adapt texts to the controlled language guidelines from different industries. These guidelines are employed to achieve both consistency in the authoring of source texts and improvement of the translatability of these texts by making them amenable to MT, as explained above. The guidelines can be often found in the literature on CLs when grammatical and lexical constraints are described. For example, Mitamura (1999) explains that in KANT Controlled English there are lexical constraints (besides the controlled vocabulary that limits lexical ambiguity) such as the following: use of functional words such as determiners should be encouraged, but use of pronouns and conjunctions should be discouraged since they increase the syntactic ambiguity; use of participial forms (-ing and -ed forms) should be restricted when used after conjunctions (* While driving the vehicle...) or in reduced relative clauses (*Directional stability caused by wheel lock-up...). Both examples should therefore be rewritten as follows: While you are driving the vehicle... and The directional stability that is caused by the wheel lock-up. As for grammatical constraints, Mitamura argues that these constraints make sense even when technical texts are not intended for translation, since they improve readability of the source texts and reduce the ambiguity. She distinguishes between phrase-level constraints and sentence-level constraints. In the former category she includes replacing phrasal verbs with single-word verbs (turn on should be rewritten as start) and repeating prepositions in conjoined constructions to avoid ambiguous readings. For instance, this phrase recorded memory of radio and each control unit is ambiguous since it can be construed as {recorded memory of radio} and {each control unit}, or recorded memory {of radio and each control unit}. Therefore, it needs to be rewritten this way: recorded memory of the radio and of each control unit. As for sentence-level constraints, Mitamura includes coordination of sentences (the two parts of a conjoined sentence should be of the same type), relative clauses (they should always be introduced by a relative pronoun), and elliptical constructions, that should be avoided altogether. Wojcik et al (1998) provide a list of writing rules that are used in Boeing Technical English (BTE). These rules specify, among other aspects, that : (a) determiners such as the a, an, this, these, etc. should be used when appropriate; (b) passive sentences should be avoided in descriptive writing, (c) sentence length should be limited to 25 words, (d) noun clusters with more than three words should be avoided, (e) there should not be more than two adjectives modifying a noun or a noun cluster, (f) -ing forms should be carefully avoided, (g) the word that should not be omitted after verbs, (h) relative pronouns should be used to introduce relative clauses; (i) and parallel constructions are encouraged in coordinated structures. There are also explicit guidelines provided by MT developers for writing content that need to be translated using MT. Notice that some of these guidelines overlap with the controlled language guidelines from KANT Controlled English and BTE. For instance, IBM 1 provides these recommendations: use of simple, short sentences (not more than 20 words), avoidance of idiomatic and slang expressions, avoidance of ambiguous words, repetition of nouns and noun phrases instead of using pronouns when possible, use of proper punctuation, use of complete sentences in lists, etc. Therefore, pre-editing texts following the constraints from the controlled language specifications or even writing texts directly in CL become a new set of skills that translators need to take into account in Controlled Translation. TM-MT Another key element in controlled translation is that introduced by the use of CAT tools and, more specifically by TM and MT systems, in combination with CLs. In this sense, Rintanen & Zetzsche (2002) report a successful experience at Caterpillar, where documentation for machines and equipment is produced by using CTE (Caterpillar Technical English) and AMT (Automated Machine Translation), together with Atril's Déjà Vu, in an effort to reduce post-editing time. The AMT used at Caterpillar is KANTOO MT environment (Nyberg et al, 1996, Nyberg and Mitamura, 2000) from Carnegie Mellon University. This MT environment provides translations into Spanish, French and German and it consists of a controlled language checker, tools for lexical maintenance, for terminology update and for partial draft translations taken from similar translated terms. Another interesting environment is General Motors' CASL, which also integrates MT with CL (Godden, 2000) . In any case, the full integration of CLs and translation tools in the translation workflow is still an area of further development, where several aspects are yet to be explored: training in controlled language authoring, developing a theory of errors, building checkers, using rule-based MT vs. example-based MT, among others. Post-editing Post-editing (PE) is an activity mainly associated to MT and directly linked to the differing demand for information access. The current urge for information at all levels, a direct consequence of globalization, has compelled the translation industry to turn to MT as an alternative to human translation. This, in turn, has set off the need for post-editing the output of MT. Clearly, since MT provides almost 100% accuracy only under certain restricted circumstances (limited vocabulary and grammar, use of a sublanguage), all other output must be post-edited one way or another. As Allen (forthcoming) states, PE ranges from browsing/gisting to full PE depending on translation motivation, i.e. whether it is simply the process of \"translating to understand\" (inbound translation) or the process of \"translating to communicate\" (outbound translation). These two factors determine different degrees of PE: MT with no post-editing for content browsing, rapid PE for perishable information and urgent texts allowing only the correction of \"the most blatant and significant errors\", partial PE where the post-editor decides which \"amount of changes to make in view of the client/reader audience\" and full PE, where MT combined with the use of CL, produces, in specific industrial projects, a faster output than \"translating the entire document without any computer-aided translation assistance\". The area of PE is still open to further study with research being done on PE guidelines, PE automation or interaction with CL and MT The Teaching Scenario As mentioned above, controlled translation can be seen as a new teaching scenario that, in our opinion, needs to be considered when training future translators. At the Universidad Europea in Madrid, we have developed a new course that addresses these new skills that will be more frequently required from professional translators in the coming years. From a methodological stance, the course presented here introduces the student to a \"kaleidoscopic\" view of MT which concentrates at the same time on the translation process and the resulting product, on the user's expectations and the developer's job, on the integration of MT in the translator's environment and its relationship to other tools. This, in turn, takes the student to consider the industry's requirements and approaches to a controlled translation. Methodology The course is designed along the following lines: a) The initial framework is the translation assignment, which takes into account key aspects relating to the client, the translation audience, the perception of quality or the tools to be used. In this respect, the student addresses a set of questions that help to build the translational context: what is the purpose of the translation?, who has commissioned it?, who is to use the translated text?, what volume of text is to be translated?, what are the deadlines for translation submission?, depending on volume and deadlines, what translation tools are to be used?, are there any format to be applied?, will the document be in the future? With this information, the student gets a clear picture of the purpose of the translation and understands why MT in a controlled translation environment is sometimes a better choice than only human translation. b) The text typology to be explored concentrates on the automotive industry. This is motivated, first, by the observation that this particular field provides a suitable context for MT post-editing and, second, by the fact that CL is extensively applied within this field (General Motors, Ford, Scania, BMW, etc.). The texts to be introduced to the students are owner's manuals and service manuals. c) The pre-editing guidelines: students are introduced to the lexical and grammatical constraints from controlled languages such as KANT Controlled English and BTE, highlighting how preediting guidelines can be derived from these constraints. Next, students are provided with the list of guidelines below. They will use these guidelines to pre-edit texts from the automotive industry with the final goal of making these texts amenable to MT systems. Some of these guidelines closely follow the ones from KANT Controlled English and BTE. Others have been derived after carefully studying the style of the automotive texts collected for the course. The pre-editing guidelines (PreG) are: PreGl) Keep sentences short (not more than 20 words). PreG2) Avoid multiple coordination of sentences. PreG3) Insert determiners whenever possible. PreG4) Insert that, which, in order to in subordinate clauses whenever possible. PreG5) Try to avoid anaphoric expressions. PreG6) Try to avoid elliptical constructions. PreG7) Rewrite when and while followed by an -ing form by inserting you are and -ing: for example, when checking for ignition spark should be rewritten as when you are checking for an ignition spark. PreG8) Try to avoid phrasal verbs or keep the adverb/preposition close to the verb: for instance, rewrite turn the engine on as turn on the engine, or better yet start the engine. PreG9) Try to avoid adjectives, past participles and present participles (ing form) in post-nominal position. Rewrite them as relative clauses. For example, wires lying across brackets should be rewritten as wires that are lying across brackets. PreG10 (Wagner, 1985) . These guidelines are suitable only for texts that require short turnaround time, but they are useful as a set of general recommendations. For instance, as much of the output translation as possible should be retained trying to avoid deleting and/or rewriting too much. Repetitions in the translation should not be corrected. Also, corrections of words and phrases should be made only if they are non-sensical, they are wrong, and, time permitting, they are ambiguous. Besides the above guidelines, students are introduced to more specific ones derived from the J2450 Translation Quality Metric 2 from the Society of Automotive Engineering (SAE). The objective of using this metric is establishing a standard that can quantify the quality of translations of automotive service information, regardless of source language, target language, human translation or machine translation. The metric consists of error categories with their associated numeric weights so that an evaluator can tag errors in the translation and come up with a score that quantifies the quality of the translation. The metric has seven error categories each with two sub-categories and associated weights, and two meta-rules for resolving ambiguities when assigning errors to categories and sub-categories. Linguistic errors that cannot be classified under the first six categories fall under miscellaneous error, but this category is not used to tag style, since stylistic errors are ignored by this metric. The two meta-rules for resolving ambiguities when assigning categories and scores state that: 1. When an error is ambiguous, always choose the earliest primary category. 2. When in doubt, always choose serious over minor. Finally, students will apply the following minimal post-editing guidelines (PostG) that fix the problems detected when evaluating the translation with the J2450 Metric: PostGl) Fix wrong terminology in the text. PostG2) Fix syntactic errors (wrong part of speech, incorrect phrase structures, wrong linear order, etc.). PostG3) Fix omissions (missing text). PostG4) Fix morphological errors (number, gender, case, tense, voice, aspect, etc.) . PostG5) Fix misspelling errors. PostG6) Fix punctuation errors. PostG7) Fix any other linguistic errors not covered in PostG1, PostG2 and PostG4, such as unnecessary determiners and wrong translations of non-technical vocabulary. When applying PostG7, students should also refrain from making stylistic changes. In particular they should avoid changing the MT output to a more sophisticated style, removing duplicate words to avoid a repetitive style, changing nouns to pronouns, changing the meaning of the output sentence after reinterpreting the source sentence, merging two source sentences into one output sentence, and splitting one source sentence into two output sentences. For instance, a source sentence such as Do not smoke in battery charging areas, if it is translated by Systran MT as No fume en áreas de carga de la batería, it should not be post-edited as No fume en áreas donde se da carga a las baterías since the new translation is just a more sophisticated version of the same input sentence. Systran's version is good, grammatical and understandable for technical documentation. d) The MT systems that will be used are Softissimo's Reverso, Systran and SDLX's Freetranslation.com 3 , since these are available on-line at no charge and allow students to extensively practice on a controlled translation environment. A hands-on exercise We would like to illustrate in this section how the teaching methodology described so far is put into practice in a course for translation students whose language combination is English-Spanish. For the sake of brevity the exercise described here will only experiment with one MT system, Systran 4 , but it can easily be reproduced with other systems. Let us now see the seven different steps that make up the exercise: Step 1. Define the translation assignment. In this case, the assignment given to the students is the translation of a service manual of an automotive company (Subaru, General Motors, Honda, Toyota, or any other similar company) which service technicians will use as on-line documentation. The student is part of a team of freelance translators in a translation agency and they are given a short turnaround time. As for the text format, there are no special requirements since it is provided to them in ASCII. There will be foreseen updates of the manual in the future. Finally, the translation's purpose is to communicate (outbound translation) in a nonsophisticated style, which means that minimal PE is expected. With this information, students compose the translation framework which they will use as reference whenever decisions have to be taken along the process. Step 2. Introduce the text to be translated and analyse its particularities according to the specific text typology. The text given to the students is the following: The key features of this type of text are (or should be) precision, conciseness and objectivity. Therefore, it is characterised, among other aspects, by the use of long nominal constructions (proper exhaust ventilation), passive and impersonal constructions (care should be taken, when working in a pit, before jacking up the vehicle), and technical vocabulary (Sager et al, 1980) . Step 3. Analyse the MT output and annotate it following SAE J2450 guidelines. (See \"error categories\" in section 3.1.). Text 2 (Systran's output, annotated according to error categories -ErC): No funcione ErC7 el motor por un período del ErC7 tiempo extendido ErC7 fuera ErC2 ventilación de extractor apropiada. Mantenga el área de trabajo ventilada bien ErC2 y libérela ErC2 de inflamable materiales ErC2 ErC4 . El ErC7 cuidado especial debe ser ErC2 tomado Erc7 al dirigir ErC1 cualesquiera materiales inflamables o venenosos ErC4 ErC4 , tales como gasolina, refrigerante gas ErC2 . etc. Al trabajar en el hueco ErC1 o la ErC7 otra área incluida ErC1 sea seguro ErC2 ErC1 ventilar correctamente el área antes de trabajar con peligroso materiales ErC2 ErC4 . No fume mientras trabaja en el vehículo. Antes de alzar con el gato encima del vehículo ErC2 , aplique las cuñas de la rueda ErC1 o el otro neumático bloques ErC1 a las ruedas para evitar que el vehículo se mueva. Después alzando con el gato encima del vehículo ErC2 , utilice ErC1 el peso del vehículo con seguridad soportes ErCl en las puntas ErC1 señaladas para la elevación apropiada ErC4 antes de trabajar en el vehículo. Once errors have been elicited from the translated text, there follows a discussion whereby students try to estimate their cause (lack of appropriate dictionary entries in the system, grammatical rules missing or not correctly applied, problems in morphological rules, etc.). This is an intuitive process which gives students the opportunity to go somewhere beyond the \"black box\" inside the MT system. Step 4. Apply pre-editing guidelines to the original text in order to make it amenable to MT. (See \"pre-editing guidelines\" in section 3.1.). Step 6. Compare the output of the original text (Text 2) with that of the preedited text (Text 4), using SAE J2450 metric, so as to quantify the impact of the controlled language guidelines in the translatability of technical texts. In this respect, SAE J2450 metric includes a formula for calculating a document score, whereby this score is the sum of the weighted scores divided by the number of words in the source language document 5 . In the texts presented here the scores obtained are the following: • Text 2 = 0.72 • Text 4 = 0.45 This shows an evident improvement of the pre-edited version over the original one. Step 7. Apply general post-editing guidelines. (See \"post-editing guidelines\" 5 See \"Appendix A SAE J2450 translation metric score sheet\", available at: http://www.lisa.org/useful/2001/J2450Practice.pdf (3 Oct. 2002) in section 3.1). Text 5 (post-edited version): No haga funcionar PostG7 el motor por un periodo de PostG7 tiempo prolongado PostG7 sin la ventilación de extractor apropiada. Mantenga el área de trabajo bien ventilada PostG2 y mantenga el área de trabajo libre de cualquier material inflamable. Se debe tener PostG2 PostG7 cuidado especial cuando usted está manejando cualquier material inflamable PostG4 o material venenoso PostG7 PostG4 , tales como gasolina, gas refrigerante, etc. Cuando usted está trabajando en un foso PostG1 u otra área PostG7 cerrada PostG1 asegúrese de P o s t G 1 P o s t G 2 ventilar correctamente el área antes de trabajar con los materiales peligrosos. No fume mientras que usted está trabajando en el vehículo. Antes de alzar con el gato el vehículo PostG2 , aplique los calzos de las ruedas PostG1 u otros bloqueos para ruedas PostG1 a las ruedas para evitar que el vehículo se mueva. Después de alzar con el gato el vehículo PostG2 , sostenga PostG1 el peso del vehículo con los soportes de seguridad en los puntos PostG1 que están señalados Notice that the resulting minimally postedited version has a repetitive style. This is fine for the translation assignment envisaged in the exercise. Full post-editing would involve polishing this version removing repetitions and making the text sound more natural. Conclusion The teaching framework presented here is an attempt at introducing translation students to the different aspects of controlled translation. After the description of the key elements actively intervening in the translation industry (CL, MT, TM, preand post-editing), the building blocks of the teaching framework have been presented. Finally, an actual exercise has been outlined in order to demonstrate how students are provided with hands-on experience on those key elements.",
    "abstract": "This paper introduces the concept of controlled translation as the new working environment for the professional translator, and advances the idea that a new teaching scenario should emerge to cater for the needs of this controlled environment. In this context, we present how such scenario can be tailor-made to answer the needs of the translation industry. Namely, we concentrate on the introduction of controlled languages techniques to students, on training in pre-editing skills for machine translation use, and on postediting practice.",
    "countries": [
        "Spain"
    ],
    "languages": [
        "French",
        "English"
    ],
    "numcitedby": "17",
    "year": "2002",
    "month": "November 14{--}15",
    "title": "Controlled translation: a new teaching scenario tailor-made for the translation industry"
}