{
    "article": "Linguistic Linked Open Data (LLOD) is a technology and a movement in several disciplines working with language resources, including Natural Language Processing, general linguistics, computational lexicography and the localization industry. This talk describes basic principles of Linguistic Linked Open Data and their application to linguistically annotated corpora, it summarizes the current status of the Linguistic Linked Open Data cloud and gives an overview over selected LLOD vocabularies and their uses. A resource constitutes Linguistic Linked Open Data if it is published in accordance with the following principles : 1. The dataset is relevant for linguistic research or NLP algorithms. 2. The elements in the dataset should be uniquely identified by means of a URI. 3. The URI should resolve, so users can access more information using web browsers. 4. Resolving an LLOD resource should return results using web standards such as Resource Description Framework (RDF). 5. Links to other resources should be included to help users discover new resources and provide semantics. 6. Data should be openly licensed using licenses such as the Creative Commons licenses. Criterion (1) defines linguistic(ally relevant) data, criteria (2-5) define linked data, criterion ( 6 ) defines open data, their combination thus yields Linguistic Linked Open Data. The primary benefits of LLOD have been identified as : -Representation : Linked graphs are a more flexible representation format for linguistic data -Interoperability : Common RDF models can easily be integrated -Federation : Data from multiple sources can trivially be combined -Ecosystem : Tools for RDF and linked data are widely available under open source licenses -Expressivity : Existing vocabularies help express linguistic resources. -Semantics : Common links express what you mean. -Dynamicity : Web data can be continuously improved. I specifically focus on linguistically annotated corpora and discuss the potential of Linked Data in relation to four standing problems in the field :",
    "abstract": "Linguistic Linked Open Data (LLOD) is a technology and a movement in several disciplines working with language resources, including Natural Language Processing, general linguistics, computational lexicography and the localization industry. This talk describes basic principles of Linguistic Linked Open Data and their application to linguistically annotated corpora, it summarizes the current status of the Linguistic Linked Open Data cloud and gives an overview over selected LLOD vocabularies and their uses.",
    "countries": [
        "Germany"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "0",
    "year": "2016",
    "month": "7",
    "title": "Corpora and Linguistic Linked Open Data: Motivations, Applications, Limitations"
}