{
    "article": "The development of the African Wordnet (AWN) has reached a stage of maturity where the first steps towards an application can be attempted. The AWN is based on the expand method, and to compensate for the general resource scarceness of the African languages, various development strategies were used. The aim of this paper is to investigate the usefulness of the current isiZulu Wordnet in an application such as language learning. The advantage of incorporating the wordnet of a language into a language learning system is that it provides learners with an integrated application to enhance their learning experience by means of the unique sense identification features of wordnets. In this paper it will be demonstrated by means of a variety of examples within the context of a basic free online course how the isiZulu Wordnet can offer the language learner improved decision support. Introduction The development of the African Wordnet (AWN) containing wordnets for five African languages, namely Setswana (TSN), isiXhosa (XHO), isiZulu (ZUL), Sesotho sa Leboa (NSO) and Tshivenda (VEN) , has reached a stage of maturity where the first steps towards an application can be attempted. The aim of this paper is to investigate the usefulness of the current isiZulu Wordnet 1 in an application such as language learning. Against the background of a multi-lingual scenario of eleven official languages of South Africa, the 1 Available for download from https://rma.nwu.ac.za/index.php/resource-catalogue/africanwordnet-isizulu.html. Please note that this catalogue will soon be transitioned to the newly constituted South African Centre for Digital Language Resources (SADiLaR) https://rma.nwu.ac.za/index.php/about-sadilar/ National Development Plan 2030 (NDP) enjoins all South Africans to learn at least one indigenous language as part of nation-building and social cohesion (South African Government, 2017) . Such an imperative calls for prioritizing the development of language learning courses. Currently, very limited material exists to support language learners who wish to focus on improving their skills in their own time, without much cost involved and with actual real-world examples. Most of the material developed to engage learners of an African language, are either taught in time-consuming (university) classes or after purchasing expensive software with generic course content and teaching style. An exception is a set of basic free online courses LEarn To Speak an African Language (LetsAL) (University of South Africa, 2010) that were developed for first time language learners of some of the indigenous South African languages, namely Setswana, isiXhosa, isiZulu, Sesotho and Sesotho sa Leboa. Although the African languages can still be regarded as under-resourced (cf. the resource audit performed by Grover, Van Huyssteen and Pretorius, 2011) the African Wordnet (AWN) project reported in Bosch and Griesel (2017) , has played a significant role in filling the gap as available source of data for further human language technology and linguistic research. The individual African languages wordnets, with less than 20,000 synsets per language, are still relatively small in comparison to some of the large wordnets such as the Princeton WordNet 2 (117 659 synsets for English) and the FinnWordNet 3 (120 449 synsets for Finnish). Nevertheless, we investigate the possibility of using the AWN effectively as support for language learners in a computer assisted language learning (CALL) environment. Our focus is on isiZulu. In this paper, the interaction between the AWN and LetsAL will be explored as a first step towards moving to a more integrated CALL system, with a focus on improving user interaction. A brief background to both the AWN and LetsAL will be provided, before the contents of the two resources is assessed. We also discuss ways to integrate the AWN into the current LetsAL system, with a view on moving towards an intelligent CALL (iCALL) application as proposed in Bosch and Griesel (2013) . Fast-tracking the expansion of the AWN with LetsAL data is also shown to be effective, even with minimal additional resources. Background In this section, we discuss the status quo of the African Wordnet as potential language learning support resource and provide background on the LetsAL courses. The African Wordnet Project The African Wordnet Project (AWN) deals with the development of aligned wordnets for African languages spoken in South Africa (i.e. languages belonging to the Bantu language family) as multilingual knowledge resources with the long-term purpose of including a wide variety of related languages also from other parts of Africa. Bosch and Griesel (2017) discuss the development strategies implemented for building a first version of the AWN for five languages in parallel. The expand model was followed from the onset since, as stated by Ordan and Wintner (2007) , this model provides a tested structure for building a new resource and is therefore typically the choice for less resourced languages. During the first development phases, the AWN used the extended Common Base Concepts list from the Eu-roNet Project 4 as well as the Core Concepts list designed for the BalkaNet Project 5 to extract English synsets for linguists to include and translate into the African languages concerned. However, it soon became clear that a more localised approach was needed. The seed lists mentioned above contain many concepts that are not lexicalised in the African context. As the development team became more experienced, and appropriate lexical resources became available, more localised support could be given in the form of frequency-based seed terms and semi-automatic linking of lemmas from bilingual wordlists and the PWN (Princeton University, 2017) . Opportunities to harvest usage examples from online corpora also contributed to promising results. Throughout the development, the AWN used the DEBVisDic editor tools (DEBVisDic: WordNet editor and browser, n.d.) which are distributed as freeware and were recently relaunched as a web application (Rambousek and Horak, 2016) . The current LetsAL environment In an initiative to actively promote African languages in anticipation of the Soccer World Cup that took place in South Africa in 2010, a modest beginning was made with the development of free online courses that focus on basic language skills (Mischke, n.d.) . The so-called LetsAL (LEarn To Speak an African Language) courses are aimed at first time language learners, who are offered basic lessons covering 10 general themes, including greetings and courtesies; asking for help; numbers, days, months, seasons; question words, quantities, weather; banks, taxis and restaurants; transportation and finding your way; touring and socializing; at the filling station; the human body and ailments; as well as shopping and sport. Each theme is explored via a list of appropriate vocabulary and phrases accompanied by translations, a short dialogue as well as a video to contextualize the content. Noteworthy cultural customs are also shared, such as who greets first or the role of a traditional doctor. This Open Educational Resource (OER) created by the University of South Africa ( 2010 ) is actively used by banks and private schools for language learning purposes. When compared to similar products involving international languages, several areas begging for further development become apparent, e.g. inclusion of real-time interaction between learners; games and fun content included for assessment purposes; etc. (see Bosch and Griesel, 2013) . Currently the courses also do not offer links to other external resources. It is in this area where the AWN, already freely available for the five languages, could play a central role in future improvements to these courses. Incorporating AWN in LetsAL as additional reference material The advantages of incorporating all available natural language processing (NLP) resources for a language into a CALL system, is that learners are offered an integrated application to enhance their understanding of the subject matter. In a related study, Winiwarter (2011) describes COLLIEa collaborative language learning and instruction environment for Japanese foreign language learners. This system combines advanced NLP tools such as machine translation and complex analysers with the English PWN and the Japanese Wordnet to provide learners with translations of Japanese webpages, as well as detailed information on the word level. \"All this information is very useful as decision support for selecting the word sense, reading, and English translation of a Japanese word\" (Winiwater, 2011:3761) . While NLP support is still limited for isiZulu, it is important that we integrate the resources that are freely available and use them to the best advantage of language learners. The learner improved decision support that can be offered by the isiZulu AWN, which typically covers a variety of semantic relations including synonymy and antonymy, along with usage example sentences and definitions, will be demonstrated by means of a selection of examples within the context of LetsAL. Each of the example words already occur in the LetsAL course material, but only with the English translation and no further information on meaning nuances or associated misconceptions in isiZulu. To illustrate the need for more disambiguating context and the type of information that a language learner might also find useful, we combined information from the isiZulu AWN and the relevant information from the English PWN (Princeton University, 2017) in tables 1 -10. The significance of these examples is discussed, before a suggestion for improving the current LetsAL environment with similar information is made at the end of this section. IsiZulu and most of the languages belonging to the Bantu language family are known as tone languages in which pitch variation plays a role in conveying lexical as well as grammatical distinctions 6 (cf. Poulos and Msimang, 1998:543, and Heine and Nurse, 2000:152) . The two basic tone levels that can be distinguished in isiZulu, namely high (H) and low (L), may be marked by means of placing acute and grave accents above the syllables of a word, or by placing the symbols H and L after the word, e.g. índòdà (man) OR indoda HLL (man) In the following pairs of nouns and verb stems it is illustrated how tone distinguishes meaning: íthàngá (thigh) HLH íthàngà (pumpkin) HLL ínyàngá (moon; month) HLH ínyàngà (herbalist) HLL -dúmà (be tasteless) HL -dùmá (roar, be famous) LH Since tone is not, however, marked in the standard orthography of isiZulu, language learners are often confronted with a difficult choice between two meanings of (seemingly) the same word. It should also be noted that tones are not absolute. Tones documented in dictionaries usually refer to tones of the word as it occurs in isolation or in sentence final position. In other sentence positions, tones may undergo various changes. Example 1: ithanga A case of homonymy which is an example of potential confusion for language learners is the noun ithanga which occurs in the human body theme of LetsAL, with the English translation of \"thigh\". In a different context such as vegetables, the meaning of ithanga is completely different and unrelated, namely \"pumpkin\". The differentiated meanings of the orthographic form of ithanga (thigh/pumpkin) are illustrated in Tables 1 and 2 . Example 2: inyanga The LetsAL example inyanga is a noun with two related meanings \"moon\" and \"month\" though in different domains, namely time_period and astonomy respectively, as shown in Tables 3 and  4 . It is significant that the same orthographic noun has a third meaning \"herbalist\" (in the medicine domain) which however is unrelated to the former two meanings, therefore representing a homonymous relationship (cf. For language learners, it would also be useful to take note of the additional antonymous relations of luhlaza (green, unripe) and vuthiwe (ripe, mature) to avoid confusion, as illustrated in Tables 9 and 10 . Implementation We propose that the current LetsAL environment be enriched with the data from the AWN in much the same way as suggested above and in the COLLIE project. Synonyms, usage examples, definitions and other semantic relations, as described in Tables 1 to 10 , can all assist POS: a; ID PWN 2.0: ENG20-01442460-a; ID PWN 3.1: 01497045 Synonyms: luhlaza :5 Definition: okungavuthiwe kwezithelo Usage: abanye badla izithelo eziluhlaza -->> [near_antonym] vuthiwe:2 Synonyms: green :3, unripe :1, unripened :1, immature :4 Definition: not fully developed or mature; not ripe Usage: unripe fruit Usage: fried green tomatoes Usage: green wood -->> [near_antonym] ripe:1, mature:4 Table 9 . luhlaza (green, unripe) POS: a; ID PWN 2.0: ENG20-01441835-a; ID PWN 3.1: 01496321 Synonyms: vuthiwe :2 Definition: okulungele ukudliwa noma ukuphuzwa Usage: izitshalo zikabhekilanga zivuthiwe lapho umbala ngemuva kwesihloko ushintsha -->> [near_antonym] luhlaza:5 Synonyms: ripe :1, mature :4 Definition: fully developed or matured and ready to be eaten or used Usage: ripe peaches Usage: full-bodies mature wines -->> [near_antonym] green:3, unripe:1, unripened:1, immature:4 Table 10 . vuthiwe (ripe, mature) learners to understand not only the broad meaning of words in context, but can also point out subtle differences and potential language specific pitfalls such as those involving orthography. Figure 2 shows a mockup of the value-added website, including a pop-up window with information for the isiZulu word ithanga (thigh) in the anatomy domain. A link to the PWN (Princeton University, 2017) or the isiZulu AWN entry (at the top of the pop-up window) gives learners access to the full synset without cluttering the LetsAL environment. The domain, usage example(s) and definition(s) are also shown. If any other disambiguating or relevant relations such as polysemy or antonymy are identified for a particular synset, the information will also be presented in the pop-up circle. In the example (Figure 2 ), a hypernym for ithanga is isitho (limb). We deliberately avoid the use of the terms \"synset\" and \"hypernym\" since users of LetsAL are assumed to be general language learners who might not be familiar with these terms. Marrying the AWN and LetsAL to some extent, offers valuable advantages for users of both resources. Language learners will benefit greatly from having the additional information included in the AWN readily available in the LetsAL interface (see Section 3). In turn, the AWN will also become a more balanced resource by including fundamental meanings, such as those presented in a beginner course for L2 or foreign language learners. To measure the amount of overlap between the two resources, a list of unique words was first extracted, and function words removed. This resulted in a list of 486 shared words. Of this list, 94 were already included in the isiZulu AWN and therefore also removed from our experiment, resulting in a list of 392 words from the LetsAL content that are not covered in the AWN yet. This clearly shows that there is still some work to be done on the isiZulu AWN to achieve a balanced coverage of the most basic vocabulary, as taught to language learners. To this end, methods previously employed in the AWN to speed up development of new synsets, namely semiautomatic linking of information from bilingual wordlists to information from the PWN. In short, this method uses the minimum amount of additional resources to extract potential synsets from the English for each word in the African language. A human expert then assesses the validity of each link before it is included in the AWN. The results when applying this method to the isiZulu LetsAL data can be seen in Table 11 . A human expert provided a bilingual list (English -isiZulu) of meaningful stems, derived from all the vocabulary and dialogues included in the LetsAL course for isiZulu. The English stems with their associated synsets were extracted from PWN (Princeton University, 2017) and limited to those with attributes \"sense:1\". We also split the data on POS categories assigned by a linguist to limit the choices necessary in the validation step. The lemmas that were already included in the AWN were not presented for validation again as the goal of this experiment was rather to improve the coverage of the AWN, than the depth of already included synsets. That important aspect will be covered in a next pass on the data. Following this method grew the isiZulu AWN with 172 additional synsets in a matter of a few hours now totaling 10 954 synsets. POS category Lemmas in The LetsAL infrastructure lends itself perfectly to inclusion of data from the AWN as additional on-line reference source. Incorporating this feature for isiZulu into the live system will be our primary focus, where after the same improvement will be made to the other three languages for which a wordnet already exists (namely isiXhosa, Setswana and Sesotho sa Leboa). The AWN project is about to enter a new development stage and it is therefore planned to add Sesotho as a sixth language. As soon as a wordnet is available, it can be incorporated into the LetsAL course. Growing the AWN is also a priority and the project team is looking at the best method by which to select new synsets for inclusion. The comparison with LetsAL presented here will serve as valuable input for the next phase of development, especially the low initial coverage of basic terminology, as shown in Section 4. The team is also performing comparisons with what is currently included in the AWN and a base list of terms for the African languages compiled by Snider and Roberts (2004) . The so-called SIL-CAWL contains 1700 words in various categories such as Man's Physical Being and Environment. A further aim in the next phase of development of the AWN will be to fast-track inclusion of usage examples. For this experiment, an open-source corpus management system named NoSketch Engine (Rychlý, 2007) was used to manually look up usage examples in three small, but freely available online corpora for isiZulu, created in the Wortschatz project at the University of Leipzig 7 . Future work will include optimising a semiautomatic process by which developers of the AWN are presented with the best candidate sentences from the corpora, to be edited and included as usage examples. Roughly 4 000 isiZulu synsets in the AWN do not have any usage examples added yet, so speeding up development in this category is essential. Another promising resource that needs to be explored for possible inclusion in an iCALL system such as this, is ImageNet ( 2016 )). This extension of PWN 3.0 includes a large image database organised according to the WordNet hierar-7 See https://nlp.fi.muni.cz/trac/noske for more details on NoSketch Engine and http://wortschatz.uni-leipzig.de/en for information on the Wortschatz project. Access to the isiZulu corpora in NoSktech Engine is via http://cql.corpora.unileipzig.de/?corpusId=zul_mixed_2014. chy to further disambiguate the meaning of each node. The example in Table 2 (pumpkin) could for instance be further enhanced by adding a link to its ImageNet counterpart (see htp://imagenet.org/synset?wnid=n12158443). Images could also be used in an assessment component to LetsAL or to base interactive games ontwo important aspects that are envisaged for future work as well. Acknowledgements The authors would like to thank: the South African National Research Foundation, National HLT Network, Department of Arts and Culture, the University of South Africa's Women-in-Research Fund as well as the South African Centre for Digital Language Resources for providing funding in the various phases of the AWN project; as well as reviewers and conference participants for valuable inputs to the paper.",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 0.9999900317366834,
        "foundation": 0.9999888397127765,
        "none": 0.0
    },
    "reasoning": "Reasoning: The article explicitly acknowledges funding from the South African National Research Foundation, National HLT Network, Department of Arts and Culture, the University of South Africa's Women-in-Research Fund, and the South African Centre for Digital Language Resources. These entities suggest government and institutional support, which aligns with research agency and foundation categories. There is no mention of defense or corporate funding.",
    "abstract": "The development of the African Wordnet (AWN) has reached a stage of maturity where the first steps towards an application can be attempted. The AWN is based on the expand method, and to compensate for the general resource scarceness of the African languages, various development strategies were used. The aim of this paper is to investigate the usefulness of the current isiZulu Wordnet in an application such as language learning. The advantage of incorporating the wordnet of a language into a language learning system is that it provides learners with an integrated application to enhance their learning experience by means of the unique sense identification features of wordnets. In this paper it will be demonstrated by means of a variety of examples within the context of a basic free online course how the isiZulu Wordnet can offer the language learner improved decision support.",
    "countries": [
        "South Africa"
    ],
    "languages": [
        "English",
        "Sesotho"
    ],
    "numcitedby": 2,
    "year": 2018,
    "month": "January",
    "title": "{A}frican {W}ordnet: facilitating language learning in {A}frican languages"
}