{
    "framing_question": "If this paper introduces a dataset, what background and expertise is prioritized in data annotators, if any?",
    "response": "There is no mention of background and expertise prioritized in data annotators in this paper.",
    "article": "There is a growing body of work on how word meaning changes over time: mutation. In contrast, there is very little work on how different words compete to represent the same meaning, and how the degree of success of words in that competition changes over time: natural selection. We present a new dataset, WordWars, with historical frequency data from the early 1800s to the early 2000s for monosemous English words in over 5000 synsets. We explore three broad questions with the dataset: (1) what is the degree to which predominant words in these synsets have changed, (2) how do prominent word features such as frequency, length, and concreteness impact natural selection, and ( 3 ) what are the differences between the predominant words of the 2000s and the predominant words of early 1800s. We show that close to one third of the synsets undergo a change in the predominant word in this time period. Manual annotation of these pairs shows that about 15% of these are orthographic variations, 25% involve affix changes, and 60% have completely different roots. We find that frequency, length, and concreteness all impact natural selection, albeit in different ways. Introduction We rely on words to articulate our thoughts. The goal is often not just to be precise, but also to be clear and compelling. 1 Since multiple words can represent the same meaning (for example, allowable and permissible), we often make decisions on which words to use from sets of known synonyms. 2 For example, in the current day, it more common to say: talking while chewing is not permissible rather than allowable. Collectively, as speakers of a language we choose some words more frequently than others, to represent a meaning. Occasionally new words emerge, and every now and then some words fall out of favour so much that they may be considered extinct. Thus it is not surprising that prominent thinkers of the past, including Charles Darwin, have argued that just as there is a natural selection in the plant and animal species over time, there is a natural selection of words over time (Darwin, 1968; Darwin, 2003). In this analogy, word type maps to a species, and word frequency maps to the species population. Thus the creation and use of a new word is akin to the birth of a new species, the wide-spread use of a word is akin to the thriving of a species, and the complete lack of use of a word is akin to the extinction of a species. Over the last few years, there has been a spurt of research on historical language change, especially on how the meaning of a word has changed over time (Mihalcea and  Nastase, 2012; Hamilton et al., 2016a; Bamler and Mandt,  2017; Zimmermann, 2019; Jawahar and Seddah, 2019)this might be considered as a mutation. Much of this work is a direct result of the availability of resources such as the Google Books Ngrams Corpus (GBNC) (Google, 2012). However, there is very little computational work on the natural selection of words; that is, how words compete to rep-resent a meaning, and how, over time, some words become more successful, whereas others become less successful. In this paper, we present a large dataset to foster computational studies on the natural selection of English words. Specifically, the dataset includes sets of synonymous monosemous words and their frequencies in English books across 200 years. 3 We focus on monosemous words because readily accessible large amounts of text is not sense-annotated and thus it is difficult to track frequencies of individual word senses. However, working with polysemous words remains interesting future work. The words are taken from the English WordNet 3.1 (Fellbaum, 1998). Historical frequencies are obtained from the English GBNC (Google, 2012). Since the dataset includes sets of words that compete with each other to represent meanings, we refer to it as the WordWars dataset. For any given span of time, we will refer to the most frequent (monosemous) word in a synset as the predominant or winner word. WordWars includes the predominant word and frequency information for 5,062 synonym sets from 1800 to 2009. To facilitate easy exploration of the WordWars dataset, we also created an online interactive visualization to illustrate individual battles within each of the synsets. We begin with an overview of the related work in Section 2 Sections 3 describes the WordWars dataset: how we created it ( §3.1) and how we visualize it ( §3.2). In Section 4, we explore three questions on the natural selection of monosemous words, using the WordWars dataset: 1. What proportion of predominant words from early 1800s are displaced by other words in the 2000s (both overall and across select sub-classes such as part of speech)? ( §4.1) 2. Which word features have a significant impact on the natural selection of words, i.e., on whether a word that thrived in the early 1800s will be displaced by another in the early 2000s? We explore three word features of particular importance in linguistic and psychological studies: frequency (in early 1800s), length, and concreteness. ( §4.2) 3. What are some of the notable differences between the predominant words of early 1800s and the predominant words of early 2000s, especially in terms of orthography, affixation, and word length? ( §4.3) WordWars can be used to explore a number of other research questions as well, including those listed in Section 5 We leave that for future work. All of the data associated with this project, as well as the interactive visualizations, are made freely available through the project webpage. 4 Related Work In his seminal work, The Descent of Man, Charles Darwin recognized that evolution is not just a feature of biological entities but also of words: the survival or preservation of certain favoured words in the struggle for existence is natural selection (Darwin, 2003)   Interestingly, the term evolution and associated concepts were used to describe cultural and language changes long before Darwin applied them to living organisms ( van Wyhe,  2005). Language evolution has since been of substantial interest in a number of fields, especially linguistics, cultural studies, phonosemantics, psychology, and evolutionary studies. See survey articles for recent research on language change (Gray et al., 2007; Pagel, 2009; Mesoudi,  2011). Below we identify some of the most relevant work to the current study. George Zipf famously stated that: the magnitude [length] of words tends to stand in an inverse relationship to the number of occurrences Zipf (1949)   Thus shorter words tend to be more frequent than longer words. He attributed this to the human tendency to preserve effort. Concreteness measures the degree to which a word refers to an entity perceivable by the senses. Some studies argue that concrete words are easier to remember because they trigger not just the verbal codes of memory but also the perceptual ones (Paivio, 1971). Similar to concreteness, it has been shown that high frequency terms and longer words are more easy to recall in lexical decision tasks (Meyer and Schvaneveldt,  1971; Schvaneveldt and Meyer, 1973; Barber et al., 2013;  Keuleers et al., 2010). Frequency, word length, and concreteness have also been shown to play an important role in child language acquisition. Children learn the high-frequency, concrete, and shorter words first (Goulden et al., 1990). In this work we examine the impact of frequency, word length, and concreteness on the evolution of words. Bolinger (1953) claimed that words that sound similar to near-synonyms have a greater chance of being more frequently used. Magnus (2001) shows that some phonemes tend to be used in a restricted semantic space, i.e., they occur in words with similar meanings. For example, labial consonants like /b/ tend to convey a sense of roundness, as in, ball, bell, boat, blob, blotch, bun, and bulb. Cuskley et  al. (2014) shows that even though some forces push verbs to become regular, other forces regenerate and maintain irregularity in language. We do not examine these ideas here, but WordWars can be of benefit for that work as well. There is growing interest in Computational Linguistics research in studying language change. A large majority of that work examines how the meaning of a word changes over time (Mihalcea and Nastase, 2012; Hamilton et al.,  2016a; Hamilton et al., 2016b; Bamler and Mandt, 2017;  Dubossarsky et al., 2017; Rudolph and Blei, 2018; Zimmermann, 2019; Jawahar and Seddah, 2019). For example, gay, wicked, and nice mean very different things now than what they did in the past. Essentially, that work examines how a word gains new senses, and how some senses of a word may become deprecated. In contrast, here we examine how different words compete to represent the same meaning, and how the degree of success of words in that competition changes over time. WordWars can also be used to develop various machine learning systems, including those that aim to predict the progression of word frequencies over time. See Turney and  Mohammad (2019) for a supervised learning algorithm that is able to predict the future leader of a synset-the word in the synset that will have the highest frequency. WordWars: Historical Frequencies of Sets of Competing Words We begin with how we created WordWars ( §3.1), followed by how we visualize it ( §3.2). Creating WordWars Our goal was to compile a dataset of groups of words that (roughly) mean the same thing, along with their frequencies of usage over time. Since some words have more than one sense and it is difficult to determine the intended sense automatically in text, we chose to focus on monosemous words (words with exactly one sense or meaning). We use WordNet 3.1 (Fellbaum, 1998) to obtain sense information and the Google Books Ngrams Corpus 2012 version (GBNC) (Google, 2012) to obtain historical frequency information. The precise steps we used to create the dataset are listed below: 1. Identify words that are monosemous using WordNet 3.1. Words that occur in only one synset were considered monosemous (e.g.: aptly, whereas madly, which occurs in multiple synsets was ignored). Words that occur in the same WordNet synset are considered synonymous (e.g., aptly, ably, competently and capably). 2. Obtain historical unigram frequencies for the monosemous words from the GBNC. Table 1 row e shows the number of WordNet monosemous words for which historical frequency information is available in GBNC. To smooth frequencies, we aggregate frequencies across ten-year spans. Thus the entry for a word w and 1809, includes the total number of times w occurred in books from 1800 up to and including 1809; the entry for 1810, includes the total number of times w occurred in books from 1801 up to and including 1810; and so on. Each word has frequency scores for all the ten-year spans from 1809 to 2009. 5 For brevity, we will refer to a span by its final year, i.e., the 1800-1809 span will be referred to as the 1809 span. (File monosemous-word-historicalfrequencies has these tab-separated columns: word, ten-year span, frequency.) 3. Identify battle synsets. Determine synonym sets from WordNet 3.1 that include at least two monosemous words with unigram frequency information in the GBNC. These are the synsets where we examine the competition between the monosemous words to represent meanings. We will refer to them as the battle synsets. Rows g and h show the number of battle synsets and the number of monosemous words in the battle synsets, respectively. 4. Determine predominant/winner words. For a given span, we will refer to the most frequent (monosemous) word in a synset as the predominant word or winner word. We record the information of these words in the winners file, which has these columns: synset, winner word in the 1809 span, and winner word in 5. Store contexts of words in battle synsets. We extract all the 5-grams in the GBNC that include any of the words in the battle synsets. We do not make use of the 5-grams for analysis in this paper, but they provide valuable contexts for the competing words, and thus of potential use in future work. We do include the 5-grams in the interactive visualization so users can peruse the contexts of words at different stages of the word's life cycle (early adoption, when they become dominant, etc.). We refer to the collection of files described above as the WordWars Dataset. We repeated these steps for two other periods of time: 1809 to 1909 and 1909 to 2009. An analysis of these additional datasets helps break down how language changed in each of the two corresponding centuries. We also created a version of the WordWars dataset from the GBNC Fiction subset. Although, the rest of the paper presents analyses only on the full dataset, experiments with the Fiction subset obtained similar results. 6 Visualizing WordWars The Google Ngram Viewer is an online interactive visualization where users can enter one or more words, and the system renders a graph of their frequencies over time (based on GBNC data). 7 One can enter the words from the change-of-winner synsets that WordWars provides to visualize the frequencies. However, entering words from hundreds of synsets can become tedious. To facilitate the examination of the competing words, we created an online interactive visualization to illustrate individual battles within each of the WordWars synsets. Figure 1 shows one of the sub-visualizations. The user can view individual 1809 and 2009 winner pairs on the left. With a single click, one can choose to explore only the change-of-winner pairs. (The image in Figure 1 is after this click.) Clicking on any of the word pairs shows the historical relative frequencies of all the words in the corresponding synset in the graph on the right, where relative frequency is the ratio of the frequency of the word in a year to the total frequency of all words in that year. For example, in Figure 1 , one can see the relative frequencies associated with the ably-aptly change-of-winner pair, which includes frequencies not just for ably and aptly but also of other monosemous words in that synset (competently and capably). From the graph, the user can also note that the winner changed in 1956 (hovering over the graph shows the year and precise relative frequency information). Using just the down (or up) arrow key, one can cycle through a large number of change-of-winner synset quickly and easily. Figures 2 and 3 show examples where one can see both relative frequencies and raw frequencies, of competing sets of words, from 1809 to 2009.   1809-2009, 1809-1909, and 1909-2009.   Other visualization options (not shown here), allow one to choose: (1) the base corpus (GBNC Full or Fiction), (2) to view specific kinds of change-of-winner pairs (orthographic variants, same root different affixation, or different root), (3) particular parts of speech (noun, verbs, adjectives, or adverbs), and (4) whether the synset includes a new word (a word that occurs in GBNC in any of years after 1809, but not in the 1809 span). One can also click on the desired tenyear span to see the contexts (5-grams) in which the word was used. This can help better understand for example, the contexts in which a word was used at different stages of its life cycle: for example, when people first started to use it, when its use increased or decreased markedly, when its use surpassed the previous predominant word, when it was close to extinction, etc. A slider allows users to select ranges of years such that the system will show only those change-of-winner synsets for which the usage of the 2009 winner surpassed the usage of the 1809 winner in the selected time period. We hope that the visualization will encourage further studies on word evolution. Examining the Natural Selection of Words with WordWars We now present the use of WordWars to better understand three broad questions associated with the natural selection of words: (1) the rate of change of predominant words ( §4.1), (2) importance of three prominent word features in determining whether an 1809 winner will be displaced in 2009 ( §4.2), and (3) differences between the 1809 and 2009 winners ( §4.3). Rate of Change of Predominant Words and the Impact of New Words Table 2 provides a number of statistics from the Word-Wars dataset for three pairs of spans: 1809-2009, 1809-1909, and 1909-2009. Observe that only about 26,000 of the 47,981 words that occurred in the 2009 span, also occurred in the 1809 span. This is not surprising since the number of books in the Google Books Corpus from 2000 to 2009 is orders of magnitude larger than the number of books from 1800 to 1809. Interestingly though, more of the new words were first seen between 1809 and 1909 (∼15K)  than between 1909 and 2009 (∼7K). Note that the number of battle synsets for the 1909-2009 file (6,708) is markedly higher than the number of battle synsets for the 1809-2009 file (5,062). This is because of the higher vocabulary size in 1909, which leads to more synsets from that time having a non-zero number of monosemous words. Observe that in 32% of the 2009 span battle synsets, the predominant word is different from the predominant word in in the 1809 span (1,602 of the 5,062). The percentage is lower for the 1809-1909 span pair (29%) and for the 1909-2009 span pair (24%). This makes sense because there is a greater chance for the dominant word to change over a longer period of time as compared to over a shorter period of time. It is interesting to note that the percentage of change is higher in the 1809-1909 span pair than in the 1909-2009 pair. Perhaps this is correlated with the fact that the former period saw a larger number of new words, than the latter period.    Table 3 shows the number of new words in different span pairs, the number of synsets they are involved in, as well as the number synsets where the new words eventually became the predominant words. Observe that for the 1809-2009 span pair, 45% (2304/5062) of the battle synsets included at least one new word (a word that did not occur in the ten years from 1800 to 1809). Further, in 25% of the synsets (593 of the 2304 synsets), the new word eventually became the predominant word. Table 4 shows a break down of the number of predominant word changes by part of speech. Observe that there are a far greater number of changes in noun synsets than any other part of speech. However, the numbers are roughly proportional to the number of battle synsets for each part of speech. The Role of Frequency, Length, and Concreteness in Determining Whether an 1809 Winner will be Displaced in 2009 A compelling question in the understanding of language change is why some words that once thrived (in terms of speaker preference) are displaced by others over time. We now use the WordWars dataset to examine this question. Some words that won the dominance battles in the 1809 span, also won the battles in the 2009 span, whereas others did not. We will refer to the former set of words as the 1809win2009win words and the latter as the 1809win2009loss words. We determine how the two sets of words compare in terms of three word features prominently studied in linguistics, cognitive science, and psychology: (a) frequency (in the 1809 span), (b) length, and (c) concreteness. We use the concreteness ratings for about 40K English lemmas compiled by Brysbaert et al. (2014). 8 The ratings are real values between 1 and 5. Since the distributions of word frequencies tend to not have a normal distribution (as is also the case in our dataset), we use the two sample Kolmogorov-Smirnov test (K-S test) to determine whether the 1809 span frequen-cies of the 1809win2009win words are significantly different from the 1809 span frequencies of the 1809win2009loss words (Massey Jr, 1951). Since word length and concreteness ratings have normal distributions, we used the Student's t test to determine whether the word lengths and concreteness ratings of the 1809win2009win words and the 1809win2009loss words are significantly different. Table 5 shows the sample sizes and means of the relevant distributions. 9 The significance tests show that low frequency 1809 winners are significantly more likely to be displaced by other words of their synsets, compared to high frequency 1809 winners (p < .001). This makes sense as a competitor does not need to gain an overly large frequency to replace the 1809 winner word. Nonetheless, it also shows that in low-frequency synsets the change in relative frequencies of its members can be more dramatic than in high-frequency synsets. The length of a word does not have a significant impact on whether it is likely to be replaced or not (p > .05). The concreteness of the word has a significant impact on whether it will be replaced: low concreteness (i.e., abstract) 1809 winners are more likely to be displaced than high concreteness 1809 winners (p < .001). It is worth exploring, why: Is this because abstract words by their nature tend to be displaced more often than concrete words? Or, is this because there has been a much larger proliferation of abstract words (than concrete words) in the last two hundred years? Or, is there some other cause? We leave that for future work. Differences between the 1809 Winners and the 2009 Winners Here, we examine the differences between the predominant words of 1809 and the predominant words of 2009. We do so by manually annotating the 1809 and 2009 winner pairs into three types: orthographic (spelling) variants, same root but different affixation, and completely different roots. 10 We discarded 66 of the 1607 pairs from further analysis as they did not fall into one of the three pair types (e.g., word and its abbreviation). Table 6 shows numbers for each type and examples of sub-types. Observe that close to 60% of the pairs have different roots, about 25% have the same root but different affixation, and about 15% are orthographic variants. The individual types can be further examined to better understand changes in orthography, affixation, and how a completely different word can come to dominate a synset. In the subsections below we explore (1) changes in affixation, and (2) difference in lengths of the 1809 winner and the 2009 winner, which is uniquely related to all three pair types. Changes in Affixation Among the 365 same root change-of-winner pairs, we observe that suffix changes are markedly more numerous than prefix changes. Table 7 shows the most common affix and prefix changes. Table 8 shows the top five and bottom five suffixes by net gain-number of additional 2009 winner words that have the suffix. The \"NONE\" entry indicates that the 2009 winner was often a word resulting from the dropping of a suffix from the 1809 winner. The five entries in the middle of Table 8 correspond to common suffixes that were similarly dominant both in the 1809 and the 2009 spans. There was markedly less change in the prefixes of winners in the 1809 span and the 2009 span, with the notable exception of non and re (which have become markedly more frequent in the 2009 span) and un and ana (which have become markedly less frequent in the 2009 span). 11 The full lists of suffixes and prefixes ordered by net gain are available on the project page. Lengths of New Winners If the principle of least effort for speakers, championed by Guillaume Ferrero and George Zipf (Ferrero, 1894;  Zipf, 1949), is one of the forces in language evolution, then new winners are expected to be shorter in length than the earlier winners (a mechanism to reduce speaker effort). We test this hypothesis by comparing the lengths of the 2009 winners and the 1809 winners they have displaced. A onetailed t test shows that the mean length of the 2009 winners is statistically significantly smaller than the mean length of the words they have displaced (p < .001). Table 9 shows the percentage of 2009 winners that are shorter, longer, and the same length as the 1809 winners they have displaced. If the change in length was random, then these percentages would each be 33%. However, row a. shows that overall, there is a markedly greater tendency for a word to be displaced by a shorter word. The rows b, c, and d show the results for three word-pair types. Notice that the tendency towards shorter words is most pronounced in sameroot (affix-change) pairs. On the other hand, note that for noun and verb different-root pairs, it is more common for the 2009 winner to be longer than the word it displaces. The tendency for longer words is especially strong in adverb, noun, and verb orthographic variations, yet, adjectival orthographic variations lead markedly to shorter words. Thus, even though overall there is a tendency towards shorter words, within particular types and parts of speech the tendency can be towards longer words. This raises new questions as to why these differences exist. Other Research Questions that can be Studied with the WordWars Dataset The WordWars dataset can be used to study various aspects of language change, including but not limited to: • To study the rate at which language is changing in different time periods within 1809-2009. For example, to identify short periods of time that incurred a large number of changes in the dominant word. • To study word attributes (beyond those examined here) that are correlated with greater success (higher relative frequencies). • In this work we explored the tendency of predominant words to be displaced. However, WordWars can be used more generally to study changes in usage frequency of a word relative to its synonyms. • When plotting the relative frequencies of words across time, we observe various shapes. These shapes can be categorized into different kinds to study the which shapes are more common, and what factors influence the shape. • To develop supervised machine learning models that are able to predict the future winner of a synset. We have already done some initial work in that regard (Turney and Mohammad, 2019). • The WordWars dataset along with the Google 5-grams dataset can be used to study word usages immediately after birth, when the word becomes the most dominant word in the synset, when another word displaces it and it is no longer dominant, when it is close to extinction, etc. Such analyses can yield socio-cultural clues into the use of words. WordWars is made freely available for research. Limitations The study of the natural selection of words is challenging for several reasons, including the lack of linguistic resources for words from earlier centuries, difficulty of tracking the frequencies of different senses of a word, and the occasional changes in the meanings of words over time. We have taken some steps to alleviate the impact of these challenges, including: focusing on monosemous words, using resources like WordNet that have substantial coverage (even of deprecated words), and limiting the analysis to only 200 years (the proportion of words whose meaning has changed dramatically in just 200 years is expected to be small). Nonetheless, it should be noted that these factors may introduce certain biases. Conclusions We presented a new dataset, WordWars, with historical frequency information from the early 1800s to the early 2000s for monosemous words in over 5000 synsets. We used the dataset to analyze several research questions about the natural selection of words in that time period. We showed that close to one third of the synsets undergo a change in the predominant word in this time period. Manual annotation of these pairs shows that about 15% of these are orthographic variations, 25% involve affix changes, and 60% have completely different roots. We showed that even though length does not determine whether a predominant word will be displaced, if displaced, the new predominant word tends to be shorter. Notable exceptions for certain word-pair types and parts of speech are also identified. We showed that concreteness and frequency are significant factors in determining whether an 1800s predominant word will be displaced by the early 2000s. We also presented a ranking of affixes by the extent to which they have become more popular in this time period. We showed that the suffixes ic and ability and prefixes non and re gained the most popularity whereas suffixes al and ical and prefixes un and ana dropped the most in popularity. Finally, we identified several research questions that can be studied with the WordWars dataset. The dataset and the interactive visualization are made freely available. 12 We hope that these will foster further research on the natural selection of words. Future work will explore extending this work beyond monosemous words to all words (which will require identifying ways to disambiguate word senses with sufficient accuracy) and analyzing data in additional languages to determine how patterns of natural selection may vary. We are also interested in exploring the complex inter-relationship between the change of meaning of a word over time and its capacity to compete with other words for favor in usage. Acknowledgments Many thanks to Peter Turney for the encouragement to pursue this project and helpful discussions.",
    "funding": {
        "military": 0.0,
        "corporate": 0.0,
        "research agency": 6.704270752999619e-07,
        "foundation": 6.98819728239819e-06,
        "none": 0.9999995679800934
    }
}