{
    "article": "We present a large Norwegian lexical resource of categorized medical terms. The resource merges information from large medical databases, and contains over 77,000 unique entries, including automatically mapped terms from a Norwegian medical dictionary. We describe the methodology behind this automatic dictionary entry mapping based on keywords and suffixes and further present the results of a manual evaluation performed on a subset by a domain expert. The evaluation indicated that ca. 80% of the mappings were correct. Introduction Named Entity Recognition (NER) is a common task within the area of clinical Natural Language Processing (NLP) with the aim of extracting critical information such as diseases and treatments from unstructured texts (Friedman et al., 1994; Xu et al., 2010; Jagannatha and Yu, 2016) . Current neural approaches to NER typically require a large amount of annotated data for a reliable performance (Ma and Hovy, 2016; Lample et al., 2016) . Distant supervision (Mintz et al., 2009) , however, relaxes this constraint on the training data size thanks to the combined use of information from lexical resources, a small amount of training data and large amounts of raw data. This technique has been successfully applied also in the biomedical and clinical domain (Fries et al., 2017; Shang et al., 2018) . In absence of even a small amount of annotated data, categorized lexical resources can also be used as gazetteers in rule-based approaches. There is currently no large and freely available lexical resource with categorized entity types for Norwegian medical terms to be used for clinical NER with distant supervision. This paper presents an effort to create such a resource by collecting and merging lists of terms available from a number of other smaller and more specialized resources. We implement and describe an automatic mapping method which is applied to a dictionary containing a variety of definitions for relevant terms and present an evaluation of this mapping using both inter-resource overlap and manual evaluation performed by a domain expert. The resulting lexical resource will be made freely available. Background Medical Entity Recognition often makes use of lexical resources such as lists of disease names derived from the International Statistical Classification of Diseases and Related Health Problems (ICD) resource (World Health Organization and others, 2004) or from disease information from general resources, such as the Medical Subject Headings (Lipscomb, 2000, MeSH) . There has been quite a bit of work aimed at creating semantic lexicons for use in NLP from such domain-specific resources (Johnson, 1999; Liu et al., 2012) . Automated extraction of medical entities from clinical text has been the topic of several research efforts more recently, a majority aimed at English (Xu et al., 2010; Jagannatha and Yu, 2016) and Chinese clinical text (Wu et al., 2018) . For a language that is very closely related to Norwegian, Skeppstedt et al. (2014) developed and evaluated an entity detection system for Findings, Disorders and Body Parts in Swedish. In order to alleviate the need for manual annotation, distant supervision has recently been applied also to entity recognition in the medical domain for English and Chinese (Shang et al., 2018; Nooralahzadeh et al., 2019) . Norwegian Medical Terminology Resources There are a number of resources which contain Norwegian medical terms that could in principle be relevant for NER. The Medisinsk ordbok (MO) 'Medical Dictionary' (Nylenna, 1990) Automatic Dictionary Entry Mapping Method The use of dictionary definitions as a source of semantic information has been the topic of quite a bit of research in lexical semantics, from the early work of Markowitz et al. (1986) where patterns in the dictionary definitions along with suffix information gave rise to a semantic lexicon to more recent efforts to embed dictionary definitions in order to derive semantic categories for phrasal units (Hill et al., 2016) . In this work, we map entries from the MO dictionary to categories, i.e. to medical entity types. We identify 12 different types of entity categories based on previous work (Zhang and Elhadad, 2013) and the inspection of MO entries. We then implement a rule-based mapping method relying on suffixes and keywords. Mapping Strategies The mapping method consists of four different mapping strategies: two relying on the entries themselves and two deriving the mapped category from the definitions. One of these is suffix based, the others operate based on keywords. In what follows, we describe each of these strategies in detail. Suffix-based mapping (strategy SUFF) This strategy consists of mapping an entry to a category whenever its last characters match a specific suffix. Many medical terms have Greek or Latin origin resulting in suffixes that give rather clear indications of the category of an entry. We compile a list of suffixes based on both frequently occurring suffixes in the data and an online resource 3 . We only include suffixes and endings which can be mapped to an unambiguous category in the majority of cases. The complete list used for the mapping is presented in Table 1 . Keyword-based mapping Mapping entries to keywords is primarily used to map an entry to a category based on the first noun occurring in their definition (strategy KW-1N). To be able to detect first nouns, definitions are tokenized and part-of-speech tagged with UDPipe (Straka et al., 2016) . 2 https://legemiddelverket.no/andretemaer/fest 3 https://en.wikipedia.org/wiki/List_of_ medical_roots,_suffixes_and_prefixes Category Suffixes CONDITION -agi, -algi, -algia, -blastom, -cele, -cytose, -donti, -dynia, -emi, -emia, -epsi, -ism, -isme, -ismus, -itis, -oma, -pati, -plasi, -plegi, -ruptur, -sarkom, -sis, -trofi, -temi, -toni, -tropi DISCIPLINE -iatri, -logi MICROORG -coccus, -bacillus, -bacter PERSON -iater, -olog PROCEDURE -biopsi, -grafi, -metri, -skopi, -tomi SUBSTANCE -cillin TOOL -graf, -meter, -skop Table 1 : Suffix mapping. To create a list of keywords for the mapping, we inspect the 200 most frequent nouns in the definitions and manually map the ones with a strong indication of a single category. We complement this with other frequent nouns which can be good indicators of a category. This results in a list of 168 mapped keywords, see Table 2 for some examples. When mapping, we require the first noun of a definition to either (i) exactly match a keyword or (ii) to contain it. The latter is only applied for keywords longer than 4 characters to avoid short sequences which might over-generate false positives (e.g. tap 'loss' for katapleksi 'cataplexy'). When checking for contained keyword, we limit the position of the keyword match to the second character onward in the first noun to approximate the occurrence of a keyword as the second part of a compound as this is more indicative of categories. Given that many dictionary entries are also compounds, we apply the mapping based on contained keyword also to the entries themselves (strategy KW-E). When applying keyword-based mapping to definitions, before detecting the first noun, we remove those nouns and phrases which have little added semantic value relevant for the category. These include prepositional phrases forming a complex noun phrase typical of definitions (e.g. form av 'form of'), nouns not indicative of a category (e.g. uttrykk 'expression') and abbreviations (plur. 'plural', lat. 'Latin'). During the mapping procedure, first each strategy casts a vote on the category. In case of multiple votes with a disagreement, the category is based on a single mapping strategy chosen following a specific order, starting from the strategy with the highest expected precision and continuing with the ones with increasingly high recall as follows: SUFF → KW-E → KW-1N. After a first iteration of mapping, we perform a second iteration and map uncategorized entries if there is an entry already mapped available for the first noun in their definition (strategy ITER). The MO resource contains altogether 2,387 synonyms, which were treated as separate entries with the same definition. The number of entries with multiple meanings (and definitions) were merely 360 in total, amounting to 1.5%. Since such polysemous entries were so rare, we consider only the first sense of each entry. The methodology outlined above could be applied also for categorizing medical terminology in other languages via, for example, machine translating the list of keywords (or terms) used and making small language-specific orthographic adjustments to the suffix mappings from Table 1 . Such suffixes are often adapted to the orthographic conventions of a certain language, as also Grigonytė et al. (2016) found in the case of Swedish. Mapping Results The results of the category mapping for MO based on the methodology outlined in Section 4. is presented in Table 3 . The percentage of mapped entries was 47%, almost half of all available entries in MO. The other terms, which were not mapped, did not match either any of the suffixes or the keywords used. The latter includes, among others, cases where the first noun in the definition was a synonym of the term and hence too specific to be included in the list of keywords used (e.g. the term klorose 'chlorosis', a type of anemia occurring mosty in adolescent girls is defined using jomfrusyk 'virgin sick'). Category Based on some manual inspection, most non-mapped terms would fit one of the categories proposed, with few exceptions that might lead to rather small categories, such as regulations (e.g. internasjonalt helsereglement 'international health regulations'). Several non-mapped terms should belong to the ANAT-LOC category. The proposed keyword-based methods would often be ambiguous for these terms and could indicate either an anatomical location or a medical condition related to it. For example, both the ANAT-LOC hjertekammer 'ventricle' and the CONDI-TION panserhjerte 'armoured heart' contain the keyword hjerte 'heart' and have this word also as the first noun in their definition, their category could thus not be determined by our method. Additional databases containing a detailed list of anatomical location terms are therefore particularly useful for expanding our resource. We also inspected the distribution of the mapping strategies used (see Resource Merging The mapped MO entries were complemented with data from the other resources described in Section 3. The mapping for these resources was straightforward since each resource contained either one specific type of entity or manual annotation was available. At a closer inspection, we found that the ALOC list contains, besides anatomic locations, several terms which could belong to more than one category depending on the context of their use, e.g. tracheostomi 'tracheostomy' could either be ANAT-LOC referring to the hole created during a tracheostomy or it could refer to the procedure itself. These cases were mapped to PROC for reasons of consistency with the suffix-based mapping applied, but it might be worth to accommodate multiple categories in future versions. This list has been manually revised by a medical expert who disambiguated the category consistently with the mapping methodology used. From FAM-HIST, we collected all occurrences of condition and event entities and mapped them to our CONDITION category. The SUBSTANCE category was augmented, in part, based on the FEST resource. The terms collected from FEST included substance names (also in English, when available) as well as medical product names with and without strength information. From ICD-10, both the disease names corresponding to the 3 and the 4 digit codes were preserved. Only 16% of the ICD codes were 3 digit codes. From ICPC-2, we included all terms, sub-terms and short forms under the CONDITION category except for the terms appearing in the Procedure codes chapter, which were mapped to the PROCEDURE category. Terms from the Social problems chapter were excluded as most of these were not strictly speaking medical conditions (e.g. lav inntekt 'low income'). We observed a minor difference compared to ICD between some terms associated to the same code (e.g. Blindtarmsbetennelse vs. Uspesifisert appendisitt for code K37, appendicitis). In the case of LABV, we included under the SUBSTANCE category all substance names, medicine and other medical product names and brands together with type and strength information when available (e.g. Kortison Tab 25 mg 'Cortisone Tablet 25 mg'). Lastly, all codes from PROC were included without any filtering. Resource-based Automatic Evaluation Thanks to a certain amount of overlap between the mapped MO entries and the other resources, we can use information from the latter to automatically evaluate the former. Table 6 shows the overlap and the percentage of correct mappings. On average, 85% mappings were correct out of the total of 2,378 overlapping terms from the resources listed in Table 6 . Approximately 21% of all mapped terms from MO were thus evaluated (and corrected) automatically with the help of the other resources. Most misclassifications occurred with the ALOC and FAM-HIST resources and concerned the ANAT-LOC and CONDITION categories. Resource Manual Evaluation Given that the overlap between MO and the other resources was limited to certain categories, we further performed a manual evaluation of the automatically mapped MO entries in order to assess their quality. We randomly selected 1,128 terms to evaluate manually, aiming at a balanced amount per category (100 each) and mapping method. We included all available terms for categories where the total amount of terms remained below 100. The terms were categorized by a medical expert without access to the automatically mapped categories and the mapping method used. We present the per-category precision and recall in Table 7 , where the number of terms in the last column refers to manually assigned labels. 112 terms were labeled as 'OTHER' in cases where a term did not belong to any of the 12 categories indicated or when terms were outside of the area of expertise of the evaluator.  beled as OTHER, was 71.5% and 79.4% respectively. In 20 cases, SERVICE and ORGANIZATION were indicated as alternative labels to each other. We therefore compute evaluation measures also with these two categories merged (ORG+SER). This yields in total 82% correct labels when excluding OTHER. According to the confusion matrix in Figure 1 , most automatic categorization errors occurred between CONDITION and PHYSIOLOGY. (SERVICE was mapped to ORGANI-ZATION here.) Figure 1 : Confusion matrix over categories. Errors related to the PERSON category were mostly connected to the use of person as keyword with the KW-E strategy, which generated false positives such as schizoid personlighetstype 'schizoid personality type'. Some categorization errors occurred because of the lack of prefix information, e.g. in the case of the keyword refleks 'reflex' in arefleksi 'areflexia' and hyperrefleksi 'hyper-reflexia', which were both mapped to PHYSIOLOGY instead of CONDITION. This indicates that taking into consideration prefixes would contribute to improving the automatic categorization, especially for the KW-E strategy. The category label confusions between TOOL and ANAT-LOC originated from the keyword apparat, which proved to be ambiguous for the proposed categories, not only meaning 'device' and thus mappable to TOOL, but also meaning 'apparatus, system' as in immunapparatet 'immune system' and thus belonging to ANAT-LOC. Most correct mappings (88.3%) with a single strategy were obtained using suffixed (SUFF), followed by the keyword mapping from first nouns (KW-1N, 79.9%) and entries (KW-E, 76.6%). The iterative mapping (ITER) yielded considerably fewer correct mappings, only 64.7%. When multiple strategies opted for the same category label, 98.2% of terms were correctly categorized. As a final step during the resource creation, we revised the automatic categories based on the manually assigned ones. The updated count of terms per category in the resource after merging with other databases (eliminating overlap) and incorporating the evaluation results is reported in Table 8 . Category Conclusion We introduced the first Norwegian lexical resource of categorized medical entities and provided an overview of the process of its creation. The resource unites information from medical databases as well as entries automatically mapped from a medical lexicon. A manual evaluation of a subset of the mapped terms confirmed that the automatic mappings were of a suitable quality to be used as additional supervision signal with machine learning based NER approaches. In future work we plan to apply the resource in medical entity recognition for Norwegian, using it to provide initial categories for distant supervision. We also plan to perform annotations with multiple raters and measure inter-annotator agreement for the proposed categories. Acknowledgments This work is funded by the Norwegian Research Council and more specifically by the BigMed project, an IKT-PLUSS Lighthouse project.",
    "abstract": "We present a large Norwegian lexical resource of categorized medical terms. The resource merges information from large medical databases, and contains over 77,000 unique entries, including automatically mapped terms from a Norwegian medical dictionary. We describe the methodology behind this automatic dictionary entry mapping based on keywords and suffixes and further present the results of a manual evaluation performed on a subset by a domain expert. The evaluation indicated that ca. 80% of the mappings were correct.",
    "countries": [
        "Norway"
    ],
    "languages": [
        "Swedish",
        "English",
        "Chinese"
    ],
    "numcitedby": "1",
    "year": "2020",
    "month": "May",
    "title": "Building a {N}orwegian Lexical Resource for Medical Entity Recognition"
}