{
    "article": "In this paper, we describe the details of the Timely Disclosure Documents Corpus (TDDC). TDDC was manually organized by aligning the sentences from past Japanese and English timely disclosure documents in PDF format published by companies listed on the Tokyo Stock Exchange. TDDC consists of approximately 1.4 million parallel sentences in Japanese and English. TDDC was used as the official dataset for the 6th Workshop on Asian Translation to encourage the advancement of machine translation. Introduction The Tokyo Stock Exchange (TSE) is one of the largest capital markets in the world, with over 3,600 companies listed as of the end of 2018. TSE-listed companies are required to disclose material information to the public in a timely manner. This information is written in timely disclosure documents and includes financial statements, corporate actions, and corporate governance policies. Moreover, the documents are essential for investment decisions and are disclosed on the TSE websites 1 . From the surveys by TSE, the proportion of overseas corporation ownership of Japanese listed company shares (based on market capitalization) has risen almost consistently since 1990 to currently around 30% 2 . As of 2018, the proportion of share trading value coming from transactions by overseas investors is approximately 59% 3 . Although tens of thousands of original Japanese documents are disclosed every year (i.e., over 79,000 documents in 2018), the availability of English disclosure documents is limited. Thus, there is a strong demand for machine translation on both listed companies and global investors since Japanese to English translation needs to be done in a timely manner. However, it is difficult for TSE-listed companies to translate all their documents owing to the volume of information, limited resources of translators, and time constraints. The amount of text in timely disclosure documents tends 1 https://www.jpx.co.jp/english/listing/ disclosure/index.html 2 https://www.jpx.co.jp/english/markets/ statistics-equities/examination/01.html 3 https://www.jpx.co.jp/english/markets/ statistics-equities/investor-type/00-02. html to be large. In 2018, the total number of pages in all timely disclosure documents (over 79,000 documents disclosed by over 3,600 companies) exceeded 710,000; which means on average, a TSE-listed company is required to disclose over 197 pages each year. For TSE-listed companies, to translate all these pages would take huge amounts of time and money. Moreover, there are not enough translators available for all timely disclosure documents because the demand for translation clusters in peak season. For example, in 2018, approximately 48% of TSE-listed companies disclosed annual earnings reports (over 38,000 pages) in the same week, from May 9th to 15th. Furthermore, most investors require TSE-listed companies to disclose both Japanese and English documents simultaneously. Consequently, it is not easy to meet the demand for the English translation of timely disclosure documents using manual translation only. The machine translation could therefore be a solution to these problems. For current machine translation systems aimed at a specific field, a parallel corpus adapted to that field is regarded as an essential resource. There are already Japanese-English parallel corpora for training machine translation systems in fields such as patents (Utiyama and Isahara, 2007) and scientific papers (Nakazawa et al., 2016) . However, thus far, there is no large-scale Japanese-English parallel corpus specifically aimed at the Investor Relations field. The Timely Disclosure Documents Corpus (TDDC) consists of approximately 1.4 million Japanese-English sentence pairs that have been extracted from past timely disclosure documents and other documents. Timely disclosure documents contain important figures (e.g., sales, profits, and dates) and proper nouns (e.g., names of people, places, companies, businesses, and products). This information is essential for investors; thus, mistranslations need to be avoided, and overall translation quality needs to be improved. TDDC was prepared by Japan Exchange Group (JPX), which is an operator of securities exchanges including TSE. It was provided for research at the 6th Workshop on Asian Translation (WAT) 4 . During the 6th WAT, TDDC was free and available online only for research on natural language processing such as machine translation 5 . In this paper, we introduce details of TDDC and briefly explain the findings from the 6th WAT perspective. Timely Disclosure Task Timely disclosure task, which is one of the subtasks for the 6th WAT, aims to improve the Japanese to English translation of sentences extracted from timely disclosure documents to avoid mistranslations that would confuse investors. As terms on which investors focus, we define two groups: important figures and proper nouns. These terms cannot be accurately translated using typical Neural Machine Translation (NMT) systems because the NMT systems restrict the vocabulary size and consider rare words (e.g., names and numbers) as out-ofvocabulary words (Luong et al., 2015) . The current NMT systems introduce the subword tokenization, which transfers rare words to the sequence of its constituent characters (Sennrich et al., 2016) . However, the subword tokenization solves the problem only if a rare word can be translated as constitutive words. Thus, even using the subword tokenization, the NMT systems often are often unable to translate neither numbers with many digits nor constitutive proper nouns. The following sections will explain the summary of the timely disclosure documents and their details. Timely Disclosure Documents Timely disclosure documents are disclosed in PDF format on the TSE websites. There are mainly three categories of timely disclosure documents: performance results, corporate governance reports, and documents that describe material facts pertaining to business or other matters of listed companies. The material facts gets defined in the Japanese law (Article 166 of the Financial Instruments and Exchange Act). TSE-listed companies are usually required to disclose their performance results as \"決算短信\" (Kessan tanshin, Earnings reports) four times a year and corporate governance reports, which describe their status of corporate governance at least once a year. These periodic or annual documents tend to contain many common words and sentences for each company because companies tend to write new documents by referring to their past documents. Meanwhile documents that describe material facts are disclosed as required, not periodically. Important Figures We define important figures as numbers that have financial meaning (e.g., not page numbers and item numbers) such There are various patterns of units of amounts in Japanese timely disclosure documents, particularly. The following patterns \"1 億 5 千万円\" (1 × 10 8 + 5 × 10 7 yen), \"1 億 5000 万円\" (1 × 10 8 + 5, 000 × 10 4 yen), \"1 億 50 百万円' (1 × 10 8 + 50 × 10 6 yen), and \"150 百万円\" (150 × 10 6 yen) indicate \"150 million yen\". Examples of amounts are shown in Table 1 . Examples of dates include document issue dates, accounting period, and fiscal year. The imperial era name (or Japanese era name), such as \"平成\" (Heisei) and \"令 和\" (Reiwa) are widely used in Japanese documents for counting years, instead of Anno Domini (AD). There are cases where some companies omit information on dates in Japanese but provide them in English. For example, although \"前期\" (prior period) was written in a Japanese document, an English document described it as \"fiscal year 2017\". In Japanese timely disclosure documents, there are many variable prefixes for dates such as \"本\" (this), \"当\" (this), \"次\" (next), and \"前\" (previous, last). Examples of dates are presented in Table 2 . For performing the timely disclosure task, context-based accurate translation is not necessary (e.g., omissions of words in Japanese sentences and abbreviated numbers). However, these unbalanced sentences cause poor corpus quality. Proper Nouns We define proper nouns as rare words that are found only in documents from one company such as names of people, company names, names of places, and product names. This definition limits its original meaning and excludes technical terms such as accounting and legal terms. These terms can be found not only in the documents from one company but also in the documents from other companies. For investors, it is important to clearly grasp the subjects and objects in sentences, which should not be misplaced or translated in other proper nouns. Moreover, in timely disclosure documents, there are pairs of sentences for which the information in Japanese and En-glish are not equivalent owing to the differences in proper nouns between Japanese and English sentences: omission of subjects or objects and addition of proper nouns. There are cases where some companies omit the subject and object in Japanese but supplement proper nouns in English. In other cases, in Japanese timely disclosure documents, some companies frequently use pronouns; however, in English, those pronouns are replaced with proper nouns. Similar to dates described in Section 2.2, for this task, it is not necessary to achieve accurate translation based on the context (e.g., translation of Japanese pronoun to proper nouns). Table 3 shows examples of subject or object omissions and proper nouns additions. Construction of the Corpus The construction process of TDDC consists of the following steps: (1) gathering source documents, (2) aligning documents and sentences, and (3) preprocessing sentences. Source Documents The source documents of TDDC are documents that satisfied the following conditions: • disclosed from January 1, 2016 to June 30, 2018 • written by TSE-listed companies or Real Estate Investment Trusts (REITs) • disclosed in both Japanese and English, and • not encrypted or rasterized (i.e., sentences can be extracted). The source documents include documents that were disclosed daily (not timely), such as Corporate Governance Reports, which are also essential for investors. Aligning Documents and Sentences The pairs of documents and pairs of sentences were manually aligned through crowdsourcing. The main procedure is as follows: (a) A worker picks an English document from the documents which no one has picked yet. (b) The worker finds the corresponding Japanese document. (c) The worker extracts English sentences from top to bottom of the English documents and sees each of the similar Japanese sentences. (d) A Checker examines the alignment results. Thus the sentences of one document are aligned by only one worker, and there is no automatic alignment generated before the manual alignment. Sentences that were difficult to align were excluded (e.g., translations with notes in English), and not all sentences in each timely disclosure document were included in TDDC. Although checkers carefully examined the alignment results, there may have been the following errors: character corruption, alignment errors, and not extracted characters at the beginning or end of sentences. Preprocessing The aligned sentences underwent five preprocessing steps to remove noises (i.e., character corruption, control characters, and extra spaces). Replacing characters Most TSE-listed companies made timely disclosure documents using Windows OS computers because this is the recommended environment of TSE systems. Although files created in Japanese Windows OS are mainly encoded with CP932 (Code Page 932), timely disclosure documents frequently contained characters that are not defined in CP932. Therefore, some specific characters are replaced with other characters described in CP932. Unicode normalization There are two ways of expressing alphanumeric characters in Japanese sentences on computers: full-width and half-width. To normalize characters (including the abovementioned characters), the sentences are normalized with NFKC (Normalization Form Compatibility Composition) 6 , with the following exceptions: Numbers enclosed within a circle (\"①\"-\"⑳\": U+2460-U+2473), Two dot leaders (\"‥\": U+2025), and Horizontal ellipsis (\"…\": U+2026). The words in these exceptions are often written in timely disclosure documents, and each of them and their normalized characters will have distinct meanings. For example, numbers enclosed within a circle will be normalized with NFKC into integers, and both these numbers will be used in the original document as distinct item numbers. Deleting control characters Sentences extracted from PDF documents sometimes contain control characters. Therefore, control characters are removed such as the characters whose Unicode Character Categories are \"Cc,\" \"Cf,\" \"Cn,\" or \"Co.\" Deleting extra spaces Extra spaces in the sentences are deleted such as spaces at the beginning and end of sentences, and more than one space. Deleting non-Japanese-English pairs To make TDDC contain Japanese-English pairs, non-Japanese-English pairs are deleted such as an English sentences that contains Japanese characters and Japanese sentences that does not contain Japanese characters. Dataset Data Format TDDC consists of Japanese-English sentence pairs, document hashes, and sentence hashes. A document hash is a hash of the Document ID (DID), which is a unique identifier of the source document. A sentence hash is a hash of the DID and Sentence ID (SID), which is a unique identifier of the sentence in each source document. Pairs of Mr. Tsuda has been appointed as an outside director due to his capacity to identify with the Company's corporate philosophy and social mission as well as his considerable experience and insight on financial policy and systems which can be expected to be reflected into the management of JPX. DID and SID guarantee that these Japanese-English sentence pairs are independently extracted from the original documents. Sample of rows of TDDC that contain DID, SID, Japanese sentences, and English sentences are described in Table 4 . Data Splitting The training data is split into two sets of data from different periods. The first data set was created based on documents disclosed from January 1, 2016 to December 31, 2017 (Train-2016 -to-2017) , and the second data set was based on documents from January 1, 2018 to June 30, 2018 (Train-2018) . Development, development-test, and test data sets were extracted from timely disclosure documents disclosed from January 1, 2018 to June 30, 2018, excluding documents that were used to create the training data. The documents for the period were randomly selected, and the sentences were extracted from each randomly selected, discrete document set; thus, the extracted sources were not biased. Moreover, annotators modified English sentences to guarantee that the pairs of development, development-test, and test data were semantically correct. Analysis of TDDC Table 5 shows the statistics of TDDC. To understand the difficulty of the timely disclosure task, we conducted an analysis of TDDC. A challenging issue for the general NMT systems is long sentence processing (Bahdanau et al., 2014) . Approx-imately 23% of sentences in Train-2016-to-2017 are long (i.e., the number of words is over 50). Figure 1 shows the distribution of the number of English words in the sentences of Train-2016-to-2017. Table 5 shows that there are many duplicate sentences in each dataset. Table 6 shows the number of duplicate sentences in Train-2016-to-2017. It gets confirmed that there are more duplicate Japanese sentences than English sentences, and there are more duplicate sentences in Items than in Texts. Table 7 gives the distribution of source documents in Train-2016-to-2017. Similar to Section 3.1, TDDC consists of sentences from timely disclosure documents that are disclosed both in Japanese and English; thus the publishing companies are biased. The number of the publishing TSE-listed companies in Train-2016-to-2017 is 590, although 3,602 companies are listed on TSE as of the end of 2017. Timely Disclosure Task at the 6th Workshop on Asian Translation TDDC was provided for the 6th WAT, which is an open evaluation campaign that focuses on Asian languages. The participants of the timely disclosure task can submit the results of Texts and/or Items. During the 6th WAT, the translation performance of the results underwent automatic and human evaluations (Nakazawa et al., 2019) . As automatic evaluation, the following three metrics were used: BLEU (Papineni et al., 2002) , RIBES (Isozaki et al., 2010) and AMFM (Banchs et al., 2015) . For human evaluation, two types of evaluations were used: pairwise crowdsourcing evaluation (Nakazawa et al., 2016) and Japan Patent Office (JPO) adequacy evaluation. In addition to these official evaluations during the 6th WAT, to focus on the timely disclosure task, we particularly evaluated the results of JPO adequacy evaluation. JPO Adequacy Evaluation The JPO adequacy evaluation was performed by translation experts with a quality evaluation criterion for translated patent documents that was decided by the JPO. Table 8 shows the JPO adequacy criterion from 5 to 1. The evaluation was performed subjectively. \"Important information\" represents the technical factors and their relationships. The degree of importance of each element was also evaluated. The percentages in each grade are rough indications for the transmission degree of the source sentence meanings. The detailed criterion is described in the JPO document (in Evaluation of Important Figures and Proper Nouns The number of test sentences for the JPO adequacy evaluation was 200. A total of 200 test sentences were randomly and carefully selected from the test dataset to focus on the translation evaluation of important figures and proper nouns defined in Section 2. We rated each of the sentences in terms of important figures and proper nouns as  Almost all important information is transmitted correctly. (80%-) 3 More than half of important information is transmitted correctly. (50%-) 2 Some of important information is transmitted correctly. (20%-) 1 Almost all important information is NOT transmitted correctly. (-20%) Participants During the 6th WAT, 4 teams participated in the Japanese-English timely disclosure documents task (Nakazawa et al., 2019) . Morishita et al. as ntt (Morishita et al., 2019) , Imamura and Sumita as NICT-2 (Imamura and Sumita, 2019), and Susanto et al. as sarah (Susanto et al., 2019) used NMT without other resources. Eriguchi et al. as geoduck (Eriguchi et al., 2019) used translation memory and NMT with 1 million Japanese-English Wikipedia parallel corpus provided by Asai et al. (Asai et al., 2018) as an additional training resource. Evaluation Results Figures 2 and 3 denote the official results of the timely disclosure task (Nakazawa et al., 2019) . Table 9 shows the evaluation results of the sentences containing important figures or proper nouns. Table 10 shows the sample results of In the results, all systems achieved approximately 4 points according to the JPO adequacy evaluation scores for both Items and Texts, and all evaluators rated over 70% of all pairs as 4 or 5. We examined these results and determined that most of these high-rated pairs consist of typical terms and sentences from timely disclosure documents, including long sentences. The sentences of Examples 1, 2, and 3 in Table 10 include important figures or proper nouns; in addition, the source sentences in Example 3 are long, and they were correctly translated. Moreover, the source sentences in Example 1 and 3 contain complex numbers with Japanese numerals; however, they were correctly translated by the systems. It is assumed that these sentences are typical in timely disclosure documents, and there are sufficient sentences for training models. Despite these scores, however, Table 9 shows that there are mistranslations of important figures and proper nouns. Mistranslations We determined that there were four patterns of mistranslations in these results: uncommon expressions, appearance of unrelated proper nouns, incorrect modifiers or determiners, and sentences that contained interpreted numbers. Table 10 shows various error types, which are analyzed below: Uncommon sentences and words used in timely disclosure documents tend to be mistranslated. The structure of the source sentences in Example 4 seemed to be uncommon in timely disclosure documents, and some sentences were scored low. In Example 4, some figures in the sample results were mistranslated and modified with irrelevant date. Moreover, in Example 5, names of people were rare in TDDC, and they were mistranslated. The abovementioned information implies that the translations of uncommon sentences are considerably affected by sentences in the training data that are similar but have different meaning. Some systems tended to translate sentences without subjects into sentences with incorrect subjects. As mentioned in Sections 2.2, Japanese sentences frequently omit subjects and objects that would normally be included in English. However, source sentences in Examples 6 and 7 that included \"当社\" (The Company) were sometimes translated to unrelated company names. Similarly, in Example 8, despite the lack of the subject, the translated sentence contained a specific personal name. To achieve accurate translation by machine translation systems, awareness of the context is required, otherwise unnatural or passive sentences are output. It is assumed that there were the same or similar sentences in the training data, and the subjects in English sentences contained proper nouns. There are some incorrect modifiers or determiners in these results. As mentioned Sections 2.1, in Japanese timely disclosure documents, there are many variable prefixes for dates. Some systems translated sentences containing these words with an incorrect year. For example, the source sen-tence in Example 9, \"当第 3 四半期連結会計期間末\" (the end of third quarter of this fiscal year) was translated as \"the end of the third quarter of FY 2015\" or \"the end of the third quarter of FY 2016\". In TDDC, there are sentences that contain interpreted numbers. For example, translation of the year from the imperial era name to AD requires machine translation systems to understand the conversion rules. Some systems appear to be able to translate these dates, but not every time, as shown in Example 7. As another example, a Japanese sentence in a document states \"X の伸長率は 99.4%となり ました。\" (Growth rate of X was 99.4%.); however, in an English document, it is stated that \"X declined 0.6%.\". The interpretation of numbers in Japanese-to-English translations is frequently seen in timely disclosure documents. In Example 10, these pairs in TDDC, which required the interpretation of numbers, were mistranslated. In conclusion, the following causes for these mistranslations are considered: • It is difficult to translate long sentences and proper nouns that TDDC does not contain. • Some source sentences are unclear owing to the lack of subjects and/or objects; thus, there is no suitable English translation without a context. • TDDC contains not semantically balanced pairs, and the systems may be considerably affected by either source pair sentences. Evaluation Subjectivity We determined two patterns of improper JPO adequacy scores owing to the subjectivity of evaluators: false positive and false negative. Some translations results include unrelated proper nouns and incorrect modifiers or determiners; however, some evaluators did not seem to consider those as deductions, such as Examples 6 to 9. We call these higher than expected scores as false positive. Some translations seem to be appropriate for sentences in TDDC that contain paraphrasing expressions; however, evaluators gave them low scores probably because they were not literal translations. For example, some systems correctly translated sentences that included interpreted numbers, but evaluators did not appreciate this and deducted points. In Example 10, one evaluator gave a score of 4 to the sentence that was identical to the reference sentence; however, the other evaluator gave a score of 1. We call these lower than expected scores as false negative. These false positive and false negative tendencies imply that it is necessary to create another evaluation criterion, which correctly evaluates the correctness of transmitted information to investors. Conclusion In this study, we introduced TDDC, which is a large-size parallel corpus of timely disclosure documents. The purpose of TDDC is to contribute to the improvement in machine translation of sentences in these documents. However, we predict that TDDC could be diverted for use in benchmarks for Named-Entity Recognition because the sentences in TDDC have particular useful characteristics with respect to proper nouns and figures. The results of the 6th WAT suggest that most sentences that are typical in TDDC and do not depend on context are translated correctly. However, there are mistranslations in sentences that contain words that are not present in TDDC or whose meaning changes depending on the context. Further consideration is needed to improve these translations, such as an expansion of language resources, context-aware machine translation systems, and suitable evaluation criteria for the timely disclosure task. TSE-listed companies disclose many timely disclosure documents every year. We should consider using the rich source of information in these documents to expand language resources in the Investor Relations field. The Company recognizes the return of profit to its shareholders as a key management priority. Result (4.5) Kyowa Hakko Kirin regards the return of profits to its shareholders as one of its key management priorities. Result (4.5) FANCL considers the distribution of profit to shareholders to be an important management issue. Of the total, non-consolidated net sales of mainstay B-to-B business grew 1.7% on a year-on-year basis and those of LOHACO declined 0.6%. Result (2.5) Of the total, non-consolidated net sales of mainstay B-to-B business grew 1.7% on a year-on-year basis and those of LOHACO declined 0.6%. Result (1.0) Of the total, non-consolidated net sales of mainstay B-to-B business grew 5.3% on a year-on-year basis and those of LOHACO declined 7.1%.",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 4.320199066265573e-07,
        "foundation": 1.9361263126072004e-07,
        "none": 1.0
    },
    "reasoning": "Reasoning: The article does not explicitly mention any funding sources for the research or the development of the Timely Disclosure Documents Corpus (TDDC). It focuses on the creation and analysis of the TDDC and its application in machine translation, without any reference to specific funding from defense, corporate entities, research agencies, foundations, or any other sources.",
    "abstract": "In this paper, we describe the details of the Timely Disclosure Documents Corpus (TDDC). TDDC was manually organized by aligning the sentences from past Japanese and English timely disclosure documents in PDF format published by companies listed on the Tokyo Stock Exchange. TDDC consists of approximately 1.4 million parallel sentences in Japanese and English. TDDC was used as the official dataset for the 6th Workshop on Asian Translation to encourage the advancement of machine translation.",
    "countries": [
        "Japan"
    ],
    "languages": [
        "English",
        "Japanese"
    ],
    "numcitedby": 0,
    "year": 2020,
    "month": "May",
    "title": "{TDDC}: Timely Disclosure Documents Corpus"
}