{
    "article": "In text processing, deep neural networks mostly use word embeddings as an input. Embeddings have to ensure that relations between words are reflected through distances in a high-dimensional numeric space. To compare the quality of different text embeddings, typically, we use benchmark datasets. We present a collection of such datasets for the word analogy task in nine languages: Croatian, English, Estonian, Finnish, Latvian, Lithuanian, Russian, Slovenian, and Swedish. We designed the monolingual analogy task to be much more culturally independent and also constructed cross-lingual analogy datasets for the involved languages. We present basic statistics of the created datasets and their initial evaluation using fastText embeddings. Introduction As an input, neural networks require numerical data. Text embeddings provide such an input, ensuring that relations between words are reflected in the distances and directions in high-dimensional numeric space. There are many distinct models producing embedding vectors, using different specialized learning tasks, e.g., word2vec (Mikolov et al., 2013b) , GloVe (Pennington et al., 2014) , and fastText (Bojanowski et al., 2017) . For training, the embeddings algorithms use large monolingual corpora. To compare the quality of different text embeddings, typically we use benchmark datasets. In this work, we present a collection of such datasets for the word analogy task in nine languages: Croatian, English, Estonian, Finnish, Latvian, Lithuanian, Russian, Slovenian, and Swedish. To make the datasets sensible for all languages, we designed the analogy task to be culturally neutral. Specifically, we avoided analogy categories that exhibit single culture or single country examples, such as NFL teams, US cities, or US states. The word analogy task was popularized by Mikolov et al. (2013c) . The goal is to find a term y for a given term x so that the relationship between x and y best resembles the given relationship a : b. There are two main groups of categories: semantic and syntactic. To illustrate a semantic relationship, consider for example that the word pair a : b is given as \"Finland : Helsinki\". The task is to find the term y corresponding to the relationship \"Sweden : y\", with the expected answer being y = Stockholm. In syntactic categories, each category refers to a grammatical feature, for example adjective degrees of comparison. The two words in any given pair then have a common stem (or even the same lemma), for example, given the word pair \"long : longer\", we see that we have an adjective in its base form and the same adjective in a comparative form. The task is then to find the term y corresponding to the relationship \"dark : y\", with the expected answer being y = darker, i.e. a comparative form of the adjective dark. In the vector space, the analogy task is transformed into vector arithmetic and we search for nearest neighbours, i.e. we compute the distance between vectors: d(vec(Finland), vec(Helsinki)) and search for word y which would give the closest result in distance d(vec(Sweden), vec(y)). In our dataset, the analogies are already prespecified, so we do not search for the closest result but only check if the prespecified word is indeed the closest, or alternatively, measure the distance between the given pairs. The paper is split into further four sections. In Section 2, we describe the analogy task, its origin, culture-independent design, structure, and how it can be used as a benchmark for evaluation of embeddings in monolingual and cross-lingual setting. In Section 3, we present the creation of the actual monolingual and cross-lingual datasets and the process of their adaptation to all involved languages. We present statistics and initial evaluations of the produced datasets in Section 4. Conclusion and plans for further work are described in Section 5. Analogy task for embedding evaluations We composed the analogy tasks for nine languages from the EMBEDDIA project 1 . The work is based on the English dataset by Mikolov et al. (2013a) 2 . Due to Englishand US-centered bias of this dataset, we removed some categories and added or changed some of the others as described below. Our dataset was first written in Slovene language and then translated to other languages as explained in Section 3.3. Following Mikolov et al. (2013a) , we limit the analogies to single word terms; for example \"New Zealand\" is not used as a term for a country, since it consists of two words. Note that due to language differences, the produced datasets are not aligned across languages. To assure consistency and allow the use of the datasets in cross-lingual analogies (described in Section 2.1), our datasets (even the English one) are somewhat different from the one by Mikolov et al. (2013a) . We removed or edited some categories and added new ones to avoid or limit English-centric bias in the following way. • We merged two categories dealing with countries and their capitals (\"common capital cities\" and \"all capital cities\") into one category. • We changed \"city in US state\" category to \"city in country\" and used mostly European countries with a better chance to appear in the corpora of respective languages. • We removed the category \"currency\", as only a handful of currencies are nowadays present in news and text corpora with sufficient frequency. • We added two new semantic categories, \"animals\" and \"city with river\" described below. • We added a syntactic category comparing noun case relationships. Cross-lingual analogies Cross-lingual word embeddings have two or more languages in the same semantic vector space. Cross-lingual word analogy task has been proposed by Brychcín et al. (2019) as an intrinsic evaluation of cross-lingual embeddings. Following their work, we compose cross-lingual analogy datasets, so that one pair of related words is in one language and the other pair from the same category is in another language. For example, given the relationship in English father : mother, the task is to find the term y corresponding to the relationship brat (brother) : y in Slovene. The expected answer being y = sestra (sister). We limited the cross-lingual analogies to the categories that all our languages have in common, i.e. we excluded the last three syntactic categories: genitive to dative, present to past, and present to other tense. Creation of datasets Once the relations forming the analogies were prepared, we used them to form the actual monolingual and cross-lingual datasets. The process consisted of three steps. In Sections 3.1 and 3.2, we describe the creation of monolingual and cross-lingual datasets from the relations, and in Section 3.3, we explain the translation procedure which lead to creation of datasets in all involved languages. Compiling monolingual dataset The actual construction of the analogy dataset started by forming baseline relations for each category. First, we manually wrote the relations one per line, where each relation consists of two words. In the family category, an example of such a relation is \"father, mother\". Next we combined all relations in each category with one another and wrote them in pairs, e.g., \"father, mother, brother, sister\" If a pair of relations share a common word, such a pair is excluded from the database. An example of forming relation pairs is shown in Table 1 . Relations Cross-lingual datasets Cross-lingual analogies described in Section 2.1 are compiled in a similar manner. Consider a language pair L 1 −L 2 . From the same one-relation-per-line files shown in the upper part of Table 1 , we combine all relations in a category in such a way that one relation from language L 1 and one relation from language L 2 form a pair. L 1 relations are on the left-hand side, and L 2 relations are on the right-hand side. An example of forming cross-lingual relation pairs is shown in Table 2 for English-Slovene language pair. The same rules for excluding pairs with common words apply, except that we do not consider translations of the same term as the same word, e.g., \"Nile\" (in English) and \"Nil\" (its Slovene equivalent) in the same entry are allowed, but using \"Nile\" twice is disallowed. Relations Translation procedure When the first dataset in Slovene was formed, we translated it into other languages (including English). We used various tools to help us translate Slovenian dataset to the other languages. For the geographic data, i.e. names of countries, cities and rivers, we used the titles of equivalent Wikipedia articles or data from Wikipedia lists, such as the list of capital cities. If an entity had a name consisting of more than one word in another language, it was either skipped or replaced by another entity with subjectively similar location and/or importance. The same was done in cases where we would have a relation of type \"x : x\", which is nonsensical. For example, in Lithuanian Algeria and its capital Algiers are both called \"Alžyras\". So we replaced it with \"Damaskas : Sirija\" (in English this would correspond to \"Damascus : Syria\"). For non-geographic words, we mostly used Babelnet 3 and Wiktionary 4 to find the translations. In the latter, we mostly relied on conjugation and declination tables of our key words. Wiktionary was also used for finding new examples for relations in syntactical categories, to replace those for which a translation was either impossible or could not be found. This was most often the case in all the categories operating with adjectives. An example of an impossible translation is the Slovene relation \"drag : dražji\". Its English translation is \"expensive : more expensive\". Since we are limited to single-word terms, we discarded that translation and replaced such a relation with another one, with either a similar meaning \"costly : costlier\", or a completely different one, like \"high : higher\", provided it does not already appear in the dataset. English and Swedish languages do not have noun cases or rather only have genitive case (in addition to nominative) in a very limited sense. We decided to exclude the \"genitive to dative\" category for these two languages. Further more, while Finnish and Estonian have many noun cases, none of those cases is dative. We exchanged dative in this category with allative case, which mostly covers the same role. For two categories, \"city with river\" and in a smaller part \"city in country\" we intentionally varied the entries across languages more than in other categories, where it was only done so out of necessity. We felt certain relations are too locally specific to frequently (or at all) appear in other language corpora. We removed most of such relations in other languages and tried to replace them with other relations more geographically local to that language, in order to keep the number of different countries or rivers high. Majority of the relations in these two categories is still the same for all languages. The translated relations were checked by native speakers of each language and corrected where deemed necessary. Statistics and evaluation In this section, we first present relevant statistics of the created datasets, followed by their evaluation using fastText embeddings. Statistics The original English analogy dataset by Mikolov et al. (2013a) The number of pairs in cross-lingual datasets is smaller, because some categories were omitted. We created crosslingual datasets for all 72 language pairs. The exact sizes of datasets for a few selected pairs are shown in Table 4 . Not all categories are equally represented, some have much more relation pairs than others. We tried to downplay the importance of the category \"capitals and countries\", which is very prominent in the dataset by Mikolov et al. (2013a) , however, it is still by far the largest category in our dataset. Some categories are necessarily small, like \"family\", since the number of terms for family members is relatively small. That is especially true for languages from northern Europe, so we also included plural terms and some non-family members in that category, like a relation \"king : queen\". Language pair The number of analogy pairs per category (averaged over all languages) is shown in Evaluation We evaluated the analogy datasets using the fastText (Bojanowski et al., 2017) embeddings 5 . The fastText embeddings use subword inputs which are suitable also for morphologically rich languages, we processed. We limited the evaluation to the word vectors of the 200,000 most frequent tokens from the embeddings of each language. Not all analogy pairs can be evaluated in that way, since some words do not appear among the first 200,000 words. The amount of pairs that are covered (i.e. all four words from the analogy are among the most frequent 200,000 words) for each language is shown in the the number of times the closest word vector was vector of the word d. The results for all languages per category are shown in Table 7 . The results show that not all relations are recognized with the same accuracy across languages, the differences being large and surprising in some cases. This hints that there is a considerable space for improvement in construction of word embeddings. Error analysis We took a closer look at some of the categories with the largest differences in evaluation scores between Slovenian and English. The differences are on average the largest between these two languages. The category \"Capitals and countries\" has an excellent score in English, but in Slovenian, the predictions face three issues: country names endings, morphological richness of the language and generally weak word embeddings, possibly due to low frequency of certain words considered in the analogy dataset. As the top part of Table 8 demonstrates. some country names in Slovenian are homonymous to that country's adjectival form (\"-ska\" and \"-ška\" endings\"). When we search for the word vector, closest to d, we often get the adjectival form of country d instead of the country's name. Another frequent error is that we get the same word as c, just in a different case (bottom part of Table 8 ). Finnish, also a morphologically rich language, scores much better in this category. Although, it does not seem to suffer from the first identified issue in Slovenian, it does suffer from the second issue, just much less frequently. This leads us to believe, that the problems identified are avoidable with even larger datasets and better quality of embeddings. Several examples of identified issues in Slovenian in the category \"Superlative adjective\" are shown in Table 9 . Common issues are the adjectives with the opposite meaning, synonyms, and other forms of adjective comparison. An example of the latter is, given the base adjective \"velik\" (big), the superlative form is \"največji\" (the biggest), but the predicted word is \"prevelik\" (too big). If we choose the correct prediction not only from the nearest word, but from n nearest words, the evaluation scores increase in all languages in all categories. The differences between different languages then also significantly decrease. We report the scores for values of n equal to 3, 5, and 10 in Tables 10, 11, and 12, respectively. Conclusion We prepared word analogy datasets for nine languages. The datasets are suitable for evaluation of monolingual embeddings as well as cross-lingual mappings. We describe the choice of 15 categories, 5 semantic and 10 syntactic, and an effort to make them language and culture neutral. While the resulting datasets in nine languages are not aligned, they are nevertheless compatible enough to allow creation of cross-lingual analogy tasks for all 72 language pairs. We present basic statistics of the created datasets and their initial evaluation using fastText embeddings. In the third column is the best prediction of the word from the second column, as described in Section 4. Each example has an English translation in the line below the example. cate large differences across languages and categories, and show that there is a substantial room for improvement in creation of word embeddings that would better capture relations present in the language as distances in vector spaces. Gladkova et al. (2016) criticised that many analogy datasets are unbalanced. We have tried to improve on this issue, but further work is needed to completely mitigate it. Additionally, the dataset can be improved by adding more categories. Bigger Analogy Test Set (BATS) for English features 40 categories (Gladkova et al., 2016) , though many of its categories are English language specific. As a further challenge we see creation of similar intrinsic evaluation tasks for the assessment of contextual embeddings. Such tasks would require that the existing analogies are used in sentences or other broader contexts. The datasets of word analogy tasks for all nine languages and all language combinations are publicly available on the Clarin repository 6 . Acknowledgements We thank to native speakers that checked the respective monolingual analogies: Dace Linde (Latvian) and Andrei Šumakov (Russian). The work was partially supported by the Slovenian Research Agency (ARRS) core research programme P6-0411. This paper is supported by European Union's Horizon 2020 research and innovation programme under grant agreement",
    "abstract": "In text processing, deep neural networks mostly use word embeddings as an input. Embeddings have to ensure that relations between words are reflected through distances in a high-dimensional numeric space. To compare the quality of different text embeddings, typically, we use benchmark datasets. We present a collection of such datasets for the word analogy task in nine languages: Croatian, English, Estonian, Finnish, Latvian, Lithuanian, Russian, Slovenian, and Swedish. We designed the monolingual analogy task to be much more culturally independent and also constructed cross-lingual analogy datasets for the involved languages. We present basic statistics of the created datasets and their initial evaluation using fastText embeddings.",
    "countries": [
        "Estonia",
        "Slovenia",
        "Finland"
    ],
    "languages": [
        "English",
        "Estonian",
        "Lithuanian",
        "Finnish"
    ],
    "numcitedby": "10",
    "year": "2020",
    "month": "May",
    "title": "Multilingual Culture-Independent Word Analogy Datasets"
}