{
    "article": "The methodology developed within the FrameNet project is being used to compile resources in an increasing number of specialized fields of knowledge. The methodology along with the theoretical principles on which it is based, i.e. Frame Semantics, are especially appealing as they allow domain-specific resources to account for the conceptual background of specialized knowledge and to explain the linguistic properties of terms against this background. This paper presents a methodology for building a multilingual resource that accounts for terms of the environment. After listing some lexical and conceptual differences that need to be managed in such a resource, we explain how the FrameNet methodology is adapted for describing terms in different languages. We first applied our methodology to French and then extended it to English. Extensions to Spanish, Portuguese and Chinese were made more recently. Up to now, we have defined 190 frames: 112 frames are new; 38 are used as such; and 40 are slightly different (a different number of obligatory participants; a significant alternation, etc.) when compared to Berkeley FrameNet. Introduction Frame Semantics (Fillmore 1982) , and more specifically the methodology developed within the FrameNet project (Fillmore and Atkins 1992; Ruppenhofer et al. 2016 ) is being used for the development of resources in an increasing number of specialized fields of knowledge. Projects can lead to stand-alone resources based on FrameNet or to proposals to increase the lexical coverage of Berkeley FrameNet with the addition of specialized terminology. These projects deal with various fields of knowledge, such as biology (Dolbey et al. 2006) , football (Schmidt 2009 ; Dicionário da copa de mundo 2020), law (Pimentel 2013) , computing (Ghazzawi 2016) , linguistics (Malm et al. 2018) , and the environment (the resource presented in this article). Other terminology projects, such as EcoLexicon (Faber et al. 2016) in the field of the environment, apply Frame Semantics without referring explicitly to the FrameNet methodology. For designers of specialized resources, the FrameNet methodology is especially appealing as it first allows them to capture the conceptual background of domain-specific knowledge. As pointed out by Fillmore and Baker (2010) , acquiring new specialized concepts requires a background of other, more familiar concepts: […] as with the mathematical concept mantissa, which requires previous familiarity with such concepts as base, power, logarithm, decimal point, and, of course, the conceptual prerequisites of each of these in turn. (Fillmore and Baker 2010:317) Authors also point out that the process of acquiring specialized concepts require \"a lengthy chain of prior learning as a prerequisite to attaining the new concept.\" (Fillmore and Baker 2010:317) Additionally, the FrameNet methodology allows designers of specialized resources to account for the linguistic properties of terms and to connect these properties to a conceptual background. Traditionally, specialized resources have focused on providing explanations (in some cases, very detailed ones) about the knowledge conveyed by terms, giving very few details about the linguistic behavior of these terms. It is often assumed that this information can be found in other, perhaps more general resources. Things are changing though as work on corpora emphasizes the need for a deeper understanding of linguistic behavior. This paper presents a methodology for the development of a multilingual resource that accounts for environment terms. The resource, called Framed DiCoEnviro (2020), covers various topics, such as climate change, renewable energy, transport electrification, endangered species, and sustainable agriculture. It includes Chinese, English, French, Portuguese (Lamberti 2019) and Spanish terms. 1 (The coverage varies considerably from one language to another as some projects started only recently). Additionally, besides French and English, topics covered in different languages vary. After listing some lexical and conceptual differences that must be managed in domain-specific resources (Section 2), we describe the steps of our methodology and explain to what extent the FrameNet methodology needed to be adapted (Section 3). We conclude by providing some figures regarding the work we have done up to now and mention some directions we wish to take in the future. Why Developing \"FrameNets\" in Specialized Fields of Knowledge is not a Trivial Task Specialized knowledge and terms used to express it can be unknown to the layperson, as is the case with mantissa mentioned in the previous section. However, such clear-cut cases do not exhaust all possible ways to convey specialized knowledge. Indeed, specialized and common knowledge interact in various situations and influence each other in different ways. In addition, terms are often based on the lexical stock of languages and share with lexical units a complex set of relationships (L'Homme and Polguère 2008). A common mechanism to create terms consists in adding new meanings to existing lexical items (e.g. green meaning \"that is less damageable to the environment\"). Other, much subtler changes can also affect the way lexical items are used in specialized situations. Fillmore pointed out that, although the concepts of INNOCENT and GUILTY can be known to laypeople, they are conceptualized differently when considered from the perspective of law. In both everyday language and legal language there is a contradictory opposition between INNOCENT and GUILTY. In everyday language, the difference depends on whether the individual in question did or did not commit the crime in question. In legal language, by contrast, the difference depends on whether the individual in question has or has not been declared guilty by the court as a result of a legal action within the criminal system. (Fillmore 1982:127) Such differences can be observed in many other fields of knowledge. In the environment, which is the field that we are concerned with in this article, situations that may seem familiar at first sight are considered in a way that contrasts with what we will call everyday situations. We examine a simple example, i.e. a situation that involves species that live in a specific location, and consider it from the perspective of endangered species. We will compare this situation to a similar one captured in FrameNet (which is considered here, although this is not entirely the case, as a reference for \"everyday situations\"). 2 In contrast with the mantissa example, everybody has at least basic knowledge about this situation. 3 We could assume that it is closely related to the situation captured in the RESIDENCE Frame, which is defined as follows: This frame has to do with people (the Residents) residing in Locations, sometimes with a Co-resident (FrameNet 2020). In both cases, living entities make use of locations for shelter and to carry out daily activities. However, a closer look soon reveals that many differences can be spotted between the situation as it is described in FrameNet and a situation in which species are involved. The first one is that the perspective taken in FrameNet concerns human beings. Other differences are listed below. Lexical content of frames. It appears that some lexical units that can evoke the RESIDENCE frame cannot apply to species. Indeed, some lexical units only apply to human beings (e.g. resident, squatter) and others only to species (e.g. nest) (Table 1 ). RESIDENCE in FrameNet RESIDENCE in the environment bivouac .n, bivouac.v, camp.n, camp.v, camped.a, camper.n, dwell.v, dweller.n, inhabit.v, inhabitant.n, live.v, lodge.v, occupant.n, occupy.v, reside.v, resident.n, room-mate.n, room.v, shack up.v, squat.v, squatter.n, stay.v, tenant Core and non-core frame elements (FEs). Core and noncore frame elements can vary when considering the RESIDENCE situation from the perspective of endangered species. The Co-resident core FE has no correspondence in the field of endangered species. On the other hand, the range in which a given species can be found is often specified. Relations between frames. When considering a residence situation from the point of view of endangered species, the fact of living in a given area is closely linked to other situations that concern the state of this species. Species can spread in small or large areas; they can also settle in locations in larger and larger numbers. Species are also vulnerable to certain threats that will cause them to be less abundant in an area or even disappear. Finally, measures can be taken to place species in an area so they can start occupying it again. In other words, the relations shared by situations from the point of view of endangered species differ sharply from those described in FrameNet (Figure 1 ). This simple example is by no means an exceptional case. Many more examples could be mentioned in which situations are similar or do not differ drastically from other more common situations. However, differences emerge at many descriptive levels (lexicon, frame as was discussed above) given that entities and events can be conceptualized differently in specialized fields of knowledge. On a lexical level, differences in conceptualization result in subtle \"meaning modulations\" 4 that we differentiate from polysemy per se and are much more difficult to pinpoint using standard lexico-semantic criteria. For instance, the verb introduce denotes an activity whereby someone places a species in an area where it can live and reproduce (Toad populations, predatory fish should not BE INTRODUCED into breeding ponds). It is related to reintroduce and introduction and is opposed to eliminate and extirpate. In everyday language, introduce includes many more activities in which someone places something in a given location. Given the use of introduce in everyday language, it is linked to a much larger set of different lexical units (LUs) (such as imbed, implant, insert, place, etc.). It would be difficult to contend that we are dealing with a completely new meaning in the field of endangered species (as was the case with green mentioned earlier). Furthermore, some distinctions can be relevant when considering lexical units from the perspective of a specialized domain but would not be made in other contexts. For instance, the verb hunt lends itself to two different uses in corpora that deal with the environment. One corresponds to the activity whereby a meat eater chases, captures and kills other animals for food; the second corresponds to the activity carried out by modern human beings that consists in chasing animals for other kinds of reasons, this activity having a negative impact on the conservation of species. Hunt1 is linked to other terms, such as predation, and to prey; while hunt2 is linked to poach, capture, and fish (Figure 2 ). In order to account for these phenomena, designers of specialized resources can build stand-alone resources for specific fields of knowledge. This strategy certainly has the advantage of allowing designers and users of these resources to focus exclusively on the way situations are conceptualized in a given area of knowledge. However, the relationship with common knowledge and the general lexical stock of languages is lost. This strategy also implies that stand-alone resources need to be compiled each time a new domain or topic is targeted. Another approach -which is the one taken in this workconsists in situating terminology within the broader spectrum of the lexicon. This will allow us to connect specialized meanings and usage to a more \"general\" lexicon. By doing so, we must also attempt to better define what is specific to a given field of knowledge and what this field of knowledge shares with language in general. A Methodology Adapted to Specialized Fields of Knowledge Our methodology is bottom-up (Schmidt 2009) as in many other terminology projects. Terminologists are not experts of the fields they are asked to account for, especially when they recently embarked on a project. They must rely on knowledge sources to identify relevant terms and describe them. The first five steps of the methodology consist in compiling terminological entries. This part of the work is heavily based on Explanatory Combinatorial Lexicology (Mel'čuk et al. 1995) and is implemented in a terminological resource called the DiCoEnviro (2020). Once these entries contain enough linguistic data, we As was mentioned above, our resources account for terms in different languages and more could be added in the future. The first five steps of the methodology are applied to languages separately. Native speakers or near native speakers of each language are responsible for building lexical entries. The definition of semantic frames can take into account terms in different languages. Compilation of Corpora Since terminologists are seldom experts of the field they describe, they rely heavily on the contents of corpora to locate relevant terms and information about their uses. Hence, all terminological projects start with the compilation of a corpus. Since the field of the environment encompasses a wide range of subjects and that the terminology and the number of occurrences of given terms can vary quite drastically from one subject to another, we work on separate topics and compile a corpus accordingly. When we embark on a new project, we start with corpora of about 500,000 words (this corresponds roughly to 30-40 different texts of varying sizes ranging between 1,000 to 50,000 occurrences). Corpora are often enriched at a later stage (for instance, our English corpus on endangered species now amounts to around 1,060,000 tokens and comprises 88 different texts). Identification of Terms Once a corpus on a specific topic is compiled, we proceed to identify relevant terms. We first approach this task with an automated method that produces a list of candidateterms. We submit our corpus to a term extractor, called TermoStat and developed by Drouin (2003) , and have it search for nouns, verbs, adjectives and adverbs. The term extractor compares the content of a specialized corpus to a reference corpus. For English, the latter is a combination of the British National Corpus (BNC) and the American National Corpus (ANC). More specifically, the extractor compares lemmatized and part of speech tagged units in both corpora and produces a list of candidate terms ranked according to their specificity in the specialized corpus. This specificity is a reflection of the unusual frequency of the unit in the specialized corpus. The hypothesis underlying this method is that unusually frequent units correspond to terms. Table 2 shows the first results of this method applied to our corpus of endangered species. Terminologists must then analyze this list, keep those candidates that correspond to relevant terms, and ignore other lexical items. Although some cases do not raise problems (e.g. species, habitat), others might be more problematic (e.g. recovery). Terminologists look up problematic cases in the corpus to examine the context in which they appear. Extraction of Contexts The third step of the methodology consists in going back to the corpus and retrieving contexts that will be placed in lexical entries. These contexts are extremely useful to analyze terms and complete other parts of their description. Contexts are also annotated, as will be seen further on. For each term, terminologists extract 15 to 20 different contexts. These are selected according to the richness of the information they contain (presence and number of participants, argumental or circumstantial status of each participant, explanations of the meaning, etc.). Experience has shown that 15 to 20 contexts per meaning are sufficient to give a clear picture of how terms behave in a specialized corpus. Beyond that point, the information becomes redundant. At this stage, terminologists might make meaning distinctions they missed during the previous step. Since different meanings are described in separate entries, contexts must reflect these distinctions and be placed in the right entry. Definition of Argument Structure The fourth step consists in defining the argument structure of terms. This step -albeit central in our methodologydoes not apply to terms that are non-predicative (e.g., animal, organism, plant, wolf). At this stage, terminologists determine how many arguments a term has and state these arguments in the entry (habitat of X; X inhabits Y). Arguments are represented with two different systems. We first label them with semantic roles that express the relationship between the term and its arguments. The labels used for the arguments of inhabit are: Patient inhabits Location. 6 An additional label states what we call the typical term (Species inhabits Area). This typical term is designed to give the user an idea of the kinds of terms that can instantiate the arguments. Annotation of Contexts Once the argument structure is defined, terminologists proceed to annotate the set of contexts based on the methodology devised for the FrameNet project (Ruppenhofer et al. 2016) . The examples selected below represent a sample of the annotated contexts for the term inhabit. Once these first five steps are completed, we obtain terminological entries that contain a statement of the argument structure and up to 20 annotated contexts (Figure 3 ). Terminologists then proceed to identify terms that are likely to evoke the same frame. Definition of Semantic Frames Given that our methodology is bottom-up, the identification of frames is first guided by different lexicosemantic properties of terms that are described in their entries:  The same number of arguments: e.g., inhabit, live and occupy have two arguments.  Arguments of a similar nature: e.g. the arguments of inhabit, live and occupy are labelled as Patient (L'Homme (2015) . Frame elements in FrameNet are relevant within a specific frame. In our resources, labels should be applied to large sets of terms. and Location, and are instantiated by terms that denote living organisms and/or habitats (Patient; animal, fish, species, etc.; Location: coast, environment, habitat, reserve, etc.).  Shared circumstantials (found in annotations). Of course, shared participants are useful clues to identify terms evoking the same frame, but terminologists must define the content of frames based on much more information. Terms must denote the same general situation and share presuppositions about it (Ruppenhofer et al. 2016) . Hence, based on our descriptions, we could establish that the terms inhabit, live and occupy evoke the same situation, whereby a living entity finds itself in a given location that should provide it with what it needs to feed, reproduce and survive. To help them define frames, terminologists also refer to Berkeley FrameNet (2020). They look for corresponding data in the English data. To assist them in this process, a tool compares the XML versions of both resources (Figure 4 ), locates corresponding lemmas and extracts relevant information. If a frame was already encoded in FrameNet and that the data it describes fits the properties of the terms in the field of endangered species, the frame defined in FrameNet is used and adapted. For instance, this was possible for the terms inhabit, live and occupy. We thus based our frame on the one in FrameNet. Of course, many differences appear in the descriptions given in each resource (different lexical content, labels used for participants, etc., see Section 2). Furthermore, when we base our frame on an existing one in FrameNet, we use the same name and provide a link that will lead users to its description in the original FrameNet resource. 7 7 Users can also view the similarities and the differences between frames as they are represented in FrameNet and those that appear Of course, there are many cases for which no correspondence can be established and we must also create frames that account for our specific data. More than half of the frames that appear in the Framed DiCoEnviro were defined specifically to account for situations in the field of the environment. For instance, a new frame needed to be created to account for the meaning distinction that was mentioned above for the verb hunt. In these cases, we create a name that attempts to be evocative of the situation that it represents. Encoding of Frames Once frames are defined, they are encoded in an entry that accounts for the following:  The name of the frame.  A definition formulated for the field of the environment and stating the obligatory participants.  Example(s) for each of the languages described.  An indication of the reference to FrameNet with a hyperlink to FrameNet wherever relevant.  The list of participants (obligatory and optional ones).  The list of terms that evoke this frame in different languages; hyperlinks to the DiCoEnviro are provided to visualize terminological entries and contextual annotations. Definition of Relations Between Frames Situations are connected in different ways, and frames that capture these situations can be linked so as to make these connections explicit. For instance, the SPECIES_COLONIZATION frame (with LUs such as colonize, Summary This article presented a bottom-up methodology to compile FrameNet-like domain-specific resources. We applied this methodology to different environmental topics and to different languages. Our descriptions are first placed in a terminological resource, called DiCoEnviro (2020). Based on these terminological descriptions, we proceed to identify frames. Once a frame is identified and defined, terminological entries are linked to a frame module that is superimposed on terminological entries and that is visible in another resource called the Framed DiCoEnviro (2020). Up to now, 190 frames were defined. We first applied our methodology to French and then extended it to English. Our infrastructure can easily be adapted other languages and entries in Spanish, Portuguese and Chinese are currently being added. However, the nonavailability of tools can raise problems in certain languages. For instance, the term extractor TermoStat has not yet been adapted to Chinese. In this case, an alternative solution needed to be sought. When defining frames, we refer to Berkeley FrameNet. In many cases, an existing frame can be used or adapted to our data. However, in many other cases (more than half), a new frame is created. More specifically, 112 new frames were created; 38 are used as such; 40 are slightly different (a different number of obligatory participants; a significant alternation, etc.). Future Work The work reported in this article is ongoing. New terminological entries are added in different languages on a regular basis. Some of these entries can be assigned to existing frames or lead to the definition of new frames. We also extend the coverage of the DiCoEnviro by adding terms linked to new environmental topics. Our methodology and infrastructure can easily be extended to new languages. However, as was mentioned above, some tools might not be available for some languages; in these cases, adjustments need to be made. As the descriptive work progresses in different languages, we should get a clearer picture of interlinguistic differences and the levels at which they occur (lexicon, frame). The relationship with Berkeley FrameNet is visible through the Framed DiCoEnviro and this allows users to visualize similarities and differences between domain-specific and \"everyday\" situations to a certain extent. It would also be interesting to establish a connection the other way around, i.e. allow users of FrameNet to view how situations can be conceptualized differently in specialized areas of knowledge. For the time being, interrelationships between the two resources can only be made manually due to several methodological differences that exist between them. However, it would be useful to attempt to mitigate these differences in order to capture most of them automatically. Acknowledgments The authors wish to thank collaborators who work on the different versions of the DiCoEnviro and Framed DicoEnviro: Maria Francesca Bonnadona, Flávia Lamberti Arraes, and Zheng Ying. They also extend their thanks to two anonymous reviewers who raised many interesting points and whose comments helped clarify parts of the paper.",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 0.0,
        "foundation": 0.0,
        "none": 0.9999943230348141
    },
    "reasoning": "Reasoning: The article does not provide any specific information regarding funding sources for the research or project it discusses. Without explicit mention of support from defense branches, corporations, research agencies, foundations, or an indication of no funding, it is not possible to accurately attribute any funding sources."
}