{
    "article": "This paper reports on an extended version of a synonym verb class lexicon, newly called SynSemClass (formerly CzEngClass). This lexicon stores cross-lingual semantically similar verb senses in synonym classes extracted from a richly annotated parallel corpus, the Prague Czech-English Dependency Treebank. When building the lexicon, we make use of predicate-argument relations (valency) and link them to semantic roles; in addition, each entry is linked to several external lexicons of more or less \"semantic\" nature, namely FrameNet, WordNet, VerbNet, OntoNotes and PropBank, and Czech VALLEX. The aim is to provide a linguistic resource that can be used to compare semantic roles and their syntactic properties and features across languages within and across synonym groups (classes, or 'synsets'), as well as gold standard data for automatic NLP experiments with such synonyms, such as synonym discovery, feature mapping, etc. However, perhaps the most important goal is to eventually build an event type ontology that can be referenced and used as a human-readable and human-understandable \"database\" for all types of events, processes and states. While the current paper describes primarily the content of the lexicon, we are also presenting a preliminary design of a format compatible with Linked Data, on which we are hoping to get feedback during discussions at the workshop. Once the resource (in whichever form) is applied to corpus annotation, deep analysis will be possible using such combined resources as training data. Introduction The aim of the presented research is to create a linked lexicon of bilingual Czech-English synonyms, now openly available in version 1.0 (Urešová et al., 2019) . Synonyms are extracted from translated texts of the Prague Czech-English Dependency Treebank corpus. A functionally adequate relationship in terms of translation must exist between the meaning of the English and the Czech verbs, i.e., the English and the Czech verb(s) are considered synonymous in the given context(s) if the translated verb adequately expresses the functional intent of the original. We aim for each synonym class to be characterized both meaning-wise (verb sense(s), semantic roles) and structurally (valency arguments) by linking (mapping) semantic roles and valency members (Role ↔ Argument mapping). This paper synthesizes previous work on the lexicon to comprehensively describe its version 1.0 published in connection with this paper (and under a new name that reflects future direction from bilingual to multilingual entries), but it also adds -on top of a comprehensive description of lexicon structure and the process of its creation -a number of interannotator agreement evaluation experiments (Sect. 4) and a first attempt at defining a Linked Data scheme for it (Sect. 5). The paper is structured as follows. In Sect. 2, structure and content of the lexicon are described. The resources used and linked to are presented in Sect. 3. Sect. 4 contains a description of the process by which the lexicon has been created, i.e., the annotation process and interannotator agreement (IAA) analysis. The principles of (re)structuring and (re)formatting the links to Linked Data format are described in Sect. 5, and related work is described in Sect. 6. We summarize our work and outline future plans in Sect. 7. Structure and Content of the Lexicon The SynSemClass lexicon -formerly CzEngClass, whose previous preliminary versions as well as various aspects of its theoretical basis and the annotation process are described in (Urešová et al., 2019a; Urešová et al., 2018a; Urešová et al., 2018e; Urešová et al., 2018d; Urešová et al., 2018c; Urešová et al., 2018b) -builds upon the PCEDT parallel corpus (Sect. 3.1) and the existing internal resources, namely CzEngVallex, and EngVallex lexicons (Sect. 3.2) . On top of that, other lexical databases, namely FrameNet, VerbNet, PropBank, OntoNotes and WordNet (Sect. 3.2) are used as additional sources, and links are annotated and kept between their entries and the SynSem-Class entries. The overall scheme of the lexicon with an example of one class entry is depicted in Fig. 1 . Each synonym class contains Czech and English verbs (verb senses) that have similar meaning. The latest version of SynSemClass captures 3515 verb senses with 2027 on the English and 1488 on the Czech side. The synonymous senses are represented as valency frames (of generally different verbs) and they are called Class Members. Each class is assigned a common set of semantic roles, called a Roleset. A Roleset contains the core \"situational participants\" common for all the Class Members in one class. When determining Class Membership for a potential candidate verb (sense), the Roleset also serves as a source of context information: if all the semantic roles from the Roleset can be mapped to valency slots (labeled by a \"functor\" in the valency theory (Panevová, 1974) within the Functional Generative Description, or FGD (Sgall et al., 1986) , framework) for the given verb sense as recorded in its valency frame in the appropriate valency lexicon (and vice versa), it is deemed-together with the approximate sense match to the other Class Members-as belonging to Figure 1 : The overall scheme of the SynSemClass lexicon and an example of a class (\"complain-stěžovat si\") that synonym class. As a result, each Class Member has its valency frame slots mapped to the semantic roles kept in that class' Roleset. 1 The valency frames of different Class Members of one SynSemClass class are thus \"compatible\" through the mapping to the Roleset, even if they possibly differ in their argument labels (valency slot functors). Some typical Rolesets: • Class \"klesnout-decline\": Item, Initial_value, Fi-nal_value, Difference • Class \"nabídnout-offer\": Offerer, Recipient, En-tity_offered, Entity_received • Class \"chránit-defend\": Defender, Asset_Patient, Harmful_situation While the role labeling system is still preliminary, we strive to have the names semantically descriptive in nature (i.e., Offerer instead of Agent), and we keep the convention that for better human understanding, we use an underscore for signalling an \"or\" when the following word is capitalized (as in Asset_Patient), as opposed to a mere use of multiple words to describe the role, in which case the next word is not capitalized (Final_value). When mapping the roles from a given Roleset, each of the roles must be mapped to \"something\" from the valency frame of a verb in that class; that \"something\" may be • either a member of the valency frame, • or any other free modification to which the given semantic role might be mapped, • or a proxy semantic participant (#any, #sb, #sth). Conversely, each member of the valency frame of a verb listed in the given synonymous class must be mapped to a semantic role from the assigned Roleset. 2 If any member of the valency frame of a potential Class Member of the given synonymous class really cannot be mapped to the chosen Roleset of that class, then that candidate Class Member cannot be included in the class. Class Members are further linked to the original resources used (the parallel Czech-English treebank and the Czech and English valency lexicons) and also to other external resources (see Sect. 3). A simplified example of the synonym class \"complainstěžovat si\" is shown in Fig. 1 . It schematically shows the SynSemClass lexicon on the left with its entries (= classes), and an example synonym class in the form of a table with the additional annotation available for this entry. Most importantly, the table shows the Argument mapping between the roles in the common Roleset for this class (which in this case contains three semantic roles: Complainer, Addressee (of the complaint) and Complaint) and the individual Class Members' arguments from the PDT-Vallex and EngVallex lexicons. While in most cases the mapping is straightforward (as is the case of the valency slot ACT, which is mapped to Complainer for all the Class Members shown in Fig. 1 ), in some cases there is a need to specify certain restrictions (e.g., restrict the mapping between ADDR and Addressee to the use of the preposition \"to\") or a combination of arguments (slot names) mapped to a single semantic role (PAT|EFF is mapped to Complaint for the Czech Class Member \"st ěžovat si\"). For more details about this mapping and its annotation, see Sect. 4.3. The links to external resources follow -for English, they contain the OntoNotes sense number (e.g., 1, or a hyphen if no OntoNotes sense to map to is available for the given verb sense), FrameNet frame name (Complaining), Prop-Bank roleset number (e.g., gripe.01) and WordNet sense number (e.g., #1). Alternatives may exist (e.g., for Word-Net senses -see grumble, which maps to both grumble#1 as well as grumble#2 in WordNet). Czech verbs are linked only to the VALLEX lexicon (Lopatková et al., 2016) , and in the future, they will also map to Czech WordNet. Examples are selected from the available corpora, in this case from the Prague Czech English Dependency Treebank (PCEDT), which is a parallel version of the WSJ part of the Penn Treebank (WSJ section and sentence ID number is used in Fig. 1 , see also Sect. 3.1) . These examples are selected so that they best characterize the corresponding verb sense as included in the particular class. The extended version of SynSemClass (Urešová et al., 2019) is openly available in the LINDAT/CLARIN repository 3 contains 145 synonym classes with 3515 verbs fully annotated in Step 2, out of which 57 classes are also annotated in Step 3. For more details on the annotation process and its Steps see Sect. 4. Resources Used and Linked to In this section, we describe the main corpus used as the source of evidence for creating the SynSemClass lexicon entries (= the synonym classes), and the lexical resources used for both identifying the Class Members as well as linking them to the external lexicons. The Corpus As described in previous papers on this resource (Urešová et al., 2019a; Urešová et al., 2018a; Urešová et al., 2018e; Urešová et al., 2018c; Urešová et al., 2018b) , for evidence examples, we use the parallel Prague Czech-English Dependency Treebank 2.0 (PCEDT 2.0) (Hajič et al., 2012) . This corpus contains approx. 50 thousand aligned sentence pairs. The English side is the WSJ part of the Penn treebank (Marcus et al., 1993) ; it has been translated to Czech by professional translators. Each language part is enhanced with a rich manual linguistic annotation in the Prague Dependency Treebank (PDT 2.0) style (Hajič et al., 2006; Hajič et al., 2018) which is based on the Functional Generative Dependency (FGD) framework (Sgall et al., 1986) . For the purpose of our work, it is important that the annotation captures aligned surface dependency trees and deep syntacticosemantic (tectogrammatical) trees across the two languages on sentence and node levels. Moreover, at the deep (tectogrammatical) layer, each verb node (occurrence) is assigned a valency frame, also representing a verb sense, by way of using its ID which identifies it in the associated valency lexicons, PDT-Vallex and EngVallex (Sect. 3.2). Linked Lexical Resources When building the synonym classes, we proceed from the PDT-style valency lexicons which are an integral part of the PCEDT. The existing annotation of PCEDT by the valency lexicon entries has helped to seed the SynSemClass lexicon and also to get real-world examples. For Czech verbs, PCEDT uses the Czech valency lexicon called PDT-Vallex (Urešová et al., 2014) , (Urešová, 2011) , while for English verbs, the English valency lexicon EngVallex (Cinková et al., 2014) is used. The most important links come from the CzEngVallex lexicon (Urešová et al., 2015) , (Urešová et al., 2016) , a bilingual valency lexicon which combines PDT-Vallex and EngVallex entries and contains not only Czech and English verbs which are translation equivalents to each other but it also captures mapping among their valency arguments. The individual Class Members in SynSemClass are further mapped to the following external lexical resources: FrameNet (Baker et al., 1998; Fillmore et al., 2003) , Verb-Net (Schuler, 2006) , PropBank (Palmer et al., 2005) , senses from OntoNotes Groups (Pradhan and Xue, 2009) , English WordNet 4 and Czech Vallex (Lopatková et al., 2016) . 5 Creating the Lexicon SynSemClass is being built strictly \"bottom-up\", i.e., from the corpus and existing lexical resources towards the new synonym lexicon. Since the lexicon is a complex resource, we divide its creation and annotation of its entries into three \"areas\": (1) determining which verbs should go into one class (Class Members), (2) determining the common set of semantic roles for each class and mapping it to valency for each Class Member, and (3) adding links to other existing lexical resources. These three areas are intertwined and influence each other -for example, while linking a Class Member to the other lexical resources the annotator might realize that the Class Member should go to a different class, or that the class should be split into two, or merged etc., but overall, this \"division of work\" allows us to describe the structure of the lexicon and the annotation process more clearly. The tasks to be performed to get full annotation and meet all the objectives in all of the three areas are even more complex. Going \"bottom-up\", i.e., starting from the PCEDT corpus, we proceed in four steps, interspersing automatic and manual phases. In the automatic phases, the PCEDT corpus is used to get preliminary Class Membership and valency information for both Czech and English verbs. In the manual phases, many (sub)tasks are performed for each class, all of them for verbs in both languages (Czech and English): • pruning the preliminary Class Members in each class, eliminating clear misalignments and/or sense mismatches, • creation (Step 1) and possible amendment (Steps 2 and 3, see below) of the set of semantic roles for each class (the Roleset), • linking (mapping) semantic roles to valency members for each verb in the class, with possible restrictions on the semantics of the arguments, • selecting the most appropriate examples from the corpus to accompany each Class Member, • adding links to the external lexical resources. The Annotation Process The annotation process has been sequenced into an initial automatic seed selection step (Step 0) and three followup steps (Steps 1-3), each consisting of an automatic phase (pre-assignment of verbs from the aligned parallel corpus to the classes, as populated in the previous step), and a manual pruning and annotation phase (Fig. 2 ). We will refer to these Steps later when describing the results, including inter-annotator agreement in the three annotation \"areas\". These steps can be briefly described as follows (Fig. 2 ): •  for the newly selected English verbs. This third step has been added after inspecting the results of Step 2it was apparent that the composition of each class was skewed towards containing more Czech than English verbs, which has been corrected by adding the additional English verbs in this Step. While it might seem that there is now again more English verbs than the Czech ones, manual inspection shows that this is due to the richer verb vocabulary used in the original text, while the Czech translation has been more uniform. No \"Step 4\" is thus planned. In each Step, adjustments in the results of the previous Step(s) have been allowed. Specifically, after Step 2, it was clear that some of the original seeds (Czech verbs from Step 0) have been expanded to very similar or almost identical classes; therefore these classes have then been merged, reducing the overall number of classes. Such global operations, as well as the resolution of any disagreement between the annotators, have been done by a single adjudicator, who might also have modified or better exemplified the issues in the annotation guidelines. Also, such modifications might further concern the Roleset, mappings of arguments to semantic roles, or the links to the other lexical resources. The decision which roles to select for a given synonym class cannot be inferred easily from any single Class Member. Often, it is only during the annotation of all additional potential Class Members (as added in Steps 2 and 3) that the semantic character of each Class (and its Class Members) becomes clear, and some amendment has to be done in order to keep consistency at the level of \"semantic depth\" of the semantic roles (SRs) used. While the SRs are mostly taken from FrameNet, sometimes their labels have to be modified to fit the properties of the synonym class. Currently, there are 123 SRs taken from FrameNet and 49 SRs have a specific SynSemClass label; we are also using some of the ideas from previous work on comparison of semantic roles, such as (Aguilar et al., 2014) . In addition, the Roleset composition and annotation is very closely related to the mapping of valency slots of the valency frame for each Class Member to the individual semantic roles (Sect. 2, Sect. 4.3). It could even change the decisions made during the Class Membership inclusion/exclusion (Sect. 4), since if no mapping between the Roleset and the valency frame can be established, the verb must be excluded from the class. 6 Determining Class Membership Interannotator Agreement In (Urešová et al., 2018d) , the first interannotator agreement experiment was described where 8 annotators were determining Class Membership of the automatically preselected list of English verbal translation equivalents (total of 544 English verbs, as inserted by the automatic phase of Step 1) for 60 of the Czech seed verb senses (as selected in Step 0). In that experiment, the annotators had to prune the English Class Member candidates by checking the corpus examples through the CzEngVallex valency argument alignments, i.e., their usage in context. They could select not only Yes or No, but also a tentative Yes or No (Rather Yes, Rather No) and also a special value \"Delete\", which was used to signify a total mismatch (wrong underlying corpus alignment, in most cases); they were thus using sort of a 5-point Likert scale, mapped back to binary decisions (with Yes and Rather Yes taken as a positive answer) for the IAA computation. The agreement for the Class Membership, as described in (Urešová et al., 2018d) , was as follows: Of the 544 datapoints the annotators (4 annotators for each decision, in our case) fully agreed in 358 cases (65.8%), which gives a good idea of the adjudication effort needed. 7  For a pairwise comparison, we have used Cohen's kappa (Eq. 2), see also (Urešová et al., 2018d) ; macroaveraged over all annotator pairs, κ = 0.44. The agreement as measured over all the annotators using Fleiss' kappa was κ = 0.45. While both the averaged Cohen's kappa as well as the Fleiss' kappa values are low, (Urešová et al., 2018d) also measured deviation from an average value on the full Likert scale used, and that value was surprisingly low (0.36 when the Yes-Rather Yes-...-Delete 5-point scale has been converted to values 4 to 0). In Steps 2 and 3 (see intro to Sect. 4), we have concentrated on pairwise comparison, limited to three annotators (two of them continuing work from Step 1 and one new annotator). For those classes annotated by two annotators, we have computed mutual F 1 score (Eq. 1) (Jardine and van Rijsbergen, 1971 ) and Cohen's kappa κ (Eq. 2) (Cohen, 1960): 8 F 1 = 2PR P + R , (1) where P is precision and R recall, and κ = p o − p e 1 − p e (2) where p o is the observed and p e the expected probability, as estimated from the annotated data of the pair of annotators. We provide the numbers microaveraged over the n classes each annotator pair worked with, and then macroaveraged over the three pairs of annotators. In Step 2, three annotators have been pruning the automatically preselected Czech verbs, using the same scale as in Step ) have been annotated by a pair of annotators. One of the annotators for the multiple annotation experiment was a native speaker. 9 The macroaveraged F 1 score over the three pairs of annotators is 0.82, and the macroaveraged kappa value is 0.52. This is better than in Step 1 (which was also concerned with English verbs). Annotator It can be seen from these numbers that apparently determining Class Membership for English verbs is harder (results of Steps 1 and 3) than for the Czech verbs (Step 2). A natural explanation would be that Czech native speakers would be better aligned for determining Class Membership for the Czech verbs, but the numbers from Step 3, where one of the annotators was a native speaker of English, suggest that this might not necessarily be the case. Mapping Semantic Roles to Valency As described in Sect. 2, an important part of each synonym class is the Roleset, set of semantic roles that are shared among Class Members. To make sure that these SRs are applicable to all of them, there must exist a mapping between the valency frame slots of each Class Member and the SRs of that class' Roleset. This mapping was also done fully manually, for all the 3515 Class Members in the current version of SynSemClass. For some mapping examples, see Fig. 1 -e.g., the verb \"grumble\" (more precisely, the valency frame ev-w1502f1 for grumble) in the class \"complain-stěžovat si\" maps ACT to Complainer, ADDR to Addressee and PAT to Complaint. Interannotator Agreement For IAA in the Roleset-to-valency-slot mappings, we have computed a full match between an annotator pair (microaveraged over all verbs in the classes that were annotated by the two annotators), and then also matches for the individual valency slot labels, or functors (ACT, PAT, ADDR, EFF, ORIG, and \"other\" (all remaining) used in the valency frames). Only fully equivalent mapping of all (valency slot functor ↔ semantic role) pairs counts as a correct complete match. Only agreement accuracy is computed, as the ratio of a number of complete matches between the two annotators to the number of Class The low agreement numbers in Tab. 3 are mainly due to the fact that during Step 2 (when the first set of Czech verbs has been added) not only the mappings, but also the Roleset as created in Step 1 for the initial, mostly English verb set has been often modified, causing a mismatch between the two annotators. 11 Examples include adding or deleting a role, or a partial swap etc. In Step 3 (i.e., after adding another set of English verbs to each class), the Roleset has hardly been ever changed, and only the mapping to valency slots was the cause of mismatches. Thus in this case, we believe that the difference in average agreement (51.6% vs. 79.6%) is not a language issue. Tables 5 and 6 show the breakdown of the accuracy of the valency slot to role mappings. Only the core argument slots are listed individually, while all other (incl. the special #any, #sb and #sth slots) are grouped together. As expected, the agreement accuracy measure is higher than for the complete match for the whole valency frame, and quite high in general, except for the mix of other non-core valency slots for the Czech verbs added in Step 2 and for the EFF valency slot for English verbs added in Step 3. Since the EFF valency slot corresponds to the third, fourth or fifth argument, as the case may be, we can only speculate that perhaps the EngVallex valency slot labeling might not be consistent enough to allow the annotators understand well its relation to the semantic roles in the given class, and they then therefore differ in their judgment. Mapping to Other Lexical Resources In this section, we evaluate the interannotator agreement in linking the individual class members to external resources, as described in Sect. 3.2, i.e., to VALLEX on after Step 2), and to FrameNet, WordNet, OntoNotes, VerbNet and PropBank on the English side (after Step 3). The annotators could assign none, one, or more links to an entry in the external resource. Multiple links have been allowed in case they believed that both (or all) such links relate well to the given class member, i.e., in cases where the granularity of the external resource has been finer than the granularity of the PDT-Vallex or EngVallex entries, respectively, in terms of sense distinctions. In the opposite case, when the granularity of PDT-Vallex (or EngVallex) is finer than the external resource entry(ies), the annotators have been asked to simply assign the link to such a more coarse-grained entry, without any special notes or markup. After the lexicon is completed, it will be possible to extract such asymmetric cases by reverting the links. When comparing the links assigned by two annotators, only a full match (when all links agreed, for each external resource individually) counted as agreement, including cases when multiple (or no) links have been assigned by any of the two. Interannotator Agreement Interannotator agreement on linking to the external resources has been measured again as a simple agreement rate (mutual accuracy), taken as the ratio on agreed upon links to the total number of class members annotated by a given pair of annotators. External links have only been annotated for valid class members, i.e., those retained after the manual pruning of automatically preselected class members which is always performed first in each Step (Step 2 for Czech and Step 3 for English verbs in this case). Tab. 7 shows the agreement for linking to VALLEX, the alternative Czech valency lexicon, which is not used in the annotation of the Czech corpora but developed independently (Sect. 3.2). VALLEX, however, uses almost the same principles as PDT-Vallex for sense distinctions as well as for slot labels, the two features most important here. Only a full match (valency frame ID, or a set of valency frame IDs in case of multiple links) counts as \"correct\". Annot. pair A 4 -A 5 A 4 -A 9 A 5 -A 9 Avg. # of pairs 70 124 84 -VALLEX 65.7% 69.4% 71.4% 68.8% Table 7 : Agreement ratio for linking the Czech verbs to the VALLEX lexicon, for 3 annotator pairs in Step 2 While the three pairs of annotators do not differ much in the agreement ratio, it is interesting to observe the relatively low agreement on assigning links to a very closely related resource, possibly caused by the fact that every entry in the VALLEX lexicon has been throughly and widely researched and all possible senses of a given lexeme added, making it both more fine-grained than PDT-Vallex as well as having more senses for each lexeme, including those not found in the underlying corpora. Such a richness made the task of the annotators apparently quite hard. For the English verbs (as added in Step 3), the results are in Tab. 8. As the results show, the agreements ratios vary widely. The relatively high agreement for PropBank and OntoNotes is undoubtedly due to the fact that the EngVallex verb senses come from the same corpus (at least in part), namely the WSJ part of the Penn Treebank, despite the differences in creating the argument structure in ProbBank and the OntoNotes groupings, vs. the valency frames in EngVallex. FrameNet frame assignment agreements, due to the relatively broad nature of FrameNet frames, are somewhat low. VerbNet, even though its classes are definitely broader than the synonym sets in SynSemClass, displays very low agreement, which might be caused by mismatches in the assignment to the single class or subclass in the VerbNet hierarchy. WordNet links display an extremely low agreement, caused, in our opinion, by the very fine-grained distinctions in WordNet verb senses, which often caused multiple WordNet senses being assigned to a single SynSemClass class member. This leads easily to a disagreement between the annotators due to the fact that an agreement is counted as correct only if all links agree (i.e., linking to WordNet senses #1 and #2 by one annotator and to only sense #2 by the other annotator is a mismatch). Annot. pair A 4 -A 6 A 4 -A 9 A 6 -A 9 Avg. # of Converting to Linked Data Linked Data is a widespread effort to make data available \"in context\", i.e., to link them to other data, in our case to lexical resources, in order to use the \"knowledge\" these links add mutually to the individual resources. Our motivation is to be compatible with such lexicons, e.g., resources available in the ELEXIS 12 project, as describe e.g., in (Declerck et al., 2015) . In the work described so far, we have concentrated on the content creation, including the various links, especially to the existing external lexicons. In order to design the structure for providing the data in Linked Data form, we have used the OntoLex (lemon) format 13 . Content-wise, we have been mostly inspired by (McCrae et al., 2014) , since in the treatment of word (verb) senses and the view of ontology it is closest to our approach. Similarly, (Corcoglioniti et al., 2016) has a set of modules for PropBank, FrameNet, VerbNet and NomBank, which we will use as well. For verbs, as already mentioned in the Introduction section, there is no ontology as we can find, e.g., in the medical domain (e.g., the ICD, or various other classifications schemes in MESH), or biology or other domains. In fact, the idea behind SynSemClass is to build an ontology substitute that could be used for a sort of grounding (at least at the event type level) in data (text) annotation. Thus, we treat a class in SynSemClass as substitute for an ontology unit, similar to the treatment of WordNet synset in (McCrae et al., 2014) . Each member of the class is a sense, denoted by a concatenation of the verb lemma (usually, infinitive form or a concatenated infinitive form of a MWE in case of e.g., phrasal verbs) and the valency frame ID, which is unique in the whole linked dataset, including across languages (cf. the valency frame ID prefix), for example confirm-ev-w649f1, while a word (LexicalEntry), even though redundant (because reachable through the link to the valency lexicons) is represented by its lemma concatenated by the word ID, e.g., confirm-ev-w649, see Fig. 3 . External links are represented as links to the LD versions of WordNet (McCrae et al., 2014) and FrameNet (Bryl et al., 2012) , while the links to VerbNet, FrameNet, PropBank frames and OntoNotes sense groupings are represented as URLs (URIs) to their web presence, if it exists in the Unified Verb Index, or as the customary ID with an appropriate lexicon-unique prefix if they do not. While the SynSem-Class lexicon does not have a hyponym/hyperonym hierarchy (yet), it will be represented by the broader relation as found in SKOS. Grammatical properties (i.e., the mapping between the valency arguments and semantic roles, as a property of each class, will be represented as standard properties. Fig. 3 shows a linked representation of one SynSem-Class entry, or more precisely, one sense of the verb confirm, identified by its EngVallex reference (ev-w649f1). The lower half of the scheme shows the links to external resources, as described above. Please note that each link to each external lexicon can appear multiple times; for example, to simplify the picture, we have left ). All entries in other languages (Czech, for the moment) will have their own entries, but they will share the reference to the SynSemClass (ssc10:vec00078 in this case). Related work We have presented the first version of SynSemClass, a bilingual verbal synonym lexicon linked to several external resources, as an initial step in developing multilingual verbal ontological resource that can link to existing lexicalsemantic resources (and resources bordering already on ontologies, such as FrameNet). We are aware of several such projects (or similar ones), such as the Predicate Matrix project (Lacalle et al., 2014 ), VerbAtlas (Di Fabio et al., 2019) and especially the SemLink work lead by M. Palmer and colleagues (Palmer, 2009; Bonial et al., 2013; Bonial et al., 2012) . Our contribution here is the inclusion of valency and its mapping to semantic roles as a major criterion of including a verb (or better, its sense) in a synonym class, while adding the fully manually assigned mapping (linking) to these other resources. In terms of Linked Data, there has been previous projects, especially for FrameNet, as comprehensively described in (Ide, 2014) . WordNet has also several conversion to Linked Data (more precisely, to RDF/OWL), and there is also a description of the model(s) and outstanding issues; 14 previous work on WordNet conversion to Linked Data can be found in http://xmlns.com/2001/08/wordnet as well as in (McCrae et al., 2014) (which, among other features, also links to VerbNet). Summary and Future Extensions Our main contribution is the linking of the (currently) bilingual verbal synonym lexicon in two directions: (a) to deep syntactic information for each verb included (i.e., to the Czech and English valency lexicons), and (b) to existing \"popular\" lexical resources (i.e., VerbNet, PropBank, OntoNotes groupings, FrameNet and WordNet). We have also presented a suggested mapping to the Linked Data scheme, and shown that all the necessary components are there; this conversion will be physically made once we increase the coverage of SynSemClass and check its consistency (for the moment, the lexicon is available in XML format as an Open Resource). 15  In the short term, we plan to extend the resource by using both automatic and manual methods and annotation. As shown in this paper, the manual effort involved is relatively large for getting all the components of the lexicon together, and agreement among annotators is not that high, even though it has been improving. Thus the plan is to involve distributional methods (in part using deep learning based on this initial version, e.g., to find more precisely additional synonym candidates in both parallel as well as monolingual texts, including also languages other than Czech and English). We have also started to cooperate on linking the resources from the Unified Verb Index 16 to SynSemClass and vice versa, sharing data in order to minimize the annotation effort needed to enrich both resources. In the long term, we would like to add connection (including entry to entry links) to additional and newly appearing resources, such as VerbAtlas (as being worked on within the BabelNet project) (Di Fabio et al., 2019) , which is in fact very close in goals to the project presented here. This implies adding verbal and event nominals and provide the linking for them, too. We believe that SynSemClass can be used, already in the current state and coverage, as an evaluation resource for any automated methods and tools for annotation of all three areas: synonym class membership, valency to semantic role mapping, and mapping to external resources. We also plan to create a textual resource (preferably, a treebank, and ideally, a parallel one or ones) that would be annotated by the classes (and semantic roles associated with these classes) from SynSemClass. Such a resource can then be used to train various NLP tools, from verb sense disambiguation to information extraction to full grounding that would include both entities as well as events/states. In this area, we plan to cooperate with other projects and initiatives that tackle universal or uniform semantic representations, such as the UMR project (Pustejovsky et al., 2019) , or the semantic representations that have been used in the CoNLL 2019 MRP Shared Task (Oepen et al., 2019) . Acknowledgements This work has been supported by the GA ČR (Grant Agency of the Czech Republic) grants No. GX20-16819X and GA17-07313S. It uses resources hosted by the LIN-DAT/CLARIN (LINDAT/CLARIAH-CZ) Research Infrastructure, projects No. LM2015071 and LM2018101, supported by the Ministry of Education and Youth of the Czech Republic. The work described herein would not at all be possible without the annotators who have actually made it happen-we would thus like to thank them all: Kathryn S. Conger, Darja Klambotskaya, Vlad'ka Krajcsovicsová, Jakub Sláma, Barbora Bulantová, Kateřina Truksasová, Martin Babička, and Alena Straková.",
    "abstract": "This paper reports on an extended version of a synonym verb class lexicon, newly called SynSemClass (formerly CzEngClass). This lexicon stores cross-lingual semantically similar verb senses in synonym classes extracted from a richly annotated parallel corpus, the Prague Czech-English Dependency Treebank. When building the lexicon, we make use of predicate-argument relations (valency) and link them to semantic roles; in addition, each entry is linked to several external lexicons of more or less \"semantic\" nature, namely FrameNet, WordNet, VerbNet, OntoNotes and PropBank, and Czech VALLEX. The aim is to provide a linguistic resource that can be used to compare semantic roles and their syntactic properties and features across languages within and across synonym groups (classes, or 'synsets'), as well as gold standard data for automatic NLP experiments with such synonyms, such as synonym discovery, feature mapping, etc. However, perhaps the most important goal is to eventually build an event type ontology that can be referenced and used as a human-readable and human-understandable \"database\" for all types of events, processes and states. While the current paper describes primarily the content of the lexicon, we are also presenting a preliminary design of a format compatible with Linked Data, on which we are hoping to get feedback during discussions at the workshop. Once the resource (in whichever form) is applied to corpus annotation, deep analysis will be possible using such combined resources as training data.",
    "countries": [
        "Czech Republic"
    ],
    "languages": [
        "Czech",
        "English"
    ],
    "numcitedby": "5",
    "year": "2020",
    "month": "May",
    "title": "{S}yn{S}em{C}lass Linked Lexicon: Mapping Synonymy between Languages"
}