{
    "article": "Dictionary-based methods in sentiment analysis have received scholarly attention recently, the most comprehensive examples of which can be found in English. However, many other languages lack polarity dictionaries, or the existing ones are small in size as in the case of Senti-TurkNet, the first and only polarity dictionary in Turkish. Thus, this study aims to extend the content of SentiTurkNet by comparing the two available WordNets in Turkish, namely KeNet and TR-wordnet of BalkaNet. To this end, a current Turkish polarity dictionary has been created relying on 76,825 synsets matching KeNet, where each synset has been annotated with three polarity labels, which are positive, negative and neutral. Meanwhile, the comparison of KeNet and TR-wordnet of BalkaNet has revealed their weaknesses such as the repetition of the same senses, lack of necessary merges of the items belonging to the same synset and the presence of redundant narrower versions of synsets, which are discussed in light of their potential to the improvement of the current lexical databases of Turkish. Introduction A wordnet can be described as a highly comprehensive dictionary which provides semantic relationships such as synonymy, hypernymy, hyponymy, meronymy, homonymy etc. These rich lexical sources are used for many tasks such as word sense disambiguation, text analysis, information retrieval, and sentiment analysis. There are two WordNets for Turkish, namely TR-wordnet of BalkaNet (Tufis et al., 2004a ) (hereafter, TRwordnet, which means Turkish wordnet) and KeNet (Ehsani et al., 2018; Bakay et al., 2019b; Bakay et al., 2019a; Ozcelik et al., 2019; Bakay et al., 2020) . Whereas TR-wordnet has been created earlier with a smaller scope of synsets, KeNet has been created later with a much wider range of synsets than that of TR-wordnet (See Section 2 for a more detailed comparison). Although the newer WordNets such as KeNet are more exhaustive than the earlier ones due to their increased number of synsets, it must be noted that it is also possible to come across instances where the less inclusive wordnets, TR-wordnet can actually reveal the shortcomings of the larger ones. Therefore, comparisons of the available synsets for a given language are a good way to improve the available sources as they, by complementing one another, give us the chance to combine the powerful aspects of different wordnets and develop a more thorough dataset for performing various tasks such as sentiment analysis. In recent years, sentiment analysis studies have gained significance in NLP applications. Currently, popular sentiment analysis applications frequently employ data regarding product interpretation, film interpretation, service evaluation and political events, mostly extracted from social media platforms. The aim of sentiment analysis is to reveal all emotions and commentary present in the data examined. There are several applicable methods for this purpose, one of which is the dictionary-based method where a polarity dictionary is employed. Exploiting a dictionary-based method necessitates the construction of a specific polarity dictionary in the same language as the data-to-beanalyzed. The reason behind this necessity stems from the improbability of creating a universal polarity dictionary due to both grammatical and cultural asymmetries between languages. For instance, a certain historical event can have positive connotations in one culture and negative connotations in another culture. Thus, it is an essential step to create a language specific polarity dictionary. In our study, we present a polarity dictionary to provide an extensive polarity dictionary for Turkish that dictionary-based sentiment analysis studies have been longing for 1 . Our primary objective is to provide a more refined and extensive polarity dictionary than the previous SentiTurkNet. In doing so, we have resorted to a different network from the referenced study. We have identified approximately 76,825 synsets from Kenet, which then were manually labeled as positive, negative or neutral by three native speakers of Turkish. Subsequently, a second labeling was further made on positive and negative words as strong or weak based on their degree of positivity or negativity. In this paper, we will first discuss the literature on WordNets and polarity lexicons in Section 2, then proceed to present the comparison of KeNet and TR-wordnet in Section 3. In section 4, we explain how we have constructed our comprehensive polarity lexicon, HisNet. Subsequently in Section 5, we present the statistical comparison of HisNet to SentiTurkNet. Lastly, we make our concluding remarks in Section 6. 2 Literature Review Wordnets The first wordnet project was Princeton WordNet (PWN), which was initiated in 1995 by George Miller (1995) . Currently, the latest release of PWN, version 3.1 has 117,000 synsets 206,941 word-sense pairs. Although WordNets for other languages were constructed shortly after the release of PWN, their coverage is not as extensive as that of PWN, (Vossen, 1997; Black et al., 2006) . For Balkan languages, BalkaNet (Tufis et al., 2004a) is the most comprehensive work up to date. For the TR-wordnet of BalkaNet (Bilgin et al., 2004a) , researchers automatically extracted synonyms, antonyms and hypernyms from a mono-lingual Turkish dictionary. Although TR-wordnet includes 14,626 number of synsets, KeNet is a more comprehensive Turkish WordNet, which has 80,000 synsets covering 110,000 word-sense pairs (Ehsani et al., 2018; Bakay et al., 2019b; Bakay et al., 2019a; Ozcelik et al., 2019; Bakay et al., 2020) . Polarity Lexicons The first examples of polarity dictionary work could be found in English. SentiWordNet 1.0, the very first study on English polarity dictionaries, was presented by Esuli and Sebastiani (2006) . Considerable research has been conducted to improve these resources with the aim of making them more precise. For example, the polarities of the objective words in SentiWordNet have been reassessed by Hung and Lini (2010) . SenticNet (Cambria et al., 2014) , another well-known dictionary in English, is created by rescoring words based on five different criteria, which are happiness, attention, sensitivity, ability and general polarity. Thus, it is evident that SenticNet is a polarity dictionary that provides a more extensive emotional evaluation than SentiWordNet. There are polar dictionaries created in major languages other than English. However, these dictionaries were found to be insufficient in terms of the number of words. Brooke et al. (2009) aimed to translate English polarity sources to Spanish. At first, the methods established independent from the target language were found adequate, yet in the long term it was noticed that these methods were costly and inaccurate. Employing languagedependent resources to improve this system was deemed more feasible. Remus et al. (2010) have created a German sensitivity dictionary named SentiWortschatz for the German language. For the purpose of creating a feeling dictionary, over 3500 German words were assigned positive and negative values in the range of [-1, 1], using PosTags. Abdaoui et al. (2017) have created the FEEL: a French Expanded Emotion Lexicon polarity dictionary for French. Moreno-Sandoval et al. (2017) have created the Combined Spanish Lexicon polarity dictionary for Spanish. Besides major languages such English, French and Spanish, polarity lexicon work has been extended to less-resourced languages such as Basque. Saralegi and Vicente (2013) created lexicons for Basque and evaluated them against the standard datasets in varying domains. Das and Bandyopadhyay (2010) have proposed a method for designing a sentiment dictionary for the Indian languages, Bengali and Telugu. This proposal aims to translate all three languages using Senti-WordNet and SubjectivityWordList (Wilson et al., 2005) as the source. There was no known polarity dictionary study in Turkish up until 2015. The first study was conducted by Dehkharghani et al. (2016) drawing on the Turkish WordNet (Bilgin et al., 2004b) , which is a part of the BalkaNet (Tufis et al., 2004b) project aiming to develop a multi-lingual dictionary database of separate WordNets for Balkan languages. To this end, this study aims to compare the two available WordNets for Turkish by revealing their weaknesses and presents HisNet, which is a more detailed polarity lexicon derived from KeNet. 3 Comparison of TR-wordnet and KeNet Extracting Matchings In order to compare KeNet and TR-wordnet, we have extracted the matchings between the two. Initially, the synsets containing only synset numbers are discarded from both KeNet and TR-wordnet. Since the number of synsets in KeNet by far outmatches the number of synsets in TR-wordnet, we concentrate on TR-wordnet. For each synset S b in TR-wordnet, we display each synset S k in KeNet, where S k contains at least one synset number from S b . In general, the synsets containing the same synset number are taken as candidates for a possible match between TR-wordnet and KeNet. In total, there are 9,787 synsets from TR-wordnet which matches 27,314 synsets from KeNet. This extracted list has been, then, displayed on Google sheets and the comparisons have been analyzed by two trained annotators. Table 1 shows five example cases taken from the extracted list. In this table, whereas Case 1 shows a situation where one synset in Tr-wordnet matches with two synsets in KeNet, each of the Case 2, 3 and 4 exemplifies a one-to-one match between the WordNets. More specifically, in Case 2, the synset in TRwordnet includes two lemmas as opposed to the single lemma in KeNet. Cases 3 and 4 demonstrate the lack of definitions for the given synsets in TR-wordnet. Case 4 and 5 exemplify the matching of a single synset in KeNet with two different synsets in TR-wordnet. Weaknesses of KeNet The first advantage of this comparison is that it shows several shortages of KeNet, which need to be improved. Firstly, a comparison of KeNet senses with the ones from TR-wordnet helps us see the organization of KeNet senses in a better way. After comparing the matching senses between TR-wordnet and KeNet, it has been found that more than 1,300 of senses in KeNet need to be re-written to cover the range of meanings given in the synsets. To exemplify, as it can be seen in case 1 in Table 2 , whereas the TR-wordnet sense for the given synset is broader, the one provided in KeNet needs to be improved. Secondly, as synsets of KeNet have been extracted from different sources, there are some redundant synsets, which are the copies of some synsets, only with different IDs. For example, Case 2 in Table 2 shows two separate synsets for \" İzlanda\" in KeNet, one of which is redundant. With this comparison, we have been able to detect these repetitive synsets that need to be removed from KeNet, the number of which has been found to be 58. Thirdly, this comparison has revealed the incorrect mergings in KeNet synsets. 310 mistakenlymerged synsets have been found and they were later split up based on their sense distinctions (Bakay et al., 2019b) . Such a split procedure will first create new synsets and a comparison of these new synsets with TR-wordnet can later be used to further investigate how the scope of the sense disambiguation among the two Wordnets differs. As an example, in Case 3 in Table 2 , we see the mergings in these synsets with the use of pipes (-) in between the senses. In this example, the comparison of the merged synset of \"idaresiz gevs ¸ek\" in KeNet with \"gevs ¸ek\" in TR-wordnet shows that the synset in KeNet is to be split up as it covers two different senses. Lastly, there are synsets that are actually referring to the same entities but wrongly separated and given as different ones due to a wrong split or a lack of merging. The display we have used in this work has enabled us to recognize these cases as these imitative synsets are matched with the same synsets in TR-wordnet. Case 4 in Table 2 , for instance, shows that the two different synsets of KeNet that are matched with \"steril aseptik\" in TR-wordnet are, in fact, items belonging to the same synset. Thus, 816 numbers İc ¸inde ibadet edilen, tapınılan yapı of such synsets have been merged into the other existing synsets which have the same senses. Weaknesses of TR-wordnet In addition to the advantage of showing the shortcomings of KeNet, this comparison has also shed light onto the weaknesses of TR-wordnet and thus, why it needs to be improved. First of all, as in KeNet, some senses in TR-wordnet are incomplete such that they are either in English or have only exemplary sentences instead of actual senses. Overall, in the dataset of TR-wordnet used in this comparison, 1,975 senses out of 9,787 (20.18%) are in English and 416 (4.25%) have exemplary sentences instead of senses. Furthermore, for 3,174 (32.43%) number of synsets, no sense definition is provided. Similar to the case in KeNet as explained in the previous section, there are redundant synsets in TR-wordnet, as well. This one-to-one comparison between TR-wordnet and KeNet has showed us the cases where one single synset in KeNet is matched with more than one synset in TR-wordnet (see cases 1, 2 & 3 in Table 3 ). We must note that such matchings could mean that for more than one synset in TR-wordnet, there is only one available synset in KeNet as their equivalent. Such multiple matchings of the same synset could be interpreted as the lack of necessary sense distinction in KeNet. However, it is not the case in any of the multiple matchings. On the other hand, there are three reasons for such repeated use of the same senses with multiple matchings in TR-wordnet: they are (i) simply the copies of the same senses in TRwordnet, only with different IDs (see Case 1), (ii) a result of the lack of the necessary merging of the synsets (see Case 2) or (iii) a result of the presence of a narrower and a wider synsets, the former of which should be removed as the latter already covers it (see Case 3). The numbers of such cases where one synset in KeNet matches with multiple senses in TR-wordnet for one of these three reasons is 416 in total. Another significant difference between KeNet and TR-wordnet is the addition of new lemmas in KeNet synsets. Case 4 in Table 3 exemplifies the inclusion of the lemmas of \"kokus ¸mak\" and \"taaffün etmek\" in addtion to the existing lemma of \"kokmak\" in TR-wordnet. These additional lemmas can be taken as a clear reflection of the wider coverage of KeNet. Whereas the equivalents of these synsets in KeNet are also given in TRwordnet, these extra lemmas in KeNet show that by using a more comprehensive dataset, KeNet has to widen its scope. The last crucial discrepancy between TRwordnet and KeNet is that some senses of TRwordnet are matched with more than one sense in KeNet. To put differently, a single sense in TRwordnet cannot be provided with only one sense in KeNet, which provides a sense distinction between the combined sense in TR-wordnet. The required distinction is given with either two or three separate senses in KeNet. Therefore, as it can be seen in Cases 5 and 6 in Table 4 , although they are merged in a single synset in TR-wordnet, KeNet captures the necessary distinctions between the senses by having two separate synsets to correspond to a single synset in TR-wordnet. This lack of necessary distinctions in TR-wordnet can be taken as a significant issue of TR-wordnet to improve, which has been successfully given in the more comprehensive Turkish wordnet, KeNet. Polarity Lexicon Generation: HisNet This study aims to enlarge SentiTurkNet in terms of synset number by using a different Turkish WordNet. For this study, we used the most comprehensive word network available as the Turkish WordNet: KeNet (Ehsani et al., 2018; Bakay et al., 2019a; Bakay et al., 2019b; Ozcelik et al., 2019; Bakay et al., 2020) . was created with the data obtained from the current items in Turkish lexicon, and emerged following the Turkish WordNet. Compared to Turkish WordNet, KeNet has a larger synset rate, which is the reason why we opted for KeNet over Turkish WordNet for the purposes of this study. As the first step of our project, we have identified approximately 76,825 synsets from Kenet. Subsequently, all of these synsets were manually labeled as positive, negative or neutral by three native speakers of Turkish. This recursive labeling process is necessary to train the classifiers where the polarity values will then be determined. C ¸ürüyüp bozularak kötü bir koku c ¸ıkarmak-pis kokmak The first labelling process resulted in 3,100 positive, 10,191 negative and 63,534 neutral data, during which decisions were based on the meaning and connotation of each word. As the polarity of such connotations are subjective by nature, and thus, we have attended to the majority's label when there is a discrepancy between the annotators. For instance, the word for flower, \"c ¸ic ¸ek,\" may have positive connotations for an individual, yet another individual may find flowers repulsive because of their allergies. After the first round of labeling, the words tagged as \"neutral\" consisted the majority. Following the first labelling, a second labelling process was conducted for the words which were labeled as positive and negative in the first round. To be more specific, the words were re-labeled based on the degree of their positivity or negativity as strong or weak. There was no second labeling on objective words. After the second marking, we found that the weak positive and weak negative tags were more prominent. For instance, the word mükemmel (excellent) in Turkish has been marked three times. Thus, three different views were obtained for the value of this word. In this example, after it was decided that the value of the word (-0.25) 3,360 mükemmel (excellent) was positive, it was evaluated whether the positive value was weak or strong in the second stage. While selecting the appropriate label, the compatibility of the labels selected by the three labelers was also evaluated. To put it differently, if a positive word receives strong label from all three annotators, it is regarded as strong positive. If it receives two strong and one weak label, it is considered as very positive. If it is labelled as strong once and as weak twice, it means it is just positive. Finally, if it receives weak label from all three annotators, it is considered as weak positive. The same is also true for the words labelled as negative. Table 5 shows the number of synsets annotated in each categories and their degree of positivity and negativity. It is clear from this table that weakly positives/negatives and strongly positives/negatives outnumber very positives/negatives and plain positives/negatives. If this task had been conducted with the random assignment of these labels, the outcome would have been the opposite with very positives/negatives and plain positives/negatives constituting the majority. This could be interpreted as the high degree of consistency between the annotators since at least two of the annotators obviously agree with each other in most cases. Finally, the automatic analysis processes will be easier and more accurate in Turkish with the assignment of such polarity values to words. We believe that tagging words from KeNet data and comparing them to WordNet in English will lead us to conduct better analyses. Moreover, providing the sentiment analysis solutions with marked data will enhance their performance. Annotation Statistics Agrement of Annotators: Fleiss's Kappa statistic The consistency between annotators is very important for creation of a reliable polarity lexicon. There are several methods to calculate the consistency between annotators such as Cohen's Kappa, Fleiss Kappa, Gwet's AC1 and Krippendorff's Alpha. In our study, we have employed Fleiss Kappa statistic to measure the level of agreement between annotators in this work. Fleiss kappa coeffient (Fleiss, 1971) , which is a generalization of Scott's pi coeffient (Scott, 1955) , can be applied to more than two, an arbitrary number of raters. As with Cohen's Kappa and Scott's pi coeffient, how much of the agreement between these raters cannot be attributed to chance is expressed as a number between 0 and 1. As shown in Table 6 and Table 7 , the results have demonstrated that the agreement between the annotators is significant. Comparison of HisNet and SentiTurkNet In this section, we present the results of the statistical comparison of HisNet and SentiTurkNet. Since the TurkishWordNet Ids of the synonyms in SentiTurkNet have not been defined, the mappings have been performed using the English synonyms. Afterwards, the faulty mappings have been corrected manually. When the synsets in the KeNet and the synsets in WordNet were mapped, only the 19,835 of synsets matched. Therefore, we used a subset of HisNet's in comparisons with other sentiment lexicons. Table 8 shows the number of polarity Conclusion Dictionary-based sentiment analysis studies in languages except English are very limited due to the scarcity of sources regarding polarity. We conclude that translating sources of polarity from English to Turkish is not a viable approach to create a Turkish polarity dictionary since not all terms in one language have equivalent terms in other languages. Furthermore, the same terms may have different degrees of polarity due to the cultural discrepancies. To this end, the most prominent contribution of this study is to present HisNet, a new polarity lexicon for Turkish by extending the volume of SentiTurkNet, the existing first and only polarity dictionary available in Turkish. We expect that HisNet can prove itself as a useful tool for sentiment analysis applications in Turkish thanks to its exhaustive coverage of the synsets in Turkish WordNet. In this paper, we have also presented a comparison of two available WordNets for Turkish, which is crucial to do so when there are multiple sources for a given language for further improvements. Our comparison has shown that both TRwordnet and KeNet have their shortcomings. To sum up, such comparisons may present a detailed picture of what steps need to be taken to improve the available WordNets as they provide the available sources for a language in a comparative way.",
    "abstract": "Dictionary-based methods in sentiment analysis have received scholarly attention recently, the most comprehensive examples of which can be found in English. However, many other languages lack polarity dictionaries, or the existing ones are small in size as in the case of Senti-TurkNet, the first and only polarity dictionary in Turkish. Thus, this study aims to extend the content of SentiTurkNet by comparing the two available WordNets in Turkish, namely KeNet and TR-wordnet of BalkaNet. To this end, a current Turkish polarity dictionary has been created relying on 76,825 synsets matching KeNet, where each synset has been annotated with three polarity labels, which are positive, negative and neutral. Meanwhile, the comparison of KeNet and TR-wordnet of BalkaNet has revealed their weaknesses such as the repetition of the same senses, lack of necessary merges of the items belonging to the same synset and the presence of redundant narrower versions of synsets, which are discussed in light of their potential to the improvement of the current lexical databases of Turkish.",
    "countries": [
        "Türkiye"
    ],
    "languages": [
        "German",
        "French",
        "Basque",
        "Turkish",
        "English",
        "Spanish"
    ],
    "numcitedby": "2",
    "year": "2021",
    "month": "January",
    "title": "{H}is{N}et: A Polarity Lexicon based on {W}ord{N}et for Emotion Analysis"
}