{
    "article": "Cet article présente les expériences effectuées sur un système de liage d'entités nommées. Cette tâche se découpe en deux principales parties que sont la détection de mentions méritant d'être liées à la base de connaissance et la désambiguïsation qui permet de sélectionner l'entité finale à lier à chaque mention. Deux approches existent pour résoudre cette tâche. Il y a celle de désambiguïsation seule et celle end-to-end qui effectue les deux sous-tâches simultanément. Nous nous sommes intéressés au modèle end-to-end atteignant l'état de l'art. Le coeur de ces expériences était d'exploiter des embeddings contextuels afin d'améliorer les performances. Trois approches ont été testées afin d'intégrer ces embeddings et de remplacer les embeddings de mots. Les différentes versions atteignent au mieux l'état de l'art. L'article présente quelques pistes déjà étudiées expliquant les raisons pour lesquelles les expériences testées ne dépassent pas le modèle initial et ouvrent des possibilités d'amélioration. Introduction La tâche de liage d'entités nommées permet d'identifier les éléments d'intérêts dans un texte et de les relier à une entrée d'une base de connaissances. Cette tâche est primordiale pour d'autres applications telles que le résumé de texte, les systèmes de question-réponses ou l'augmentation de bases de connaissances (Shen et al., 2014) . C'est cependant une tâche difficile car elle doit à la fois se charger de repérer les mentions d'intérêts dans un texte et en même temps déterminer à quelle entrée de la base de connaissance chaque mention correspond. Or il est fréquent que relier une mention à une entité soit ambigu. Plusieurs entrées peuvent correspondre et se tromper entraîne alors la génération d'un contre-sens sur le texte analysé. Les deux tâches que sont (a) trouver les mentions puis (b) les relier à une entité peuvent être disjointes, beaucoup de travaux ne concernent que l'un des deux aspects. Néanmoins, effectuer la tâche d'un seul trait, par une approche dite end-to-end, peut avoir l'avantage de renforcer les performances globales du modèle. À partir d'un système end-to-end, l'objectif de ce travail est d'en modifier l'architecture afin de tenter de l'améliorer. L'axe privilégié a été l'amélioration des embeddings de mots, initialement du Word2Vec (Mikolov et al., 2013) , pour les remplacer par des embeddings contextuels de type BERT (Devlin et al., 2018) . Le modèle BERT a été choisi car il correspond à l'état de l'art en terme de modèle d'embeddings contextuels. Le travail présenté se base sur un corpus de liage d'entités en anglais. Cette article présentera dans un premier temps la tâche de liage d'entités nommées ainsi que les travaux récents, puis présentera les différentes expériences réalisées avec BERT avant de présenter les résultats obtenus et de les discuter. Travaux récents La tâche de Liage d'Entités Nommées (LEN) consiste à repérer les mentions d'intérêts dans un document permettant sa compréhension et sa mise en contexte en les reliant à une base de connaissances. Elle est traditionnellement composée de deux sous-tâche (Shen et al., 2014) . La première est La Reconnaissance d'Entités Nommées (REN) qui consiste à trouver dans un texte les mots ou groupes de mots significatifs qui doivent être mis en relation avec la base de connaissances, dont les éléments sont appelés entités. Ces mots ou groupes de mots sont appelés des mentions car ils mentionnent des éléments de la base de connaissances. La seconde tâche est La Désambiguïsation d'Entités Nommées (DEN) qui consiste à relier à chaque mention la bonne entité dans la base de connaissances. C'est une tâche de désambiguïsation car plusieurs entités peuvent initialement correspondre à une même mention. Par exemple, si dans un texte on relève la mention \"le président français\", plusieurs entités issues d'une base de connaissances peuvent correspondre en premier lieu car il y a eu plusieurs présidents français (même si on se limite aux présidents de la République). De même, un texte comportant un nom comme \"Obama\" pourra correspondre à plusieurs entités car plusieurs personnes peuvent porter ce patronyme. Il faut donc déterminer duquel on parle. Cette tâche est souvent découpée en 2 temps (Shen et al., 2014) . On commence par générer l'ensemble des entités qui pourraient correspondre à la mention donnée (Candidate Entity Generation), puis on les classe de la plus pertinente à la moins pertinente pour prendre la décision d'association finale (Candidate Entity Ranking), la pertinence pouvant correspondre à la fréquence (moyen le plus naïf). Ainsi, un système LEN a besoin d'une base de connaissances qui servira de référence pour associer les mentions de tous les textes. Wikipedia 1 est souvent retenu pour ce rôle. Chaque page correspond à une entité unique, et il n'existe pas deux pages référençant la même personne, institution, concept ou autre (on exclut les cas des pages traduites). Une bonne base de connaissances n'est pas qu'un simple dictionnaire et possède des liens entre les entités qui permettent de les situer les unes par rapport aux autres. Dans Wikipedia de tels liens peuvent s'exprimer par les liens hypertextes présents dans une page et permettant d'atteindre d'autres pages. Ces liens hypertextes étant associés à des mots ou groupes de mot, ils permettent aussi d'avoir des exemples de mentions devant être reliés à ces entités. Ces liens peuvent permettre aussi de définir des relations qui peuvent s'avérer utiles lors du classement des entités comme leur fréquence. Les autres bases de connaissances fréquemment utilisées sont YAGO (Fabian et al., 2007) , DBPedia (Auer et al., 2007 ) et Freebase (Bollacker et al., 2008) . Le travail sur la base de connaissances est fait en amont, le modèle l'utilise seulement. Un système LEN a ensuite besoin d'un corpus de textes sur lequel le modèle devra extraire et lier les mentions vers les entités de la base de connaissances. Chaque texte du corpus (ou document) est composé de plusieurs phrases et potentiellement de plusieurs mentions afin de les mettre en relation, de les contextualiser et de faciliter ainsi le travail de désambiguïsation. Un corpus de textes peut être un recueil d'articles de presse. Les deux principaux corpus pour le liage d'entités nommées sont CoLNN (Hoffart et al., 2011) et TAC 2 (Getman et al., 2018; McNamee & Dang, 2009) . Certains modèles découplent les parties REN et DEN. La partie DEN est la plus complexe et il existe des systèmes permettant de réaliser la tâches REN en amont (tels que StandfordNER 3 ou OpenNLP 4 ). Cependant, depuis quelques années, les modèles tentent davantage une approche end-to-end (Shen et al., 2014) . L'idée est de rendre la tâche REN plus robuste en utilisant les résultats de la désambiguïsation pour aider à mieux capturer les mentions. Par exemple, un système découplé aura tendance à mal étiqueter The New York Times pour le tronquer en New York Times ou simplement New York (l'article the étant le plus souvent oublié). Or, un bon étiquetage de mention peut permettre de faciliter sa correspondance avec une référence de la base de connaissance. DeepType (Raiman & Raiman, 2018) est un exemple de système de désambiguïsation seule. Il est la référence de l'état de l'art en DEN. End-to-End Neural Entity Linking (Kolitsas et al., 2018) est un exemple de système end-to-end. Il est la référence de l'état de l'art pour cette approche. Certains systèmes utilisent BERT (Devlin et al., 2018) pour obtenir des embeddings contextuels car il peut être spécialisé pour réaliser une tâche de liage d'entités nommées (Broscheit, 2019) . D'autres approches se concentrent sur une adaptation de BERT dans le cadre de datasets plus spécifiques auxquels BERT n'a pas été confronté, comme le fait PEL-BERT (Li et al., 2020) . BERT n'est pas le seul modèle d'embeddings contextuels (comme ELMo (Peters et al., 2018) ou GPT (Radford et al., 2019) ), mais il constitue la référence. Nous avons choisi de nous appuyer sur un modèle NEL pré-existant : le End-to-End Neural Entity Linking de Kolitsas (Kolitsas et al., 2018) . Il effectue la tâche d'Entity Linking (EL) de la détection de mention (REN) jusqu'à la désambiguïsation (DEN). Ce choix a été motivé car le modèle de Kolitsas est à l'état de l'art actuel en tant que système end-to-end. Des travaux comme ceux de Broscheit (Broscheit, 2019) l'utilise comme point de comparaison. Son architecture est, de plus, aisée à modifier, contrairement à des modèles comme DeepType qui repose principalement sur son système de types. Ainsi, il était plus envisageable d'explorer l'impact de nouveaux modules en les utilisant sur le modèle de Kolitsas. Enfin, les modules utilisés par ce système sont des outils éprouvés tels que Word2Vec (Mikolov et al., 2013) et des Bidirectional Long Short-Term Memory (Bi-LSTM). Il était donc intéressant de tester des améliorations en intégrant des approches plus récentes ayant prouvé leur robustesse (notamment BERT). Modèle Initial Cette section a pour but d'expliquer le fonctionnement du modèle End-to-End Neural Entity Linking de Kolitsas (Kolitsas et al., 2018) , illustré dans la Figure 1 afin de comprendre par la suite les modifications qui y ont été apportées. Le modèle part d'un document, soit un texte cohérent, de quelques phrases. Le modèle y détecte les mentions, les relie aux entités correspondantes dans la base de connaissances et renvoie une liste des couples Mention-Entités ainsi prédits dans le document. Le principe général est de construire un embedding de mention à partir des embeddings de mots. Cet embedding de mention pourra être comparé à des embeddings d'entités pré-calculés, permettant d'assigner un score de similarité à chacun. Enfin, on choisit la meilleure entité candidate grâce au score de similarité des embeddings et de la cohérence globale en utilisant les autres entités présentes dans le document. L'entrée est constituée des embeddings de mots Word2Vec pré-entraînés. Les embeddings de mots finaux {ν k } k∈ 1 ,n sont obtenus par concaténation des embeddings de mots Word2Vec et des embeddings de caractères de chaque mot. Ces embeddings de caractères sont appris grâce à un bi-LSTM appliqué sur les caractères du mot (étape absente sur la figure 1 ). Ces embeddings de mots sont ensuite transformés en embeddings de contexte {x k } k∈ 1 ,n (appelé context-aware word embedding dans la figure 1 ) grâce à un bi-LSTM. Une fois les embeddings de contexte fixés, ceux pertinents dans la construction d'une mention (c'est-à-dire les embeddings de contexte correspondant à la mention m = w q , ..., w r ) sont combinés grâce à un réseau Feed Foward (appelé FFNN de Mention ou F F N N 1 dans la figure 1 ) pour transformer l'ensemble en Embedding de Mention. Le modèle ne prédéfinit pas les mentions qui seront construites. Il construit et teste toutes les mentions possibles. Compte tenu des notations précédentes, l'Embedding de Mention est obtenu ainsi : x m = F F N N 1 (g m )où g m = [x q ; x r ; xm ] et xm = r k=q α m k ν k . Les coefficients α m k sont obtenus ainsi : α m k = exp(α) r t=q exp(α k ) et α k = w α , x k Chaque Embedding de Mention est ensuite comparé à une liste de candidats ((e j ) ≥1 ) issus des Embeddings d'Entités pré-entraînés (Ganea & Hofmann, 2017) (y e ) ∈wikipedia et sélectionnés par des probabilités pré-calculées (ou prior (p(e j , m)) à partir des liens hypertextes de Wikipedia. Ces probabilités ont été établies lors de l'apprentissage des embeddings d'entités et sont considérées comme acquises par le modèle. Chaque couple Entité-Mention reçoit ensuite un score de similarité Ψ obtenu par le réseau Feed Foward (appelé FFNN de Score ou F F N N 2 dans la figure 1 ) : Ψ(e j , m) = F F N N 2 ([logp(e j , m); x m ; y i ]) Seules les entités avec un score final suffisamment haut sont testées (supérieur à un paramètre γ ). Ceci permet de filtrer les mentions construites par le modèle qui ne correspondent à aucune réelle entité. On obtient donc l'ensemble des couples (mention, candidat) sérieux : V G = {(m, e) ∈ M, e ∈ (e j ) ≥1 , Ψ(e, m) ≥ γ } Enfin, le modèle procède à une désambiguïsation globale qui permet d'unifier les entités retenues en prenant en compte la cohérence globale entre toutes les entités sélectionnées. On compare donc chaque candidat retenu avec l'ensemble des candidats retenus pour les autres mentions G(e j , m) = cos(y e j , y m G ) où y m G = e∈V m G y e et V m G = {e|(m , e) ∈ V G ∧ m = Φ(e j , m) = F F N N 3 ([Ψ(e j , m), G(e j , m)]) On obtient ainsi en sortie, pour chaque mention initiale du texte, l'entité à laquelle elle fait référence. C'est à partir de cette architecture que nous allons chercher à améliorer le modèle. Expériences et résultats Cette section présente les travaux réalisés pour remplacer les embeddings de mots Word2Vec (Mikolov et al., 2013) par des embeddings plus robustes. Il a été choisi d'utiliser BERT (Devlin et al., 2018) car il s'agit des embeddings contextuels les plus performants de l'état de l'art. De plus, la première étape du modèle consiste à transformer les embeddings de mots en embeddings de contexte par l'intermédiaire d'un bi-LSTM. Protocole expérimental Trois manières d'utiliser les embeddings contextuels BERT (Devlin et al., 2018) sont explorées. -La première (Hypothèse 1) consiste à remplacer la couche d'embeddings de mots et le bi-LSTM de contextualisation par les embeddings BERT. L'idée est de considérer que les embeddings contextuels de BERT ont déjà l'information initialement produite par le bi-LSTM et peuvent donc le remplacer. Le but est de vérifier s'ils sont plus performants que ceux générés par le modèle. -La seconde (Hypothèse 2) consiste à remplacer les embeddings de mots par les embeddings contextuels BERT. L'idée ici est de considérer que les embeddings contextuels BERT peuvent être assimilés à des embeddings de mots (et non plus contextels) plus puissants que ceux de Word2Vec. Ils passent donc par le bi-LSTM afin de créer du contexte. -La dernière (Hypothèse 3) est de considérer que les embeddings BERT peuvent apporter de l'information supplémentaire et venir en soutien du bi-LSTM. L'idée est de combiner les embeddings BERT aux embeddings de contexte issus du bi-LSTM en supposant que la connaissance issue de BERT va ainsi améliorer la qualité de l'embedding contextuel global. Les trois méthodes ont donc été testées selon les protocoles décrits ci-dessous. Les expériences ont toutes été menées sur 50 itérations. Les autres paramètres d'apprentissage ont été conservés identiques à ceux originellement utilisés par Kolitsas (Kolitsas et al., 2018) à l'exception des modifications précisées. Utilisation des embeddings en tant qu'embeddings de mots Comme illustré dans la figure 2 , le modèle subit peu de modifications pour l'Hypothèse 1. On remplace uniquement les embeddings de mots initiaux (Word2Vec) par ceux extraits depuis BERT. (Devlin et al., 2018) . Après expérience, nous avons choisi de sommer les quatre dernières couches ce qui donne de meilleures performances par rapport aux autres méthodes de combinaison des couches BERT (Devlin et al., 2018) . Résultats et Analyses",
    "abstract": "Cet article présente les expériences effectuées sur un système de liage d'entités nommées. Cette tâche se découpe en deux principales parties que sont la détection de mentions méritant d'être liées à la base de connaissance et la désambiguïsation qui permet de sélectionner l'entité finale à lier à chaque mention. Deux approches existent pour résoudre cette tâche. Il y a celle de désambiguïsation seule et celle end-to-end qui effectue les deux sous-tâches simultanément. Nous nous sommes intéressés au modèle end-to-end atteignant l'état de l'art. Le coeur de ces expériences était d'exploiter des embeddings contextuels afin d'améliorer les performances. Trois approches ont été testées afin d'intégrer ces embeddings et de remplacer les embeddings de mots. Les différentes versions atteignent au mieux l'état de l'art. L'article présente quelques pistes déjà étudiées expliquant les raisons pour lesquelles les expériences testées ne dépassent pas le modèle initial et ouvrent des possibilités d'amélioration.",
    "countries": [
        "France"
    ],
    "languages": [],
    "numcitedby": "0",
    "year": "2021",
    "month": "6",
    "title": "Modification d{'}une mod{\\`e}le de liage d{'}entit{\\'e}s nomm{\\'e}es end-to-end par l{'}ajout d{'}embeddings contextuels (Modifying an end-to-end named entity linking model by adding contextual embeddings )"
}