{
    "article": "Language technologies, such as machine translation (MT), but also the application of artificial intelligence in general and an abundance of CAT tools and platforms have an increasing influence on the translation market. Human interaction with these technologies becomes ever more important as they impact translators' workflows, work environments, and job profiles. Moreover, it has implications for translator training. One of the tasks that emerged with language technologies is post-editing (PE) where a human translator corrects raw machine translated output according to given guidelines and quality criteria (O'Brien, 2011: 197-198). Already widely used in several traditional translation settings, its use has come into focus in more creative processes such as literary translation and audiovisual translation (AVT) as well. With the integration of MT systems, the translation process should become more efficient. Both economic and cognitive processes are impacted and with it the necessary competences of all stakeholders involved change. In this paper, we want to describe the different potential job profiles and respective competences needed when post-editing subtitles. Existing translation competence models In the last decades, different translation competence models have been developed (e.g., PACTE, 2003; Göpferich, 2009; EMT, 2009) , which have many competences in common, but also presented some differences (see Table 1 ). Often, professional translators are not only asked to translate, but also to revise translated texts. Further, MT output has become an established resource in the translation process. Accordingly, expanded competence models have been developed for revision (Robert et al., 2017) and PE (Nitzke et al., 2019) 1 : Competences and characteristics according to the different models showing the common competences (\"overlapping\") and competences that only occur in one of the models (model specific) As PE is a rather new task in the professional translation market, Nitzke et al.'s (2019) model was rather seen as a starting point for discussing the new field and few adjustments needed to be done. Figure 1 presents the revised model (Nitzke and Hansen-Schirra, in press) . The PE model is grounded on the translation competences, including bilingual, extralinguistic and research competence. These competences are the foundation of the model, as this is the basis for skilled post-editing. On the foundation stand three columns, which define additional competences. First, error handling describes the post-editor's competence to deal with errors in the MT output including error spotting, error classification, but also which errors to correct and how to correct these specific errors. Further, MT engineering competence describes not only the knowledge a post-editor needs to have about MT systems but also the ability to train and assess MT systems. Finally, post-editors should be able to consult direct clients, companies as well as agencies regarding risk assessment and service competences within the PE task. The model is topped by a figurative roof, the PE soft skills. These include, e.g., psycho-physiological components (concentration, attention despite repeated errors, stress, analytical thinking), an affinity towards the latest technological developments, the ability to handle PE briefs including guidelines for the PE task (information on target audience, text type skopos, and required effort), or the post-editor's self-perception and professional work ethos. Depending on the specialisation, these competences may play a major or a minor role resulting in three possible job perspectives, i.e., post-editor, MT engineer, and MT consultant (see Nitzke and Hansen-Schirra in press for more details). Since automation developments also affect AVT processes, the following section applies and further develops the competences needed for post-editing subtitles. Additional competences for post-editing subtitles Subtitling as a special form of translation is part of the subfield AVT, indicating that the text goes beyond written words and includes both verbal and non-verbal elements in the two audio and visual channels. According to Gottlieb (2005: 36) , subtitling is a diasemiotic form of translation of a polysemiotic text. Subtitling may describe intralingual or interlingual translation in that depending on the target audience different elements need to be translated from speech to written text within temporal and spatial constraints within a language or from a source language into a target language. Leaning on the definition by Díaz-Cintas (2020: 150), subtitling, or timed text, can be defined as the added, written, and condensed rendition of aural utterances (and sounds) and on-screen texts in the source or target language in one-to two-line captions displayed usually on the bottom of the screen in synch with the audio and image. This is done according to a particular style guide or guidelines (dictated by national regulations, companies, providers, etc.) which among others prescribe display times and segmentation rules. Further, subtitles may be either verbatim or reduced and prepared ahead of time or live. In this article, we discuss PE for prepared interlingual subtitling while also referencing to intralingual subtitling and live-(sub)titling as some of the competences overlap. Subtitling, either way, is a rather complex translation task dealing with polysemiotic text translated from the audiovisual to visual channel and thus requires, in addition to translation competences, specific subtitling competences. While some of the subtitling competences overlap with written translation competences, they can be broken down to the following sub competences according to Merchán's (2018: 471) taxonomy which is based on PACTE's translation competence model: (1) contrastive competences, i.e., an exhaustive knowledge and mastery of the source and target language both in written and oral comprehension including colloquial varieties and dialects; (2) extralinguistic competences, i.e., good knowledge of the cultures involved in the translation process and the target audience; film and theatre knowledge; familiarity with the language of film and visual semiotics as well as various features of different audiovisual texts and genres; (3) methodological and strategic competences, i.e., the theoretical knowledge of one or several AVT modes. Here, subtitling includes the mastery of techniques to visualize text and image simultaneously, the capacity of synthesis, i.e., techniques to streamline texts, capacity to use creative language resources and to analyse various genres and reproduce their discursive features (e.g., false orality) and finally mastery of synchronization and spotting techniques for subtitling; (4) instrumental competences, i.e., the mastery of AVT software for subtitling, specific software to digitize, codify and convert audiovisual files, speech recognition (SR) software (speaker-dependent and automatic) and mastery of strategies to retrieve information and other resources; (5) translation problem-solving competences, including knowledge of translation strategies and techniques to translate different audiovisual genres as well as the capacity to manage AVT projects (developing and organizing team projects). Díaz-Cintas and Remael (2019:57) point out \"linguistic competence, sociocultural awareness and subject knowledge are no longer sufficient\" in subtitling. Today, subtitlers need to be familiar with state-of-the-art information and communication technologies, demonstrate high technical know-how and quickly adapt to new programs and specifications as they typically work with multiple programs and clients. This may also include the use of ASR/SR and MT for PE subtitles. Thus, when considering the above-mentioned revised PE model and applying it to subtitling, these five subtitling sub competences need to be added to the task and can be visualized as the base of each of the three columns as seen in Figure 2 . In general, the model can be split into basic competences (foundation), specialised competences (column bases), and task-related competences (column). Different widths of the columns may express the focus on a specific task and thus help describe possible job profiles as later discussed in Section 3. These tasks require additional soft skills for PE (roof). Besides error handling of the MT output, when post-editing subtitles, the post-editor also needs to be familiar with subtitling-specific competences such as spotting, condensing by analysing image and sound (or audiovisual monitoring), and segmenting longer utterances across lines and subtitles while adhering to the given guidelines, which are far from a world-wide standard. Some of these skills may be less relevant when post-editing in template files, i.e., when the spotting and segmentation of subtitles is already set and translation, or in this case post-editing, is performed within the constraints of the template. The use of template files is nothing new in subtitling and they may be based on the original intralingual subtitles or on a subtitle file in English as a pivot language (see e.g., Artegiani and Kapsaskis 2014; Nikolić 2015; Georgakopoulou 2019) . Subtitle template files can be verbatim (word for word, similar to a transcript) and based on automatic subtitles or they can be sensatim (meaning for meaning) and thus reduced in nature leaving out words while containing the original meaning (Eugeni and Caro 2019) ; these are most often human-generated subtitles. Further, template files can be locked, with fixed spotting and a set number of subtitles, or unlocked with suggested segmentation and timing which can be adjusted by the subtitler or in this case post-editor (Oziemblewska and Szarkowska 2020: 4) . When working with pivot template files, the language of the original movie and the pivot template file differs, i.e., a Swedish movie is translated into German via an English template file by a subtitler without knowledge of Swedish. This may have further implications for the profile of the subtitle posteditor. In any case, when source language transcripts, intralingual subtitles or subtitle (pivot) template files are available, MT systems and PE processes can be used on these texts. An exploratory empirical study by Nitzke (2016) suggests, that PE should not be performed monolingually. The same is particularly true in subtitling and includes not only access to the written words of the source text but also access to the original video. Subtitling is the translation of polysemiotic texts which cannot be isolated from the images and sound in the video. When working with a locked subtitle file, one could argue that access to the original video is not necessary, especially in a pivot setup, when the video is in a language the subtitle post-editor does not understand anyways, and that it would only slow down the process. However, initial results from a study by Tardel (in print) with 13 translation students and 13 professional subtitlers suggests that in PE of movie transcripts via a pivot language the professional subtitlers worked with the video and performed more edits and still they were not significantly slower than students. The students in contrast mainly worked with the written scripts missing the context of the video. This suggests that access to the video is necessary for language-independent information extraction of the audiovisual source text. Here, the mentioned competence of audiovisual monitoring comes into play to support disambiguation during PE. If no subtitle file or source language transcript is available for MT, SR systems may be used to obtain a transcript in a previous step. This has already been applied in fully automatic setups using automatic speech recognition (ASR) in captioning on YouTube (Alberti and Bacchiani, 2009) and most recently in Google Chrome (Scharff and Kompalli, 2021) with varying quality from language to language and highly depending on the audio quality and speakers in the audiovisual material. YouTube and Google apply this directly to the unedited video and without human PE in the process resulting in verbatim subtitles and spotting which is based on the source language content. For professional subtitling settings, ASR quality control and PE is necessary to meet the respective quality expectations and efficiency gains. When ASR is used in combination with MT, recognition errors from the ASR might be transferred. Thus, post-editors will also have to be familiar with the types of errors generated by ASR systems which includes adjusting errors in automatic timing, compression, and segmentation. Work by Koponen et al. (2020) has shown in a small-scale study that PE of MT subtitles results in faster production with fewer keystrokes, but they point out that segmentation and timing of subtitles play a key role in the process when it comes to quality and production effort. To address this, Matusov et al. (2019) developed and tested a system for customizing NMT to subtitling by including a segmentation algorithm based on subtitle rules such as maximum characters per line and lines per subtitle in relation to the assumed reading speed, as well as punctuation, part-of-speech detection, and dialogue turns. As segmentation in subtitling is often not so straight forward, they trained a neural model for predicting segment boundaries. In their small-scale test with two post-editors, they found improved performance for the adapted MT system over the baseline MT system without the improved automatic segmentation. These developments show that adapting MT for subtitling is essential and its use for PE of subtitles has implications on the expected competences and performance of the subtitler. In contrast to ASR directly from the audio track of a given video, speaker-dependent SR is being applied in most live-subtitling settings both intralingual and interlingual with respeaking (see e.g., Romero-Fresco, 2020) . In contrast to scripted and non-scripted preproduced material, live content is translated into subtitles with a small decalage, similar to interpreting, by means of respeaking (or transpeaking) and simultaneous editing of the SR output. When applying respeaking and PE to preproduced content, similar competences are required as discussed in Pöchhacker and Remael (2019) . In preproduced content, however, more focus is put on carful spotting and segmentation. Overlapping competences that are relevant also for post-editing of prepared interlingual subtitles include the technicalmethodological competence regarding the speech recognition sub-competences transpeaking task & process, research and preparation as well as editing. When editing ASR outputirrespective of trained speaker-dependent SR in respeaking or the direct application of ASR to a video in order to obtain a transcriptthe PE subtitler also needs to have an understanding of the applied technology, which errors to expect, and how to correct them most efficiently. Here, the quality of the ASR is crucial in whether it is actually beneficial in the process. Results from a study carried out with video transcripts within the COMPASS project suggest that manual transcription is still preferred and faster when ASR quality is too low (Hansen-Schirra et al., 2020; Tardel, 2020) . Similar results were also obtained by Matamala et al. (2017) in a small-case study comparing manual transcription to respeaking and editing ASR. They found the manual transcription yielded the better results compared to ASR and respeaking both regarding temporal effort and quality. Thus, similar to post-editing MT, also the editing of ASR requires competences along the three pillars error handling, ASR engineering and consulting. For applications where ASR produces not the required quality (due to, e.g., low-resource languages, too many speakers, heavy dialects, etc.), respeaking scenarios would also be a possible solution for prepared subtitle productions, giving the subtitler more control over the SR output and allowing the tailoring of the SR system with profiles for similar shows. This, however, has yet to be tested empirically and in realistic workflows. Before describing three possible job profiles that result from the above-mentioned model in Figure 2 , we can conclude that subtitlers working as post-editors of subtitles that are (semi-) automatically generated require fundamental technical-methodological competences regarding MT and SR/ASR including automatic spotting and compression in addition to written translation and post-editing competences and subtitling competences. Job profiles for post-editing subtitles When MT output is post-edited in the subtitling context, it has implications regarding the necessary competences of the subtitler as well as the respective guidelines and quality expectations. PE for subtitling often not only includes the editing of the machine translated text, but the post-editor also has to time and segment the subtitles. Further, the subtitles must comply with what is shown in the images. Information visible in the image might therefore easily be left out in the subtitles when time and space constraints do not allow for verbatim subtitles. Despite the differences, similar considerations apply to subtitlers and written translators. The job profiles presented in Nitzke and Hansen-Schirra (in press ) may be transferred and adapted to AVT settings, in particular interlingual subtitling as visualized in Figure 2 . In the practical post-editing for subtitling profile, a subtitler (or subtitle quality controller, i.e., proofreader) with PE experience performs the PE task. This profile Subtitle Post-Editor has also been discussed by Georgakopoulou and Bywood (2014: 27) as well as Bywood et al. (2017: 502) . They suggest two options, either the job could be performed by subtitlers with special training in PE or trained post-editors from written translation with special training on subtitling and AVT. Either way, for both the two essential translation competences of the foundation as well as the PE soft skills of the roof apply. The decision who performs the post-editing of subtitles heavily depends on whether the post-editing is performed in a template file (locked or unlocked), on fully automatic subtitles, or with a translated transcript without provided segmentation and timings. In contrast to locked template files more of the subtitling-specific competences are required as this involves spotting, reduction, and segmentation. Thus, besides the aforementioned specific PE skills, post-editors for subtitling need to have knowledge of the client-specific subtitle conventions such as spotting, reduction, segmenting and adjustments from speech to written text as well as matching of the text with the image. ASR & MT engineers for subtitling need competences regarding system requirement and training processes including approaches for speech processing and language processing. They need the ability to train and assess both ASR and or MT systems in order to perfectly tailor them to the needs of the subtitle post-editor. They therefore need to be aware of the nature of subtitles as synchronized, condensed, and segmented text across lines and subtitles as well as in general of the differences between speech and written text. Further they need to be aware that subtitles may include several languages besides the designated source and target language. Moreover, they need an understanding of different style guides that may depend on the target language, medium, broadcaster or streaming provider. Among others these include subtitle and line length, assumed reading times, and segmentation rules as well as differences in formatting for narrators or forced subs. These could be implemented in customized ASR, MT, and automatic segmentation solutions or at the side of the subtitler when post-editing in the subtitling software that has been configured regarding the specifics of the respective style guide. In addition, engineers need to be aware of different subtitle file formats, availability, and quality of training material (i.e., aligned subtitle files). A third job profile is MT consulting for subtitling, where among others an added understanding of the subtitled media content is required in order to perform the necessary risk management and proper consulting. This includes for movies, knowledge on film rights, genres, and processes of film production and distribution depending whether the content is broadcast on TV, distributed via DVD or online platforms. Subtitled media may also include educational content or subtitles for communication within companies with different impact of quality issues and therefore affecting risk management. Again, translation competences and PE soft skills are essential to grasp the entirety of the task and to best consult language service providers and film producers or distributors alike on when and how to apply MT and PE. This role would be suitable for project managers working in AVT with training on PE. Conclusion We have shown in this paper that the three suggested PE job profiles can easily be adapted to the subtitling context. Hence, they might also be applicable to other job profiles that make use of MT and PE processes in the translation industry. While adapting the job profiles, the focus has to be on what other competences and knowledge might become relevant and need to be included. Especially when looking at specialized translation settings, the three roles can be adapted with regards to domain-specific translation purposes, but also to more creative text types like marketing or literary translation. Each column of the model can thus be complemented with a base containing specialised knowledge and competences. Further discussions are needed for the translation of non-scripted audiovisual material. As mentioned, possible solutions include the application of ASR and post-editing of the ASR output. Another avenue could be the application of respeaking and transpeaking, similar to live subtitling, with editing of the improved SR output. After a transcription (manually, semiautomatic with PE of ASR or fully automatic), MT could be used to further translate the content into lower-resource languages via PE. This could be performed on complete transcripts, verbatim or reduced sensatim subtitle template files. Finally, we propose that the job profiles are implemented in translator training and not as a separate PE add-on afterwards. All three job profiles, both for PE of written texts as well as subtitles, have translation competences at their foundation. Thus, MT engineers and consultants should also have a thorough understanding of translation in order to enter the conversation with the users, i.e., translators and subtitlers. However, it might not be possible to include all necessary aspects of the specialisations in translation curricula as time and capacities are limited and the aim should be to provide modules and trainings for additional competence acquisition.",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 1.9361263126072004e-07,
        "foundation": 0.0,
        "none": 0.999311273830822
    },
    "reasoning": "Reasoning: The provided text does not mention any specific funding sources, including defense, corporate, research agencies, foundations, or an absence of funding. Without explicit mention of funding sources or acknowledgments attributing support to the research, it is not possible to determine the presence of funding from the described categories based solely on the content provided.",
    "abstract": "Language technologies, such as machine translation (MT), but also the application of artificial intelligence in general and an abundance of CAT tools and platforms have an increasing influence on the translation market. Human interaction with these technologies becomes ever more important as they impact translators' workflows, work environments, and job profiles. Moreover, it has implications for translator training. One of the tasks that emerged with language technologies is post-editing (PE) where a human translator corrects raw machine translated output according to given guidelines and quality criteria (O'Brien, 2011: 197-198). Already widely used in several traditional translation settings, its use has come into focus in more creative processes such as literary translation and audiovisual translation (AVT) as well. With the integration of MT systems, the translation process should become more efficient. Both economic and cognitive processes are impacted and with it the necessary competences of all stakeholders involved change. In this paper, we want to describe the different potential job profiles and respective competences needed when post-editing subtitles.",
    "countries": [
        "Germany"
    ],
    "languages": [
        "Swedish",
        "English",
        "German"
    ],
    "numcitedby": 0,
    "year": 2021,
    "month": "August",
    "title": "Post-Editing Job Profiles for Subtitlers"
}