{
    "framing_question": "What information does the paper provide about the researchers’ positionality, if any?\"",
    "response": "The paper does not provide any information about the researchers' positionality.",
    "article": "Les récents développements des approches d'apprentissage neuronal profond ont permis des avancées très significatives dans le domaine de l'interrogation des systèmes d'information en langage naturel. Cependant, pour le français, les ressources à disposition ne permettent de considérer que les requêtes sur des données stockées sous forme de texte. Or, aujourd'hui la majorité des données utilisées en entreprise sont stockées sous forme tabulaire. Il est donc intéressant d'évaluer si les ressources anglophones associées (jeux de données tabulaires et modèles) peuvent être adaptées au français tout en conservant de bons résultats. Introduction Ces dernières années les avancées en traitement automatique du langage permettent d'envisager des applications plus poussées dans des milieux professionnels, comme par exemple l'amélioration du traitement des données pour la gestion de la relation client (CRM). Ainsi le traitement des questions en langage naturel sur des données peut être très prometteur. Le traitement des questions en langage naturel a connu un vif intérêt, à l'image du jeu de données SQuAD présenté par (Rajpurkar et al., 2018) , qui fait désormais partie du jeu de tâche du benchmark GLUE (Wang et al., 2019) . La tâche consiste à extraire les portions de textes qui permettent de répondre à la question posée. Or, la plupart des données sont stockées sous forme d'une base de données tabulaire. Ainsi, dans le cadre de données stockées dans une base SQL, le contexte des questions serait une table de données, et la réponse serait alors une traduction de cette question en SQL. Plusieurs jeux de données ont été réalisés afin de répondre à cette tâche d'analyse de données tabulaires, que ce soit en se focalisant sur des questions générales et complexes (Pasupat & Liang, 2015) , plusieurs questions simples (Iyyer et al., 2017) , ou en cherchant une traduction la plus fidèle qui soit d'un langage naturel vers le SQL (Zhong et al., 2017) . Si chacun de ces jeux de données propose un modèle associé, on peut toutefois remarquer que le modèle TAPAS proposé par (Herzig et al., 2020) , utilise d'une manière originale l'architecture BERT (Devlin et al., 2019) , pour proposer un nouveau traitement de cette tâche ; il donne actuellement les meilleurs résultats. Cependant toutes ces ressources ne sont conçues que pour un usage qui concerne la langue anglaise. Par suite, l'on peut se demander dans quelle mesure une nouvelle collecte de données est nécessaire pour obtenir un modèle équivalent à TAPAS pour le français. C'est pourquoi nous proposons ici une traduction du jeu de données proposé par (Zhong et al., 2017) , ainsi que son évaluation sur une version ré-entraînée du modèle TAPAS, afin de déterminer si ce jeu de données obtenu par traduction d'une ressource anglophone est suffisant pour obtenir un modèle de traitement de questions en langage naturel sur des données tabulaires en français. Plus précisément, nous souhaitons établir dans quelle mesure ce modèle ré-appris sur les données traduites produit des résultats comparables à ceux obtenus pour l'anglais sur une tâche équivalente. Présentation des jeux de données Afin de réaliser la tâche de traduction du langage naturel en une expression SQL, plusieurs jeux de données peuvent être exploités : -WIKITableQuestion (Pasupat & Liang, 2015) est un jeu de données composé de questions sur des tables HTML issues de Wikipedia auxquelles sont associées des questions complexes réalisées par des humains à qui il a été demandé de créer, suivant une table donnée, des questions complexes dont la réponse nécessite plusieurs opérations sur la table (agrégation, comparaisons, superlatifs, opérations mathématiques). Au total il comprend 22 033 questions sur 2 108 tables. -SQA (Iyyer et al., 2017) : cet ensemble de données a été construit en demandant à des humains de décomposer un sous-ensemble de questions hautement compositionnelles de WIKITQ, où chaque question décomposée résultante peut être renseignée par une ou plusieurs cellules d'une table SQL. L'ensemble final se compose de 6 066 séquences de questions avec 2,9 questions par séquence en moyenne. -WikiSQL (Zhong et al., 2017) : ce jeu de données se concentre sur la traduction de texte en SQL. Il a été construit en demandant à des humains de paraphraser une question basée sur un modèle en langage naturel, deux autres étant invités à vérifier la qualité des paraphrases proposées. Le résultat est un ensemble de 80 654 questions sur 24 241 tables issues de Wikipédia. Entre ces trois jeux de données, notre choix s'est porté sur WikiSQL, car c'est le plus important d'un point de vue quantitatif, mais aussi parce qu'il fait office de benchmark pour cette tâche, étant souvent cité en ce sens ( (Baik et al., 2019 ), (Lyu et al., 2020) ). De plus dans leur article présentant le modèle, (Herzig et al., 2020) ont pu tester l'apprentissage par transfert de WIKISQL vers un autre jeu de données avec un certain succès. Notre expérience étant fondée sur cette application de l'apprentissage par transfert sur des données traduites, le choix de ce jeu de donné semble justifié. De la même manière que (Kabbadj, 2018) ont proposé une traduction du jeu de données SQuAD en utilisant l'API de google traduction, nous proposons une version traduite du jeu de données WikiSQL en utilisant cette même API. Cette tâche de traduction comporte trois étapes : -la traduction de la question en langage naturel de l'anglais vers le français -la traduction des entêtes des colonnes de la Au lieu de créer un modèle contraint à une structure de table spécifique, Google a fait le choix d'une approche plus globale en créant un réseau de neurones adapté à toute forme de jeu de données tabulaires. Son modèle TAPAS réutilise l'architecture de l'encodeur BERT, en y ajoutant des plongements supplémentaires. L'ajout le plus notable au modèle de base BERT est l'intégration d'informations supplé-mentaires pour l'encodage de l'entrée textuelle. Tapas exploite les incorporations apprises pour les index de ligne et de colonne ainsi que pour un index de rang spécial qui représente l'ordre des éléments dans les colonnes numériques. L'architecture obtenue surpasse actuellement les autres modèles pour l'interrogation en langage naturel de données tabulaires. Le modèle TAPAS est assez similaire à BERT mais il en diffère par l'ajout à son tokenizer des plongements des positions relatives, ainsi que sept tokens modélisant les tables. TAPAS est pré-appris sur une tâche de modèle masqué 1 , à l'aide de millions de tables venant de la version anglaise de Wikipedia et les textes correspondants. Enfin, TAPAS est entraîné plus finement sur une tâche des réponses aux questions. Le modèle cherche alors à prédire deux choses : les cellules correctes associées à la réponse et l'agrégateur correspondant. Application et résultats 4.1 Apprentissage du modèle Outre les ajouts et modifications apportés au modèle BERT originel décrit précédemment, TAPAS suit un protocole d'apprentissage en trois étapes qui s'appuie sur plusieurs jeux de données. La première étape consiste en un pré-entraînement sur un jeu de données de 6,2 millions de tables anglophones extraites de Wikipedia suivant le modèle de masquage proposé dans BERT (Devlin et al., 2019) . Le but ici est d'initialiser l'entraînement du modèle à partir du contexte constitué des éléments qui composent la table traitée : la tâche consiste à retrouver certains éléments masqués de ce contexte. Cette étape de pré-apprentissage est suivie d'une étape d'ajustement fin (fine tuning) qui finalise 1. Masked language modeling (MLM) Dans leurs travaux les plus récents sur le modèle (Eisenschlos et al., 2020) , les auteurs ont ajouté une étape intermédiaire d'apprentissage. Pour notre expérimentation, nous sommes partis de ce modèle ayant bénéficié de ce pré-entraînement supplémentaire. Expérimentation sur les données francophones Le but de l'expérimentation est de déterminer dans quelle mesure ce nouveau jeu de données francophones impacte les performances du modèle TAPAS. Ainsi l'un des modèles TAPAS entraîné sur WikiSQL pour la langue anglaise sert de modèle témoin. À cela on compare un modèle suivant la même architecture et ayant reçu le même pré-entraînement, mais dont l'entraînement fin a été réalisé sur le nouveau jeu de données francophones. Les deux jeux de données sont alors testés sur leurs jeux de données respectifs. Un schéma récapitule ce processus en figure 3 , les indicateurs de sont les mêmes que ceux décrits dans l'article originel de Tapas. Conclusion et travaux futurs Si les résultats propres de l'expérience ne permettent pas d'en déduire pour l'instant une réelle efficacité du modèle en situation réelle, ils permettent néanmoins d'encourager cette approche de traduction de jeu de données. En effet on peut espérer de meilleurs résultats avec un apprentissage plus long, ou un jeu de données traduit et relu, ce qui allégerait la tâche d'expertise humaine nécessaire à l'obtention d'un jeu de données pour cette tâche de traitement de requêtes en français sur des données tabulaires. De plus ces résultats nous éclairent sur l'usage de l'apprentissage fin, qui permet d'une part d'adapter plus facilement de larges modèles à de nouvelles langues, et d'autre part d'éviter de travailler sur des modèles complets souvent très volumineux ; dans notre cas les données de pré-apprentissage forment un corpus de 6.2 millions de tables. Enfin, des résultats complémentaires permettront d'affiner les conclusions et perspectives de cette étude, comme sur l'influence de la traduction sur les performances d'exactitude. On peut aussi imaginer un modèle suivant la même architecture mais prenant en compte des données francophones sur chaque étape de l'apprentissage. Références AIKEN M. ( 2019 ). An updated evaluation of google translate accuracy. Studies in Linguistics and Literature, 3, p253. DOI : 10.22158/sll.v3n3p253. 2. Tels que présentés dans l'article de (Eisenschlos et al., 2020) , après entraînement sur TPU.",
    "funding": {
        "military": 0.0,
        "corporate": 0.0,
        "research agency": 0.0,
        "foundation": 3.128162811005808e-07,
        "none": 0.9999998063873687
    }
}