{
    "article": "La reconnaissance d'entités nommées est une tâche de traitement automatique du langage naturel bien étudiée et utile dans de nombreuses applications. Dernièrement, les modèles neuronaux permettent de la résoudre avec de très bonnes performances. Cependant, les jeux de données permettant l'entraînement et l'évaluation de ces modèles se concentrent sur un nombre restreint de domaines et types de documents (articles journalistiques, internet). Or, les performances d'un modèle entraîné sur un domaine ciblé sont en général moindres dans un autre : ceux moins couverts sont donc pénalisés. Pour tenter de remédier à ce problème, cet article propose d'utiliser une technique d'augmentation de données permettant d'adapter un corpus annoté en entités nommées d'un domaine source à un domaine cible où les types de noms rencontrés peuvent être différents. Nous l'appliquons dans le cadre de la littérature de fantasy, où nous montrons qu'elle peut apporter des gains de performance. Introduction La reconnaissance d'entités nommées (REN) a bénéficié récemment des avancées en apprentissage profond (Li et al., 2020) , et notamment de l'arrivée des modèles de langue neuronaux contextuels pré-entrainés, tels que BERT (Devlin et al., 2019) . Ceux-ci ont en effet permis d'améliorer les performances de nombreuses tâches de traitement automatique du langage naturel (TALN). Malgré les performances élevées dont font preuve ces modèles pour la REN, celle-ci est encore loin d'être considérée comme résolue (Stanislawek et al., 2019) . L'un des défauts de ces modèles provient de leurs données d'entraînement et d'évaluation. En effet, s'il existe de nombreux corpus annotés en entités nommées pour certains domaines (on peut citer le corpus journalistique CoNLL-2003 (Tjong Kim Sang & De Meulder, 2003) , le corpus multi-domaines OntoNotes (Weischedel et al., 2011) ou encore WikiGold (Balasuriya et al., 2009) , tiré de Wikipédia), d'autres sont plus délaissés et n'ont que peu ou pas de corpus dédiés : c'est le cas, par exemple, du domaine littéraire. Un modèle entraîné sur les données d'un domaine spécifique étant généralement moins performant lorsqu'il est appliqué sur celles d'un autre, ce délaissement se traduit par des performances moindres dans les domaines n'ayant pas de données annotées. Dans ce contexte, il est donc intéressant de disposer de techniques permettant d'adapter un corpus ou un modèle d'un domaine source, où l'on possède beaucoup de données, à un domaine cible plus pauvre en ressources. Plusieurs possibilités existent pour réaliser cette adaptation. Gururangan et al. (2020) montrent par exemple que continuer de pré-entraîner un modèle neuronal contextuel sur le domaine cible permet d'augmenter les performances dans celui-ci. Malheureusement, ce pré-entraînement est plus coûteux que l'affinage (fine-tuning) d'un modèle pré-entraîné. Une autre voie possible est l'adaptation du corpus original par augmentation. L'augmentation de données est une technique devenue standard en apprentissage profond pour le traitement de l'image (Shorten & Khoshgoftaar, 2019) . Des opérations comme le recadrement (cropping), le retournement (flipping) ou l'ajout de bruit permettent de créer des exemples synthétiques supplémentaires, ce qui accroît le nombre de données d'entraînement. Comparativement, elle est moins explorée en TALN, bien que des recherches récentes commencent à s'y intéresser (Feng et al., 2021) . En effet, il ne paraît pas aussi facile de générer de nouveaux exemples à partir du texte, car cela requiert de garder la cohérence de la phrase tout en la modifiant. L'augmentation de données est encore moins explorée dans le cadre de la REN, car celle-ci se heurte à des problèmes spécifiques : certaines techniques classiques d'augmentation (comme le remplacement par un synonyme, l'échange de mots ou encore l'insertion aléatoire (Wei & Zou, 2019)) peuvent notamment engendrer des exemples synthétiques avec des labels incorrects (Dai & Adel, 2020) . Il existe tout de même quelques travaux utilisant cette technique pour adapter des corpus à un autre domaine. Ding et al. (2020) proposent d'entraîner un modèle de langage pour générer des exemples synthétiques dans le cas où peu d'exemples sont disponibles, mais supposent cependant l'existence d'un minimum d'exemples déjà annotés. Chen et al. (2021) décrivent une architecture neuronale capable d'apprendre à transformer une phrase d'un domaine source vers un domaine cible, et s'en servent pour générer des exemples synthétiques proches du domaine cible. Néanmoins, leur méthode nécessite d'entraîner cette architecture, ce qui demande aussi de disposer de quelques exemples annotés dans le domaine cible. Nous présentons dans cet article une méthode d'augmentation des données, le remplacement de mentions (Dai & Adel, 2020) , pour permettre d'adapter un corpus annoté en entités nommées d'un domaine à un autre. Cette méthode a l'avantage de la simplicité, et de ne pas demander l'annotation de données du domaine cible. Elle consiste à générer de nouveaux exemples en remplaçant, dans une phrase du corpus original, une entité nommée par une autre du même type. Nous décrivons notre méthode dans la Section 2. Pour montrer l'intérêt de cette technique, nous expérimentons en adaptant le corpus CoNLL-2003 (Tjong Kim Sang & De Meulder, 2003) , qui couvre originellement le domaine journalistique, à celui de la littérature de fantasy. Nous discutons les résultats obtenus en Section 3. Protocole Expérimental Jeux de données Nous utilisons deux jeux de données différents, provenant de deux sources distinctes, tous deux composés de textes en anglais. Nous nous concentrons sur les entités nommées désignant des personnes. Dekker et al. (2019) ont procédé à une évaluation de plusieurs modèles de REN, en annotant un corpus littéraire pour les entités de type PERSONNE. Il se compose du premier chapitre de 40 romans. Cependant, d'après nos observations, ce jeu de données souffre de problèmes d'annotations (erreurs et incohérences), d'encodage et de tokenisation, que nous avons donc cherché à corriger. Nous avons rectifié les problèmes d'encodage et de tokenisation manuellement. Afin de pallier les erreurs et les incohérences, nous avons défini un ensemble de règles d'annotation que nous avons appliquées à tout le corpus grâce à un processus semi-automatique. Celui-ci s'articule en 3 étapes : 1) l'application d'heuristiques de correction supervisées par un humain, puis 2) une correction assistée à l'aide d'un modèle BERT (Devlin et al., 2019) , et finalement 3) une correction manuelle en dernier ressort. Nos résultats sont évalués sur le sous-ensemble de ce corpus formé par les 17 romans de fantasy qu'il contient. Jeu d'évaluation Modèle et Entraînement Nous utilisons un modèle BERT-base (Devlin et al., 2019) pré-entraîné, obtenu via la librairie huggingface (Wolf et al., 2020), auquel nous apposons une couche neuronale de classification. Ce modèle est affiné (fine-tuning) sur notre corpus d'entraînement pendant 2 cycles d'apprentissage avec un taux d'apprentissage de 2 • 10 −5 (Devlin et al., 2019) . Augmentation des données Nous proposons l'utilisation d'une technique simple, le remplacement de mentions (Dai & Adel, 2020), pour adapter un corpus annoté en entités nommées d'un domaine source vers un domaine cible. Afin de générer un nouvel exemple, nous partons d'un exemple de départ et remplaçons une mention (un passage continu du texte annoté comme une entité) et ses mentions équivalentes (les autres passages identiques de l'exemple) par une autre entité de même type récupérée dans une liste prédéfinie. La longueur des passages remplacés pouvant être modifiée, les labels sont ajustés en fonction. La Figure 1 p < 0.05). La Table 1 indique les résultats de nos expérimentations. Nous calculons la précision, le rappel et la F-mesure selon la méthode du CoNLL-2003 (Tjong Kim Sang & De Meulder, 2003) en utilisant la librairie python seqeval (Nakayama, 2018) . L'augmentation externe intra-domaine (fantasy) avec un taux d'augmentation de 5 % donne une amélioration significative de la F-mesure, ce qui met en valeur l'utilité d'injecter des noms proches du corpus cible lors de l'entraînement. De manière générale, on observe une augmentation du rappel et une baisse de la précision pour toutes les configurations, effet qui semble augmenter avec l'accentuation du taux d'augmentation, jusqu'à un certain point. L'augmentation parfaite (dekker) démontre bien cet effet, avec un rappel très élevé mais une précision tout de même amoindrie. Elle démontre aussi une marge de progression de la performance importante, avec une augmentation du rappel de plus de 11 points par rapport à la configuration sans augmentation (none). Hors augmentation parfaite, l'augmentation externe intra-domaine semble avoir le plus d'effets, avec l'accroissement du rappel le plus important mais également la baisse de précision la plus importante. L'augmentation du rappel nous permet de remarquer que certaines classes de noms sont mieux reconnues par le modèle dans la configuration fantasy : -Les noms qui sont aussi des noms communs (\"Bug\", \"Silent\", \"Weasel\"). -Les noms de fantasy à apostrophes, tels que \"Rand al'Thor\" ou \"Bran al'Vere\".",
    "abstract": "La reconnaissance d'entités nommées est une tâche de traitement automatique du langage naturel bien étudiée et utile dans de nombreuses applications. Dernièrement, les modèles neuronaux permettent de la résoudre avec de très bonnes performances. Cependant, les jeux de données permettant l'entraînement et l'évaluation de ces modèles se concentrent sur un nombre restreint de domaines et types de documents (articles journalistiques, internet). Or, les performances d'un modèle entraîné sur un domaine ciblé sont en général moindres dans un autre : ceux moins couverts sont donc pénalisés. Pour tenter de remédier à ce problème, cet article propose d'utiliser une technique d'augmentation de données permettant d'adapter un corpus annoté en entités nommées d'un domaine source à un domaine cible où les types de noms rencontrés peuvent être différents. Nous l'appliquons dans le cadre de la littérature de fantasy, où nous montrons qu'elle peut apporter des gains de performance.",
    "countries": [
        "France"
    ],
    "languages": [],
    "numcitedby": "0",
    "year": "2022",
    "month": "6",
    "title": "Remplacement de mentions pour l{'}adaptation d{'}un corpus de reconnaissance d{'}entit{\\'e}s nomm{\\'e}es {\\`a} un domaine cible (Mention replacement for adapting a named entity recognition dataset to a target domain)"
}