{
    "article": "We present a benchmark suite of four datasets for evaluating the fairness of pre-trained language models and the techniques used to fine-tune them for downstream tasks. Our benchmarks cover four jurisdictions (European Council, USA, Switzerland, and China), five languages (English, German, French, Italian and Chinese) and fairness across five attributes (gender, age, region, language, and legal area). In our experiments, we evaluate pretrained language models using several grouprobust fine-tuning techniques and show that performance group disparities are vibrant in many cases, while none of these techniques guarantee fairness, nor consistently mitigate group disparities. Furthermore, we provide a quantitative and qualitative analysis of our results, highlighting open challenges in the development of robustness methods in legal NLP. Introduction Natural Language Processing (NLP) for law (Chalkidis and Kampas, 2019; Aletras et al., 2019; Zhong et al., 2020; Chalkidis et al., 2022) receives increasing attention. Assistive technologies can speed up legal research or discovery significantly assisting lawyers, judges and clerks. They can also help legal scholars to study case law (Katz, 2012; Coupette et al., 2021) , improve access of law to laypersons, help sociologists and research ethicists to expose biases in the justice system (Angwin et al., 2016; Dressel and Farid, 2018) , and even scrutinize decision-making itself (Bell et al., 2021) . In the context of law, the principle of equality and non-discrimination is of paramount importance, although its definition varies at international, regional and domestic level. For example, EU nondiscrimination law prohibits both direct and indirect discrimination. Direct discrimination occurs when one person is treated less favourably than others would be treated in comparable situations on grounds of sex, racial or ethnic origin, disability, sexual orientation, religion or belief and age. 1  Given the gravity that legal outcomes have for individuals, assistive technologies cannot be adopted to speed up legal research at the expense of fairness (Wachter et al., 2021) , potentially also decreasing the trust in our legal systems (Barfield, 2020) . Societal transformations perpetually shape our legal systems. The topic deserves great attention because AI systems learning from historical data pose the risk of lack of generalisability beyond the training data, and more importantly transporting biases previously encumbered in the data in future decision-making, thereby exponentially increasing their effect (Delacroix, 2022) . Historical legal data do not represent all groups in our societies equally and tend to reflect social biases in our societies and legal institutions. When models are deployed in production, they may reinforce these biases. For example, criminal justice is already often strongly influenced by racial bias, with people of colour being more likely to be arrested and receive higher punishments than others, both in the USA 2 and in the UK. 3  In recent years, the NLP and machine learning literature has introduced fairness objectives, typically derived from the Rawlsian notion of equal opportunities (Rawls, 1971) , to evaluate the extent to which models discriminate across protected attributes. Some of these rely on notions of resource allocation, i.e., reflecting the idea that groups are treated fairly if they are equally represented in the training data used to induce our models, or if the same number of training iterations is performed per group. This is sometimes referred to as the resource allocation perspective on fairness (Lundgard, 2020) . Contrary, there is also a capability-centered approach to fairness (Anderson, 1999; Robeyns, 2009) , in which the goal is to reserve enough resources per group to achieve similar performance levels, which is ultimately what is important for how individuals are treated in legal processes. We adopt a capability-centered approach to fairness and define fairness in terms of performance parity (Hashimoto et al., 2018) or equal risk (Donini et al., 2018) . 4  Performance disparity (Hashimoto et al., 2018 ) refers to the phenomenon of high overall performance, but low performance on minority groups, as a result of minimizing risk across samples (not groups). Since some groups benefit more than others from models and technologies that exhibit performance disparity, this likely widens gaps between those groups. Performance disparity works against the ideal of fair and equal opportunities for all groups in our societies. We therefore define a fair classifier as one that has similar performance (equal risk) across all groups (Donini et al., 2018) . In sum, we adopt the view that (approximate) equality under the law in a modern world requires that our NLP technologies exhibit (approximately) equal risk across sensitive attributes. For everyone to be treated equally under the law, regardless of race, gender, nationality, or other characteristics, NLP assistive technologies need to be (approximately) insensitive to these attributes. We consider three types of attributes in this work: • Demographics: The first category includes demographic information of the involved parties, e.g., the gender, sexual orientation, nationality, age, or race of the plaintiff/defendant in a case. In this case, we aim to mitigate biases against specific groups, e.g., a model performs worse for female defendants or is biased against black defendants. We can further consider information involving the legal status of involved parties, e.g., person vs. company, or private vs. public. • Regional: The second category includes regional information, for example the courts in charge of a case. In this case, we aim to mitigate disparity inbetween different regions in a given jurisdiction, e.g., a model performs better in specific cases originated or ruled in courts of specific regions. Related Work Fair machine learning The literature on inducing approximately fair models from biased data is rapidly growing. See Mehrabi et al. (2021) ; Makhlouf et al. (2021) ; Ding et al. (2021) for recent surveys. We rely on this literature in how we define fairness, and for the algorithms that we compare in our experiments below. As already discussed, we adopt a capability-centered approach to fairness and define fairness in terms of performance parity (Hashimoto et al., 2018) or equal risk (Donini et al., 2018) . The fairness-promoting learning algorithms we evaluate are discussed in detail in Section 4. Some of these -Group Distributionally Robust Optimization (Sagawa et al., 2020) and Invariant Risk Minimization (Arjovsky et al., 2020) -have previously been evaluated for fairness in the context of hate speech (Koh et al., 2021) . Fairness in law Studying fair machine learning in the context of legal (computational) applications has a limited history. In a classic study, Angwin et al. (2016) analyzed the performance of the Correctional Offender Management Profiling for Alternative Sanctions (COMPAS) system, which was used for parole risk assessment (recidivism prediction) in the US. The system relied on 137 features from questionnaires and criminal records. Angwin et al. found that blacks were almost twice as likely as whites to be mislabeled as high risk (of reoffending), revealing a severe racial bias in the system. The system was later compared to crowdworkers in Dressel and Farid (2018) . These studies relied on tabular data and did not involve text processing (e.g., encoding case facts or decisions). More recently, Wang et al. (2021b) studied legal judgment consistency using a dataset of Chinese criminal cases. They evaluated the consistency of LSTM-based models across region and gender and reported severe fairness gaps across gender. They also found that the fairness gap was particular severe for more serious crimes. Another line of work (Rice et al., 2019; Baker Gillis, 2021; Gumusel et al., 2022) explores representational bias with respect to race and gender analyzing word latent representations trained in legal text corpora. While we agree that representational bias can potentially reinforce unfortunate biases, these may not impact the treatment of individuals (or groups). We therefore focus on directly measuring equal risk on downstream applications instead. Previous work has focused on the analysis of specific cases, languages or algorithms, but Fair-Lex aims at easing the development and testing of bias-mitigation models or algorithms within the legal domain. FairLex allows researchers to explore fairness across four datasets covering four jurisdictions (Council of Europe, United States of America, Swiss Confederation and People's Republic of China), five languages (English, German, French, Italian and Chinese) and various sensitive attributes (gender, age, region, etc.) . Furthermore, we provide competitive baselines including pre-trained transformer-based language models, adapted to the examined datasets, and an in-dept examination of performance of four group robust algorithms described in detail in Section 4. Benchmarking NLP has been stormed by the rapid development of benchmark datasets that aim to evaluate the performance of pre-trained language models with respect to different objectives: general Natural Language Understanding (NLU) (Wang et al., 2019b,a) , Cross-Lingual Transfer (CLT) (Hu et al., 2020) , and even domain-specific ones on biomedical (Peng et al., 2019) , or legal (Chalkidis et al., 2022) NLP tasks. Despite their value, recent work has raised criticism on several limitations of the so called NLU benchmarks (Paullada et al., 2020; Bowman and Dahl, 2021; Raji et al., 2021) . The main points are: poor (laissez-faire) dataset development (e.g., lack of diversity, spurious correlations), legal issues (e.g., data licensing and leakage of personal information), construct validity (e.g., poor experimental setup, unclear research questions), question of \"general\" capabilities, and promotion of superficial competitiveness (hype, or even falsify, state-of-the-art results). We believe that the release of FairLex, a domainspecific (legal-oriented) benchmark suite for evaluating fairness, overcomes (or at least mitigates) some of the aforementioned limitations. We introduce the core motivation in Section 1, while specific (case-by-case) details are described in Section 3. Our benchmark is open-ended and inevitably has several limitations; we report known limitations and ethical considerations in Sections 7 and 8. Nonetheless we believe that it will help critical research in the area of fairness. Benchmark Datasets ECtHR The European Court of Human Rights (ECtHR) hears allegations that a state has breached human rights provisions of the European Convention of Human Rights (ECHR). We use the dataset of Chalkidis et al. (2021) , which contains 11K cases from ECtHR's public database. Each case is mapped to articles of the ECHR that were violated (if any). This is a multi-label text classification task. Given the facts of a case, the goal is to predict the ECHR articles that were violated, if any, as decided (ruled) by the court. The cases are chronologically split into training (9k, 2001-16), development (1k, 2016-17), and test (1k, 2017-19) sets. To facilitate the study of fairness of text classifiers, we record for each case the following attributes: (a) The defendant states, which are the European states that allegedly violated the ECHR. et al., 2020) . SCDB provides metadata (e.g., date of publication, decisions, issues, decision directions and many more) for all cases. We consider the available 14 thematic issue areas (e.g, Criminal Procedure, Civil Rights, Economic Activity, etc.) as labels. This is a single-label multi-class document classification task. Given the court opinion, the goal is to predict the issue area whose focus is on the subject matter of the controversy (dispute). SCOTUS contains a total of 9,262 cases that we split chronologically into 80% for training (7.4k, 1946-1982) , 10% for development (914, (1982) (1983) (1984) (1985) (1986) (1987) (1988) (1989) (1990) (1991) and 10% for testing (931, . From SCDB, we also use the following attributes to study fairness: (a) the type of respondent, which is a manual categorization of respondents (defendants) in five categories (person, public entity, organization, facility and other); and (c) the direction of the decision, i.e., whether the decision is considered liberal, or conservative, provided by SCDB. FSCS The Federal Supreme Court of Switzerland (FSCS) is the last level of appeal in Switzerland and similarly to SCOTUS, the court generally hears only the most controversial or otherwise complex cases which have not been sufficiently well solved by lower courts. The court often focus only on small parts of previous decision, where they discuss possible wrong reasoning by the lower court. The Swiss-Judgment-Predict dataset (Niklaus et al., 2021) contains more than 85K decisions from the FSCS written in one of three languages (50K German, 31K French, 4K Italian) from the years 2000 to 2020. The dataset provides labels for a simplified binary (approval, dismissal) classification task. Given the facts of the case, the goal is to predict if the plaintiff's request is valid or partially valid. The cases are also chronologically split into training (59.7k, 2000-2014), development (8.2k, 2015-2016), and test (17.4k, 2017-2020) sets. The original dataset provides three additional attributes: (a) the language of the FSCS written decision, in either German, French, or Italian; (b) the legal area of the case (e.g., public, penal law) derived from the chambers where the decisions were heard; and (c) the region that denotes in which federal region was the case originated. CAIL The Supreme People's Court of China is the last level of appeal in China and considers cases that originated from the high people's courts concerning matters of national importance. The Chinese AI and Law challenge (CAIL) dataset (Xiao et al., 2018) is a Chinese legal NLP dataset for judgment prediction and contains over 1m criminal cases. The dataset provides labels for relevant article of criminal code prediction, charge (type of crime) prediction, imprisonment term (period) prediction, and monetary penalty prediction. 8  Recently, Wang et al. (2021b) re-annotated a subset of approx. 100k cases with demographic attributes. Specifically the new dataset has been annotated with: (a) the applicant's gender, classified in two categories (male, female); and (b) the region of the court that denotes in which out of the 7 provincial-level administrative regions was the case judged. We re-split the dataset chronologically into training (80k, 2013-2017), development (12k, 2017-2018), and test (12k, 2018) sets. In our study, we re-frame the imprisonment term prediction and examine a soft version, dubbed crime severity prediction task, a multi-class classification task, where given the facts of a case, the goal is to predict how severe was the committed crime with respect to the imprisonment term. We approximate crime severity by the length of imprisonment term, split in 6 clusters (0, ≤12, ≤36, ≤60, ≤120, >120 months). Fine-tuning Algorithms Across experiments, our main goal is to find a hypothesis for which the risk R(h) is minimal: h * = arg min h∈H R(h) (1) R(h) = E(L(h(x), y)) (2) where y are the targets (ground truth) and h(x) = ŷ is the system hypothesis (model's predictions). Similar to previous studies, R(h) is an expectation of the selected loss function (L). In this work, we study multi-label text classification (Section 3), thus we aim to minimize the binary cross-entropy loss across L classes: L = −y log ŷ − (1 − y) log(1 − ŷ) (3) ERM (Vapnik, 1992) , which stands for Empirical Risk Minimization, is the most standard and widely used optimization technique to train neural methods. The loss is calculated as follows: L ERM = N i=1 L i N ( 4 ) where N is the number of instances (training examples) in a batch, and L i is the loss per instance. Besides ERM, we also consider a representative selection of group-robust fine-tuning algorithms which aims at mitigating performance disparities with respect to a given attribute (A), e.g., the gender of the applicant or the region of the court. Each attribute is split into G groups, i.e., male/female for gender. All algorithms rely on a balanced group sampler, i.e., an equal number of instances (samples) per group (N G ) are included in each batch. Most of the algorithms are built upon group-wise losses (L g ), computed as follows: L(g i ) = 1 N g i N g i j=1 L(x j ) (5) Group DRO (Sagawa et al., 2020) , stands for Group Distributionally Robust Optimization (DRO). Group DRO is an extension of the Group Uniform algorithm, where the group-wise losses are weighted inversely proportional to the group training performance. The total loss is: L DRO = G i=1 w g i * L(g i ), where (6) w g i = 1 W ( ŵg i * e L(g i ) ) and W = G i=1 w g i (7) where G is the number of groups (labels), L g are the averaged group-wise (label-wise) losses, w g are the group (label) weights, ŵg are the group (label) weights as computed in the previous update step. Initially the weight mass in equally distributed across groups. V-REx (Krueger et al., 2020) , which stands for Risk Extrapolation, is yet another proposed grouprobust optimization algorithm. Krueger et al. (2020) hypothesize that variation across training groups is representative of the variation later encountered at test time, so they also consider the variance across the group-wise losses. In V-REx the total loss is calculated as follows: L REX = L ERM + λ * Var([L g 1 , . . . , L g G ]) (8) where Var is the variance among the group-wise losses and λ, a weighting hyper-parameter scalar. IRM (Arjovsky et al., 2020) , which stands for Invariant Risk Minimization, mainly aims to penalize variance across multiple training dummy estimators across groups, i.e., performance cannot vary in samples that correspond to the same group. The total loss is computed as follows: L IRM = 1 G         G i=1 L(g i ) + λ * P(g i )         (9) Please refer to Arjovsky et al. (2020) for the definition of the group penalty terms (P g ). Adversarial Removal (Elazar and Goldberg, 2018) algorithm mitigates group disparities by means of an additional adversarial classifier (Goodfellow et al., 2014) . The adversarial classifier share the encoder with the main network and is trained to predict the protected attribute (A) of an instance. The total loss factors in the adversarial one, thus penalizing the model when it is able to discriminate groups. Formally, the total loss is calculated as: L AR = L ERM − λ * L ADV (10) L ADV = L(ĝ i , g i ) ( 11 ) where ĝi is the adversarial classifier's prediction for the examined attribute A (in which group (g i ) of A, does the example belong to) given the input (x). 5 Experimental Setup For the purpose of this work, we release four domain-specific BERT models with continued pretraining on the corpora of the examined datasets. 9  We train mini-sized BERT models with 6 Transformer blocks, 384 hidden units, and 12 attention heads. We warm-start all models from the public MiniLMv2 models checkpoints (Wang et al., 2021a) using the distilled version of RoBERTa (Liu et al., 2019) for the English datasets (ECtHR, SCO-TUS) and the one distilled from XLM-R (Conneau et al., 2020) for the rest (trilingual FSCS, and Chinese CAIL). Given the limited size of these models, we can effectively use up to 4096 tokens in ECtHR and SCOTUS and up to 2048 tokens in FSCS and 9 https://huggingface.co/coastalcph CAIL for up to 16 samples per batch in a 24GB GPU card. 10 For completeness, we also consider linear Bag-of Words (BoW) classifiers using TF-IDF scores of the most frequent n-grams (where n = 1, 2, 3) in the training corpus of each dataset. Data Repository and Code We release a unified version of the benchmark on Hugging Face Datasets (Lhoest et al., 2021). 11 In our experiments, we use and extend the WILDs (Koh et al., 2021) library. For reproducibility and further exploration with new group-robust methods, we release our code on Github. 12   Evaluation Details Across experiments we compute the macro-F1 score per group (mF1 i ), excluding the group of unidentified instances, if any. 13  We report macro-F1 to avoid bias toward majority classes because of class imbalance and skewed label distributions across train, development, and test subsets (Søgaard et al., 2021) . Results Main Results In Table 2 , we report the group performance (mF1), where models trained with the ERM algorithm, across all datasets and attributes. We observe that the intensity of group disparities vary a lot between different attributes, but in many cases the group disparities are very vibrant. For example, in ECtHR, we observe substantial group disparity between the two defendant state groups (21.5% absolute difference), similarly for applicant's gender groups (16.2% absolute difference). In FSCS, we observe language disparity, where performance is on average 3-5% lower for cases written in Italian compared to those written in French and German. Performance disparity is even higher with respect to legal areas, where the model has the best performance for criminal (penal law) cases (83.4%) compared to others (approx. 10-20% lower). We also observe substantial group disparities with respect to the court region, e.g., cases ruled in E. Switzerland courts (66.8%) compared to Federation courts (56.4%). The same applies for CAIL, e.g., cases ruled in Beijing courts (66.8%) compared to Sichuan courts (56.4%). Group Disparity Analysis Moving forward we try to identify general (attribute agnostic) factors based on data distributions that could potentially lead to performance disparity across groups. We identify three general (attribute agnostic) factors: • Representation Inequality: Not all groups are equally represented in the training set. To examine this aspect, we report the number of training cases per group. • Temporal Concept Drift: The label distribution for a given group changes over time, i.e., inbetween training and test subsets. To examine this aspect, we report per group, the KL divergence in-between the training and test label distribution. • Worst Class Influence: The performance is not equal across labels (classes), which may disproportionally affect the macro-averaged performance across groups. To examine this aspect, we report the Worst Class Influence (WCI) score per group, which is computed as follows: WCI(i) = #test-cases (worst-class) #test-cases (12) In Table 2 , we present the results across all attributes. We observe that only in 4 out of 10 cases (attributes), the less represented groups are those with the worst performance compared to the rest. It is generally not the case that high KL divergence (drift) correlates with low performance. In other words, group disparities does not seem to be driven by temporal concept drift. Finally, the influence of the worst class is relatively uniform across groups in most cases, but in the cases where groups differ in this regard, worst class influence correlates with error in 2 out of 3 cases. 14  In ECtHR, considering performance across defendant state, we see that all the three factors correlate internally, i.e., the worst performing group is less represented, has higher temporal drift and has more cases in the worst performing class. This is not the case considering performance across other attributes. It is also not the case for SCOTUS. In FSCS, considering the attributes of language and region, representation inequality seems to be an important factor that leads to group disparity. This is not the case for legal area, where the best Cross-Attribute Influence Analysis We have evaluated fairness across attributes that are not necessarily independent of each other. We therefore evaluate the extent to which performance disparities along different attributes correlate, i.e., how attributes interact, and whether performance differences for attribute A 1 can potentially explain performance differences for another attribute A 2 . We examine this for the two attributes with the highest group disparity: the defendant state in ECtHR, and the legal area in FSCS. For the bins induced by these two attributes (A 1 ), we compute mF1 scores across other attributes (A 2 ). In ECtHR, approx. 83% and 81% of male and women applicants are involved in cases against E.C. European states (best-performing group). Similarly, in case of age groups, we observe that ratio of cases against E.C. European states is: 87% and 86% for ≤65 and ≤35, the best-and worst-performing groups respectively. In FSCS, the ratio of cases relevant to penal law is: approx. 29%, and 41% written in written in French (best-performing group) and Italian (worst-performing group). Similarly, approx. 27% originated in E. Switzerland (bestperforming group) and 42% in Federation (worst performing group) are relevant to public law. In both attributes, there is a 15% increase of cases relevant to public law for the worst performing groups. In other words, the group disparity in one attribute A 2 (language, region) could be also explained by the influence of another attribute A 1 (legal area). In Table 3 , we report the performance in the aforementioned cross-attribute (A 1 , A 2 ) pairings. With the exception of the (age, defendant state) cross-examination in ECtHR, we observe that group disparities in attribute A 2 (Table 2 ) are consistent across groups of the plausible influencer (i.e. attribute A 1 ). Hence, cross-attribute influence does not explain the observed group disparities. We believe that such an in-depth analysis of the results is fundamental to understand the influence of different factors in the outcomes. This analysis wouldn't be possible, if we had \"counterfeited\" an ideal scenario, where all groups and labels where equally represented. While a controlled experimental environment is frequently used to examine specific factors, it could hide, or partially alleviate such phenomena, hence producing misleading results on fairness of the examined models. Group Robust Algorithms Results Finally, we evaluate the performance for several group robust algorithms ( Section 4) that could potentially mitigate group disparities. To estimate their performance, we report the average macro-F1 across groups (mF1) and the group disparity (GD) among groups measured as the group-wise std dev.: GD = 1 G G i=1 (mF1 i − mF1) 2 (13) We also report the worst-group performance (mF1 W = min([mF1 1 , mF1 2 , . . . mF1 G )). In Table 4 , we report the results of all our baselines on the four datasets introduced in this paper. We first observe that the results of linear classifiers trained with the ERM algorithm (top row per dataset) are consistently worse (lower average and worst-case performance, higher group disparity) compared to transformed-based models in the same setting. In other words linear classifier have lower overall performance, while being less fair with respect to the applied definition of fairness (i.e. equal performance across groups). As one can see, transformer-based models trained with the ERM algorithm, i.e., without taking into account information about groups and their distribution, perform either better on in the same ballpark than models trained with methods specialized to mitigate biases (Section 4), with an average loss of 0.17% only in terms of mF1 and of 0.78% in terms of mF1 W . While, these algorithms improve worst case performance in the literature,  Table 4 : Test results for all examined group-robust algorithms per dataset attribute. We report the average performance across groups (mF1), the group disparity among groups (GD), and the worst-group performance (mF1 W ). ↑ denotes that higher scores are better, while ↓ denotes that lower scores are better. ECtHR (ECHR Violation Prediction) SCOTUS (Issue Area Classification) Algorithm Defendant State Applicant Gender Applicant Age Respondent Type Direction ↑ mF1 ↓ GD ↑ mF1 W ↑ mF1 ↓ GD ↑ mF1 W ↑ mF1 ↓ GD ↑ mF1 W ↑ mF1 ↓ GD ↑ mF1 W ↑ mF1 ↓ GD ↑ mF1 W Bag-of- ↑ mF1 ↓ GD ↑ mF1 W ↑ mF1 ↓ GD ↑ mF1 W ↑ mF1 ↓ GD ↑ mF1 W ↑ mF1 ↓ GD ↑ mF1 W ↑ mF1 ↓ GD ↑ mF1 W Bag-of- when applied in a controlled experimental environment, they fail in a more realistic setting, where both groups across attributes and labels are imbalanced, while also both group and label distribution change over time. Furthermore, we cannot identify one algorithm that performs better across datasets and group with respect to the others, indeed results are quite mixed without any recognizable pattern. Limitations The current version of FairLex covers a very small fraction of legal applications, jurisdictions, and protected attributes. Our benchmark is open-ended and inevitably cannot cover \"everything in the whole wide (legal) world\" (Raji et al., 2021) , but nonetheless we believe that the published resources will help critical research in the area of fairness. Some protected attributes within our datasets are extracted automatically, i.e., the gender and the age in the ECtHR dataset, if possible, by means of regular expressions, or manually clustered by the authors, such as the defendant state in the ECtHR dataset and the respondent attribute in the SCO-TUS dataset. Various simplifications made, e.g, the binarization of gender, would be inappropriate in real-world applications. Another important limitation is that what is considered the ground truth in these datasets (with the exception of SCOTUS) is only ground truth relative to judges' interpretation of a specific (EC, US, Swiss, Chinese) jurisdiction and legal framework. The labeling is therefore somewhat subjective for non-trivial cases, and its validity is only relative to a given legal framework. We of course do not in any way endorse the legal standards or framework of the examined datasets. Conclusions We introduced FairLex, a multi-lingual benchmark suite for the development and testing of models and bias-mitigation algorithms within the legal domain, based on four datasets covering four jurisdictions, five languages and various sensitive attributes. Furthermore, we provided competitive baselines including transformer-based language models adapted to the examined datasets, and examination of performance of four group robust algorithms (Adversarial Removal, IRM, Group DRO, and V-REx). While, these algorithms improve worst case performance in the literature, when applied in a controlled experimental environment, they fail in a more realistic setting, where both groups across attributes, and labels are imbalanced, while also both group and label distributions change over time. Furthermore, we cannot identify a single algorithm that performs better across datasets and groups compared to the rest. In future work, we aim to further expand the benchmark with more datasets that could possibly cover more sensitive attributes. Further analysis on the reasons behind group disparities, e.g., representational bias, systemic bias, is also critical. Ethics Statement Social Impact of Dataset The scope of this work is to provide an evaluation framework along with extensive experiments to further study fairness within the legal domain. Following the work of Angwin et al. (2016) , Dressel and Farid (2018), and Wang et al. (2021b) , we provide a diverse benchmark covering multiple tasks, jurisdictions, and protected (examined) attributes. We conduct experiments based on pretrained transformer-based language models and compare model performance across four representative group-robust algorithm, i.e., Adversarial Removal (Elazar and Goldberg, 2018) , Group DRO (Sagawa et al., 2020) , IRM (Arjovsky et al., 2020) and REx (Krueger et al., 2020) . We believe that this work can inform and help practitioners to build assisting technology for legal professionals -with respect to the legal framework (jurisdiction) they operate -; technology that does not only rely on performance on majority groups, but also considering minorities and the robustness of the developed models across them. We believe that this is an important application field, where more research should be conducted (Tsarapatsanis and Aletras, 2021) in order to improve legal services and democratize law, but more importantly highlight (inform the audience on) the various multi-aspect shortcomings seeking a responsible and ethical (fair) deployment of technology. Credit Attribution / Licensing We standardize and put together four datasets: ECtHR (Chalkidis et al., 2021) , SCOTUS (Spaeth et al., 2020) , FSCS (Niklaus et al., 2021) , and CAIL (Xiao et al., 2018; Wang et al., 2021b) that are already publicly available under CC-BY-(NC-)SA-4.0 licenses. We release the compiled version of the dataset under a CC-BY-NC-SA-4.0 license to favor academic research, and forbid to the best of our ability potential commercial dual use. 15 All datasets, except SCOTUS, are publicly available and have been previously published. If datasets or the papers where they were introduced in were not compiled or written by ourselves, we have referenced the original work and encourage FairLex users to do so as well. In fact, we believe that this work should only be referenced, in addition to citing the original work, when jointly experi-menting with multiple FairLex datasets and using the FairLex evaluation framework and infrastructure, or use any newly introduced annotations (EC-tHR, SCOTUS). Otherwise only the original work should be cited. Personal Information The data is in general partially anonymized in accordance with the applicable national law. The data is considered to be in the public sphere from a privacy perspective. This is a very sensitive matter, as the courts try to keep a balance between transparency (the public's right to know) and privacy (respect for private and family life). ECtHR cases are partially annonymized by the court. Its data is processed and made public in accordance with the European data protection laws. SCOTUS cases may also contain personal information and the data is processed and made available by the US Supreme Court, whose proceedings are public. While this ensures compliance with US law, it is very likely that similarly to the ECtHR any processing could be justified by either implied consent or legitimate interest under European law. In FSCS, the names of the parties have been redacted by the courts according to the official guidelines. CAIL cases are also partially anonymized by the courts according to the courts' policy. Its data is processed and made public in accordance with Chinese Law. A Discrimination and Fairness in Law The legal notion of discrimination has a different scope and semantics in comparison to the notions of fairness and bias used in the context of machine learning (Gerards and Xenedis, 2020) , where the aim usually is not to achieve equal odds, e.g. that a court shall rule the same decision for both men and woman based on similar facts, or to have 50/50 favourable decisions for both man and woman, but equal opportunities (Rawls, 1971) . In the context of law, the principle of equality and non-discrimination is of paramount importance at international, regional and domestic level. Article 2 of the Universal Declaration of Human Rights (UDHR) prohibits discrimination on grounds of race, colour, sex, language, religion, political or other opinion, national or social origin, property, birth or other status, with the latter term having an open-ended meaning. The principle is also reflected in several other United Nations (UN) human rights instruments and in regional legal instruments, including Article 24 American Convention of Human Rights (ACHR), Articles 2 and 3 African Charter on Human and People's Rights (ACHPR) and Article 14 and Protocol N. 12 of the European Convention on Human Rights (ECHR). The principle of non-discrimination is included in all international human rights instruments, although only a few explicitly provide a definition of non-discrimination (e.g. Article 1(1) CERD, Article 1 CEDAW, Article 2 CRPD, Article 1(1) ILO). In general, in international human rights law a violation of the principle of non-discrimination occurs when: (a) equal cases are treated differently, (b) there is no reasonable and objective justification for the difference in treatment, or (c) the means used are not proportional to the aim. In addition, many international instruments explicitly allow for 'positive action', without mandating an obligation on States in that sense. The term 'positive action' refers to active measures taken by private institutions or governments that favour members of previously disadvantaged groups with the aim to remedy the effects of past and present discrimination. At both regional and domestic level, a great number of countries have implemented non-discrimination law directly in their legislation. The following brief analysis provides an overview of the legal framework applicable in the EU and in the USA, in light of the wide deployment of algorithms and increasing risk of algorithmic discrimination documented in these contexts. In the context of EU, EU non-discrimination law prohibits both direct and indirect discrimination. 17 Direct discrimination occurs when one person is treated \"less favourably than another is, has been or would be treated in a comparable situation\" on grounds of sex, racial or ethnic origin, disability, sexual orientation, religion or belief and age in the context of a protected sector (e.g. the workplace and provision of goods and services) (Wachter et al., 2021) . Prohibiting direct discrimination allows to provide people with equal access to opportunities (i.e. formal equality). This however does not suffice, nor guarantee to create equality of opportunity (i.e. substantive equality), which can instead be achieved only by accounting for protected attributes and for social and historical realities and by taking positive measures to level the playing field (Fredman, 2016) . The notion of indirect discrimination is grounded on achieving substantive equality in practice. The Directives define indirect discrimination as situations where an apparently neutral provision, criterion or practice would put persons with a protected characteristic at disadvantage in comparison to other persons, unless 'that provision, criterion or practice is \"justified by a legitimate aim and the means of achieving that aim are appropriate and necessary\". Nevertheless, the current EU non-discrimination law framework suffers from limitations, both as regards its personal (i.e. it only protects six characteristics) and material scope (i.e. the prohibition on discrimination is limited only to certain fields) (Gerards and Xenedis, 2020) . These limitations pose problems in connection to algorithmic dis- crimination. For example, as algorithmic bias often creates seemingly neutral distinctions which however often correlate to a protected group (i.e. proxy discrimination), the limited list of protected grounds renders difficult to tackle the effects of algorithmic bias through the concept of direct discrimination (Prince and Schwarcz, 2019) . Indirect discrimination can help address those cases. but its application in this context poses several challenges. In April 2021 the European Commission presented a proposal for a Regulation laying down harmonized rules on artificial intelligence (AI Act / AIA). 18 The proposal aims at avoiding \"significant risks to the health and safety or fundamental rights of persons\" and would, once adopted, complement the currently applicable legal framework for tackling algorithmic discrimination, thereby overcoming some of its existing limitations. The envisaged implementation of the proposed AI Act highlights the importance that the legislator poses in preventing and mitigating discrimination and biases arising from the development and use of AI systems in several areas of application, including in the legal sector (Schwemer et al., 2021) . AI systems used for the administration of justice and democratic processes are proposed to be deemed high-risk in order \"to address the risks of potential biases, errors, and opacity\" (recital 40 AIA). The consequence is that such systems would be subject to a variety of design and development requirements, e.g. related to the training, validation and testing data sets which would have to be examined inter alia in relation to possible biases (art. 10(2) lit. f AIA) or related to human oversight of such AI system with a view to remain aware of automation bias (art. 14(4) lit. b AIA). In the US the jurisprudence relies on the doctrines of disparate treatment and disparate impact provided for in Title VII of the 1964 Civil Rights Act. 19 A prohibition on disparate treatment is included also in the Equal Protection Clause of the Constitution 20 and in civil rights laws. The prohibition refers to intentional discrimination and occurs when individuals are treated in a different manner on the basis of protected class attributes, such as race, colour, national origin, sex, age and religion. 21 The prohibition on disparate impact is instead provided for only in civil rights statutes and, in brief, it establishes that if some practice or activity has a disproportionate adverse effect on protected groups, the defendant must prove that such a practice has an adequate justification. 22 Also in the US, recent literature has highlighted the challenges that the current legal framework faces when tackling algorithmic discrimination, in particular as far as liability and the burden of proof are concerned (Kleinberg et al., 2019; Xiang, 2021) . Beyond the boundaries of EU and US law, a great number of countries explicitly prohibit discrimination in their laws on the basis of nationality, race, ethnicity and religion. Other countries extend the prohibition only in relation to race and religion instead. In many countries, there is not yet any specific or dedicated law against non-discrimination, such as in China, India, Indonesia, Japan, Korea and Saudi Arabia. This does not imply by any means that there are not potentially separate pieces of legislation that enforce non-discrimination for some class attributes. B Attribute Extraction and Grouping In this section, we provide finer details on attribute extraction and grouping. ECtHR We extracted the defendant states from the HUDOC 23 case metadata, namely Respondent State(s). We group the defendant states mainly relying on their classification by the EuroVoc thesaurus 24 . The grouping mainly reflects the high disproportion of violations between mainly Eastern European countries, and in a second degree Central European, and the rest (Western European, Nordic, Mediterranean states). Applicant's birth year is extracted from the case facts, if available, e.g., \"The first applicant, Mr X, was born in 1967.\", using Regular Expressions (RegEx). Then, we compute the age by subtract birth year from the judgment date, extracted from the HUDOC case metadata, as well. The age grouping does not follow any pattern and aims to cluster applicants in discrete groups that have statistical support. Finally, we extract gender from case facts, if possible, based on pronouns (e.g., 'he', 'she', 'his', 'her'), and other gender words (e.g., 'mr', 'mrs', 'husband', Acknowledgments This work is fully funded by the Innovation Fund Denmark (IFD) 16 under File No. 0175-00011A. We would like to thank the authors of the original datasets for providing access to the original documents, metadata, or confidentially sharing prereleased versions of the datasets. SCOTUS Both attributes rely on metadata provided by the Supreme Court DataBase (SCDB) 25 . In case of the direction of the decision, i.e., whether the decision is considered liberal, or conservative, we use the original variable (Decision Direction). 26 . In case of the type of respondent, we manually categorize (cluster) all available, 311 in total, values for the Respondent variable 27 in five abstract categories (person, public entity, organization, facility and other). FSCS All attributes are already available as part of the original dataset of Niklaus et al. (2021) . Groups represent individual values. Information was extracted from courts' metadata. CAIL All attributes are already available as part of the original dataset of Wang et al. (2021b) . Groups represent individual values. Information was extracted from courts' metadata. C Train and Evaluation Details We fine-tune all pre-trained transformer-based language models using the AdamW (Loshchilov and Hutter, 2019) optimizer with a learning rate of 3e-5. We use a batch size of 16 and train models for up to 20 epochs using early stopping on validation performance. 28 Across datasets and attributes, we run five repetitions with different random seeds and report averaged scores. D Release of Language Models We release four domain-specific BERT models (Table 5 with continued pre-training on the corpora Table 5 : Domain-specific pre-trained language models specifications. of the examined datasets. 29 We train mini-sized BERT models with 6 Transformer blocks, 384 hidden units, and 12 attention heads. We warm-start all models from the public MiniLMv2 models checkpoints (Wang et al., 2021a) using the distilled version of RoBERTa (Liu et al., 2019) for the English datasets (ECtHR, SCOTUS) and the one distilled from XLM-R (Conneau et al., 2020) for the rest (trilingual FSCS, and Chinese CAIL). We pre-train each models in the training subset of each FairLex dataset with sequences of 128 sub-words for 10 epochs using the AdamW (Loshchilov and Hutter, 2019) optimizer with a maximum learning rate of 1e-4 and 10% warm-up ratio. E Statistics E.1 Distribution of Document Length In Figure 2 we report the distribution of sequence (document) length across FairLex datasets (ECtHR, SCOTUS, FSCS). We observe that the documents are extremely long (3,000-6,000+ words) across datasets. Hence, we deploy hierarchical models (Section 5) that are able to encode large parts of the documents. E.2 Group Distribution by Attribute In Tables 6 and 7 we report the group distribution per examined attribute under consideration. In some cases, the extraction of the specific attribute, e.g., gender or age in ECtHR, was not possible, i.e., the applied rules would no suffice, possibly because the information is intentionally missing. During training, the groups of unidentified samples is included, but we report test scores excluding those, 29 https://huggingface.co/coastalcph i.e., mF1 and GD do not take into account the F1 of these groups. F Label Distribution KL Divergences In Tables 8, 9 , 10, and 11, we report the Jensen-Shannon divergences between train-test, train-dev and test-test distribution of labels separately for each protrected attribute values and for each dataset in our framework.",
    "abstract": "We present a benchmark suite of four datasets for evaluating the fairness of pre-trained language models and the techniques used to fine-tune them for downstream tasks. Our benchmarks cover four jurisdictions (European Council, USA, Switzerland, and China), five languages (English, German, French, Italian and Chinese) and fairness across five attributes (gender, age, region, language, and legal area). In our experiments, we evaluate pretrained language models using several grouprobust fine-tuning techniques and show that performance group disparities are vibrant in many cases, while none of these techniques guarantee fairness, nor consistently mitigate group disparities. Furthermore, we provide a quantitative and qualitative analysis of our results, highlighting open challenges in the development of robustness methods in legal NLP.",
    "countries": [
        "Denmark"
    ],
    "languages": [
        "Chinese",
        "French",
        "Italian",
        "English",
        "German"
    ],
    "numcitedby": "2",
    "year": "2022",
    "month": "May",
    "title": "{F}air{L}ex: A Multilingual Benchmark for Evaluating Fairness in Legal Text Processing"
}