{
    "article": "In this paper, we introduce a large-scale test collection for multiple document summarization, the Text Summarization Challenge 3 (TSC3) corpus. We detail the corpus construction and evaluation measures. The significant feature of the corpus is that it annotates not only the important sentences in a document set, but also those among them that have the same content. Moreover, we define new evaluation metrics taking redundancy into account and discuss the effectiveness of redundancy minimization. Introduction It has been said that we have too much information on our hands, forcing us to read through a great number of documents and extract relevant information from them. With a view to coping with this situation, research on automatic text summarization has attracted a lot of attention recently and there have been many studies in this field. There is a particular need to establish methods for the automatic summarization of multiple documents rather than single documents. There have been several evaluation workshops on text summarization. In 1998, TIPSTER SUM-MAC (Mani et al., 2002) took place and the Document Understanding Conference (DUC) 1 has been held annually since 2001. DUC has included multiple document summarization among its tasks since the first conference. The Text Summarization Challenge (TSC) 2 has been held once in one and a half years as part of the NTCIR (NII-NACSIS Test Collection for IR Systems) project since 2001. Multiple document summarization was included for the first time as one of the tasks at TSC2 (in 2002) (Okumura et al., 2003) . Multiple document summarization is now a central issue for text summarization research. In this paper, we detail the corpus construction and evaluation measures used at the Text Summarization Challenge 3 (TSC3 hereafter), where multiple document summarization is the main issue. We also report the results of a preliminary experiment on simple multiple document summarization systems. TSC3 Corpus Guidelines for Corpus Construction Multiple document summarization from multiple sources, i.e., several newspapers concerned with the same topic but with different publishers, is more difficult than single document summarization since it must deal with more text (in terms of numbers of characters and sentences). Moreover, it is peculiar to multiple document summarization that the summarization system must decide how much redundant information should be deleted 3 . In a single document, there will be few sentences with the same content. In contrast, in multiple documents with multiple sources, there will be many sentences that convey the same content with different words and phrases, or even identical sentences. Thus, a text summarization system needs to recognize such redundant sentences and reduce the redundancy in the output summary. However, we have no way of measuring the effectiveness of such redundancy in the corpora for DUC and TSC2. Key data in TSC2 was given as abstracts (free summaries) whose number of characters was less than a fixed number and, thus, it is difficult to use for repeated or automatic evaluation, and for the extraction of important sentences. Moreover, in DUC, where most of the key data were abstracts whose number of words was less than a fixed number, the situation was the same as TSC2. At DUC 2002, extracts (important sentences) were used, and this allowed us to evaluate sentence extraction. However, it is not possible to measure the effectiveness of redundant sentences reduction since the corpus was not annotated to show sentence with same content. In addition, this is the same even if we use the SummBank corpus (Radev et al., 2003) . In any case, because many of the current summarization systems for multiple documents are based on sentence extraction, we believe these corpora to be unsuitable as sets of documents for evaluation. On this basis, in TSC3, we assumed that the process of multiple document summarization consists of the following three steps, and we produce a corpus for the evaluation of the system at each of the three steps 4 . Step 1 Extract important sentences from a given set of documents Step 2 Minimize redundant sentences from the result of Step 1 Step 3 Rewrite the result of Step 2 to reduce the size of the summary to the specified number of characters or less. We have annotated not only the important sentences in the document set, but also those among them that have the same content. These are the corpora for steps 1 and 2. We have prepared humanproduced free summaries (abstracts) for step 3. In TSC3, since we have key data (a set of correct important sentences) for steps 1 and 2, we conducted automatic evaluation using a scoring program. We adopted an intrinsic evaluation by human judges for step 3, which is currently under evaluation. We provide details of the extracts prepared for steps 1 and 2 and their evaluation measures in the following sections. We do not report the overall evaluation results for TSC3. Data Preparation for Sentence Extraction We begin with guidelines for annotating important sentences (extracts). We think that there are two kinds of extract. 1. A set of sentences that human annotators judge as being important in a document set (Fukusima and Okumura, 2001; Zechner, 1996; Paice, 1990) . Figure 1 : An example of an abstract and its sources. 2. A set of sentences that are suitable as a source for producing an abstract, i.e., a set of sentences in the original documents that correspond to the sentences in the abstracts (Kupiec et al., 1995; Teufel and Moens, 1997; Marcu, 1999; Jing and McKeown, 1999) . When we consider how summaries are produced, it seems more natural to identify important segments in the document set and then produce summaries by combining and rephrasing such information than to select important sentences and revise them as summaries. Therefore, we believe that second type of extract is superior and thus we prepared the extracts in that way. However, as stated in the previous section, with multiple document summarization, there may be more than one sentence with the same content, and thus we may have more than one set of sentences in the original document that corresponds to a given sentence in the abstract; that is to say, there may be more than one key datum for a given sentence in the abstract 5 . we have two sets of sentences that correspond to sentence in the abstract. (1) ¡ £¢ of document ¤ , or (2) a combination of ¡ ¦¥ and ¡ ¨ § of document © This means that ¡ £¢ alone is able to produce , and can also be produced by combining ¡ ¥ and ¡ § (Figure 1 ). We marked all the sentences in the original documents that were suitable sources for producing the sentences of the abstract, and this made it possible for us to determine whether or not a summarization system deleted redundant sentences correctly at Step 2. If the system outputs the sentences in the original documents that are annotated as corresponding to the same sentence in the abstract, it ! \" # 2 $ % ¨& ! ¨' ( 3 ¨) 0 ¨ 1 ¦) # ( ¦) $ ¦ % $ ! ' has redundancy. If not, it has no redundancy. Returning to the above example, if the system outputs ¡ 2¢ ,¡ ¥ ,and ¡ ¨ § , they all correspond to sentence in the abstract, and thus it is redundant. Evaluation Metrics We use both intrinsic and extrinsic evaluation. The intrinsic metrics are \"Precision\", \"Coverage\" and \"Weighted Coverage.\" The extrinsic metric is \"Pseudo Question-Answering.\" Intrinsic Metrics 3.1.1 Number of Sentences System Should Extract Precision and Recall are generally used as evaluation matrices for sentence extraction, and we used the PR Breaking Point (Precision = Recall) for the evaluation of extracts in TSC1 (Fukusima and Okumura, 2001) . This means that we evaluate systems when the number of sentences in the correct extract is given. Moreover, in TSC3 we assume that the number of sentences to be extracted is known and we evaluate the system output that has the same number of sentences. However, it is not as easy to decide the number of sentences to be extracted in TSC3 as in TSC1. We assume that there are correspondences between sentences in original documents and their abstract as in Table 1 . An ASCII space, \" \", is the delimiter for the sets of corresponding sentences in the table. As shown in the table, we often see several sets of sentences that correspond to a sentence in the abstract in multiple document summarization. An 'extract' here is a set of sentences needed to produce the abstract. For instance, we can obtain 'extracts' such as \"¡ 2¢ ,¡ § ,¡ 3 ,¡ 4 ,¡ ¨ § 5 ,¡ 4 ¨5 \", and 1 6 . Often there are several 'extracts' and we must determine which of these is the best. In such cases, we define the 'correct extract' as the set with the least number of sentences needed to produce the abstract because it is desirable to convey the maximum amount of information with the least number of sentences. \"¡ 2¢ 65 ,¡ 7¢ ¨¢ ,¡ § ,¡ 3 ,¡ 4 ,¡ ¥ ¨5 ,¡ ¥ 2¢ ,¡ ¥ ¨ § \" from Table Finding the minimum set of sentences to produce the abstract amounts to solving the constraint sat-isfaction problem. In the example in Table 1 , we obtain the following constraints from each sentence in the abstract: 8 @9 ¢ BA C¡ £¢ ED GF ¨¡ £¢ 05 BH G¡ 2¢ ¨¢ I , 8 @9 ¥ PA C¡ ¦ § QH G¡ ¦3 QH R¡ ¨4 , 8 @9 § PA CF ¨¡ ¦¥ 5 SH R¡ ¦¥ 7¢ TH R¡ ¨¥ ¨ § UI VD RF ¡ £¢ EH R¡ ¦ § 5 SH R¡ ¨4 ¨5 UI With these conditions, we now find the minimum set that makes all the conjunctions true. We need to find the minimum set that makes 9 ¢ WH 9 ¥ GH 9 § XA `Y 1a 2b Ec 2d In this case, the minimum cover is e ¡ £¢ ¦f 2¡ ¨ § gf 7¡ ¦3 Uf 7¡ ¨4 gf 7¡ ¦ § 5 hf 7¡ ¨4 ¨5 gi , and so the system should extract six sentences. In TSC3, we computed the number of sentences that the system should extract and then evaluated the system outputs, which must have the same number of sentences, with the following precision and coverage. Precision Precision is the ratio of how many sentences in the system output are included in the set of the corresponding sentences. It is defined by the following equation. Precision p rq s ut (1 ) where v is the least number of sentences needed to produce the abstract by solving the constraint satisfaction problem and w is the number of 'correct' sentences in the system output, i.e., the sentences that are included in the set of corresponding sentences. For example, the sentences listed in Table 1 are 'correct.' If the system output is \"¡ 2¢ 05 gf 2¡ 2¢ ¨¢ f 7¡ ¦3 £f 2¡ 2¢ ¨x f 7¡ ¦4 5 hf 7¡ ¨4 2¢ \", then the Precision is as follows: Precision p y p 7 (2) for \"¡ 2¢ f 2¡ 2¢ 05 hf 7¡ £¢ ¢ f 2¡ ¨ § gf 7¡ ¦3 £f 2¡ ¨4 5 \", the Precision is as follows: Precision p p (3) Coverage Coverage is an evaluation metric for measuring how close the system output is to the abstract taking into account the redundancy found in the set of sentences in the output. The set of sentences in the original documents that corresponds correctly to the -th sentence of the human-produced abstract is denoted here as where F ¨ I is defined by the following equation. ¢ f ¥ gf l o p if the system outputs otherwise (5) Function c returns 1 (one) when any d is outputed completely. Otherwise it returns a partial score according to the number of sentences nd . Given function c and the number of sentences in the abstract , Coverage is defined as follows: Coverage p u k l nm ¦o (6) If the system extracts \"¡ 2¢ 65 ,¡ 2¢ ¢ ,¡ ¨3 ,¡ 7¢ ¨x ,¡ 4 ¨5 ,¡ 4 2¢ \", c 2F 0 I is computed Weighted Coverage Now we define 'Weighted Coverage' since each sentence in TSC3 is ranked A, B or C, where \"A\" is the best. This is similar to \"Relative Utility\" (Radev et al., 2003) . We only use three ranks in order to limit the ranking cost. The definition is obtained by modifying equation (6). W.C. p u £ l n xl nm ¦o o k l nm ¦o l o n l o l \" o n l \" o l ¡ So n l ¡ So t (7)   where a F 0 I denotes the ranking of the -th sentence of the abstract and ¢ £F 6a F 6 I ¨I is its weight. ¤F 6a ¤¥ I is the number of sentences whose ranking is a ¦¥ in the abstract. Suppose the first sentence is ranked A, the second B, and the third C in Table 1 , and their weights are given as ¢ WF I A ¨ § ,¢ £F © ªI «A ¨¬ Ud ® and ¢ WF 9 I TA C¬ Ud ®¯7. As before, if the system extracts \"¡ ¢ 05 ,¡ ¢ ¨¢ ,¡ 3 ,¡ ¢ ¨x ,¡ 4 ¨5 ,¡ 4 2¢ \", then the Weighted Coverage is computed as follows: W.C. p U ° 7 7 ° p G 7± 7² (8) Extrinsic Metrics 3.2.1 Pseudo Question-Answering Sometimes question-answering (QA) by human subjects is used for evaluation (Morris et al., 1992; Hirao et al., 2001) . That is, human subjects judge whether predefined questions can be answered by reading only a machine generated summary. However, the cost of this evaluation is huge. Therefore, we employ a pseudo question-answering evaluation, i.e., whether a summary has an 'answer' to the question or not. The background to this evaluation is inspired by TIPSTER SUMMAC's QA track (Mani et al., 2002) . For each document set, there are about five questions for a short summary and about ten questions for long summary. Note that the questions for the short summary are included in the questions for the long summary. Examples of questions for the topic \"Release of SONY's AIBO\" are as follows: \"How much is AIBO?\", \"When was AIBO sold?\", and \"How many AIBO are sold?\". Now, we evaluate the summary from the 'exact match' and 'edit distance' for each question. 'Exact match' is a scoring function that returns one when the summary includes the answer to the question. 'Edit distance' measures whether the system's summary has strings that are similar to the answer strings. The score ³ e´b ased on the edit distance is normalized with the length of the sentence and the answer string so that the range of the score is [0,1]: S ed p length of the sentence µ edit distance length of the answer strings (9) The score for a summary is the maximum value of the scores for sentences in the summary. The score is 1 if the summary has a sentence that includes the whole answer string. It should be noted that the presence of answer strings in the summary does not mean that a human subject can necessarily answer the question. Preliminary Experiment In order to examine whether our corpus is suitable for summarization evaluation, our evaluation measures significant information and redundancies in the system summaries. Below we provide the details of the corpus, evaluation results and effectiveness of the minimization of redundant sentences. Description of Corpus According to the guidelines described in section two, we constructed extracts and abstracts of thirty sets of documents drawn from the Mainichi and Yomiuri newspapers published between 1998 to 1999, each of which was related to a certain topic. First, we prepared abstracts (their sizes were 5% and 10% of the total number of the characters in the document set), then produced extracts using the abstracts. Table 2 shows the statistics. One document set consists of about 10 articles on average, and the almost same number of articles were taken from the Mainichi newspaper and the Yomiuri newspaper. Most of the topics are classified into a single-event according to McKeown (2001) . The following list contains all the topics. Compared Extraction Methods We used the lead-based method, the TF IDF-based method (Zechner, 1996) and the sequential patternbased method (Hirao et al., 2003) , and compared performance of these summarization methods on the TSC3 corpus. Lead-based Method The documents in a test set were sorted in chronological and ascending order. Then, we extracted a sentence at a time from the beginning of each document and collected them to form a summary. TF IDF-based Method The score of a sentence is the sum of the significant scores of each content word in the sentence. We therefore extracted sentences in descending order of importance score. The sentence score S tfidf F ¡ I is defined by the following. S tfidf l ½ o p ¾ \"¿ À | l ºÁ t Â jÃ o t (10) where ¢ WF 0Y f 2Ä ³ I is defined as follows: l nÁ t Â ÅÃ o p Á ¦AE Çl nÁ t Â ÅÃ o }È ¨É ºÊ 7Ë Â Ì AE Íl ºÁ o (11) Y Î ÏF 6Y f 7Ä «³ I is the frequency of word Y in the document set, Ð #Î F 6Y I is the document frequency of Y , and Ä © R is the total number of documents in the set. In fact, we computed these using all the articles published in the Mainichi and Yomiuri newspapers for the years 1998 and 1999. Sequential Pattern-based Method The score of a sentence is the sum of the significant scores of each sequential pattern in the sentence. The patterns used for scoring were decided by using a statistical significance test such as the Ò ¥ metric test and using 1,000 patterns. This is an extension of Lin's method (Lin and Hovy, 2000) . The sentence score S pat F ¨¡ I is defined by the following. S pat l ½ o p Ó ¿ À | l nÔ Ío t (12) where ¢ £F 6Õ ÏI is defined as follows: l ºÔ Ío p É Ê 7Ë l AE l nÔ t Â ÅÃ o } o ÇÈ ¦É Ê 7Ë l z { ÍÖ Çz × 2Ø Ó { ÍÖ 2Ù o Ú k l ºÔ Ío (13) Î F 0Õ Ïf £Ä ³ I is the sentence frequency of pattern Õ in the document set and Î F 0Õ Ïf ³ I is the sentence frequency of pattern Õ in all topics. ³ r is the number of sentences in all topics and Û 6c ¦F 0Õ ÏI is the pattern length. Evaluation Result Table 3 shows the intrinsic evaluation result. All methods have lower Coverage and Weighted Coverage scores than Precision scores. This means that the extracted sentences include redundant ones. In particular, the difference between \"Precision\" and \"Coverage\" is large in \"Pattern.\" Although both \"Pattern\" and \"TF IDF\" outperform \"Lead,\" the difference between them is small. In addition, we know that \"Lead\" is a good extraction method for newspaper articles; however, this is not true for the TSC3 corpus. Table 4 shows the extrinsic evaluation results. Again, both \"Pattern\" and \"TF IDF\" outperform \"Lead\", but the difference between them is small. We found a correlation between the intrinsic and extrinsic measures. Effect of Redundant Sentence Minimization The experiment described in the previous section shows that a group of sentences extracted in a simple way includes many redundant sentences. To examine the effectiveness of minimizing redundant sentences, we compare the Maximal Marginal Relevance (MMR) based approach (Carbonell and Goldstein, 1998) with the clustering approach (Nomoto and Matsumoto, 2001) . We use 'cosine similarity' with a bag-of-words representation for the similarity measure between sentences. Clustering-based Approach After computing importance scores using equations ( 10 ) and ( 12 ), we conducted hierarchical clustering using Ward's method until we reached v (see Section 3.1.1) clusters for the first Ūv sentences. Then, we extracted the sentence with the highest score from each cluster. Table 5 shows the results of the intrinsic evaluation and Table 6 shows the results of the extrinsic evaluation. By comparison with Table 3 , the clustering-based approach resulted in TF IDF and Pattern scoring low in Precision, but high in Coverage. When comparing Table 4 with Table 6 , the score is improved in most cases. These results imply that redundancy minimization is effective for improving the quality of summaries. MMR-based Approach After computing importance scores using equations (10) and ( 12 ), we re-ranked the first hv sentences by MMR and extracted the first v sentences. Table 7 and 8 show the intrinsic and extrinsic evaluation results, respectively. We can see the effectiveness of redundancy minimization by MMR. Notably, in most cases, there is a large improvement in both the intrinsic and extrinsic evaluation results as compared with clustering. These results show that redundancy minimization has a significant effect on multiple document summarization. Conclusion We described the details of a corpus constructed for TSC3 and measures for its evaluation, focusing on sentence extraction. We think that a corpus in which important sentences and those with the same content are annotated for multiple documents is a new and significant feature for summarization corpora. It is planned to make the TSC3 corpus available (even if the recipient is not a TSC3 participant) by exchanging memoranda with the National Institute of Informatics in Japan. We sincerely hope that this corpus will be useful to researchers who are interested in text summarization and serve to facilitate further progress in this field.",
    "abstract": "In this paper, we introduce a large-scale test collection for multiple document summarization, the Text Summarization Challenge 3 (TSC3) corpus. We detail the corpus construction and evaluation measures. The significant feature of the corpus is that it annotates not only the important sentences in a document set, but also those among them that have the same content. Moreover, we define new evaluation metrics taking redundancy into account and discuss the effectiveness of redundancy minimization.",
    "countries": [
        "Japan"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "22",
    "year": "2004",
    "month": "aug 23{--}aug 27",
    "title": "Corpus and Evaluation Measures for Multiple Document Summarization with Multiple Sources"
}