{
    "article": "A novel method for hybrid graph-based dependency parsing of natural language text is proposed. It is based on k-best maximum spanning tree dependency parsing and evaluation of the spanning trees by using a verb valency lexicon for a given language as a reranking knowledge base. The approach is compared with existing state-of-the-art transition-based and graph-based approaches to dependency parsing. As the proposed generic method was developed specifically for improving the accuracy of Croatian dependency parsing, Croatian Dependency Treebank and CROVALLEX verb valency lexicon are used in the experiment. The suggested approach scored approximately 77.21% LAS, outperforming the tested state-of-the-art approaches by at least 2.68% LAS. Condensed version of the paper in Croatian Kvaliteta parsanja u paradigmi ovisnosnoga parsanja temeljenog na podatcima ovisi u najvećoj mjeri o svojstvima parsanoga jezika. Budući da su svojstva jezika u tome teorijskom okviru implicitno sadržana u banci ovisnosnih stabala, kaže se da je kvaliteta parsanja ovisna o svojstvima banke ovisnosnih stabala (Kübler et al., 2009) . Ovdje se nastoji -koristeći postojeće spoznaje o ovisnosnomu parsanju različitih razreda prirodnih jezika parserima temeljenim na podatcima (Buchholz and Marsi, 2006; Nivre et al., 2007) -unaprijediti kvalitetu ovisnosnoga parsanja tekstova pisanih hrvatskim jezikom koristeći postojeće metode ovisnosnoga parsanja, Hrvatsku ovisnosnu banku stabala (HOBS) (Tadić, 2007) i valencijski rječnik glagola hrvatskoga jezika CROVALLEX (Mikelić Preradović, 2008; Mikelić Preradović et al., 2009) . Prikazana su dva skupa eksperimenata. U prvome se skupu na hrvatskim tekstovima iz HOBS-a testiraju najbolji od postojećih javno dostupnih ovisnosnih parsera temeljenih na podatcima, kako bi se utvrdila najveća točnost parsanja koja se može postići njihovom uporabom. S obzirom na točnost postignutu pri parsanju srodnih jezika, poput češkoga i slovenskoga, u sklopu natjecanja u ovisnosnome parsanju CoNLL 2006 (Buchholz and Marsi, 2006) i 2007 (Nivre et al., 2007) , za vrjednovanje je odabran MaltParser (Nivre et al., 2007) kao najbolji predstavnik prijelazničkih parsera i MSTParser (McDonald et al., 2006) kao najbolji medu ovisnosnim parserima temeljenima na teoriji grafova. Za testiranje je korištena najnovija inačica HOBS-a, koja je sadržavala ukupno 88,045 pojavnica u 3,465 rečenica. Osnovni statistički podatci o HOBS-u i skupovima za treniranje i testiranje ovisnosnih parsera izloženi su u Tablici 1. Sva mjerenja su ponovljena deset puta, i to podjelom HOBS-a na deset nepreklapajućih dijelova, korištenjem devet od tih deset dijelova za postupak treniranja i desetoga dijela, veličine oko 5,000 pojavnica, za postupak testiranja. Uporabljeno je sedam algoritama za prijelazničko parsanje iz sustava MaltParser i četiri algoritma za parsanje temeljeno na teoriji grafova iz sustava MSTParser. Slika 1 i Tablica 2 i 3 prikazuju rezultate prvoga skupa eksperimenata. Parser MstCle2 (neprojektivni ovisnosni parser temeljen na grafovima, jezičnome modelu s parovima ovisnosnih relacija i algoritmu za pronalaženje najvećega prostirućeg stabla Chu-Liu/Edmonds) postigao je najveću točnost pri parsanju tekstova iz HOBS-a prema svim odabranim mjerama za vrjednovanje. Testiranje statističke značajnosti pokazalo je da su razlike u točnostima svih parsera temeljenih na grafovima u odnosu na prijelazničke parsere statistički značajne. S druge U drugome se skupu eksperimenata usporeduje parser CroDep s najboljim parserima iz prvoga skupa eksperimenata. Parser CroDep (Agić, 2012) novopredloženi je hibridni ovisnosni parser koji se sastoji od tri meduovisne komponente: (1) ovisnosnoga parsera temeljenog na teoriji grafova u skladu s izvedbom iz (McDonald et al., 2005) i algoritmu za parsanje pronalaženjem k najboljih parsanja ulazne rečenice u skladu s izvedbom iz (Hall, 2007) , (2) vrjednovatelja predloženih k ovisnosnih stabala pomoću valencijskoga rječnika glagola hrvatskoga jezika CROVALLEX i (3) modula za ponovno vrjednovanje tih stabala povezivanjem vrjednovanja iz dviju prethodnih komponenata, koji daje konačni izlaz iz sustava u vidu jednoga ovisnosnog stabla kojem je dodijeljena najviša zbirna ocjena. Slika 3 i Tablica 5 i 6 prikazuju rezultate drugoga skupa eksperimenata. Zabilježena je točnost parsera CroDep od 77.21% prema mjeri LAS, što predstavlja porast od 2.68% u odnosu najbolji parser iz prethodnoga skupa eksperimenata. Razlika izmedu njihovih točnosti statistički je značajna s obzirom na sve korištene mjere. Za porast ukupne točnosti zaslužan je statistički značajan porast točnosti parsanja imenica i glagola. Prema mjerama LAS i UAS parser CroDep u usporedbi s parserom MstCle2 bilježi povećanje točnosti od preko 10% za predikate, subjekte i objekte, što potvrduje smislenost povezivanja CROVALLEX-a i parsera temeljenoga na grafovima. Detaljniji prikaz izvedbe parsera CroDep i rezultata pojedinih ekperimenata izložen je dalje u tekstu. Introduction The quality of data-driven dependency parsing -as expressed by the de facto standard dependency parsing evaluation metrics such as LAS and UAS (Nivre, 2006) -is repeatedly shown to be highly language-dependent. More specifically, being that syntactic properties of a given language are implicitly encoded by dependency treebanks in the framework of data-driven dependency parsing, it is seen as treebank-dependent (Kübler et al., 2009) . The CoNLL 2006 and 2007 shared tasks on multilingual data-driven dependency parsing (Buchholz and Marsi, 2006; Nivre et al., 2007) separate the tested languages into three classes on the basis of observed dependency parsing accuracy scores: low, medium and high. It is specifically noted in (Nivre et al., 2007) that \"the classes are more easily definable via language characteristics than via characteristics of the data sets\" and that the \"most difficult[-to-parse] languages are those that combine a relatively free word order with a high degree of inflection,\" modified to an extent only by the respective treebank sizes. The research presented here was conducted with a goal of improving the baseline for dependency parsing of Croatian texts. Croatian is a highly inflected Slavic language with a relatively free word order, similar to Czech and Slovene, which were included in the CoNLL shared tasks on dependency parsing. With respect to the results of the shared tasks, it was expected that the scores for state-of-the-art parsers on the Croatian Dependency Treebank (Tadić, 2007; Agić, 2012; Berović et al., 2012) would place Croatian in the low accuracy class, i.e., the class of most difficult-to-parse languages. After conducting these preliminary experiments, various courses of action were considered in order to improve the baseline. Parsing baselines in data-driven dependency parsing are usually topped by feature reselection (Passarotti and Dell'Orletta, 2010) , merging parser outputs -as in parser voting (Sagae and Lavie, 2006) and stacking (Nivre and McDonald, 2008 ) -and by using external sources of linguistic knowledge, such as subcategorization information (Zeman, 2002) , possibly introducing rule-based (language-dependent) modules into data-driven (language-independent) parsers. The presented approach deals with implementing an interaction between a graph-based dependency parser and a valency lexicon of Croatian verbs, producing in turn a parsing model requiring only a dependency treebank and a machine-readable verb valency lexicon to operate. In the paper, the baseline experiment in dependency parsing of Croatian using existing stateof-the-art data-driven dependency parsers is first described, including a description of the current state of development of the Croatian Dependency Treebank. Second, the valency lexicon reranking parser is introduced, along with a short description of the verb valency lexicon of Croatian verbs used in this experiment -CROVALLEX (Mikelić Preradović, 2008; Mikelić Preradović et al., 2009) . The newly-developed parser is evaluated within the testing framework of the existing parsers and the obtained results are presented in comparison. Future work plans for improving the parser and for improving dependency parsing of Croatian texts in general are sketched in the closing section. Baseline experiment At the time of conducting the experiments within the CoNLL shared tasks of 2006 and 2007, no treebanks for Croatian were available, for any syntactic formalism. More precisely, the development of the Croatian Dependency Treebank started in January 2007 and only a 100sentence prototype of the treebank existed when the CoNLL 2007 task was initiated. Being that both shared tasks required a training and testing set and that the minimum size of the testing set was fixed at 5,000 tokens, the prototype was insufficient for participation. the treebank had finally matured in size, the shared task experiments could be recreated for Croatian texts in order to establish a baseline. This section briefly presents this experiment by presenting the treebank, parser selection, experimental setup and the obtained results. Treebank Quoting (Tadić, 2007) and (Agić et al., 2010) , the Croatian Dependency Treebank (hr. Hrvatska ovisnosna banka stabala, HOBS further in the text) is a dependency treebank built along the principles of Functional Generative Description (Sgall et al., 1986) , a multistratal model of dependency grammar developed for Czech. This formalism was further adapted in the Prague Dependency Treebank (PDT) (Hajič et al., 2000) project and applied in sentence analysis and annotation on the levels of morphology, syntax and tectogrammatics. The ongoing construction of HOBS closely follows the guidelines set by PDT, with their simultaneous adaptation to the specifics of Croatian. More detailed account of the HOBS project plan is given in (Tadić, 2007) . Currently, HOBS consists of 3,465 sentences in the form of dependency trees that were manually annotated with syntactic functions using TrEd (Pajas, 2000) as the annotation tool. These sentences, encompassing approximately 88,000 tokens, stem from the CW100 newspaper sub-corpus of the Croatian National Corpus (Tadić, 2002 (Tadić, , 2009)) . The CW100 sub-corpus was previously XCES-encoded, sentence-delimited, tokenized, lemmatized and morphosyntactically annotated by linguists. Thus, each of the analyzed sentences contains the manually assigned information on part-of-speech, morphosyntactic category, lemma, dependency and analytical function for each of the tokens. Such a course of action was taken in order to enable the training procedures of state-of-the-art dependency parsers to choose from a wide selection of different features in experiments with stochastic dependency parsing of Croatian texts. Basic stats for HOBS and the experiment sets are given in Table 1 . Sentences in HOBS are annotated according to the PDT annotation manual for the analytical level of annotation, with respect to differing properties of Croatian and consulting the Slovene Dependency Treebank (SDT) project (Džeroski et al., 2006) . The utilized analytical functions are thus compatible with those of PDT. HOBS is available via META-SHARE (Federmann et al., 2012; Piperidis, 2012) . (Nivre and Nilsson, 2005) . All selected parsers were thus evaluated as non-projective parsers, regardless of their need for treebank (de)projectivization that may be present as a preor post-processing step in certain workflows. Parsers Parser selection was based on the results of the CoNLL 2006 and 2007 shared tasks for languages similar to Croatian, i.e., the observed LAS scores for Czech and especially Slovene (being that PDT is substantially larger than both HOBS and SDT). Two standalone parser generators -MaltParser (Nivre et al., 2007) and MSTParser (McDonald et al., 2006) -were shown to be predominant in scores for parsing morphologically complex languages, with the graph-based MSTParser systems slightly outperforming the transition-based MaltParser systems for both emphasized languages. Based on these results, MaltParser and MSTParser were chosen among the publicly available CoNLL 2006 and 2007 parser generators for inclusion in the baseline testing on HOBS. MaltParser was configured by using MaltOptimizer (Ballesteros and Nivre, 2012) and seven projective and non-projective parsing algorithms were tested, while four different configurations of MSTParser were tested: first-and second-order arc-factored language model with Eisner's (projective) and Chu-Liu/Edmonds (non-projective) parsing algorithms. Results Labeled (LAS) and unlabeled (UAS) attachment score was observed, as well as linear label attachment (LA), both overall and for specific syntactic functions and parts of speech. The first set of results is given in From another perspective, the top-performing MSTParser system with a second-order arcfactored language model and the Chu-Liu/Edmonds MST parsing algorithm scored approximately 74.53% LAS, a result that places Croatian in the group of languages with low parsing accuracy, as expected. Table 3 additionally indicates that the parsing scores are even lower for the most important syntactic functions with respect to information extraction -subjects (Sb), predicates (Pred) and objects (Obj). This supported the initial estimation that a compound approach to dependency parsing should be implemented in order to increase overall parsing accuracy for Croatian. The method is presented and evaluated in the following section. Valency lexicon reranking parser The suggested parsing method draws on the fact that verb valency lexicons, such as VALLEX (Lopatková et al., 2006) and the VALLEX-inspired valency lexicon of Croatian verbs CROVALLEX (Mikelić Preradović et al., 2009) , explicitly encode obligatory and optional constraints on the number and morphosyntactic properties of dependents that the verbs contained in the lexicon impose. While rule-based dependency parsers might use such information on (predicate) verbs at parser runtime, a post-processing reranking approach is presented here. Namely, a parser is developed that provides k-best dependency trees sorted by adequacy for an input sentence and this parser is then linked to the valency lexicon through a reranking module that reorders the suggested k-best trees by using the lexicon to evaluate them. The evaluation and subsequent reranking is done by weighting dependency relations whose heads are verbs contained within the valency lexicon and adding up the weights to provide overall scores for the suggested dependency trees. In this section, the CROVALLEX valency lexicon is briefly presented and followed by a presentation of the reranking parser CroDep. The parser is then evaluated in the same testing environment as in the baseline experiment and the obtained results are discussed. Valency lexicon CROVALLEX is a verb valency lexicon created following the FGD guidelines (Sgall et al., 1986) and is accordingly compatible with HOBS with respect to the syntactic theory of choice. The utilized version of CROVALLEX (v2.008) contained 1,797 verb lemmas with 5,188 valency frames. Each valency frame is defined by stating the number, obligatoriness and morphological properties of sentence elements that a given verb introduces. for the verb dotaknuti (en. to touch). In the first frame, the agent (AGT) is obligatory (obl) and the instrument (INST) is optional and has to be in the instrumental case (case number 7). In the second frame, the patient (PAT) is obligatory and has to be in the accusative case (4). The lexicon was adapted to the requirements of data-driven dependency parsing by filtering all multiword lemmas and entries with frequency of 0 denoted in the lexicon. 1,455 verbs and 4,090 respective frames were held. HOBS was then tested using CROVALLEX in order to observe the overlaps. HOBS contained a total of 1,525 verb lemmas and 12,952 verb tokens (ca 14.55% of all lemmas and 14.72% of all tokens), out of which a total of 791 verb lemmas was found in CROVALLEX (ca 51.87%). On the other hand, 664 of the CROVALLEX verbs were not represented by HOBS (ca 45.64% of all CROVALLEX verbs). Even though the measurement of static coverage of verb lemmas itself implicitly supports the course of action with interacting CROVALLEX with a HOBS-trained dependency parser, the dynamic coverage, i.e., the coverage of verb tokens provides an even stronger justification. Only 9.24% of all the verb tokens in HOBS were not covered by CROVALLEX, i.e., for 90.76% of verb tokens in HOBS, at least a single valency frame was found in CROVALLEX. Another CROVALLEX-related viewpoint on HOBS is given in Table 4 . It shows the relative frequency of dependents attached to verbal predicates by their syntactic function. It can be seen that a place in the sentence is most frequently opened by predicates to subjects (almost 20%), prepositions introducing prepositional phrases (16.38%), auxiliary verbs (15.47%), objects (12.17%) and adverbials (10%). The distribution indicates that the properties of verbs encoded in CROVALLEX are readily instantiated in HOBS. Parser Within the suggested framework, parsing is envisioned as a three-step procedure. First, k-best dependency trees sorted by confidence are provided by a language-independent data-driven parsing algorithm. Second, these k dependency trees are scored by a valency-lexicon-based scoring module. Third and final, the trees are re-sorted by combining the scores from the previous steps. The data-driven component is a dependency parser based on both MSTParser (McDonald et al., 2006) and kMSTParser (Hall, 2007) . Graph-based dependency parsing was chosen as a starting point in prototype development on basis of the results obtained in the baseline experiment, showing that graph-based dependency parsers consistently outperform transitionbased dependency parsers on Croatian texts. The prototype uses the perceptron training algorithm implemented in MSTParser (McDonald et al., 2005) and the parsing algorithm based on (Camerini et al., 1980) for detecting k-best maximum spanning trees adapted to dependency parsing in kMSTParser. This prototype parser is called CroDep0. Currently it supports only first-order arc-factored language models. It was evaluated on HOBS within the baseline testing framework to provide a reference point and it scored 73.27% LAS, 1.26% lower than the top-performing second-order Chu-Liu/Edmonds MSTParser. The verb valency lexicon reranking component prototype was developed in what could be considered the simplest possible form of validating dependency relations with respect to valency frames. Namely, the reranking component takes a dependency tree as input. It searches the tree for verbal predicates. When a verbal predicate is encountered, its lemma is matched with the valency lexicon. If it exists as an entry in the lexicon, each of the first-level dependents introduced to the sentence by the verbal predicate is matched with the predicted slots in the valency frames on basis of its morphosyntactic properties: if the properties match and if the element is defined as obligatory, the tree score is incremented. The final score of the tree is defined as the sum of scores of all dependency relations having a verbal predicate as relation head. Each of the k-best trees provided by CroDep0 is given a score by the reranking component. Finally, the re-sorting component combines the two lists -confidence scores for the k-best trees provided by CroDep0 and valency scores provided by the valency reranker -into a single list averaging the scores while favoring the stochastic component in case of ties. Being that the dependency tree scores from the valency reranker are positive integers representing overall counts of dependency relation confirmations extracted from the valency lexicon, they are normalized for comparison with the CroDep0 confidence scores. The normalization is done by using the maximum confidence score of CroDep0 as ceiling for the valency reranker scores. More formally, let S p = {c p (t i )} k i=1 , ∀i, c p (t i ) ∈ [0, 1] represent the confidence scores for the k dependency trees t i from the k-best parser module and let S v = {c v (t i )} k i=1 , ∀i, c v (t i ) ∈ be a list of trees and respective integer scores obtained from the valency reranker. The normalized valency reranker scores Ŝv and finally the overall dependency tree scores S o are provided by the re-sorting component as follows. Ŝv = {ĉ v (t i )} k i=1 , ∀i, ĉv (t i ) ∈ [0, 1] ĉv (t i ) = max i (c p (t i )) • c v (t i ) max i (c v (t i )) S o = {c o (t i )} k i=1 , ∀i, c o (t i ) ∈ [0, 1] c o (t i ) = 2 • c p (t i ) • ĉv (t i ) c p (t i ) + ĉv (t i ) The final output of the parser is always arg max i (c o (t i )). If there are multiple dependency trees with the same overall score c o , the ordering is decided by selecting the tree with the highest relative score in the k-best parser ranking, i.e., S p . The resulting parser prototype is called CroDep. It inherits the properties of CroDep0 stochastic module, has the value of k fixed to 10 and additionally requires a verb valency lexicon in VALLEX-XML format for operation. Results Table 5 shows the overall accuracy of CroDep and its accuracy on selected parts of speech. CroDep outperforms the top-performing baseline parser by 2.68% LAS and the difference is shown to be statistically significant. The difference is also indicated graphically by the confidence intervals in Figure 3 6 shows the CroDep LAS and UAS scores on selected syntactic functions, as well as precision and recall with respect to label attachment for these functions, similar to linear morphosyntactic tagging evaluation. Compared to Table 3 which listed the scores on these syntactic functions for the top-performing baseline parsers, it can be clearly seen that the overall increase of CroDep accuracy by 2.68% LAS on MSTParser is caused by a substantial increase in LAS for predicates, subjects and objects (more than 10.00% LAS for each of the functions). Figure 3 (right side) shows that CroDep also handles long-distance dependencies better than the best baseline parsers and that its footprint is very similar to the one of the graph-based parser. Conclusion and perspectives A method is presented for hybrid language-independent dependency parsing by combining data-driven k-best maximum spanning tree parsing and rule-based reranking guided by a verb valency lexicon. It was tested in the form of prototype parser CroDep on the Croatian Dependency Treebank by using the CROVALLEX lexicon of Croatian verbs and it scored 77.21% LAS, topping the top-performing baseline parser by 2.68% LAS. Future work plans include testing the method on other languages, combining CroDep with other parsers and using methods of automatic valency frame extraction to enrich existing resources. Introduction of valency features to standard parsers might be considered. A preliminary experiment with parsing Czech was conducted by using PDT and VALLEX in compliance with the CoNLL 2007 shared task. CroDep scored 80.51% LAS, topping CroDep0 by 1.73% LAS, thus indicating method applicability across languages and outlining the influence of resource properties on method performance. Further research in language-independent k-best spanning tree parsing with valency lexicon reranking is required to support these preliminary results. Acknowledgments The presented results were partially obtained from research within project CESAR (ICT-PSP, grant 271022) funded by the European Commission, and partially from research within projects 130-1300646-0645 and 130-1300646-1776 funded by the Ministry of Science, Education and Sports of the Republic of Croatia.",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 1.0,
        "foundation": 0.0,
        "none": 0.0
    },
    "reasoning": "Reasoning: The article explicitly mentions that the presented results were partially obtained from research within project CESAR funded by the European Commission, and partially from research within projects funded by the Ministry of Science, Education and Sports of the Republic of Croatia. The European Commission is a governmental body, thus classifying as a research agency, and the Ministry of Science, Education and Sports of the Republic of Croatia is also a government entity, indicating funding from a research agency as well. There is no mention of funding from defense, corporate entities, or foundations."
}