{
    "article": "Several datasets have been annotated and published for classification of emotions. They differ in several ways: (1) the use of different annotation schemata (e. g., discrete label sets, including joy, anger, fear, or sadness or continuous values including valence, or arousal), (2) the domain, and, (3) the file formats. This leads to several research gaps: supervised models often only use a limited set of available resources. Additionally, no previous work has compared emotion corpora in a systematic manner. We aim at contributing to this situation with a survey of the datasets, and aggregate them in a common file format with a common annotation schema. Based on this aggregation, we perform the first cross-corpus classification experiments in the spirit of future research enabled by this paper, in order to gain insight and a better understanding of differences of models inferred from the data. This work also simplifies the choice of the most appropriate resources for developing a model for a novel domain. One result from our analysis is that a subset of corpora is better classified with models trained on a different corpus. For none of the corpora, training on all data altogether is better than using a subselection of the resources. Our unified corpus is available at http://www.ims.uni-stuttgart.de/data/unifyemotion. Introduction Emotion detection and classification in text focuses on mapping words, sentences, and documents to a set of emotions following a psychological model such as those proposed by Ekman (1992) , Plutchik (1980) or Russell (1980) , inter alia. The task has emerged from a purely research oriented topic to playing a role in a variety of applications, which include dialog systems (chatbots, tutoring systems), intelligent agents, clinical diagnoses of mental disorders (Calvo et al., 2017) , or social media mining. As the variety of applications is large, the set of domains and differences in text is large. An early work, motivated by the goal to develop an empathic storyteller for children stories, is the corpus creation and modelling of emotions in tales by Alm et al. (2005) . Afterwards, the idea has been transferred to the Web, namely blogs (Aman and Szpakowicz, 2007) , and microblogs (Schuff et al., 2017; Mohammad, 2012; Wang et al., 2012) . A different domain under consideration are news articles: Strapparava and Mihalcea (2007) focus on emotions in headlines. It can be doubted that emotions are expressed in a comparable way in these different domains: Journalists ideally tend to be objective when writing articles, authors of microblog posts need to focus on brevity, and one might assume that emotion expressions in tales are more subtle and implicit than, for instance, in blogs. Therefore, the transfer across emotion recognition models is, presumably, challenging. The most straight-forward alternative is, however, to build resources from scratch, a costly process. Given this situation, it remains unclear, given a novel domain for which an emotion recognition system should be developed, how to start. Next to the methodological issues we just discussed, another challenge is to acquire and compare available corpora. With this paper, we aim at contributing to all these challenges. We support future research by comparing existing datasets, exploring how they complement each other, and mapping them to a common format such that future emotion detection can benefit from being developed on different domains and annotation schemata. In addition, we perform cross-corpus experiments by training classifiers on each dataset and evaluating them on others. One challenge here is that corpora are from different domains and are annotated following different guidelines and schemata. We aim at helping to make decisions which support the best model development for a future domain by selecting appropriate corpora. Parameters to be taken into account are the source of the text (e. g., blogs, news, social media), the annotation schema (e. g., Plutchik, Ekman, subsets of them), and the annotation procedure (e. g. crowdsourcing, self-reporting, expert-based, distant labeling). Our main contributions are therefore (1) to describe existing resources, (2) to evaluate which state-of-the-art classifiers perform well when trained on one dataset and applied on another, (3) to evaluate which datasets generalize best to other domains, and (4) to compare the datasets qualitatively and quantitatively. To achieve our goals and as additional support for future research, we unify all available datasets in a common file format. We provide a script that downloads and converts the datasets, and instructs on how to obtain datasets where the license requires no redistributions. Our resources are available via http://www.ims.uni-stuttgart.de/data/unifyemotion. We aim at keeping the unified corpus up to date in the future. Background & Related work In the following, we discuss differences in psychological models and annotation schemata (Section 2.1), annotation procedures (Section 2.2), different domains and topics (Section 2.3), and different prediction methods (Section 2.4). An overview on the resources and previous work is shown in Table 1 . In addition to this, we recommend the surveys by Munezero et al. (2014) and Santos and Maia (2018) . Emotion Models in Psychology & Annotation Schemata Emotion models are still debated in psychology (Barrett et al., 2018; Cowen and Keltner, 2018) . We do not contribute to these debates but focus on the main theories in psychology and natural language processing (NLP): discrete and finite sets of emotions (categorical models) and combinations of different continuous dimensions (dimensional models). Early work on emotion detection (Alm et al., 2005; Strapparava and Mihalcea, 2007) focused on conceptualizing emotions by following Ekman's model which assumes the following six basic emotions: anger, disgust, fear, joy, sadness and surprise (Ekman, 1992) . Suttles and Ide (2013) , Meo and Sulis (2017) , and Abdul-Mageed and Ungar (2017) follow the Wheel of Emotion (Plutchik, 1980; Plutchik, 2001) which also considers emotions as a discrete set of eight basic emotions in four opposing pairs: joy-sadness, anger-fear, trust-disgust, and anticipation-surprise, together with emotion mixtures. Dimensional models were more recently adopted in NLP (Preot ¸iuc-Pietro et al., 2016; Buechel and Hahn, 2017a; Buechel and Hahn, 2017b ): The circumplex model (Russell and Mehrabian, 1977) puts affective states into a vector space of valence (corresponding to sentiment/polarity), arousal (corresponding to a degree of calmness or excitement), and dominance (perceived degree of control over a given situation). Any emotion is a linear combination of these. Annotation Procedures A standard way to create annotated datasets is via expert annotation (Aman and Szpakowicz, 2007; Strapparava and Mihalcea, 2007; Ghazi et al., 2015; Li et al., 2017; Schuff et al., 2017; Li et al., 2017) . However, having an expert annotate a statement means that they must estimate the private state of the author. Therefore, the creators of the ISEAR dataset follow a different, but similar, route making use of self reporting: subjects are asked to describe situations associated with a specific emotion (Scherer and Wallbott, 1994) . This approach can be considered an annotation by experts in their own right. Crowdsourcing, for instance using the platforms Amazon's Mechanical Turk 1 or CrowdFlower 2 , is another way to acquire human judgments. Crowdsourcing often lacks sufficient quality control but some popular datasets have been successfully acquired with this approach, e. g., the dataset released by Crowdflower for Cortana 3 or the datasets constructed by Milnea et al. (2015) and Lapitan et al. (2016) . Another example is the dataset by Mohammad (2012) , who design two detailed online questionnaires and annotate tweets by crowdsourcing. Lastly, social networks play a central role in data acquisition with distant supervision (also called self-labeling in this context), because they provide a quick and cheap way to get large amounts of noisy data annotated by writers or readers (Mohammad and Kiritchenko, 2015; Abdul-Mageed and Ungar, 2017; De Choudhury et al., 2012; Liu et al., 2017) . For example, on Twitter one could add a \"#joy\" hashtag to a happy tweet or on Facebook one could tag personal posts with a \"feeling\" and people can show an emotional \"surprised reaction\". In this last example, two levels of annotation are provided that are relevant to emotion analysis, namely both the reader's and the writer's emotional state. Accessing this information is comparably straight-forward in these social network platforms. More challenging is to acquire such data for other domains. Buechel and Hahn (2017a) and Buechel and Hahn (2017b) look specifically into distinguishing between writers' and readers' emotion expressions. It should be noted that some of these approaches exist in parallel to previous research in assessing emotion states of people, despite the fact that standardized psychological instruments exist (Bradley and Lang, 1994) . Domains and Topics Previous work on emotion detection focuses on different domains and topics, e. g., descriptions of self reported emotional events (Scherer and Wallbott, 1994), news (Lei et al., 2014; Buechel et al., 2016) , news headlines (Strapparava and Mihalcea, 2007) , blogs (Aman and Szpakowicz, 2007) , tales (Alm et al., 2005) , micro-blog posts (i. e., tweets) (Wang et al., 2012) to different domains, such as health, politics (Mohammad, 2012) , and stock markets (Bollen et al., 2011) . An early example and one of the first initiatives of emotion classification is the work by Aman and Szpakowicz (2007) , who use blog posts, sampled without taking a specific topic into account. They identify the emotion, category, intensity and cue words and phrases. Mishne and de Rijke (2005) , Balog et al. (2006) and Nguyen et al. (2014) works on LiveJournal 4 data to develop predictive models for moods. Similarly, user-generated data in social media has been a subject of research. Mohammad et al. (2015) and Mohammad and Bravo-Marquez (2017b) annotate electoral tweets for sentiment, intensity, semantic roles, style, purpose and emotions. De Choudhury et al. (2012) identify more than 200 moods frequent on Twitter. Mohammad (2012) , Mohammad et al. (2015) , Wang et al. (2012) , Volkova and Bachrach (2016) make use of Twitter distantly labeled data. Recently, Liu et al. (2017) analyzed the role of context that grounds sentiment in tweets, and looked into whether the effect of weather and news events relate to the emotion expressed in a given tweet. EmoNet is claimed to be the largest dataset constructed of tweets (Abdul-Mageed and Ungar, 2017) . Twitter is often the preferred subject of research as it is easy to use and has a well-documented API. However, Facebook is also used, e. g., Preot ¸iuc-Pietro et al. ( 2016 ) create a dataset of Facebook posts and train prediction models for valence and arousal. Pool and Nissim (2016) and Krebs et al. (2017) make use of the reaction feature in Facebook to collect labeled data for distant supervision of a classifier. A different approach within the same domain was used by Polignano et al. (2017) who labeled posts with emoticons mapped to Ekman's model. Data in social media can be in the form of dialogues. Li et al. (2017) manually label a dataset of conversations. Wang et al. (2016) introduce EmotionPush, a system that automatically conveys the emotion of received text on mobile devices, deployed on Facebook's messenger app. From the same domain, but on a different topic is the study of patients' emotional states dynamics expressed by their Facebook posts (Lombardo et al., 2017) . Motivated by the work of literary scholars is the creation of datasets to study emotion in literature. One of the first datasets is the tales corpus by Alm et al. (2005) . Kim et al. (2017) investigate the relationship between literary genres and emotions. Methods used in Emotion Identification Emotion classification is commonly phrased as text classification. As text classification in general, the array of methods seen for emotion classification can be divided into rule-based methods and machine learning, which we discuss in the following. Rule-based Algorithms Rule-based text classification typically builds on top of lexical resources of emotionally charged words. These dictionaries can originate from crowdsourcing or expert curation. Examples include WordNet-Affect (Strapparava et al., 2004) and SentiWordNet (Esuli and Sebastiani, 2007) , both of which stem from expert annotation. Partly built on top of them is the NRC Word-Emotion Association Lexicon (Mohammad et al., 2013) , which uses the eight basic emotions (Plutchik, 1980) . Warriner et al. (2013) use crowdsourcing to assign values of valence, arousal, and dominance (Russell, 1980) . Another related category of lexical resources which has been used for emotion analysis is concreteness and abstractness (Köper et al., 2017) . Brysbaert et al. (2014) publish a lexicon based on crowdsourcing, where the task was to assign a rating from 1 to 5 of the concreteness of 40,000 words. Similarly, Köper and Schulte im Walde (2016) automatically generate affective norms of abstractness, arousal, imageability, and valence for 350,000 lemmas in German. Lastly, the Linguistic Inquiry and Word Count (LIWC) is a set of 73 lexicons (Pennebaker et al., 2001) , built to gather aspects of lexical meaning regarding psychological tasks. Dictionary and rule-based approaches are particularly common in the field of digital humanities due to their transparency and straightforward use. Machine Learning A performance improvement over dictionary lookup has been observed with supervised feature-based learning. Common features include word n-grams, character n-grams, word embeddings, affect lexicons, negation, punctuation, emoticons, or hashtags (Mohammad, 2012) . This feature representation is then usually used as input to feed classifiers such as naive Bayes, SVM (Mohammad, 2012) , MaxEnt and others to predict the relevant emotion category (Aman and Szpakowicz, 2007; Alm et al., 2005) . Similarly to the paradigm shift in sentiment analysis, from feature-based modelling to deep learning, state-of-the-art models for emotion classification are often based on neural networks (Barnes et al., 2017) . Schuff et al. (2017) applied models from the classes of CNN, BiLSTM (Schuster and Paliwal, 1997) , and LSTM (Hochreiter and Schmidhuber, 1997) (Chung et al., 2015) . One approach to tackle sparsity of datasets is transfer learning; to make use of similar resources and then transfer the model to the actual task. A recent successful example for this procedure is Felbo et al. (2017) who present a neural network model trained on emoticons which is then transfered to different downstream tasks, namely the prediction of sentiment, sarcasm, and emotions. Unified Dataset of Emotion Annotations In this section, we describe each dataset we aggregate in our unified corpus. We provide a brief description and then show how the different schemata are merged. Please note that our interpretation might differ from the author's original description (though we aimed at avoiding that). Datasets Overview AffectiveText The dataset AffectiveText published by Strapparava and Mihalcea (2007) The annotation schema for the emotion category corresponds to the six fundamental Ekman emotions to which no emotion is added. This resource can be obtained through contacting the authors. CrowdFlower The dataset \"The Emotion in Text, published by CrowdFlower\" consists of 39,740 tweets. Part of this data has been used in Microsoft's Cortana Intelligence Gallery. The set of labels is non-standard (see Table 4 ). It is annotated via crowdsourcing with one label per tweet and can be freely downloaded, the license is not specified. The data is comparably noisy. DailyDialogs The dataset, published by Li et al. (2017) , is built on conversations and consists of 13,118 sentences. The annotation schema follows Ekman, complemented by \"no emotion\". It is single label annotated via expert annotation and can be freely downloaded for research purposes. This dataset has additional annotations for communication intention and topic. Electoral-Tweets The dataset, published by Mohammad et al. (2015) , targets the domain of elections. It consists of over 100,000 responses to two detailed online questionnaires (the questions targeted emotions, purpose, and style in electoral tweets). The tweets are annotated via crowdsourcing. The set of labels for emotion is non-standard (see Table 1 ). In addition to document-level annotations, tweets are annotated with emotion words. It can be freely downloaded for research purposes. EmoBank The dataset published by Buechel and Hahn (2017a) builds on multiple genres and domains. It consists of 10,548 sentences where each sentence was manually annotated according to both the emotion which is expressed by the writer, and the emotion which is perceived by the readers. The annotations are according to the valence-arousal-dominance model. A subset of the corpus is AffectiveText, which makes this dataset a good resource to design models that map between both discrete or dimensional representations. EmoInt The EmoInt published by Mohammad and Bravo-Marquez (2017a) Analysis The majority of resources consists of user generated data. The biggest dataset is CrowdFlower with 39,740 annotated tweets, followed by TEC with 21,051 tweets, and Blogs with 15,000 annotated sentences from blog posts. Out of all 14 resources, 9 are annotated with the six fundamental emotions defined by Ekman, with small variations. SSEC and Electoral-Tweets follow Plutchik's model. Electoral-Tweets is annotated with 19 emotions and the authors provide a mapping to Plutchik's set (which we follow in the aggregation). Non-fundamental emotions are annotated in CrowdFlower (fun, worry, enthusiasm, and love). Not only the size, also the distribution of labels is different in the corpora. Table 2 shows the distribution for Ekman's emotions before and after having applied the mapping to a unique set of emotion labels (see Table 4 in the Appendix A). In many corpora, joy is the dominating emotion, followed by sadness, surprise, and anger. Exceptions are SSEC, Electoral-Tweets, and EmoInt, in which negative emotions are more frequent. In SSEC, this is because of its origin as a stance dataset. Similarly, Electoral-Tweets shows a polarizing nature of political debates with disgust and anger being more common. Figure 1 shows a quantitative similarity comparison of the data. We represent each dataset by its term distribution, taking the top 5,000 most common words from each dataset and calculating the cosine similarity across corpora (inspired by Ruder and Plank (2017) and Plank and Van Noord (2011) ). Twitter corpora are more similar to each other (EmoInt and CrowdFlower are the most similar to TEC) than to other domains with the exception of SSEC, which is the most dissimilar to the other tweet datasets. DailyDialogs is more similar to the tweets than to ISEAR and Blogs. The column All stands for the union of all datasets except the one that is being compared to. In this context, the most dissimilar towards the respective aggregated set is AffectiveText. The reason is that this is a small dataset compared to the tweet-based corpora and that it covers a specific topic, headlines. Grounded-Emotions is also notably dissimilar. Most similar to All is EmoInt, followed closely by TEC and Blogs, which covers blog posts and not tweets. Aggregation To provide a standardized access to the datasets, we define joy, anger, sadness, disgust, fear, trust, surprise, love, confusion, anticipation and noemo as our common label set. The original resources additionally include other 44 labels that come from Electoral-Tweets and CrowdFlower. Where availble from the original publication, we follow proposed mappings (e. g., Electoral-Tweets with 19 emotions and a mapping to Plutchik's model). Table 4 in Appendix A summarizes the mapping. We include valence, arousal, and dominance where annotated, however, we currently do not map the categorical emotion models onto the dimensional ones. Each instance in the unified dataset contains, in addition, a unique id, the source corpus name, the text, and an assignment of a real number to each of the 11 emotion variables. In most datasets, each instance is only annotated discretely with single labels (exceptions are SSEC and AffectiveText). Therefore, most instances have exactly one label marked with a 1.0. For the multi-labeled datasets, several emotions can be marked. For datasets with annotated emotion intensity, values can range between 0 and 1. For datasets with multiple annotator information, we follow the recommendations by the original authors. For SSEC, that means, accepting a label if at least one annotator assigned it. For Tales, the authors provide a gold annotation, in which angry and disgust are merged. We handle them separately, and accept a label if and only if all annotators agree. For Blogs, we take the examples of the dataset with the high agreement annotations. Next to these fundamental attributes, we provide the domain and annotation style information, as well as additional, dataset specific attributes (e. g., the story from which an instance originates, in the Tales corpus). Our unified data includes all datasets for which the licenses are available; as some datasets are not redistributable, but free to download, we provide a script that interactively downloads and converts the existing resources into our unified format. An excerpt of the data is depicted in Appendix B. Experiments We perform experiments in the following settings: Firstly, we perform a within-corpus emotion classification (training on one corpus and testing on the same, using cross-validation 5 ). Secondly, we do pairwise-corpus evaluation: training on the entire data of one corpus and evaluating on all the data of a different one, for all corpus pairs. This includes the use of the aggregated corpus, but for this experiment excluding the test corpus -this corresponds to a cross validation setting in which the subsets correspond to corpora. Experimental settings Previous methods have shown that linear classifiers are nearly en par with neural methods (Schuff et al., 2017) . We therefore use maximum entropy classifiers as implemented in scikit-learn (Pedregosa et al., 2011) with bag-of-words (BOW) features for these experiments for simplicity and easy reproducibility. We use L2 regularization and balance the classes in the training data with instance weights. Training/test splits are 80%/20%. Cross-validation is 10-folds stratified. For datasets in which the labels do not align following our mapping, we use the intersection of labels in the train and test data. We do not discard any instances. For datasets that are designed for other tasks than emotion classification such as EmoInt and Emotion-Stimulus, we do not change the setting of our classification task. For experiments in which we move from a multi-label setting (more than one emotion can hold per instance) to a single-label setting (only one emotion holds), we train multiple binary classifiers from which we only accept, in the prediction phase, the highest scoring emotion. For experiments in which we move from a single-label setting to a multi-label setting, we as well train separate binary classifiers and accept all emotions for which the binary classifiers output one. The case multi-label to multi-label works analogously. For single-label to single-label, we use one multi-class MaxEnt model. Results Within-corpus emotion classification. The results for our first experiment are shown per emotion in Table 3 (where we restrict the results to the six fundamental emotions defined by Ekman) and in the diagonal of Figure 2 . These should be interpreted in context to the similarity analysis in Figure 1 . We see that some datasets and domains are more difficult to be modeled than others. The \"easiest\" dataset seems to be Emotion-Stimulus, followed by EmoInt. The reason for the high scores lies in the fact that both datasets are constructed for different tasks (stimulus and intensity prediction). As such, our task does not suit these two very well. Next datasets with comparably high performance measures are Blogs and DailyDialogs. In contrast, CrowdFlower and Electoral-Tweets seem to be the most challenging in the within-corpus setting. For CrowdFlower, the results are due to the larger label set, which makes the task more difficult. Mostly, the emotions that occur less frequently (like surprise) show lower results than the ones occurring frequently (like joy and sadness). In addition, manual inspection shows that this data is comparably noisy. This is also backed by the general observation that our model performs in general worse on Twitter data than on most other domains. In terms of annotation procedures, these experiments allow almost for no judgement, since most of the datasets use expert annotation and we only have few examples for the other two ways of annotation (crowdsourcing and distant supervision) being used. However, we could observe that the crowdsourced datasets are more difficult which might be due to a more noisy annotation. Cross-corpus emotion classification The in-corpus results (the diagonal in Figure 2 ) shows higher F 1 -scores than the cross-corpus results. The exception is Electoral-Tweets, where the same performance is observed by training on a different corpus, Blogs. Models trained on Twitter data perform slightly  We cannot recommend to train on Emotion-Stimulus and Grounded-Emotions as long as the specific properties of these datasets are not required. The models estimated on these data do not perform well on other sets. Note that this is not a quality judgement, Grounded-Emotions has different labels and Emotion-Stimulus was designed for a different purpose. Note that the similarity measure is an approximation of mediocre quality for model performance, with a Pearson correlation of r = 0.32. All vs. one cross-corpus emotion classification. The results for this setting can be seen in the All column of Figure 2 . These results show which datasets are easier to classify, namely DailyDialogs, Blogs, and EmoInt. It might seem intuitive that adding more and diverse training data could be helpful in classifying almost all datasets. However, we can see in the results that this is not the case. Especially the multi-labeled datasets AffectiveText and SSEC together with the datasets that were the most transformed (i. e., many labels unified) during the aggregation process, such as Electoral-Tweets and CrowdFlower are more difficult to classify while training on all the other datasets. Conclusion & Future Work Datasets annotated for emotion classification are important in emotion analysis research as they are used in many downstream tasks as well; having these datasets all in place reduces drastically the amount of work needed in preprocessing and transferring the needed data. Yet, it is a diverse collection of datasets driven by different psychological emotion models, on different domains, and approaches used in annotation. With this paper, we present the first survey on emotion datasets on text. In addition to this literature review, we provide a unified, aggregated corpus to support future research on standardized data. The existence of such a benchmark opens up the possibility of other experiments, such as transfer learning and domain adaptation work, with focus on different domains and on different label sets. From the collected unified datasets one could learn how to select the most suitable dataset for a given new domain and evaluate it across different classification models, domains, and annotation procedures, easier than it was possible until now. Also having this open will help the emotion detection task to become a standard task on which state-of-the-art methods used in general classification are tested upon, similarly to other tasks like sentiment classification, which plays this role already. In addition, this work can be used by anyone who wants to explore the current state of the emotion analysis field. As future work we plan to release another version of the dataset in which the conversion between the different emotion models are added and to perform transfer learning experiments between datasets, domains, and annotation procedures. Furthermore, we propose to use the resource to qualitatively analyze the different realizations of emotions across annotation schemata and domains. Acknowledgements This research has been funded by the German Research Council (DFG), project SEAT (Structured Multi-Domain Emotion Analysis from Text, KL 2869/1-1). We thank Evgeny Kim and Jeremy Barnes for fruitful discussions. B Example Excerpt from the Aggregated Corpus { \"id\": 210599, \"VAD\": { \"valence\": null, \"arousal\": null, \"dominance\": null }, \"source\": \"ssec\", \"text\": \"He who exalts himself shall be humbled; and he who humbles himself shall be exalted. Matt 23:12. #SemST\" \"emotions\": { \"joy\": 1, \"anger\": 1, \"sadness\": 0, \"disgust\": 1, \"fear\": 0, \"trust\": 1, \"surprise\": 0, \"love\": null, \"noemo\": null, \"confusion\": null, \"anticipation\": 0 }, \"original_split\": \"test\", \"emotion_model\": \"Plutchik\" \"domain\": \"social-media/tweets\", \"labeled\": \"multilabeled\" }",
    "abstract": "Several datasets have been annotated and published for classification of emotions. They differ in several ways: (1) the use of different annotation schemata (e. g., discrete label sets, including joy, anger, fear, or sadness or continuous values including valence, or arousal), (2) the domain, and, (3) the file formats. This leads to several research gaps: supervised models often only use a limited set of available resources. Additionally, no previous work has compared emotion corpora in a systematic manner. We aim at contributing to this situation with a survey of the datasets, and aggregate them in a common file format with a common annotation schema. Based on this aggregation, we perform the first cross-corpus classification experiments in the spirit of future research enabled by this paper, in order to gain insight and a better understanding of differences of models inferred from the data. This work also simplifies the choice of the most appropriate resources for developing a model for a novel domain. One result from our analysis is that a subset of corpora is better classified with models trained on a different corpus. For none of the corpora, training on all data altogether is better than using a subselection of the resources. Our unified corpus is available at http://www.ims.uni-stuttgart.de/data/unifyemotion.",
    "countries": [
        "Germany"
    ],
    "languages": [
        "German"
    ],
    "numcitedby": "110",
    "year": "2018",
    "month": "August",
    "title": "An Analysis of Annotated Corpora for Emotion Classification in Text"
}