{
    "article": "Interaction with computers in natural language requires a language that is flexible and suited to the task. This study of natural dialogue ~as undertaken to reveal those characteristics which can make computer English more natural. Experiments were made in three modes of communication: face-to-face, terminal-toterminal and human-to-computer, involving over 80 subjects, over 80,000 words and over 50 hours. They showed some striking similarities, especially in sentence length and proportion of words in sentences. The three modes also share the use of fragments, typical of dialogue. Detailed statistical analysis and comparisons are given. The nature and relative frequency of fragments, which ]lave been classified into twelve categories, is shown in all modes. Special characteristics of the face-to-face mode are due largely to these fragments (which include phatlcs employed to keep the channel of communication open). Special characteristics of the computational mode include other fragments, namely definitions, which are absent from other modes. Inclusion of fragments in computational grammar is considered a major factor in improving computer naturalness. The majority of experiments involved a real life task of loading Navy cargo ships. The peculiarities of face-to-face mode were similar in this task to results of earlier experiments involving another task. It was found that in task oriented situations the syntax of interactions is influenced in all modes by this context in the direction of simplification, resulting in short sentences (about 7 words long). Users seek to maximize efficiency In solving the problem. When given a chance, in the computational mode, to utilize special devices facilitating the solution of the problem, they all resort to them. Analyses of the special characteristics of the computational mode, including the analysis of the subjects\" errors, provide guidance for the improvement of the habitability of such systems. The availability of the REL System, a high performance natural language system, made the experiments possible and meaningful. The indicated improvements in habitability are now being embodied in the POL (Problem Oriented Language) System, a successor to REL. I. Introduction The research reported on is part of a larger project aimed at improving the interaction of humans with computers in a language that is natural for the user. In real life applications of computers the language is natural in a very specific sense, since it is constrained by the linguistic and situational context and sub-Ject to the inevitable restrictions of the computational grammar and the general requirements of this mode of interaction. However if computational interaction is to be natural, forms of language which are natural in normal dialogue as well as those particularly suited to the application should be available to the user. A very important requirement is that the means of communication be flexible, that the user should be able to modify the language so as to best serve the solution of the problem. Another issue is to what extent the computer should act as a natural party to the Interaction. Naturalness of human-computer interaction is often refered to as a system's habitability. This research was undertaken upon the belief that investigation of human dialogue (both spoken and written) and analysis of human-computer interaction is essential to determine how good habitability can be achieved. Initial research was done on human-to-human dialogue, both in the face-to-face mode in totally free (but voice only) interaction and in the written mode where the dialogue was via computer terminals linked to a computer system, but where the interaction was in unrestricted English. Initial research involved the solution of a relatively simple though quite realistic problem. It confirmed some expected differences between the two modes of communication, but also revealed some surprising similarities. An extremely important result and one that proved particularly challenging to obtain was the identification and definition of structures other than sentences used in natural unrestricted communication. These were finally reduced to about a dozen categories. The next stage of research involved a real-life task and the data was the same for three modes: face-to-face, terminalto-terminal, and human-to-computer. Results for the first two modes were closely comparable to the previous results and were also compared with results from the computational mode. Again, what is more striking and worthy of interest are the similarities rather than the differences. Some of the major similarities are in sentence length, percentage of words in sentences (as against fragments), number of sentences (for termlnal-to-termlnal and human-computer mode), ~ery high number of sentences containing beverbs, and low number of sentences containing relative pronouns. In this paper, the focus is on (I) the comparison of statistics obtained for the three ,nodes; (2) the nature and relative frequency of fragments and their implications for computational habitability; and (3) detailed discussion of the characteristics of the computational interactions. The research involved over i00 subjects in years 1975, 1977 and 1979/80. The subjects were predominately undergraduate and graduate students at Caltech. This work resulted in an enormous amount of data, requiring a great deal of time for analysis. Since each protocol was scored by at least two people (and usually more), averaging out the scores was also time consuming. Total time spent by subjects in experiments was over 50 hours, which yielded for flnal comparisons 20 face-to-face protocols, II termlnal-to-terminal, and 21 human-to-computer, containing over 80,000 words. Protocols of over 20 subjects in face-to-face and terminal-toterminal mode were analyzed for categories and partial statistics~ and thus not included in the final results. The main thesis of this paper is that in problem solving situations ordinary conversation and human-computer conversation in a system that allows relative natural language, share several important features, and that we can improve computer habitability by learning about the nature of ordinary conversation, which exhibits rather well defined and identifiable structural patterns. II. Early Experiments In an interesting paper on natural human dialogue in a problem solving situation I, it was noted on the basis of extensive experiments that \"people do not naturally speak in sentences\" and that in general great unruliness characterizes interactive communication, whether spoken or written. At first sight of the protocols, one tends to confirm the impression. But a closer look both at the same protocols and at the results of analysis cited, as well as some informal observation of other conversations, and the reflection that communication would hardly be achievable in such an absence of rules, led me to a hypothesis that there is considerable order in natural conversation. I designed experiments in the summer of 1975 and they were conducted in the fall with the assistance of students in a course in Soelolinguistics at Caltech. Additional experiments were conducted in 1977. These experiments are discussed in some detail since they provided guidelines for future research. They differ from the later experiments in the fact that subjects used as much time as was needed for the solution of the experiment, while in the later ones an arbitrary cut-off was imposed. The problem was that of locating the nearest doctor to a patient's address, given a map of Pasadena and a selected llst of doctors. Each experiment involved two subjects, one being given the map of Pasadena with the patient's address marked on it (3 different locations were used, but only one in a given experiment) and the other the list of doctors. In the face-to-face mode, the conversations were tape-recorded and transcribed. Sub-Jects were free to communicate by voice but were not allowed to look at each others\" materials. Typically, they were seated at the ends of a fairly large table with the tape-recorder between them, and the experimentor in the room. The experimentor provided the materials and instructions, and answered some initial questions only. In tile terminal-to-terminal mode~ the subjects were in separate rooms and the protocols were recorded and merged with a computer program. The subjects were free to communicate in ordinary English but had to observe some minimal typographical conventions (such as sending the message in by using two keys simultaneously). The role of the experimentor was the same, but divided between the subjects and occasionally offering assistance with computational requirements. The subjects were fully aware that they were conversing with a human counterpart (in this, these experiments differed from Bill Martin's. 2 For the purposes of this paper, the results of 12 face-to-face experiments and 7 termlnal-to-terminal are used. The problems of analysis were severe, but the results gratifying. As noted by other investigators, conversational English has a great deal of characteristics which call for an approach very different from the analysis of well formed single sentences. What is obvious is that there are many strings which are not sentences but \"incomplete\" or \"unfinished\" or ungrammatical in a variety of ways. But the difficulty of even deciding what a sentence is has also been noted (3): \"...the sentence is not, strictly speaking, a unit in oral discourse. One can see texts [n which long sequences of clauses linked by \"and then...\" occur. Are these separate sentences or one sentence?\" After considerable reflection and search for guidance from the literature, a rather conventional notion of sentence was used, with the requirement that it contain a NP and a gP and that it be within the confines of a single message (a message being the utterance(s) of one speaker). Semantic considerations (admittedly often inevitably intuitive) were used to determine single or multiple sentencehood. Coordinating conjunctions and sequences such as \"and then\", pauses or phatic units (these being defined as any strings keeping the channels of communication open) often signalled separate sentences. Words such as \"because\" or \"if\" tied strings into a single sentence. An additional semantic requirement (again admittedly vague) was that a sentence could stand alone as a unit and make sense. These criteria worked quite well as evidenced by the counts made by different scorers of the same protocols. An interesting category of sentences that emerged were the so-called transposed sentences, e.g., \"The two small streets there might be The setting in the 1979/80 experiments in the F-F and T-T modes was similar to that described in Section II, but with major differences in the overall design of the experiments. First, three modes of communication were used, the third being human-to-computer. The task was a real life task of loading cargo onto a ship, the data being from the real environment of loading U.S. Navy ships by a group located in San Diego, California. In the first two modes, one subject was provided with a list of cargo items to be loaded (along with their quantities) and a llst of decks, their sizes, and their primary uses. The other subject was given a list of the sizes of the cargo items. The subjects were instructed to obey space and other limitations (e.g., hatch size) and restrictions as to what cargo could be stowed on what decks. There was a time limit of one hour in both modes. The task of transcribing F-F recordings was very laborious due primarily to the specific Jargon and numerous abbreviations in the data. In the T-T mode, the protocols were obtained automatically. For the human-computer mode, the REL System was used. 4-6 This system, developed by our pro-Ject, provides the means for communicating with a large data base in a limited but useful style of natural English, described in detail in. 6 The response times to user queries are quite reasonably short so that natural interaction is possible. Requests which are not understood are diagnosed extremely quickly, thus encouraging the user to try alternate ways of phrasing. This technique was indeed employed frequently, as discussed in Section IV. It has always been the REL System's philosophy that naturalnesss of a language is obtained in two primary ways: task-specificity and flexibility for modifications. Taskspecifity can be achieved only by actual study of the users\" needs (and, obviously, by incorporating their data in the system). The capabilities of REL English have already been extended to make the language more natural for this specific task, notably by developing a prompting \"load sequence\" (and \"offload sequence\") in which the computer elicits the information from the user, and offers clarification if the prompt is not clear. This device was used extensively by the subjects, but its description is left out due to space limitations. The other major ingredient of naturalness is enabling the user to suit the language to the task by incorporating his specific knowledge and jargon. To do this, the user must be able to extend the language through definitions and make other modifications. This, also, was done by the subjects and is discussed in Section IV. The experimental setting was obviously very different. One subject at a time was assigned the task. No precise time limit was set, but most subjects were given two hour time slots, some of which was spent in in[tiallzing the computational session. The subject's session on the average lasted one and a half hours. The subjects were given a llst of the cargo items to be loaded and the number of each, as well as the primary uses of the decks. They were instructed that they should attend to fitting the cargo through hatch sizes and to keep track of space loaded. All the pertinent data about the cargo and ships was in the computer. The subjects were also given a short manual on the loading of ships, with examples of how to use the system and English, including arithmetic, definitions and load sequences. The experimenter helped the subject get started and assisted in case of computational problems in about half of the cases, others working alone. Although the subjects were instructed to read the manual before commencing experiments, the analysis of protocols showed that few had actually familiarized themselves with the system. 2. The Structure of Face-to-Face Dialogues Some working definitions need to be stated here. Messages and sentences were discussed in Section II. Fragments are all of the dialogue material that is not in sentences, and Phatics, which constitute a big subgroup of fragments, are all strings which serve a variety of functions which may all be characterized as keeping the channel of communication open (including expressions of emotions to the other subject and the computer). A page from a dialogue in Figure 1 illustrates some of the problems in analysis, and gives an idea of some of the categories of fragments, since it contains a rather large number of them. The categories are defined after the discussion of the page. 1 A There are like five categories right there. Ammunition, pyrotechnics, special weapons, vehicles and things on pallets. [ADD] 2 B Yes, let's run through this llst here. [P] 3 A Okay. [P] 4 B CHG demo. [TQ/TI] 5 A CHG. Okay, I have one CHG demo here on page 2. [E,P] 6 B And that page consists of? [C,TQ] 7 A It's a 32... [INT/TRUN] 8 B I, I Just want to, want to know ~at type. [FS] 9 A Oh, that's an ammunition. [P] i0 B It's an ammunition. [E] [i A Yeah. [P/TR] 12 B Uh hum, and some conwire? [P, C, TQ] 13 A Conwire, I also have. That's... That's a pallet. You want a subclasslfication, or is that good enough? [TRANS, FS] 14 B No, no, pallet's fine. [TR, TR] 15 A Okay. [P] [6 B A CTG. [TQ/TI] [rR] 29 A There's the WP, I'm sorry. It's in pyrotechnic also. [P]] 30 B Okay. [P] 31 A I can tell you what's in ammunition if that would help. We've got a CTG 106 APE. 32 B Okay. [P] 33 A CTG 105 HE. [TI] 34 B I or 2? [TQ] 35 A Both. Both I and 2. Then also in ammunition I have a CTG 40HE and a 60HE. [TR, ADD, C, TRANS] 36 B A 60HE. [E] 37 A Yeah. It seems to be a 60HE. [P] M(essage) I is S(entence), 7 words long. The rest is ADD(ed information). B's first mes~ sage contains a P(hatic) and S of 6. M3 is a P. M4 is either a T(erse) Q(uestion) or T(erse) l(nformatlon). Next we have an E(cho), followed by a P and a S of 9. M6 is C(onnector) and TQ. M7 is either INT(errupted) or TRUN(cated). M8 contains a F(alse) S(tart) and a S of 6. M9 is a P and an S of 3. MI0 is a S of 3, however on semantic grounds it could be considered an echo. The rule was adopted that a sentence echo was considered a sentence M27 is a P, a TQ, followed by a S of 9. Next a TR and a S of 5. It is problematic whether this should be a S. There are a number of possibilities. It could be P, could be ADD. Not many such decisions fortunately had to be made. The presence of the verb and the idiomatic character weighed toward sentencehood Ln this case. M29 is a ~ of 3, a P, a S of 4. M30 is P. M31 is a S of II, followed by a S of 6. The former is typical of complex sentences with strong semantic ties. Next M is P, next TI, next TQ, next TR, ADD, C and TRANS of 13. Next is E, and the last one a P followed by a S of 7. The working definitions for fragments and phatlcs are: TQ (Terse Questlon): An elliptical question usually containing no VP, hut often having a NP, e.g., \"Why?\", \"How about pyrotechnics?\" (\"How about NP?\" is quite common), \"~lich ones?\". Words such as \"Then\", \"And\", \"Because\" (at the beginning of a message or utterance). T (Tag questions): e.g., \"They're all under 60, aren't they?\" In the discussion above, the words \"speaker\" and \"utterance\" were used; but since most of these fragments are found also in the termlnal-to-termlnal mode and some also in the computatlonal mode, they apply also to typed interactions. 3. Statistical Analysis of the Three Modes The analysis beta Is based on the 1979/80 experiments only since they all involve the same shiploading task. The results were scored in each case by at least two persons, and the computational mode protocols by five. There are 8 face-to-face, 4 terminal-to-termlnal and 21 human-to-computer protocols, involving 44 sub-Jects. The time, was one hour each for the first two modes, and an average of one and one half hours for the third. Since there were twice as many F-F protocols as T-T and almost twice as many H-C as the first two combined, statistical totals are not very important. They are given here however to yield strength to the final processed comparisons. The analysis of computational protocols clearly necessitated some different methodologies, and some data is simply not comparable (e.g., load sequences, since they were absent in F-F and T-T). The category \"message\" was split into \"parsed message\" and \"parsed and nonparsed message,\" the first comprised of parsed inputs and the second of all inputs. The fragments also consisted of parsed ones: terse question, terse reply and definitions, and nonparsed ones: false starts and phatics. The terms \"message\" and \"fragment\" for the values in H-C refer to parsed messages and parsed fragments. Unless indicated otherwise, \"fragments\" in general do not include phatics, connectors and tags. Load sequences were completely left out of analysis, and obviously no computer answers were analyzed. The statistics show some expected marked differences as to the number of words, messages, sentences, fragments and phatics. The face-toface mode is not surprisingly much more verbose, and shows a much higher ratio of phatics. What is however far more interesting is that several statistics are close to each other: those for sentence length, message length, fragment length (excluding deflnitions in H-C, since they are absent in the other two), percentage o~ words in sentences, especially for F-F and T-T, percentage of words in fragments, again especially for F-F and T-T. The latter two are of interest since in the H-C mode the percentage of words in sentences is higher and in fragments is lower, even though the system allows use of fragments. As for sentence length, Chafe I0 cites the \"idea unit\" in spoken as having a mean length of ~out 6 words. These numbers bring to mind George Miller's 12 \"magical number 7\". Also noticeable is a striking closeness between average of messages in T-T and parsed and nonparsed inputs in H-C. The ratio of sentence/message are close for the 3 modes, and the ratios of fragment/message are close for F-F and T-T. Nor surprisingly, the ratio of phatic/message are different, being particularly low for H-C. Fragments are of particular interest and therefore are analysed in further detail. Fragments are considered separate from phatics. Nonparsed fragments in H-C are included in this analysis. TRUN and INT are collapsed into TRUN. As Table 4 shows TR is the predominant fragment in all three modes. (H-C mode characteristics are discussed in Section IV.) The next is ECHO for F-F, TI for T-T and TQ for H-C, and TQ is rather high in all three modes. These may seem to have little in common, but they are all typicaly NPs. The percentages for FS are close in all three modes, particularly so in F-F and H-C. The absence of some categories in some modes is equally interesting, even though totally understandable in some cases. The low presence of CORR in F-F and its absence in T-T is suprising, but may be partly due to some overlap of this category with FS. The absence of SELF and TAG in T-T and H-C is understandable, as is the absence of DEF(definltions) in F-F and T-T. It should be noted that in T-T the category did occur in a way. The subjects used a good deal of abbreviation in spelling (a common type of DEF is abbreviation) and also conventions, which every pair invented for end of message signal. ECHO and COMP in H-C would be rather silly -who would echo or complete the computec? But the absence of ADD, CORR, TI and CON is due to the restraints of the grammar. Their role and desirability in H-C is further discussed in Section V. The system performance was such that meaningful work could be accomplished by largely uninitiated subjects with a bare minimum of assistance. Response to inputs which were not understood was extremely fast, the incidence of bugs was low (out of 1615 messages, 12 hit bugs) and recovery from them was excellent. Response times were quite adequate, especially since many requests involved quite a bit of computation. The subjects never showed impatience or boredom, but apparently used the latency time (from input to response) to formulate the next request. The Influence of the Specific Task The special task at hand and the special character of a problem solving situation both have an influence on the performance of the sub-Jects. The \"prompt sequence\" for loading the ship provided in the language was used by all subjects even though they could have accomplished the same thing by natural dialogue (the magical number \"7\" shows up again here in the average of 7.6 loading sequences per protocol). The question (request) --response interchanges are dominant in all modes. Rather short sentences used are also attributable to this. Fragments are useful for increasing the flow of information. Phatics facilitate interaction. Syntax The types of sentences used is of particular interest here, so detailed analysis was made wit]] respect to sentence structure and type. The results are summarized in Table 6 . Sentences were also analysed as to their type, since it was noticed that a great number of them were of the W~l-type and contained be-verbs, e.g., \"What are ships?\". The results confirmed the observation: 75% were WH-type questions. Only I% were Yes-No type questions, e.g., \"Is Alamo a ship?\", \"Is there a deck whose primary use is ammunition and whose length is 396?\". Commands, most commonly starting wit}] \"List\", accounted for 19% of sentences, and a special category of statements, data addition, for the remaining 5%. These results are very interesting but I hesitate to effer an explanation. In the analysis of two F-F protocols consisting of 15500 words it was found that a be-verb occurred once every two sentences. Since be-verbs are so common also in F-F, this may either be a general feature of English or oF. the type of conversations in such problem solving tasks. Possessives and sentences with \"there\" were observed, but surprisingly few in view of the availability of these structures in the grammar. The use of the article \"the\" was erratic. The investigation of the F-F sample also showed few relative pronouns; \"that\" was the most common -one in every 19 sentences. Conjunctions were fairly freqnent --one in every 8 sentences, \"and\" being the dominant one; likewise quantiflets --one in every 10 sentences. This coincides well with the sentence analysis for H-C where sentences with conjunctions or quantifiers are the highest in percentage among the complex ones. On the whole, one is forced to conclude that monotony of structure is the rule rather than the exception in H-C. Definitions~ Fragments and Phatics The REL System allows the user to avail himself of a great variety of definitions 6 which, however, is not too well reflected in the protocols, due to the subjects\" lack of familiarity with the system. One subject whom I observed as ]laving familiarized himself with the system made extensive use of definitions. It should be added that, beyond those which were actually used, 30 more definitions were attempted but contained errors. Some definitions had been built in by the language designer, notably \"remaining area\" and \"adjusted remaining area.\" These were frequently employed. I have made a rough categorization of the definitions according to their complexity. Abbreviations are the simplest, e.g., \"def:DKS:decks of the USS Alamo\". But even abbreviations can be sophisticated and therefore more useful like the following one with a quantifier: \"def:ED:each deck of the Alamo.\" Abbreviations accounted for 34% of the total of 53 definitions. Synonyms were more complex: \"def:INFl:aft width and forward width and minimum clearance,\" \"def : INF2: INF 1 and square foot capacity,\" \"def:\"well deck\" info:INF2 of the \"well deck\" of the Alamo.\" Synonyms accounted for half (51%) of the definitions. Of the remainder, 9% involved arithmet teal operations, e.g., \"def :size: (length*width)/144\", \"def:g(\"8\",\"9\"):\"8\"*\"8\"+\"9\"*\"9\". A few definllions had to do with adding new data. Other than definitions, fragments were of two types: parsed, which were Terse Question and Terse Reply, and nonparsed, which were False Starts and Phatics. TQs were noun phrases which are parsed into sentences if followed by a question mark, e.g., \"Class of culvert?\", \"i2*(SQ of MEZ)/(450/12)?\" There are 67 of those. TRs were single words or numbers arrising from the partlcular feature provided by the system to deal with long answers. It reads, e.g., \"There are 203 lines in this answer. How many do you want? Respond with \"all', \"none\" or a number.\" It was considered important to include them, since failure to respond resulted in an error message, and also to see to what extent that feature is useful; it is, since there were 91 TRs. No distinction was made between False Start and Truncated; in all cases, these 30 oceurences were messages abandoned by the subject for reasons that are seldom identifiable. A typing error may have been noticed or a thought changed, e.g., H: \"What are the decks and primary uss\" C: \"Input Error\" H: \"what are the primary uses of each deck of the Alamo?\" What is surprising about fragments is the paucity of TQs. They are handled by the system very well and are certainly shorter to type. ! think that the reasons again are lack o~ familiarity with the system and more formal style on the part of the subject. But it is also possible that such elliptical structures are somehow more difficult to use, which would confirm transformational theory, but poses an uncomfortable question as to the desirability (widely assumed) of ellipsis In computatlonal interaction. Phatlcs are very peculiar in these H-C protocols. What ts striking is the anthropomorphisation of the computer. This may be due to the background of the subjects, Caltech. They clearly also serve the function of venting one's emotions, and that may be useful. They are illustrated in Section III and number 46. Special Strate~ies~ Learning, Persistence of Errors A number of interesting strategies with respect to the use of language were observed. The discussion here is Just lllnstcative, but the annotation off the protocols shows that they were quite frequently employed. Analysls of Errors Errors are all of those inputs that are not parsed, resulting in error messages. Not included in this analysis however are phatics and false starts, already covered. The message: \"Input error, please re-enter request\" is issued in all cases except when the system requests a response and the user fails to give one that can be ~inderstood, in which case the message is: \"Your response is not understandable. Try again.\", and in the case of bugs, where it reads: \"Your request could not be completed as entered. Please rephrase and try again.\" The total of 446 errors were classified into eight categories: (a) Vocabulary ' Errors: arising from the lack of a word in the language, e.g., \"big\" in \"Is the Mobile a big ship?\", \"feet\" in \"List the decks of each shlp with square feet capacity less than 70.\". This being by fat the largest category, the importance of the semantic facto~ ls clear. (b) Punctuation: involves sentence final marks, commas and spaces; they are well illustrated in Figure 2 . (c) Synta___x: the low incidence of these errors is surprising; formal style, repetitiousness of structure, expediency in problem solving may al[ be factors. Errors involving conjunctions or preposistlons are typical. Some difficult to categorize, nonparsed inputs were also included here, such as: \"What is known?\". In some cases, there ave vocabulary errors but the syntax could not have been handled either, typically: \"On what decks of the Alamo may cargo be stowed?\", \"stow\" and \"may\" being not known. This input was immediately paraphrased as \"What is the primary use of each deck of the Alamo?\" and handled correctly; so one may wonder what ts [nvolved in cases which could not be reasonably expected to be handled. (d) Spelling: the only interesting observation is that some subjects noticed these errors immediately, others not for a while. (e) Transmission: terminal and phone line errors. (f) Definition Format: all errors in framing definitions are included here, whether vocabulary, punctuation or format. (g) Lack of Response: to \"There are xx lines in this answer. How many do you want?\" One subject tried 6 careful requests before catching on. (h) BuR: the actual number of bugs encountered was very low. In a very few cases they resulted in termination of the session. The Job of improving it is open-ended; English for the computer will never be all of English, since English is in reality not one language, but a variety of languages, among some of which all speakers choose freely, and many belong to specialists. Our task is to build as good a system as our understanding permits, observe the results of its use in actual tasks, and then with increased understanding continue to Improve. The REI. System served well in the experiments; its rapid response time was well worth achieving",
    "abstract": "Interaction with computers in natural language requires a language that is flexible and suited to the task. This study of natural dialogue ~as undertaken to reveal those characteristics which can make computer English more natural. Experiments were made in three modes of communication: face-to-face, terminal-toterminal and human-to-computer, involving over 80 subjects, over 80,000 words and over 50 hours. They showed some striking similarities, especially in sentence length and proportion of words in sentences. The three modes also share the use of fragments, typical of dialogue. Detailed statistical analysis and comparisons are given. The nature and relative frequency of fragments, which ]lave been classified into twelve categories, is shown in all modes. Special characteristics of the face-to-face mode are due largely to these fragments (which include phatlcs employed to keep the channel of communication open). Special characteristics of the computational mode include other fragments, namely definitions, which are absent from other modes. Inclusion of fragments in computational grammar is considered a major factor in improving computer naturalness.",
    "countries": [
        "United States"
    ],
    "languages": [
        "English"
    ],
    "numcitedby": "58",
    "year": "1980",
    "month": "",
    "title": "Linguistic Analysis of Natural Language Communication With Computers"
}