{
    "article": "Surprising as it may be, one of the biggest markets for products of computional linguistics (CL) has been largely overlooked: the classroom. While machine translation has attracted a considerable amount of research, hence resources, CALL, ~ a domain with a comparable potential, has hardly ever received the attention it deserves. Actually there seems to be a communication problem and a mutual lack of interest concerning the work done in the neighbouring disciplines. issues such as learning theory (12), language learning (5, 6, 11, 14, 20) , language teaching (6, 16, 19, 27) , educational technology, i.e. programmed instruction (9, 12, 31) , theory of writing (3), algorithmization of the learning process (17), learning strategies, i.e. learning how to learn (23), etc. It is also worth mentionning that no cross fertilization has taken place between the CALL community and people working in the Machine Learning paradigm (7, 21) . 2 While there are fundamental differences in terms of goals and methods, there are also some important overlaps. Books on more sophisticated CALL systems are still scarce (13, 32), so is the work that shows how current NLP technology could be used in the classroom (1, 22, 34) Yet CALL is a field with considerable potential. It is both a challenge and a chance to bring NLP ' Unlike 17S (Intelligent Teaching Systems), CAI (Computer Assisted Instruction), CBI (Computer Based Instruction) and ICAI (Intelligent Computer Aided Instruction), which use language ['or communicating domain specific knowledge, CALL has langage learning as its primary goal. Obviously, NLP-technology may be relevant for all these systems, but in different ways. For a slightly outdated bibliography on CALL, see (2). technology from the research laboratories to the real world. While computational linguists will certainly have to play an important role in providing linguistic resources (grammars, lexicon) and processing tools, it is not clear yet how to decide on the adequacy of the tools (browser, editors). Also, there are good chances that within this context new problems arise, while old solution turn out not to be good at all, in which case the following two • what lessons have been, or can be learned by looking at the available CALL systems? In order to get a clearer picture of these problems, and in order to draw the community's attention to the fact that there is a REAL need and potential for integrating NLP technologies in CALL systems, we propose a panel discussion between specialists in the concerned disciplines (linguistics, artificial intelligence, psychology, language teaching). The expected results of such a discussion are not only an increase of resources (manpower) in the CALL domain, but also an increase of awareness, that is, a sharpening of the researchers' understanding of what the problems are that people encounter when processing language. All too often we look at language only from the point of view of the machine, i.e. how can languages be processed by computers. In doing so we tend to forget the obvious : natural languages are used by people. In building CALl, systems we will realize that there are ninny problems in the area of natural language processing that have been either overlooked, or been posed in inadequate terms. Yet, if we really want to get a real tmderstanding of the fimctioning of natural languages, --how they are used, how they are learned?--we have to look at the constraints of the system for which they have been designed: man. This is the price we have to pay if we want to produce programs that are of interest not only in the research labs but also into the arena of real world. Strangely enough, in the past we had neither the right tools, nor a decent theory (see 8, 27, 31 ), yet people were optimistic and went ahead. Today we are much better off. We do have very powerfid tools (fast computers with well designed graphical interfaces, browsers, CD-Roms, authoring languages), and a whole set of quite promising theories, yet we hesitate. But, what are we waiting lot'?",
    "abstract": "Surprising as it may be, one of the biggest markets for products of computional linguistics (CL) has been largely overlooked: the classroom. While machine translation has attracted a considerable amount of research, hence resources, CALL, ~ a domain with a comparable potential, has hardly ever received the attention it deserves. Actually there seems to be a communication problem and a mutual lack of interest concerning the work done in the neighbouring disciplines.",
    "countries": [
        "France"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "19",
    "year": "1996",
    "month": "",
    "title": "Computational Linguistics and its Use in Real World: the Case of Computer Assisted-Language Learning"
}