{
    "article": "The centering frmnework explains local coherence by relating local focus mid the lbrm of referring expressions. It has proven useful in monolog, but its utility lot multiparty discourse has not been shown, and a variety of issues must be tackled to adapt the model lot dialog. This paper reports our application of three naive models of centering theory lot dialog. These results will be used as baselines lot evaluating future models. 1 * The authors would like to thank James Allen, Marilyn Walker, and the anonymous reviewers for many helpful comments on a preliminary draft of the paper. Introduction The centering framework (Grosz et al., 1995) is one of the most influential computational linguistics theories relating local locus to the form chosen lot reletting expressions. A number of studies have developed refinements and extensions of the theory (eg. Brennan et at., 1987; Kameyama, 1986; Strube and Hahn, 1996; Walker et al., 1998) , but few have attempted to extend the model to mul•party discourse (cf. Brennan, 1998; Walker, 1998) . For dialog systems, the benefits of using centering theory include improved reference resolution and generation of more coherent referring expressions. However, it is not at all clear how to adapt the theory lot multi-party discourse, ql~is paper examines some of the issues involved in adapting the theory, then describes the results of applying three alternative models to a corpus of 2-person dialogs. We chose very naive approximations to the original theory as a starting point. These results will be a baseline for evaluating more sophisticated models in the luture. The Centering model The centering framework (Grosz et at., 1995) makes three main claims: 1) given an utterance Uu, the model predicts which discourse entity will be tile locus of U,~+I; 2) when local locus is maintained between utterances, the model predicts that it will be expressed with a pronoun; and 3) when a pronoun is encountered, tile model provides a preference ordering on possible antecedents from the prior utterance. These data structures are created for each UT,: 2 1. A partially-ordered list of lorward-looking centers Cfn that includes all discourse entities in utterance n. Its first element is the 'preferred center', Cpn. 2. A backward-looking center Cbn, the highest ranked element of Cf~-i that is in Cfu. The Iramework delines a preference ordering on techniques for effecting a topic change, ranked according to the inference load each places on tile addressee. The transitions are called 'shift', 'retain' and 'continue' and differ based on whether Cb,, = C'bn+l and whether Cb,~ = Cpn. At the heart of the theory are two centering rules: Rule l: If any member of Cfu is realized by a pronoun in Cf,,+l, Cb,,+l must be a pronoun. Rule 2: Sequences of continues are preferred over sequences of retains, and sequences of retains are preferred over sequences of shifts. Centering and multi-party discourse A w~riety of issues must be addressed to adapt centering to two-party dialog. They include: 1. Utterance boundaries are difficult to pin down in spoken dialog, and their determination affects the Cf lists. Just how the speaker turns are broken into utterances has a huge impact on the success of the model (Brennan, 1998) . 2. Should the dialog participants, referred to via first-and second-person pronouns (I/2PPs), be considered 'discourse entities' and included in C'f? aWe provide oidy the briefest sketch of the centering framework. Readers unfamiliar with the model are referred to (Grosz et al., 1995) for more details. 3. Which utterance should be considered 'previous' for locating Cfn-l: the same speaker's previous utterance or the immediately preceding utterance, regardless of its speaker? 4. What should be done with abandoned or partial utterances and those with no discourse entities. Experimental method Our data is from four randomly chosen dialogs in the CALLHOME-English corpus 3 (LDC, 1997) . Table 1 describes the three models we created to address the issues described in Section 3. Cf elements Use both speakeI:S' from 1/2PPs previous utt to find. A It does make a difference / like I always thought formula smells kind of disgusting. Issue 2: Selection of items for Cf Two crucial factors in the original model are left to the algorithm implementer: the selection of items lot Cf and their rank order. Both are active areas of research. In our models, all elements of Cf are created from nouns in the utterance. We do not include entities referred to by complex nominal constituents such as infinitives. Associations (eg. part/subpart) and ellipsed items are not 'allowed in determining elements of Cf. We adopted a commonly used Cf ordering: Subj > DO > IO > Other. Linear sentence position is used to order multiple 'other' constituents. Whether discourse participants should be considered discourse entities is very perplexing 3The dialog transcripts consisted of 614 utterances, 30 minutes of speech. After annotation (see issue 1 hi section 4), there were 664 non-empty utterances. 4CALLHOME transcribers separated utterances at a sit l~eeaker change or a long pause, or if the semantics or syntax of language indicated the end of an utterance. from a centering viewpoint (Byron and Stent, 1998) . One of our models includes entities referred to by 1/2PPs in Cf and two do not. Issues 3/4: Previous utterance Empty utterances (containing no discourse entities) are skipped in determining Cfn-1. Empty utterances include acknowledgements and utterances like \"hard to leave behind\" with no explicitly mentioned objects. The dialogs were annotated for discourse structure, so Un-1 is the previous utterance in the discourse segment, not necessarily linear order. 5 In model2, the highest ranked element of Cf from either the current speaker's prior utterance or the other speaker's previous utterance is Cb6; models l&3 consider only the immediately preceding utterance. We also annotated the 'real' topic of each utterance, selected according to the annotator's intuition of what the utterance is 'about'. It must be explicitly referred to in the utterance and can be an entity referred to using a 1/2PE After the three models were delined, one dialog was used to train the annotators (the authors) 7 , then the other three were independently annotated according to the rules outlined above. The annotators compared their results and agreed upon a reconciled version of the data, which was used to produce the results reported in Section 5. Annotator accuracy as measured against the reconciled data over 'all categories ranged from 80% to 89%. Accuracy was calculated by counting the number of utterances that differed Ii-om the reconciled data (including dillerent ordering of C f), divided by total utterances. 8 Results and analysis Table 2 summarizes our findings. Only 10 of 664 utterances violate Centering Rule 1, so centering theory's assumptions linking locai Ibcus to pronouns appear to hold in dialog. It is interesting to note that Model 1, which includes dialog participants as dis° course entities, consistently performed best in the categories used for this evaluation. 9 5The authors performed segmentation together; the purpose of this study is to examine extensions of centering tlieory, not discourse segmentation. 6In case of conflict, recency takes precedence. 7Annotators must not confer during annotation, so a training dialog is used to clarify unclear annotation instructions. In this case, tile annotators examined it to agree on which syntactic constituents would contribute Cf elements and the criteria for breakhlg turns into utterances. SMore standard reliability measures could not be used since there are no \"tags\" in this annotation schelne, and within some categories there may be an ordered list of items. 9But see (Byron and Stent, 1998) . - For utterances where a Cb can be selected, it nmtches the 'real' topic only 21% to 35% of the time. By this measure, our models are poor predictors of local locus. For instance, in Example 5, the 'real' topic of the first utterance is Jackson, but according to Model 1 the set of entities referred tt 2 by \"we\" is the Cb of both utterances. Example 5 [dialog 42481 A And like we went into Jackson, the town and / we were like -AAAHHH! let me out of here The annotators' intuitions regarding the 'real' topic often conflicted. It would be interesting to annotate actor and discourse locus separately, then see which one the Cb most closely matches. Strube and Hahn (1996) propose a iuethod of evaluating a model against centering rule 2, measuring the 'cost' of the listener's inference load. A cheap transition has Cbn = Up,-1, otherwise it is expensive. Models with a large percent of cheap transi-m57% of Cb's in Modell are entities referred to via 1/2PPs. tions better reflect human notions of coherence. All three of our models produced a very low percent of cheap transitions in this experiment, especially when compared to Strube and Hahn's result of 80%. Cheap versus expensive transitions 6 Conclusions and Future work We conclude that centering behavior in dialog is consistent with that found in monolog. However, the utility of our preliminary models is questionable. By revising our Model 1, we believe a useful model of centering in dialog can be built. This study indicates many promising directions for future research. Some we intend to pursue are: • Evaluate tile models using other criteria, e.g. improved pronoun resolution. •Expcriment with alternate Cf orderings and improve the semantic theory to include entities referred to by personal pronouns, associations and ellipsed entities in Cf. • Modify utterance boundaries to re-attach interrupted utterances or use Kameyama's proposal for 'center update units' (1998).",
    "abstract": "The centering frmnework explains local coherence by relating local focus mid the lbrm of referring expressions. It has proven useful in monolog, but its utility lot multiparty discourse has not been shown, and a variety of issues must be tackled to adapt the model lot dialog. This paper reports our application of three naive models of centering theory lot dialog. These results will be used as baselines lot evaluating future models. 1 * The authors would like to thank James Allen, Marilyn Walker, and the anonymous reviewers for many helpful comments on a preliminary draft of the paper.",
    "countries": [
        "United States"
    ],
    "languages": [
        "English"
    ],
    "numcitedby": "2",
    "year": "1998",
    "month": "",
    "title": "A Preliminary Model of Centering in Dialog"
}