{
    "article": "We present several unsupervised statistical models for the prepositional phrase attachment task that approach the accuracy of the best supervised methods for this task. Our unsupervised approach uses a heuristic based on attachment proximity and trains h'om raw text that is annotated with only part-oi;speech tags and morphologicM base forms, as opposed to attachment information. It is therefore less resource-intensive and more portable than previous corpus-based algorithm proposed for this task. We present results for prepositional phrase attachment in both English and Spanish. Introduction Prepositional phrase attachment is the task of deciding, for a given preposition in a sentence, the attachment site that corresponds to the interpretation of the sentence. For example, the task in the following examples is to decide whether the preposition with modifies the preceding noun phrase (with head word shirt) or the preceding verb phrase (with head word bought or washed). 1. I bought the shirt with pockets. I washed the shirt with soap. In sentence 1, with modifies the noun shirt, since with pockets describes the shirt. However in sentence 2, with modifies the verb washed since with soap describes how the shirt is washed. While this form of attachment ambiguity is usually easy for people to resolve, a computer requires detailed knowledge about words (e.g., washed vs. bought) in order to successflflly resolw. ~ such ambiguities and predict the correct interpretation. Previous Work Most of the previous successful approaches to this problem have been statistical or corpusbased, and they consider only prepositions whose attachment is ambiguous between a preceding noun phrase and verb phrase. Previous work has h'amed the problem as a classification task, in which tile goal is to predict N or V, corresponding to noun or verb attachment, given the head verb v, the head noun n, the preposition p, and optionally, the object of the preposition n2. For example., the (v, n,p, n2) tuples corresponding to the example sentences are 1. l)ought shirt with pockets washed shirt with soap The correct classifications of tuples 1 and 2 are N and V, respectively. (Iiindle mM Rooth, 1993) describes a partially supervised approach in which the FID-DITCH partial parser was used to extract (v,n,p) tuples from raw text, where p is a preposition whose attachment is ambiguous between the head verb v and the head noun n. The extracted tut)les are then used to construct a classifier, which resolves unseen ambiguities at around 80% accuracy. Later work, such as (Ratnaparkhi et al., 1994; Brill and Resnik, 1994; Collins and Brooks, 1995; Merlo et al., 1997; Zavrel and Daelemans, 1997; Ih'anz, 1997) , trains and tests on quintuples of the form (v, rl.,p, n2, a) extracted from the Penn treebank (Marcus et al., 1994) , and has gradually imtu'ow~d on this accuracy with other kinds of statistical learning methods, yielding up to 84.5% accuracy (Collins and Brooks, 1995) . Recently, (Stetina and Nagao, 1997) have reported 88% accuracy by using a corpus-based model in conjunction with a semantic dictionary. While previous corpus-based methods are highly accurate for this task, they are difficult to port to other languages because they require resources that are expensive to construct or simply nonexistent in other languages. We present an unsupervised algorithm for prepositional phrase attachment in English that requires only an part-of-speech tagger and a morphology database, and is therefore less resourceintensive and more portable than previous approaches, which have all required either treebanks or partial parsers. 3 Unsupervised Prepositional Phrase Attachment The exact task of our algorithm will be to construct a classifier cl which maps an instance of an ambiguous prepositional phrase (v, n,p, n2) to either N or V, corresponding to noun attachment or verb attachment, respectively. In the full natural language parsing task, there are more than just two potential attachment sites, but we limit our task to choosing between a verb v and a noun n so that we may compare with previous supervised attempts on this problem. While we will be given the candidate attachment sites during testing, the training procedure assumes no a priori information about potential attachment sites. Generating Training Data From Raw Text We generate training data from raw text by using a part-of-speech tagger, a simple chunker, an extraction heuristic, and a morphology database. The order in which these tools are applied to raw text is shown in Table 1 . The tagger from (Ratnaparkhi, 1996) first annotates sentences of raw text with a sequence of partof-speech tags. The chunker, implemented with two small regular expressions, then replaces simple noun phrases and quantifier phrases with their head words. The extraction heuristic then finds head word tuples and their likely attachments from the tagged and chunked text. The heuristic relies on the observed fact that in English and in languages with similar word order, the attachment site of a preposition is usually located only a few words to the left of the preposition. Finally, numbers are replaced by a single token, the text is converted to lower case, and the morphology database is used to find the base forms of the verbs and nouns. The extracted head word tuples differ from the training data used in previous supervised attempts in an important way. In the supervised case, both of the potential sites, namely the verb v and the noun n are known before the attachment is resolved, in the unsupervised case discussed here, the extraction heuristic only finds what it thinks are unambiguous cases of prepositional phrase attachment. Therefore, there is only one possible attachment site for the preposition, and either the verb v or the noun n does not exist, in the case of noun-attached preposition or a verb-attached preposition, respectively. This extraction heuristic loosely resembles a step in the bootstrapping procedure used to get training data for the classifier of (Hindle and Rooth, 1993) . In that step, unambiguous attachments from the FIDDITCH parser's output are initially used to resolve some of the ambiguous attachments, and the resolved cases are iteratively used to disambiguate the remaining unresolved cases. Our procedure differs critically from (Hindle and Rooth, 1993 ) in that we do not iterate, we extract unambiguous attachments from unparsed input sentences, and we totally ignore the ambiguous cases. It is the hypothesis of this approach that the information in just the unambiguous attachment events can resolve the ambiguous attachment events of the test data. Heuristic Extraction of Unambiguous Cases Given a tagged and chunked sentence, the extraction heuristic returns head word tuples of the form (v,p, n~,) or (n,p, n2), where v is the verb, n is the noun, p is the preposition, n2 is the object of the preposition. The main idea of the extraction heuristic is that an attachment site of a preposition is usually within a few words to the left of the preposition. We extract : (v,p, n2) if • p is a preposition (p ~ of) • v is the first verb that occurs within K words to the left of p • v is not a form of the verb to be The heuristic ignores cases where p = of, since such cases are rarely ambiguous, and we opt to model them deterministically as noun attachments. We will report accuracies (in Section 5) on both cases where p = of and where p ~ of. Also, the heuristic excludes examples with the verb to be from the training set (but not the test set) since we found them to be unreliable sources of evidence. Accuracy of Extraction Heuristic Applying the extraction heuristic to 970K unannotated sentences ti'om the 1988 Wall St. Journap data yields approximately 910K unique head word tuples of the form (v,p, n2) or (n,p, n2) . The extraction heuristic is far from perfect; when applied to and compared with the annotated Wall St. Journal data of tile Penn treebank, only 69% of the extracted head word tuples represent correct attachments. 2 The exo tracted tuples are meant to be a noisy but abundant substitute for the information that one might get fronl a treebank. Tables 2 and 3 list; the most fi'equent extracted head word tuples for unambiguous verb and noun attachments, respectively. Many of the frequent nounattached (n,fl, n2) tuples, such as hum to num, a are incorrect. The prepositional phrase to num is usually attached to a verb such as rise or fail in the Wall St. Journal domain, e.g., Profits rose ~6 ~ to 52 million. 1This data is available fi-om the Linguistic Data Consortium, http ://www. Idc. upenn, edu 2This accuracy also excludes cases where p = of. 3Recall t, he num is the token for quantifier phra:ses identified by the chunker, like 5 million, or 6 %. cl(v, n, p, n2) = N ifp = of arg maXaE{g,v } Pr(v, n,p, a) otherwise (1) We do not currently use n2 in the probability model, and we omit it from further discussion. We can factor Pr(v,n,p, a) as follows: Pr(v,n,p,a) = Pr(v)Pr(n) Pr(alv, n) Pr(p]a, v, n) The terms Pr(n) and Pr(v) are independent of the attachment a and need not be computed in el (1), but the estimation of Pr(alv ,n) and Pr(pla, v,n ) is problematic since our training data, i.e., the head words extracted from raw text, occur with either n or v, but never both n, v. This leads to make some heuristically motivated approximations. Let the random variable ¢ range over (true, false}, and let it denote tile presence or absence of any preposition that is unambiguously attached to the noun or verb in question. Then p(¢ = trueln ) is the conditional probability that a particular noun n in free text has an unambiguous prepositional phrase attachment. (¢ = true will be written simply as true.) We approximate Pr(alv , n) as follows: Pr(truern) Pr(a = N]v, n) Pr(t lv) Pr(a = VIv, n) .~ Z(v, n) Z(v,n) = Pr(trueln) + Pr(truelv) The rationale behind this approximation is that the tendency of a v,n pair towards a noun (verb) attachment is related to the tendency of the noun (verb) alone to occur with an unambiguous prepositional phrase. The Z(v, n) term exists only to make the approximation a well formed probability over a E {N, V}. We approximate Pr(pla , v, n) as follows: Pr(pla = N,v,n) ~ Pr(pltrue, n) Pr(plo, = l:,v,n) ~ Pr(pltrue, v) The rationale behind these approximations is that when generating p given a noun (verb) attachment, only the counts involving the noun (verb) are relevant, assuming also that the noun (verb) has an attached prepositional phrase, i.e., ¢ = true. We use word statistics from both the tagged corpus and the set of extracted head word tuples to estimate the probability of generating ¢ = true, p, and n2. Counts from the extracted set of tuples assume that ¢ = true, while counts from the corpus itself may correspond to either ¢ = true or ¢ = false, depending on if the noun or verb in question is, or is not, respectively, unambiguously attached to a preposition. Generate ~b The quantities Pr(trueln ) and Pr(truelv ) denote the conditional probability that n or ~ will occur with some unambiguously attached preposition, and are estimated as follows: Generate p The terms Pr(pln, true) and Pr(plv, tr~,e) denote the conditional probability that a particular preposition p will occur as an unambiguous attachment to rz or v. We present two techniques to estimate this probability, one based on bigram counts and another based on an interpolation method. Bigram Counts This technique uses the bigram counts of the extracted head word tuples, and backs off to the unitbrm distribution when the denominator is zero. Pr(pltrt~e'n) = { ~: otherwiseC(r~' tr' ~z~; >0 { <. (,,,v,tr~) c(v, true)> 0 Pr(p[true,'v) = ~ V,t~u~) 1( otherwise NI where 7 ) is the set of possible prepositions , where all the counts c(...) are from the extracted head word tuples. Interpolation This technique is similar to the one in (Hindle and Rooth, 1993) , and interpolates between the tendencies of the (v,p) and (Tt, p) bigrams and the tendency of the type of attachment (e.g., N or V) towards a particular preposition p. Journal were processed in a manner identical to the example sentence in Table 1 . The result was approximately 910,000 head word tuples of the form (v,p, n2) or (~t,p, n2) . Note that while the head word tuples ret)resent correct attachments only 69% of the time., their quantity is about 45 times greater than the quantity of data used in previous supervised approaches. The extracted data was used as training material ii)r the three classifiers Clbasc., Clinterp, and clbig,.am. Each classifier is constructed as fi)llows: Clbase This is the \"baseline\" classifier that predicts N of p = of, and V otherwise. clinterp: This classifier has the form of equation (1), uses the method in section 4.1 to generate ¢, and tile method in section 4.2.2 to generate p. clbiqram: This classifier has tile form of equation (1), uses the method in section 4.1 to generate ¢, and the method in section 4.2.1 to generate p. Table 4 shows accuracies of the classifiers oll the test set of (Ratnaparkhi et al., 1994) Pr(pla, v,n) , using the same approximations as clbigram, for the ambiguous example rise num to num. (Recall that Pr(v) and Pr(n) are not needed.) While the tuple (num, to, num) is more frequent than (rise, to, num), the conditional probabilities prefer a = V, which is the choice that maximizes Pr(v, n,p, a) . Both classifiers Clinterp and Clbigrarn clearly outperform the baseline, but the classifier clinterp does not outperform Clbigra m, even though it interpolates between the less specific evidence (the preposition counts) and more specific evidence (the bigram counts). This may be due to the errors in our extracted training data; supervised classifiers that train from clean data typically benefit greatly by combining less specific evidence with more specific evidence. Despite the errors in the training data, the performance of the unsupervised classifiers (81.9%) begins to approach the best performance of the comparable supervised classifiers (84.5%). (Our goal is to replicate the supervision of a treebank, but not a semantic dictionary, so we do not compare against (Stetina and Nagao, 1997) .) Furthermore, we do not use the second noun n2, whereas the best supervised methods use this information. Our result shows that the information in imperfect but abundant data from unambiguous attachments, as shown in Tables 2 and 3 , is sufficient to resolve ambiguous prepositional phrase attachments at accuracies just under the supervised state-of-the-art accuracy. Evaluation in Spanish We claim that our approach is portable to languages with similar word order, and we support this claim by demonstrating our approach on the Spanish language. We used the Spanish tagger and morphological analyzer developed at the Xerox Research Centre Europe 4 and we modified the extraction heuristic to account for the new tagset, and to account for the Spanish equivalents of tile words of (i.e., de or del) and to be (i.e., set). Chunking was not performed on the Spanish data. We used 450k sentences of raw text from the Linguistic Data Consortium's Spanish News Text Collection to extract a training set, and we used a non-overlapping set of 50k sentences fl'om the collection to create test sets. Three native Spanish speakers were asked to extract and annotate ambiguous instances of Spanish prepositional phrase attachments. They annotated two sets (using the full sentence context); one set consisted of all ambiguous prepositional phrase attachments of the form (v, n,p, n2), and the other set consisted of cases where p = con. For testing our classifier, we used only those judgments on which all three annotators agreed. Performance The performance of the classifiers clbigram, Clinterp, and Clbase, when trained and tested on Spanish language data, are shown in Table 6. The Spanish test set has fewer ambiguous prepositions than the English test set, as shown by the accuracy of Clbase. However, the accuracy improvements of clbigra m over Clbase are statistically significant for both test sets. 5 4These were supplied by Dr. Lauri Kartunnen during his visit to Penn. 5Using proportions of changed cases, P = 0.0258 for the first set, and P --0.0108 for the set where p = con The unsupervised algorithm for prepositional phrase attachment presented here is the only algorithm in the published literature that can significantly outperform the baseline without using data derived from a treebank or parser. The accuracy of our technique approaches the accuracy of the best supervised methods, and does so with only a tiny fraction of the supervision. Since only a small part of the extraction heuristic is specific to English, and since partof-speech taggers and morphology databases are widely available in other languages, our approach is far more portable than previous approaches for this problem. We successflflly demonstrated the portability of our approach by applying it to the prepositional phrase attachment task in the Spanish language. Acknowledgments We thank Dr. Lauri Kartunnen tbr lending us the Spanish natural language tools, and Mike Collins for helpful discussions on this work.",
    "abstract": "We present several unsupervised statistical models for the prepositional phrase attachment task that approach the accuracy of the best supervised methods for this task. Our unsupervised approach uses a heuristic based on attachment proximity and trains h'om raw text that is annotated with only part-oi;speech tags and morphologicM base forms, as opposed to attachment information. It is therefore less resource-intensive and more portable than previous corpus-based algorithm proposed for this task. We present results for prepositional phrase attachment in both English and Spanish.",
    "countries": [
        "United States"
    ],
    "languages": [
        "English",
        "Spanish"
    ],
    "numcitedby": "61",
    "year": "1998",
    "month": "",
    "title": "Statistical Models for Unsupervised Prepositional Phrase Attachment"
}