{
    "article": "This paper studies and evaluates disambiguation strategies for the translation of tense between German and English, using a bilingual cortms of al)pointment scheduling dialogues. It describes a scheme to detect complex verb predicates based on verb form subcatcgorization and grammatical knowledge. The extracted verb and tense infbrmation is presented and the role of different context factors is discussed. Introduction A problem for translation is its context dependeuce. For every ambiguous word, the part of the context relevant for disambiguation must be identified (disambiguation strategy), and every word potentially occurring in this context nmst be assigned a bias for the translation decision (disambiguation ildorination). Manual construction of disambiguation components is quite a chore. Fortunately, the task can be (partly) automated if the tables associating words with biases are learned from a corpus. Statistical approaches also support empirical evaluation of different disalnbiguation strategies. The paper studies disambiguation strategies for tense translation between German and English. The experiments are based on a corpus of appointment scheduling dialogues counting 150,281 German and 154,773 English word tokens aligned in 16,857 turns. The dialogues were recorded, transcribed and translated in the German national Verbmobil project that aims to develop a tri-lingual spoken language translation system. Tense is interesting, since it occurs in nearly every sentence. Tense can be ex-pressed on the surface lexically as well as morphosyntactically (analytic tenses). 2 Words Are Not Enough Often, sentence meaning is not compositional but arises fl'om combinations of words (1). (1) a. h:h habe ihn gestern gesehen. I have him yesterday seen I saw him yesterday. For translation, the discontinuous words must be amalgamated into single semantic items. Single words or pairs of lemma and part of speech tag (L-POS pairs) are not appropriate. To verify this claim, we aligned the L-POS pairs of the Vel'lmmbil corpus using the comph;tely language-independent method of Dagan et al. (1993) . Below find the results tbr sehen 1 (see) in order of frequency and some frequent alignments for reflexive pronouns. Partial Parsing A full syntactic analysis of the sort of unrestricted spoken language text found in the Verbmobil corpus is still beyond reach. Hence, we took a partial parsing approach. Complex Verb Predicates Both German and English exhibit complex verb predicates (CVPs), see (2). Every verb and verb particle belongs to such a CVP and there is only one CVP per clause. (2) He would not have called me up. The following two grammar fragments describe the relevant CVP syntax for English and German. Every auxiliary verb governs only one verb, so the CVP grammar is basically 2 regular and implementable with finite-state devices. (3) V'ersuchen hS~tte ich es schon gerne wollen. try 'd have I it liked to I'd have liked to try it. Verb Form Subcategorization Auxiliary verbs form a closed class. Thus, the set sub(v) of infinite verb forms for which an auxiliary verb v subcategorizes can be specified by hand. English and German auxiliary verbs govern the following verb forms. • infinitive e.g. Transducers Two partial parsers (rather: transducers) are used to detect English and German CVPs and to translate them into predicate argument structures (verb chains). The parsers presuppose POS tagging and lemmatization. A data base associates verbs v with sets mor(v) of possible tenses or infinite verb forms. Let m = I{mor(v) : Verb v}l and n = I{sub(v) : Verb v }]. Then the English CVP parser needs n + 1 states to encode which verb forms, if any, are expected by a preceding auxiliary verb. Verb particles are attached to the preceding verb. The German CVP parser is more complicated, but also more restrictive as all verbs in a verb complex (VC) must be adjacent. It operates in left-headed (S) or right-headed mode (VC). In VC-mode (i.e. inside VCs) the order of the verbs put on the output tape is reversed. In S-mode, n + 1 states again record the verb form expected by a preceding finite verb Vfin. VC-mode is entered when an infinite verb form is encountered. A state in VC-mode records the verb form expected by Vfin (n + 1), the infinite verb form of the last verb encountered (m), and the verb form expected by the VC verb, if the VC consists of only one verb (n + 1). So there are rn, (n + 1) 2 states. As soon as a non-verb is encountered in VC-mode or the verb form of the previous verb does not fit the subcategorization requirements of the current verb, a test is performed to see if the verb form of the last verb future perfect -~.2' .\" \"-.'~ .~__.future i9'--,'\" \"\"' \\.' , ,..  pluperf.preterite perfect present future Alignment In the CVP alignment, only 78 % of the turns proved to have CVPs on both sides, only 19 % had more than one CVP on some side. CVPs were further aligned by maximizing the translation probability of the flfll verbs (yielding 16,575 CVP pairs). To ensure correctness, turns with multit)le CVPs were inspected by hand. in word aligmnent inside CVPs, surplus tense-bearing auxiliary verbs were aligned with a tense-marked NULL auxiliary (similar to the English auxiliary do). Alignment Results The domain biases the c, orpus towards the fllture. So only 5 out of 6 German tenses and 12 out of 16 English tenses occurred in tile corpus. Both will and be going to were analysed as future, while would was taken to indicate conditional mood, hence present. • In some cases, tense was ambiguous when considered in isolation, and had to be resolved in tandem with tense translation. Ambiguous tenses on the target side were disambiguated to fit the particular disambiguation strategy. • G present/perfect (verreist sein) Combined precision and recall vahms are formed by taking the sum of the frequencies in nmnerator and denominator for all source and target tenses. Performance was cross-validated with test sets of 10 % of all CVP pairs. Baseline A baseline strategy assigns to every source tense the most likely target tense (tr(ts) = arg maxt~P(ttlt,), strategy t). The most likely target tenses can be read off Figures 1 and 2 . Past tenses rarely denote logical past, as discussion circles around a future meeting event, they are rather used for politeness. (5) a. Ich wollte Sic fragen, wie das aussieht. I wanted to ask you what is on. b. iibermorgen war ich ja auf diesem Kongrefi in Ziirich. the day after tomorrow, I'll be (lit: was) at this conference in Zurich. Full Verb Information Three more disambiguation strategies condition the choice of tense on the full verb in a CVP, viz. the source verb (tr(ts,vs) = arg maxhP(ttlts,vs), strategy vs), the target verb (tr(t,,vt) , strategy vt), and the combination of source and target verb (tr (G, {vs,vt) ), strategy vst). The table below gives precision and recall values for these strategies and for the strategies obtained by smoothing (e.g. v,t,v~,vt, t is %t smoothed first with v~, then with vt, and finally with t). Smoothing with t results in identical precision and recall figures. prec. recall ,t .865 .865 .865 .885 .854 .879 .900 .876 .896 .916 .819 .899 .902 .892 .900 .899 .889 .897 E--+G prec. recall , t .957 .957 .957 .970 .941 .965 .973 .933 .966 .979 .874 .965 .970 .956 .967 .971 .957 .967 We see that inclusion of verb inibrmation improves performance. Translation pairs approximate the verb semantics better than single source or target verbs. The full verb contexts of tenses can also be used for verb classifications. t Vs Vt Vst Vst, Vt, Vs Vst, Vs, vt G-+E Aspeetual classification: The aspect of a verb often depends on its reading and thus can be better extrapolated from an aligned corpus (e.g. I am having a drink (trinken)). German allows punctual events in the present, English prefers present perfect (e.g. sehen, finden, tbststellen(discover, find, see); einfallen (occur, remember); treffen, erwisdmn, sehen (meet)). World knowledge: In many cases perfect maps an event to its result state. finish forget denken an sich verabreden sich vertun settle a question =v fertig sein =~ nicht mehr wissen =~ have in mind =~ have an appointment =~ be wrong =~ (the question) is settled Subordinating Conjunctions Conjunctions often engender different mood. • In conditional clauses English past tenses usually denote present tenses. Interpreting hypothetical past as present increases performance by about 0.3 %. • In subjunctive environments logical future is expressed by English simple present. The verbs vorsddagen (s,ggest) (in 11 out of 14 cases) and sag'ca (say) (2/5) force simt)le present on verbs that normally prefer a translation to flmlre. (6) I suggest that we meet on the tenth. • Certain matrix verbs a trigger translation of German present to English fllture. Representation of Tense Tense can not only I)e viewed as a single item (as sketched above, representation rt). In compositional analyses of tense, source tense S and target tense T are decomposed into components (S1,..., Sn} and (T1,... ,Tn}. A disambiguation strategy tr is correct if Vi : tr(Si) = T,:. prec. recall ,t .861 .861 .861 .883 .853 .877 .895 .872 .891 .913 .816 .895 E~G prec. recall , t .957 .957 .957 .968 .940 .963 .971 .933 .965 .979 .875 .964 5 Conclusion The paper presents a way to test disamtfiguation strategies oil real data and to measure tit(; influence of diverse factors ranging front sentence internal context to the choice of representation. The pertaining disambiguation information learned fl'om the corpus is trot into action in the symbolic transfer component of the Verbmobil system (Dorna and Emele, 1996) . The only other emt)irical study of tense translation (Santos, 1994 ) I ant aware of was conducted on a manually annotated Portuguese-English corpus (48, 607 English, 43, 492 Portuguese word tokens and 6,334 tense translation pairs). It neither gives results tbr all tenses nor considers disambiguation factors. Still, it acknowledges the surprising divergence of tense across languages and argues against the widely held belief that surface tenses can be mapped directly into an interlinguM representation. Although the findings reported here support this conclusion, it should be noted that a bilingual corpus can only give one of several possible translations.",
    "abstract": "This paper studies and evaluates disambiguation strategies for the translation of tense between German and English, using a bilingual cortms of al)pointment scheduling dialogues. It describes a scheme to detect complex verb predicates based on verb form subcatcgorization and grammatical knowledge. The extracted verb and tense infbrmation is presented and the role of different context factors is discussed.",
    "countries": [
        "Germany"
    ],
    "languages": [
        "English",
        "German"
    ],
    "numcitedby": "0",
    "year": "1998",
    "month": "",
    "title": "Learning Tense Translation from Bilingual Corpora"
}