{
    "article": "Translation rule extraction is a fundamental problem in machine translation, especially for linguistically syntax-based systems that need parse trees from either or both sides of the bitext. The current dominant practice only uses 1-best trees, which adversely affects the rule set quality due to parsing errors. So we propose a novel approach which extracts rules from a packed forest that compactly encodes exponentially many parses. Experiments show that this method improves translation quality by over 1 BLEU point on a state-of-the-art tree-to-string system, and is 0.5 points better than (and twice as fast as) extracting on 30best parses. When combined with our previous work on forest-based decoding, it achieves a 2.5 BLEU points improvement over the baseline, and even outperforms the hierarchical system of Hiero by 0.7 points. Introduction Automatic extraction of translation rules is a fundamental problem in statistical machine translation, especially for many syntax-based models where translation rules directly encode linguistic knowledge. Typically, these models extract rules using parse trees from both or either side(s) of the bitext. The former case, with trees on both sides, is often called tree-to-tree models; while the latter case, with trees on either source or target side, include both treeto-string and string-to-tree models (see Table 1 ). Leveraging from structural and linguistic information from parse trees, these models are believed to be better than their phrase-based counterparts in source target examples (partial) tree-to-tree Ding and Palmer (2005) tree-to-string Liu et al. (2006) ; Huang et al. (2006) string-to-tree Galley et al. (2006) string-to-string Chiang (2005) Table 1 : A classification of syntax-based MT. The first three use linguistic syntax, while the last one only formal syntax. Our experiments cover the second type using a packed forest in place of the tree for rule-extraction. handling non-local reorderings, and have achieved promising translation results. 1  However, these systems suffer from a major limitation, that the rule extractor only uses 1-best parse tree(s), which adversely affects the rule set quality due to parsing errors. To make things worse, modern statistical parsers are often trained on domains quite different from those used in MT. By contrast, formally syntax-based models (Chiang, 2005) do not rely on parse trees, yet usually perform better than these linguistically sophisticated counterparts. To alleviate this problem, an obvious idea is to extract rules from k-best parses instead. However, a k-best list, with its limited scope, has too few variations and too many redundancies (Huang, 2008) . This situation worsens with longer sentences as the number of possible parses grows exponentially with the sentence length and a k-best list will only capture a tiny fraction of the whole space. In addition, many subtrees are repeated across different parses, so it is also inefficient to extract rules separately from each of these very similar trees (or from the cross-product of k 2 similar tree-pairs in tree-to-tree models). We instead propose a novel approach that extracts rules from packed forests (Section 3), which compactly encodes many more alternatives than kbest lists. Experiments (Section 5) show that forestbased extraction improves BLEU score by over 1 point on a state-of-the-art tree-to-string system (Liu et al., 2006; Mi et al., 2008) , which is also 0.5 points better than (and twice as fast as) extracting on 30-best parses. When combined with our previous orthogonal work on forest-based decoding (Mi et al., 2008) , the forest-forest approach achieves a 2.5 BLEU points improvement over the baseline, and even outperforms the hierarchical system of Hiero, one of the best-performing systems to date. Besides tree-to-string systems, our method is also applicable to other paradigms such as the string-totree models (Galley et al., 2006) where the rules are in the reverse order, and easily generalizable to pairs of forests in tree-to-tree models. Tree-based Translation We review in this section the tree-based approach to machine translation (Liu et al., 2006; Huang et al., 2006) , and its rule extraction algorithm (Galley et al., 2004; Galley et al., 2006) . Tree-to-String System Current tree-based systems perform translation in two separate steps: parsing and decoding. The input string is first parsed by a parser into a 1-best tree, which will then be converted to a target language string by applying a set of tree-to-string transformation rules. For example, consider the following example translating from Chinese to English: ( \"Bush held a meeting 2 with Sharon 1 \" Figure 2 shows how this process works. The Chinese sentence (a) is first parsed into a parse tree (b), which will be converted into an English string in 5 steps. First, at the root node, we apply rule r 1 shown in Figure 1 , which translates the Chinese coordination construction (\"... and ...\") into an English prepositional phrase. Then, from step (c) we continue applying rules to untranslated Chinese subtrees, until we get the complete English translation in (e).  More formally, a (tree-to-string) translation rule (Galley et al., 2004; Huang et al., 2006 ) is a tuple lhs(r), rhs(r), φ(r) , where lhs(r) is the sourceside tree fragment, whose internal nodes are labeled by nonterminal symbols (like NP and VP), and whose frontier nodes are labeled by sourcelanguage words (like \"yǔ\") or variables from a set X = {x 1 , x 2 , . . .}; rhs(r) is the target-side string expressed in target-language words (like \"with\") and variables; and φ(r) is a mapping from X to nonter-minals. Each variable x i ∈ X occurs exactly once in lhs(r) and exactly once in rhs(r). For example, for rule r 1 in Figure 1 , lhs(r 1 ) = IP ( NP(x 1 CC(yǔ) x 2 ) x 3 ), rhs(r 1 ) = x 1 x 3 with x 2 , φ(r 1 ) = {x 1 : NPB, x 2 : NPB, x 3 : VPB}. These rules are being used in the reverse direction of the string-to-tree transducers in Galley et al. (2004) . Tree-to-String Rule Extraction We now briefly explain the algorithm of Galley et al. (2004) that can extract these translation rules from a word-aligned bitext with source-side parses. Consider the example in Figure 3 . The basic idea is to decompose the source (Chinese) parse into a series of tree fragments, each of which will form a rule with its corresponding English translation. However, not every fragmentation can be used for rule extraction, since it may or may not respect the alignment and reordering between the two languages. So we say a fragmentation is well-formed with respect to an alignment if the root node of every tree fragment corresponds to a contiguous span on the target side; the intuition is that there is a \"translational equivalence\" between the subtree rooted at the node and the corresponding target span. For example, in Figure 3 , each node is annotated with its corresponding English span, where the NP node maps to a noncontiguous one \"Bush ⊔ with Sharon\". More formally, we need a precise formulation to handle the cases of one-to-many, many-to-one, and many-to-many alignment links. Given a sourcetarget sentence pair (σ, τ ) with alignment a, the (target) span of node v is the set of target words aligned to leaf nodes yield (v) under node v: span(v) {τ i ∈ τ | ∃σ j ∈ yield (v), (σ j , τ i ) ∈ a}. For example, in Figure 3 , every node in the parse tree is annotated with its corresponding span below the node, where most nodes have contiguous spans except for the NP node which maps to a gapped phrase \"Bush ⊔ with Sharon\". But contiguity alone is not enough to ensure well-formedness, since there might be words within the span aligned to source words uncovered by the node. So we also define a span s to be faithful to node v if every word in it is only aligned to nodes dominated by v, i.e.: ∀τ i ∈ s, (σ j , τ i ) ∈ a ⇒ σ j ∈ yield (v). For example, sibling nodes VV and AS in the tree have non-faithful spans (crossed out in the Figure ) , because they both map to \"held\", thus neither of them can be translated to \"held\" alone. In this case, a larger tree fragment rooted at VPB has to be extracted. Nodes with non-empty, contiguous, and faithful spans form the admissible set (shaded nodes IP 0,6 NPB 0,1 Bùshí VP 1,6 PP 1,3 P 1,2 yǔ NPB 2,3 Shālóng VPB 3,6 jǔxíng le huìtán With the admissible set computed, rule extraction is as simple as a depth-first traversal from the root: we \"cut\" the tree at all admissible nodes to form tree fragments and extract a rule for each fragment, with variables matching the admissible descendant nodes. For example, the tree in Figure 3 is cut into 6 pieces, each of which corresponds to a rule on the right. These extracted rules are called minimal rules, which can be glued together to form composed rules with larger tree fragments (e.g. r 1 in Fig. 1 ) (Galley et al., 2006) . Our experiments use composed rules. Forest-based Rule Extraction We now extend tree-based extraction algorithm from the previous section to work with a packed forest representing exponentially many parse trees. Packed Forest Informally, a packed parse forest, or forest in short, is a compact representation of all the derivations (i.e., parse trees) for a given sentence under a context-free grammar (Earley, 1970; Billot and Lang, 1989) . For example, consider again the Chinese sentence in Example (1) above, which has (at least) two readings depending on the part-ofspeech of the word yǔ: it can be either a conjunction (CC \"and\") as shown in Figure 3 , or a preposition (P \"with\") as shown in Figure 5 , with only PP and VPB swapped from the English word order. These two parse trees can be represented as a single forest by sharing common subtrees such as NPB 0, 1 and VPB 3, 6 , as shown in Figure 4 . Such a forest has a structure of a hypergraph (Huang and Chiang, 2005) , where items like NP 0, 3 are called nodes, whose indices denote the source span, and combinations like e 1 : IP 0, 6 → NPB 0, 3 VP 3, 6 we call hyperedges. We denote head (e) and tails(e) to be the consequent and antecedant items of hyperedge e, respectively. For example, head (e 1 ) = IP 0, 6 , tails(e 1 ) = {NPB 0, 3 , VP 3, 6 }. We also denote BS (v) to be the set of incoming hyperedges of node v, being different ways of deriving it. For example, in Figure 4 , BS (IP 0, 6 ) = {e 1 , e 2 }. Forest-based Rule Extraction Algorithm Like in tree-based extraction, we extract rules from a packed forest F in two steps: (1) admissible set computation (where to cut), and (2) fragmentation (how to cut). It turns out that the exact formulation developed for admissible set in the tree-based case can be applied to a forest without any change. The fragmentation step, however, becomes much more involved since we now face a choice of multiple parse hyperedges at each node. In other words, it becomes nondeterministic how to \"cut\" a forest into tree fragments, which is analogous to the non-deterministic pattern-match in forest-based decoding (Mi et al., 2008) . For example there are two parse hyperedges e 1 and e 2 at the root node in Figure 4 . When we follow one of them to grow a fragment, there again will be multiple choices at each of its tail nodes. Like in tree-based case, a fragment is said to be complete if all its leaf nodes are admissible. Otherwise, an incomplete fragment can grow at any non-admissible frontier node v, where following each parse hyperedge at v will split off a new fragment. For example, following e 2 at the root node will immediately lead us to two admissible nodes, NPB 0, 1 and VP open.append( frag ∪ {e}, front ′ ) in this section like in Figures 3 and 4 ). So this fragment, frag 1 = {e 2 }, is now complete and we can extract a rule, IP (x 1 :NPB x 2 :VP) → x 1 x 2 . However, following the other hyperedge e 1 IP 0, 6 → NP 0, 3 VPB 3, 6 will leave the new fragment frag 2 = {e 1 } incomplete with one non-admissible node NP 0, 3 . We then grow frag 2 at this node by choosing hyperedge e 3 NP 0, 3 → NPB 0, 1 CC 1, 2 NPB 2, 3 , and spin off a new fragment frag 3 = {e 1 , e 3 }, which is now complete since all its four leaf nodes are admissible. We then extract a rule with four variables: IP (NP(x 1 :NPB x 2 :CC x 3 :NPB) x 4 :VPB) → x 1 x 4 x 2 x 3 . This procedure is formalized by a breadth-first search (BFS) in Pseudocode 1. The basic idea is to visit each frontier node v, and keep a queue open of actively growing fragments rooted at v. We keep expanding incomplete fragments from open, and extract a rule if a complete fragment is found (line 10). Each fragment is associated with a frontier (variable front in the Pseudocode), being the subset of nonadmissible leaf nodes (recall that expansion stops at admissible nodes). So each initial fragment along hyperedge e is associated with an initial frontier (line 5), front = tails(e) \\ admset. A fragment is complete if its frontier is empty (line 9), otherwise we pop one frontier node u to expand, spin off new fragments by following hyperedges of u, and update the frontier (lines 14-16), until all active fragments are complete and open queue is empty (line 7). A single parse tree can also be viewed as a trivial forest, where each node has only one incoming hyperedge. So the Galley et al. (2004) algorithm for tree-based rule extraction (Sec. 2.2) can be considered a special case of our algorithm, where the queue open always contains one single active fragment. Fractional Counts and Rule Probabilities In tree-based extraction, for each sentence pair, each rule extracted naturally has a count of one, which will be used in maximum-likelihood estimation of rule probabilities. However, a forest is an implicit collection of many more trees, each of which, when enumerated, has its own probability accumulated from of the parse hyperedges involved. In other words, a forest can be viewed as a virtual weighted k-best list with a huge k. So a rule extracted from a non 1-best parse, i.e., using non 1-best hyperedges, should be penalized accordingly and should have a fractional count instead of a unit one, similar to the E-step in EM algorithms. Inspired by the parsing literature on pruning (Charniak and Johnson, 2005; Huang, 2008) we penalize a rule r by the posterior probability of its tree fragment frag = lhs(r). This posterior probability, notated αβ(frag), can be computed in an Inside-Outside fashion as the product of three parts: the outside probability of its root node, the probabilities of parse hyperedges involved in the fragment, and the inside probabilities of its leaf nodes, αβ(frag) =α(root(frag)) • e ∈ frag P(e) • v ∈ yield (frag) β(v) (2) where α(•) and β(•) denote the outside and inside probabilities of tree nodes, respectively. For example in Figure 4 , αβ({e 2 , e 3 }) = α(IP 0, 6 ) • P(e 2 ) • P(e 3 ) • β(NPB 0, 1 )β(CC 1, 2 )β(NPB 2, 3 )β(VPB 3, 6 ). Now the fractional count of rule r is simply c(r) = αβ(lhs(r)) αβ(TOP) (3) where TOP denotes the root node of the forest. Like in the M-step in EM algorithm, we now extend the maximum likelihood estimation to fractional counts for three conditional probabilities regarding a rule, which will be used in the experiments: P(r | lhs(r)) = c(r) r ′ :lhs(r ′ )=lhs(r) c(r ′ ) , (4) P(r | rhs(r)) = c(r) r ′ :rhs(r ′ )=rhs(r) c(r ′ ) , (5) P(r |root(lhs(r))) = c(r) r ′ :root(lhs(r ′ ))=root(lhs(r)) c(r ′ ) . (6) Related Work The concept of packed forest has been previously used in translation rule extraction, for example in rule composition (Galley et al., 2006) and tree binarization (Wang et al., 2007) . However, both of these efforts only use 1-best parses, with the second one packing different binarizations of the same tree in a forest. Nevertheless we suspect that their extraction algorithm is in principle similar to ours, although they do not provide details of forest-based fragmentation (Algorithm 1) which we think is non-trivial. The forest concept is also used in machine translation decoding, for example to characterize the search space of decoding with integrated language models (Huang and Chiang, 2007) . The first direct application of parse forest in translation is our previous work (Mi et al., 2008) which translates a packed forest from a parser; it is also the base system in our experiments (see below). This work, on the other hand, is in the orthogonal direction, where we utilize forests in rule extraction instead of decoding. Our experiments will use both default 1-best decoding and forest-based decoding. As we will see in the next section, the best result comes when we combine the merits of both, i.e., using forests in both rule extraction and decoding. There is also a parallel work on extracting rules from k-best parses and k-best alignments (Venugopal et al., 2008) , but both their experiments and our own below confirm that extraction on k-best parses is neither efficient nor effective. Experiments System Our experiments are on Chinese-to-English translation based on a tree-to-string system similar to (Huang et al., 2006; Liu et al., 2006) . Given a 1best tree T , the decoder searches for the best derivation d * among the set of all possible derivations D: d * = arg max d∈D λ 0 log P(d | T ) + λ 1 log P lm (τ (d)) + λ 2 |d| + λ 3 |τ (d)| (7) where the first two terms are translation and language model probabilities, τ (d) is the target string (English sentence) for derivation d, and the last two terms are derivation and translation length penalties, respectively. The conditional probability P(d | T ) decomposes into the product of rule probabilities: P(d | T ) = r∈d P(r). (8) Each P(r) is in turn a product of five probabilities: P(r) = P(r | lhs(r)) λ 4 • P(r | rhs(r)) λ 5 • P(r | root(lhs(r))) λ 6 • P lex (lhs(r) | rhs(r)) λ 7 • P lex (rhs(r) | lhs(r)) λ 8 (9) where the first three are conditional probabilities based on fractional counts of rules defined in Section 3.3, and the last two are lexical probabilities. These parameters λ 1 . . . λ 8 are tuned by minimum error rate training (Och, 2003) on the dev sets. We refer readers to Mi et al. (2008) for details of the decoding algorithm. We use the Chinese parser of Xiong et al. (2005) to parse the source side of the bitext. Following Huang (2008) , we also modify this parser to output a packed forest for each sentence, which can be pruned by the marginal probability-based insideoutside algorithm (Charniak and Johnson, 2005; Huang, 2008) . We will first report results trained on a small-scaled dataset with detailed analysis, and then scale to a larger one, where we also combine the technique of forest-based decoding (Mi et al., 2008) . Results and Analysis on Small Data To test the effect of forest-based rule extraction, we parse the training set into parse forests and use three levels of pruning thresholds: p e = 2, 5, 8. Figure 6 We also investigate the question of how often rules extracted from non 1-best parses are used by the decoder. Table 3 shows the numbers of rules extracted from 1-best, 30-best and forest-based extractions, and the numbers that survive after filtering on the dev set. Basically in the forest-based case we can use about twice as many rules as in the 1best case, or about 1.5 times of 30-best extraction. But the real question is, are these extra rules really useful in generating the final (1-best) translation? The last row shows that 16.3% of the rules used in 1-best derivations are indeed only extracted from non 1-best parses in the forests. Note that this is a stronger condition than changing the distribution of rules by considering more parses; here we introduce new rules never seen on any 1-best parses. Final Results on Large Data We also conduct experiments on a larger training dataset, FBIS, which contains 239K sentence pairs with about 6.9M/8.9M words in Chinese/English, respectively. We also use a bigger trigram model trained on the first 1/3 of the Xinhua portion of Gigaword corpus. (Chiang, 2005) , one of the best performing systems to date. These results confirm that our novel forest-based rule extraction approach is a promising direction for syntaxbased machine translation. Conclusion and Future Work In this paper, we have presented a novel approach that extracts translation rules from a packed forest encoding exponentially many trees, rather than from 1-best or k-best parses. Experiments on a state-ofthe-art tree-to-string system show that this method improves BLEU score significantly, with reasonable extraction speed. When combined with our previous work on forest-based decoding, the final result is even better than the hierarchical system Hiero. For future work we would like to apply this approach to other types of syntax-based translation systems, namely the string-to-tree systems (Galley et al., 2006) and tree-to-tree systems. Acknowledgement This work was funded by National Natural Science Foundation of China, Contracts 60736014 and 60573188, and 863 State Key Project No. 2006AA010108 (H. M.), and by NSF ITR EIA-0205456 (L. H.). We would also like to thank Qun Liu for supporting this work, and the three anonymous reviewers for improving the earlier version.",
    "abstract": "Translation rule extraction is a fundamental problem in machine translation, especially for linguistically syntax-based systems that need parse trees from either or both sides of the bitext. The current dominant practice only uses 1-best trees, which adversely affects the rule set quality due to parsing errors. So we propose a novel approach which extracts rules from a packed forest that compactly encodes exponentially many parses. Experiments show that this method improves translation quality by over 1 BLEU point on a state-of-the-art tree-to-string system, and is 0.5 points better than (and twice as fast as) extracting on 30best parses. When combined with our previous work on forest-based decoding, it achieves a 2.5 BLEU points improvement over the baseline, and even outperforms the hierarchical system of Hiero by 0.7 points.",
    "countries": [
        "United States",
        "China"
    ],
    "languages": [
        "English",
        "Chinese"
    ],
    "numcitedby": "128",
    "year": "2008",
    "month": "October",
    "title": "Forest-based Translation Rule Extraction"
}