{
    "article": "Discovering and summarizing opinions from online reviews is an important and challenging task. A commonly-adopted framework generates structured review summaries with aspects and opinions. Recently topic models have been used to identify meaningful review aspects, but existing topic models do not identify aspect-specific opinion words. In this paper, we propose a MaxEnt-LDA hybrid model to jointly discover both aspects and aspect-specific opinion words. We show that with a relatively small amount of training data, our model can effectively identify aspect and opinion words simultaneously. We also demonstrate the domain adaptability of our model. Introduction With the dramatic growth of opinionated usergenerated content, consumers often turn to online product reviews to seek advice while companies see reviews as a valuable source of consumer feedback. How to automatically understand, extract and summarize the opinions expressed in online reviews has therefore become an important research topic and gained much attention in recent years (Pang and Lee, 2008) . A wide spectrum of tasks have been studied under review mining, ranging from coarse-grained document-level polarity classification (Pang et al., 2002) to fine-grained extraction of opinion expressions and their targets (Wu et al., 2009) . In particular, a general framework of summarizing reviews of a certain product is to first identify different aspects (a.k.a. features) of the given product and then extract specific opinion expressions for each aspect. For example, aspects of a restaurant may include food, staff, ambience and price, and opinion expressions for staff may include friendly, rude, etc. Because of the practicality of this structured summary format, it has been adopted in several previous studies (Hu and Liu, 2004; Popescu and Etzioni, 2005; Brody and Elhadad, 2010) as well as some commercial systems, e.g. the \"scorecard\" feature at Bing shopping 1 . Different approaches have been proposed to identify aspect words and phrases from reviews. Previous methods using frequent itemset mining (Hu and Liu, 2004) or supervised learning (Jin and Ho, 2009; Jin et al., 2009; Wu et al., 2009) have the limitation that they do not group semantically related aspect expressions together. Supervised learning also suffers from its heavy dependence on training data. In contrast, unsupervised, knowledge-lean topic modeling approach has been shown to be effective in automatically identifying aspects and their representative words (Titov and McDonald, 2008; Brody and Elhadad, 2010) . For example, words such as waiter, waitress, staff and service are grouped into one aspect. We follow this promising direction and extend existing topic models to jointly identify both aspect and opinion words, especially aspect-specific opinion words. Current topic models for opinion mining, which we will review in detail in Section 2, still lack this ability. But separating aspect and opinion words can be very useful. Aspect-specific opinion words can be used to construct a domain-dependent senti-ment lexicon and applied to tasks such as sentiment classification. They can also provide more informative descriptions of the product or service being reviewed. For example, using more specific opinion words such as cozy and romantic to describe the ambience aspect in a review summary is more meaningful than using generic words such as nice and great. To the best of our knowledge, Brody and Elhadad (2010) are the first to study aspect-specific opinion words, but their opinion word detection is performed outside of topic modeling, and they only consider adjectives as possible opinion words. In this paper, we propose a new topic modeling approach that can automatically separate aspect and opinion words. A novelty of this model is the integration of a discriminative maximum entropy (Max-Ent) component with the standard generative component. The MaxEnt component allows us to leverage arbitrary features such as POS tags to help separate aspect and opinion words. Because the supervision relies mostly on non-lexical features, although our model is no longer fully unsupervised, the number of training sentences needed is relatively small. Moreover, training data can also come from a different domain and yet still remain effective, making our model highly domain adaptive. Empirical evaluation on large review data sets shows that our model can effectively identify both aspects and aspect-specific opinion words with a small amount of training data. Related Work Pioneered by the work of Hu and Liu (2004) , review summarization has been an important research topic. There are usually two major tasks involved, namely, aspect or feature identification and opinion extraction. Hu and Liu (2004) applied frequent itemset mining to identify product features without supervision, and considered adjectives collocated with feature words as opinion words. Jin and Ho (2009) , Jin et al. (2009) and Wu et al. (2009) used supervised learning that requires hand-labeled training sentences to identify both aspects and opinions. A common limitation of these methods is that they do not group semantically related aspect expressions together. Furthermore, supervised learning usually requires a large amount of training data in order to perform well and is not easily domain adaptable. Topic modeling provides an unsupervised and knowledge-lean approach to opinion mining. Titov and McDonald (2008) show that global topic models such as LDA (Blei et al., 2003) may not be suitable for detecting rateable aspects. They propose multigrain topic models for discovering local rateable aspects. However, they do not explicitly separate aspect and opinion words. Lin and He (2009) propose a joint topic-sentiment model, but topic words and sentiment words are still not explicitly separated. Mei et al. (2007) propose to separate topic and sentiment words using a positive sentiment model and a negative sentiment model, but both models capture general opinion words only. In contrast, we model aspect-specific opinion words as well as general opinion words. Recently Brody and Elhadad (2010) propose to detect aspect-specific opinion words in an unsupervised manner. They take a two-step approach by first detecting aspect words using topic models and then identifying aspect-specific opinion words using polarity propagation. They only consider adjectives as opinion words, which may potentially miss opinion words with other POS tags. We try to jointly capture both aspect and opinion words within topic models, and we allow non-adjective opinion words. Another line of related work is about how to incorporate useful features into topic models (Zhu and Xing, 2010; Mimno and McCallum, 2008) . Our MaxEnt-LDA hybrid bears similarity to these recent models but ours is designed for opinion mining. Model Description Our model is an extension of LDA (Blei et al., 2003) but captures both aspect words and opinion words. To model the aspect words, we use a modified version of the multi-grain topic models from (Titov and McDonald, 2008) . Our model is simpler and yet still produces meaningful aspects. Specifically, we assume that there are T aspects in a given collection of reviews from the same domain, and each review document contains a mixture of aspects. We further assume that each sentence (instead of each word as in standard LDA) is assigned to a single aspect, which is often true based on our observation. To understand how we model the opinion words, let us first look at two example review sentences from the restaurant domain: The food was tasty. The waiter was quite friendly. We can see that there is a strong association of tasty with food and similarly of friendly with waiter. While both tasty and friendly are specific to the restaurant domain, they are each associated with only a single aspect, namely food and staff, respectively. Besides these aspect-specific opinion words, we also see general opinion words such as great in the sentence \"The food was great!\" These general opinion words are shared across aspects, as opposed to aspect-specific opinion words which are used most commonly with their corresponding aspects. We therefore introduce a general opinion model and T aspect-specific opinion models to capture these different opinion words. Generative Process We now describe the generative process of the model. First, we draw several multinomial word distributions from a symmetric Dirichlet prior with parameter β: a background model φ B , a general aspect model φ A,g , a general opinion model φ O,g , T aspect models {φ A,t } T t=1 and T aspect-specific opinion models {φ O,t } T t=1 . All these are multinomial distributions over the vocabulary, which we assume has V words. Then for each review document d, we draw a topic distribution θ d ∼Dir(α) as in standard LDA. For each sentence s in document d, we draw an aspect assignment z d,s ∼Multi(θ d ). Now for each word in sentence s of document d, we have several choices: The word may describe the specific aspect (e.g. waiter for the staff aspect), or a general aspect (e.g. restaurant), or an opinion either specific to the aspect (e.g. friendly) or generic (e.g. great), or a commonly used background word (e.g. know). To distinguish between these choices, we introduce two indicator variable, y d,s,n and u d,s,n , for the nth word w d,s,n . We draw y d,s,n from a multinomial distribution over {0, 1, 2}, parameterized by π d,s,n . y d,s,n determines whether w d,s,n is a background word, aspect word or opinion word. We will discuss how to set π d,s,n in Section 3.2. We draw u d,s,n from a Bernoulli distribution over {0, 1} parameterized by p, which in turn is drawn from a symmetric Beta(γ). u d,s,n determines whether w d,s,n is general or aspect-specific. We then draw w d,s,n as T β Φ B Φ A,t Φ O,t Φ A,g Φ O,g D S Nd w d,s,n ∼              Multi(φ B ) if y d,s,n = 0 Multi(φ A,z d,s ) if y d,s,n = 1, u d,s,n = 0 Multi(φ A,g ) if y d,s,n = 1, u d,s,n = 1 Multi(φ O,z d,s ) if y d,s,n = 2, u d,s,n = 0 Multi(φ O,g ) if y d,s,n = 2, u d,s,n = 1 . Figure 1 shows our model using the plate notation. Setting π with a Maximum Entropy Model A simple way to set π d,s,n is to draw it from a symmetric Dirichlet prior. However, as suggested in (Mei et al., 2007; Lin and He, 2009) , fully unsupervised topic models are unable to identify opinion words well. An important observation we make is that aspect words and opinion words usually play different syntactic roles in a sentence. Aspect words tend to be nouns while opinion words tend to be adjectives. Their contexts in sentences can also be different. But we do not want to use strict rules to separate aspect and opinion words because there are also exceptions. E.g. verbs such as recommend can also be opinion words. In order to use information such as POS tags to help discriminate between aspect and opinion words, we propose a novel idea as follows: We set π d,s,n using a maximum entropy (MaxEnt) model applied to a feature vector x d,s,n associated with w d,s,n . x d,s,n can encode any arbitrary features we think may be discriminative, e.g. previous, current and next POS tags. Formally, we have p(y d,s,n = l|x d,s,n ) = π d,s,n l = exp λ l • x d,s,n where {λ l } 2 l=0 denote the MaxEnt model weights and can be learned from a set of training sentences with labeled background, aspect and opinion words. This MaxEnt-LDA hybrid model is partially inspired by (Mimno and McCallum, 2008) . As for the features included in x, currently we use two types of simple features: (1) lexical features which include the previous, the current and the next words {w i−1 , w i , w i+1 }, and (2) POS tag features which include the previous, the current and the next POS tags {POS i−1 , POS i , POS i+1 }. Inference We use Gibbs sampling to perform model inference. Due to the space limit, we leave out the derivation details and only show the sampling formulas. Note that the MaxEnt component is trained first independently of the Gibbs sampling procedure, that is, in Gibbs sampling, we assume that the λ parameters are fixed. We use w to denote all the words we observe in the collection, x to denote all the feature vectors for these words, and y, z and u to denote all the hidden variables. First, given the assignment of all other hidden variables, to sample a value for z d,s , we use the following formula: P (z d,s = t|z ¬(d,s) , y, u, w, x) ∝ c d (t) + α c d (•) + T α × Γ c A,t (•) + V β Γ c A,t (•) + n A,t (•) + V β • V v=1 Γ c A,t (v) + n A,t (v) + β Γ c A,t (v) + β × Γ c O,t (•) + V β Γ c O,t (•) + n O,t (•) + V β • V v=1 Γ c O,t (v) + n O,t (v) + β Γ c O,t (v) + β . Here c d (t) is the number of sentences assigned to aspect t in document d, and c d (•) is the number of sentences in document d. c A,t  (v) is the number of times word v is assigned as an aspect word to aspect t, and c O,t  (v) is the number of times word v is assigned as an opinion word to aspect t. c A,t  (•) is the total number of times any word is assigned as an aspect word to aspect t, and c O,t  (•) is the total number of times any word is assigned as an opinion word to aspect t. All these counts represented by a c variable exclude sentence s of document d. n A,t  (v) is the number of times word v is assigned as an aspect word to aspect t in sentence s of document d, and similarly, n O,t  (v) is the number of times word v is assigned as an opinion word to aspect t in sentence s of document d. Then, to jointly sample values for y d,s,n and u d,s,n , we have P (y d,s,n = 0|z, y ¬(d,s,n) , u ¬(d,s,n) , w, x) ∝ exp(λ 0 • x d,s,n ) l exp(λ l • x d,s,n ) • c B (w d,s,n ) + β c B (•) + V β , P (y d,s,n = l, u d,s,n = b|z, y ¬(d,s,n) , u ¬(d,s,n) , w, x) ∝ exp(λ l • x d,s,n ) l exp(λ l • x d,s,n ) • g(w d,s,n , z d,s , l, b), where the function g(v, t, l, b) (1 ≤ v ≤ V, 1 ≤ t ≤ T, l ∈ {1, 2}, b ∈ {0, 1} ) is defined as follows: g(v, t, l, b) =                      c A,t (v) +β c A,t (•) +V β • c (0) +γ c (•) +2γ if l = 1, b = 0 c O,t (v) +β c O,t (•) +V β • c (0) +γ c (•) +2γ if l = 2, b = 0 c A,g (v) +β c A,g (•) +V β • c (1) +γ c (•) +2γ if l = 1, b = 1 c O,g (v) +β c O,g (•) +V β • c (1) +γ c (•) +2γ if l = 2, b = 1. . Here the various c variables denote various counts excluding the nth word in sentence s of document d. Due to space limit, we do not give full explanation here. Experiment Setup To evaluate our MaxEnt-LDA hybrid model for jointly modeling aspect and opinion words, we used a restaurant review data set previously used in (Ganu et al., 2009; Brody and Elhadad, 2010 ) and a hotel review data set previously used in (Baccianella et al., 2009) . We removed stop words and used the Stanford POS Tagger 2 to tag the two data sets. Only reviews that have no more than 50 sentences were used. We also kept another version of the data which includes the stop words for the purpose of extracting the contextual features included in x. Some details of the data sets are given in Table 1 . For our hybrid model, we ran 500 iterations of Gibbs sampling. Following (Griffiths and Steyvers, 2004) 50/T , β = 0.1 and γ = 0.5. We also experimented with other settings of these priors and did not notice any major difference. For MaxEnt training, we tried three labeled data sets: one that was taken from the restaurant data set and manually annotated by us 3 , and two from the annotated data set used in (Wu et al., 2009) . Note that the latter two were used for testing domain adaptation in Section 6.3. Some details of the training sets are shown in Table 2 . In our preliminary experiments, we also tried two variations of our MaxEnt-LDA hybrid model. (1) The first is a fully unsupervised model where we used a uniform Dirichlet prior for π. We found that this unsupervised model could not separate aspect and opinion words well. (2) The second is a bootstrapping version of the MaxEnt-LDA model where we used the predicted values of y as pseudo labels and re-trained the MaxEnt model iteratively. We found that this bootstrapping procedure did not boost the overall performance much and even hurt the performance a little in some cases. Due to the space limit we do not report these experiments here. Evaluation In this section we report the evaluation of our model. We refer to our MaxEnt-LDA hybrid model as ME-LDA. We also implemented a local version of the standard LDA method where each sentence is treated as a document. This is the model used in (Brody and Elhadad, 2010) to identify aspects, and we refer to this model as LocLDA. Qualitative Evaluation For each of the two data sets, we show four sample aspects identified by ME-LDA in Table 3 and Table 5. Because the hotel domain is somehow similar to the restaurant domain, we used the labeled training data from the restaurant domain also for the hotel data set. From the tables we can see that generally aspect words are quite coherent and meaningful, and opinion words correspond to aspects very well. For comparison, we also applied LocLDA to the restaurant data set and present the aspects in Table 4 . We can see that ME-LDA and LocLDA give similar aspect words. The major difference between these two models is that ME-LDA can sperate aspect words and opinion words, which can be very useful. ME-LDA is also able to separate general opinion words from aspect-specific ones, giving more informative opinion expressions for each aspect. Evaluation of Aspects Identification We also quantitatively evaluated the quality of the automatically identified aspects. Ganu et al. (2009) provide a set of annotated sentences from the restaurant data set, in which each sentence has been assigned one or more labels from a gold standard label set S = {Staff, Food, Ambience, Price, Anecdote, Misc}. To evaluate the quality of our aspect identification, we chose from the gold standard labels three major aspects, namely Staff, Food and Ambience. We did not choose the other aspects because (1) Price is often mixed with other aspects such as Food, and (2) Anecdote and Misc do not show clear patterns in either word usage or writing styles, making it even hard for humans to identify them. Brody and Elhadad (2010) also only used these three aspects for quantitative evaluation. To avoid ambiguity, we used only the single-labeled sentences for evaluation. About 83% of the labeled sentences have a single label, which confirms our observation that a sentence usually belongs to a single aspect. We first ran ME-LDA and LocLDA each to get an inferred aspect set T . Following (Brody and Elhadad, 2010) , we set the number of aspects to 14 in both models. We then manually mapped each inferred aspect to one of the six gold standard aspects, i.e., we created a mapping function f (t) : T → S. For sentence s of document d, we first assign it to an inferred aspect as follows: t * = arg max t∈T N d,s n=1 log P (w d,s,n |t). We then assign the gold standard aspect f (t * ) to this sentence. We then calculated the F-1 score of the three aspects: Staff, Food and Ambience. The results are shown in Table 6 . Generally ME-LDA has given competitive results compared with LocLDA. For Food and Ambience ME-LDA outperformed Lo-cLDA, while for Staff ME-LDA is a little worse than LocLDA. Note that ME-LDA is not designed to compete with LocLDA for aspect identification. Evaluation of Opinion Identification Since the major advantage of ME-LDA is its ability to separate aspect and opinion words, we further quantitatively evaluated the quality of the aspectspecific opinion words identified by ME-LDA. Brody and Elhadad (2010) has constructed a gold standard set of aspect-specific opinion words for the restaurant data set. In this gold standard set, they manually judged eight out of the 14 automatically inferred aspects they had: J = {Ambiance, Staff, Food-Main Dishes, Atmosphere-Physical, Food-Baked Goods, Food-General, Drinks, Service}. Each word is assigned a polarity score ranging from -2.0 to 2.0 in each aspect. We used their gold standard words whose polarity scores are not equal to zero. Because their gold standard only includes adjectives, we also manually added more opinion words into the gold standard set. To do so, we took the top 20 opinion words returned by our method and two baseline methods, pooled them together, and manually judged them. We use precision at n (P@n), a commonly used metric in information retrieval, for evaluation. Because top words are more important in opinion models, we set n to 5, 10 and 20. For both ME-LDA and BL-1 below, we again manually mapped each automatically inferred aspect to one of the gold standard aspects. Since LocLDA does not identify aspect-specific opinion words, we consider the following two baseline methods that can identify aspect-specific opinion words: BL-1: In this baseline, we start with all adjectives as candidate opinion words, and use mutual information (MI) to rank these candidates. Specifically, given an aspect t, we rank the candidate words according to the following scoring function: Score BL-1 (w, t) = v∈Vt p(w, v) log p(w, v) p(w)p(v) , where V t is the set of the top-100 frequent aspect words from φ A,t . BL-2: In this baseline, we first use LocLDA to learn a topic distribution for each sentence. We then assign a sentence to the aspect with the largest probability and hence get sentence clusters. We manually map these clusters to the eight gold standard aspects. Finally, for each aspect we rank adjectives by their Method P@5 P@10 P@20 ME-LDA 0.825 * , 0.700 * 0.569 * BL-1 0.400 0.450 0.469 BL-2 0.725 0.650 0.563 Table 7 : Average P@n of aspect-specific opinion words on restaurant. * and indicate that the improvement hypothesis is accepted at confidence level 0.9 respectively for BL-1 and BL-2. frequencies in the aspect and treat these as aspectspecific opinion words. The basic results in terms of the average precision at n over the eight aspects are shown in Table 7 . We can see that ME-LDA outperformed the two baselines consistently. Especially, for P@5, ME-LDA gave more than 100% relative improvement over BL-1. The absolute value of 0.825 for P@5 also indicates that top opinion words discovered by our model are indeed meaningful. Evaluation of the Association between Opinion Words and Aspects The evaluation in the previous section shows that our model returns good opinion words for each aspect. It does not, however, directly judge how aspectspecific those opinion words are. This is because the gold standard created by (Brody and Elhadad, 2010 ) also includes general opinion words. E.g. friendly and good may both be judged to be opinion words for the staff aspect, but the former is more specific than the latter. We suspect that BL-2 has comparable performance with ME-LDA for this reason. So we further evaluated the association between opinion words and aspects by directly looking at how easy it is to infer the corresponding aspect by only looking at an aspect-specific opinion word. We selected four aspects for evaluation: Ambiance, Staff, Food-Main Dishes and Atmosphere-Physical . We chose these four aspects because they are quite different from each other and thus manual judgments on these four aspects can be more objective. For each aspect, similar to the pooling strategy in IR, we pooled the top 20 opinion words identified by BL-1, BL-2 and ME-LDA. We then asked two human assessors to assign an association score to each of these words as follows: If the word is closely associated with an aspect, a score of 2 is given; if it is marginally as- sociated with an aspect, a score of 1 is given; otherwise, 0 is given. We calculated the Kappa statistics of agreement, and we got a quite high Kappa value of 0.8375 and 0.7875 respectively for the restaurant data set and the hotel data set. Then for each word in an aspect, we took the average of the scores of the two assessors. We used an nDCG-like metric to compare the performance of our model and of BL-2. The metric is defined as follows: nDCG@k(t, M) = k i=1 Score(M t,i ) log 2 (i+1) iDCG@k(t) , where M t,i is the ith aspect-specific opinion word inferred by method M for aspect t, Score(M t,i ) is the association score of this word, and iDCG@k(t) is the score of the ideal DCG measure at k for aspect t, that is, the maximum DCG score assuming an ideal ranking. We chose k = 5 and k = 10. The average nDCG over the four aspects are presented in Table 8 . We can see that ME-LDA outperformed BL-2 quite a lot for the restaurant data set, which conforms to our hypothesis that ME-LDA generates aspect-specific opinion words of stronger association with aspects. For the hotel data set, ME-LDA outperformed a little. This may be due to the fact that we used the restaurant training data for the hotel data set. Further Analysis of MaxEnt In this section, we perform some further evaluation and analysis of the MaxEnt component in our model. Feature Selection Previous studies have shown that simple POS features and lexical features can be very effective for discovering aspect words and opinion words (Hu and Liu, 2004; Jin et al., 2009; Wu et al., 2009; Brody and Elhadad, 2010) . for POS features, since we observe that aspect words tend to be nouns while opinion words tend to be adjectives but sometimes also verbs or other part-of-speeches, we can expect that POS features should be quite useful. As for lexical features, words from a sentiment lexicon can also be helpful in discovering opinion words. However, lexical features are more diverse so presumably we need more training data in order to detect useful lexical features. Lexical features are also more domain-dependent. On the other hand, we hypothesize that POS features are more effective when the amount of training data is small and/or the training data comes from a different domain. We therefore compare the following three sets of features: • A: w i−1 , w i , w i+1 • B: POS i−1 , POS i , POS i+1 • C: A + B We show the comparison of the performance in Table 9 using the average F-1 score defined in Section 5.2 for aspect identification, and in Table 10 using the average P@n measure defined in Section 5.3 for opinion identification. We can see that Set B plays the most important part, which conforms to our hypothesis that POS features are very important in opinion mining. In addition, we can see that Set C performs a bit better than Set B, which indicates that some lexical features (e.g., general opinion words) may also be helpful. Note that here the training data is from the same domain as the test data, and therefore lexical features are likely to be useful. Examine the Size of Labeled Data As we have seen, POS features play the major role in discriminating between aspect and opinion words. Because there are much fewer POS features than word features, we expect that we do not need many Methods P@5 P@10 P@20 BL-2 0.725 0.650 0. labeled sentences to learn the POS-based patterns. We now examine the sensitivity of the performance with respect to the amount of labeled data. We generated four smaller training data sets with 10, 20, 30 and 40 sentences each from the whole training data set we have, which consists of 46 labeled sentences. The results are shown in Table 11 and Table 12 . We can see that generally the performance stays above BL when the number of training sentences is 20 or more. This indicates that our model needs only a relatively small number of high-quality training sentences to achieve good results. Domain Adaption Since we find that the MaxEnt supervision relies more on POS features than lexical features, we also hypothesize that if the training sentences come from a different domain the performance can still remain relatively high. To test this hypothesis, we tried two Method P@5 P@10 P@20 BL-2 0.725 0.650 0.563 ME-LDA + 10 0.700 0.563 0.488 ME-LDA + 20 0.875 0.650 0.600 ME-LDA + 30 0.825 0.700 0.569 ME-LDA + 40 0.825 0.688 0.581 ME-LDA + 46 0.825 0.700 0.569 quite different training data sets, one from the cell phone domain and the other from the DVD player domain, both used in (Wu et al., 2009) . We consider two feature sets defined in Section 6.1 for domain adaption, namely B and C. The results are shown in Table 13 and Table 14. For aspect identification, using out-of-domain training data performed worse than using in-domain training data, but the absolute performance is still decent. And interestingly, we can see that using B is better than using C, indicating that lexical features may hurt the performance in the cross-domain setting. It suggests that lexical features are not easily adaptable across domains for aspect identification. For opinion identification, we can see that there is no clear difference between using out-of-domain training data and using in-domain training data, which may indicate that our opinion identification component is robust in domain adaption. Also, we cannot easily tell whether B has advantage over C for opinion identification. One possible reason may be that those general opinion words are useful across domains, so lexical features may still be useful for domain adaption. Conclusions In this paper, we presented a topic modeling approach that can jointly identify aspect and opinion words, using a MaxEnt-LDA hybrid. We showed that by incorporating a supervised, discriminative maximum entropy model into an unsupervised, generative topic model, we could leverage syntactic features to help separate aspect and opinion words. We evaluated our model on two large review data sets from the restaurant and the hotel domains. We found that our model was competitive in identifying meaningful aspects compared with previous models. Most importantly, our model was able to identify meaningful opinion words strongly associated with different aspects. We also demonstrated that the model could perform well with a relatively small amount of training data or with training data from a different domain. Our model provides a principled way to jointly model both aspects and opinions. One of the future directions we plan to explore is to use this model to help sentence-level extraction of specific opinions and their targets, which previously was only tackled in a fully supervised manner. Another direction is to extend the model to support polarity classification. ACKNOWLEDGMENT The authors Xin Zhao, Hongfei",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 0.0,
        "foundation": 0.0,
        "none": 0.9997203495794703
    },
    "reasoning": "Reasoning: The provided text does not mention any specific funding sources for the research conducted in the article. Without explicit mention of support from defense, corporate entities, research agencies, foundations, or an indication of no funding, it is not possible to accurately determine the funding sources based on the provided information.",
    "abstract": "Discovering and summarizing opinions from online reviews is an important and challenging task. A commonly-adopted framework generates structured review summaries with aspects and opinions. Recently topic models have been used to identify meaningful review aspects, but existing topic models do not identify aspect-specific opinion words. In this paper, we propose a MaxEnt-LDA hybrid model to jointly discover both aspects and aspect-specific opinion words. We show that with a relatively small amount of training data, our model can effectively identify aspect and opinion words simultaneously. We also demonstrate the domain adaptability of our model.",
    "countries": [
        "China"
    ],
    "languages": [],
    "numcitedby": 422,
    "year": 2010,
    "month": "October",
    "title": "Jointly Modeling Aspects and Opinions with a {M}ax{E}nt-{LDA} Hybrid"
}