{
    "article": "Traditional distributional semantic models extract word meaning representations from cooccurrence patterns of words in text corpora. Recently, the distributional approach has been extended to models that record the cooccurrence of words with visual features in image collections. These image-based models should be complementary to text-based ones, providing a more cognitively plausible view of meaning grounded in visual perception. In this study, we test whether image-based models capture the semantic patterns that emerge from fMRI recordings of the neural signal. Our results indicate that, indeed, there is a significant correlation between image-based and brain-based semantic similarities, and that image-based models complement text-based ones, so that the best correlations are achieved when the two modalities are combined. Despite some unsatisfactory, but explained outcomes (in particular, failure to detect differential association of models with brain areas), the results show, on the one hand, that imagebased distributional semantic models can be a precious new tool to explore semantic representation in the brain, and, on the other, that neural data can be used as the ultimate test set to validate artificial semantic models in terms of their cognitive plausibility. Introduction Many recent neuroscientific studies have brought support to the view that concepts are represented in terms of patterns of neural activation over broad areas, naturally encoded as vectors in a neural semantic space (Haxby et al., 2001; Huth et al., 2012) . Similar representations are also widely used in computational linguistics, and in particular in distributional semantics (Clark, 2012; Erk, 2012; Turney and Pantel, 2010) , that captures meaning in terms of vectors recording the patterns of co-occurrence of words in large corpora, under the hypothesis that words that occur in similar contexts are similar in meaning. Since the seminal work of Mitchell et al. (2008) , there has thus being interest in investigating whether corpus-harvested semantic representations can contribute to the study of concepts in the brain. The relation is mutually beneficial: From the point of view of brain activity decoding, a strong correlation between corpus-based and brain-derived conceptual representations would mean that we could use the former (much easier to construct on a very large scale) to make inferences about the second: e.g., using corpus-based representations to reconstruct the likely neural signal associated to words we have no direct brain data for. From the point of view of computational linguistics, neural data provide the ultimate testing ground for models that strive to capture important aspects of human semantic memory (much more so than the commonly used explicit semantic rating benchmarks). If we found that a corpus-based model of meaning can make nontrivial predictions about the structure of the semantic space in the brain, that would make a pretty strong case for the intriguing idea that the model is approximating, in interesting ways, the way in which humans acquire and represent semantic knowledge. We take as our starting point the extensive experiments reported in Murphy et al. (2012) , who showed that purely corpus-based distributional models are at least as good at brain signal prediction tasks as earlier models that made use of manually-generated or controlled knowledge sources (Chang et al., 2011; Palatucci et al., 2009; Pereira et al., 2011) , and we evaluate a very recent type of distributional model, namely one that is not extracted from textual data but from image collections through automated visual feature extraction techniques. It has been argued that this new generation of image-based distributional models (Bruni et al., 2011; Bruni et al., 2012b; Feng and Lapata, 2010; Leong and Mihalcea, 2011) provides a more realistic view of meaning, since humans obviously acquire a large proportion of their semantic knowledge from perceptual data. The first question that we ask, thus, is whether the more \"grounded\" image-based models can help us in interpreting conceptual representations in the brain. More specifically, we will compare the performance of different image-based representations, and we will test whether text-and image-based representations are complementary, so that when used together they can better account for patterns in neural data. Finally, we will check for differences between anatomical regions in the degree to which text and/or image models are effective, as one might expect given the well-known functional specializations of different anatomical regions. Brain data We use the data that were recorded and preprocessed by Mitchell et al. (2008) , available for download in their supporting online material. 1 Full details of the experimental protocol, data acquisition and preprocessing can be found in Mitchell et al. (2008) and the supporting material. Key points are that there were nine right-handed adult participants (5 female, age between 18 and 32). The experimental task was to actively think about the properties of sixty objects that were presented visually, each as a line drawing in combination with a text label. The entire set of objects was presented in a random order in six sessions, each object remained on screen for 3 seconds with a seven second fixation gap between presenta-tions. Mitchell and colleagues examined 12 categories, five objects per category, for a total of 60 concepts (words). Due to coverage limitations, we use 51/60 words representing 11/12 categories. Table 1 contains the full list of 51 words organized by category. fMRI acquisition and preprocessing Mitchell et al. (2008) acquired functional images on a Siemens Allegra 3.0T scanner using a gradient echo EPI pulse sequence with TR=1000 ms, TE=30 ms and a 60 • angle. Seventeen 5-mm thick oblique-axial slices were imaged with a gap of 1-mm between slices. The acquisition matrix was 64×64 with 3.125×3.125×5-mm voxels. They subsequently corrected data for slice timing, motion, linear trend, and performed temporal smoothing with a high-pass filter at 190s cutoff. The data were normalized to the MNI template brain image, spatially normalized into MNI space and resampled to 3×3×6 mm 3 voxels. The voxel-wise percent signal change relative to the fixation condition was computed for each object presentation. The mean of the four images acquired 4s post stimulus presentation was used for analysis. To create a single representation per object per participant, we took the voxel-wise mean of the six presentations of each word. Likewise to create a single representation per category per participant, we took the voxel-wise mean of all word models per category, per participant. Anatomical parcellation Analysis was conducted on the whole brain, and to address the question of whether there are differences in models' effectiveness between anatomical regions, brains were further partitioned into frontal, parietal, temporal and occipital lobes. This partitioning is coarse (each lobe is large and serves many diverse functions), but, for an initial test, appropriate, given that each lobe has specialisms that on face value are amenable to interpretation by our different distributional models and the exact nature of specialist processing in localised areas is often subject to debate (so being overly restrictive may be risky). Formulation of the distributional models is described in detail in the Section 3, but for now it is sufficient to know that the Object model is derived from image statistics of the object depicted in images, Context from image statistics of the background scene, Object&Context is a com- The occipital lobe houses the primary visual processing system and consequently it is reasonable to expect some bias toward image-based semantic models. Furthermore, given that experimental stimuli incorporated line drawings of the object,and the visual cortex has a well-established role in processing low-level visual statistics including edge detection (Bruce et al., 2003) , we naturally expected a good performance from Object (formulated from edge orientation histograms of similar objects). Following Goodale and Milner (1992) 's influential perception-action model (see McIntosh and Schenk (2009) for recent discussion), visual information is channeled from the occipital lobe in two streams: a perceptual stream, serving object identification and recognition; and an action stream, specialist in processing egocentric spatial relationships and ultimately supporting interaction with the world. The perceptual stream leads to the temporal lobe. Here the fusiform gyrus (shared with the occipital lobe) plays a general role in object categorisation (e.g., animals and tools (Chao et al., 1999) , faces (Kanwisher and Yovel, 2006) , body parts (Peelen and Downing, 2005) and even word form perception (McCandliss et al., 2003) ). As the parahippocampus is strongly associated with scene representation (Epstein, 2008) , we expect both the Object and Context models to capture variability in the temporal lobe. Of wider relevance to semantic processing, the medial temporal gyrus, inferior temporal gyrus and ventral temporal lobe have generally been implicated to have roles in supramodal integration and concept retrieval (Binder et al., 2009) . Given this, we expected that incorporating text would also be valuable and that the Window2&Object&Context combination would be a good model. The visual action stream leads from the occipital lobe to the parietal lobe to support spatial cognition tasks and action control (Sack, 2009) . In that there seems to be an egocentric frame of reference, placing actor in environment, it is tempting to speculate that the Context model is more appropriate than the Object model here. As the parietal lobe also contains the angular gyrus, thought to be involved in complex, supra-modal information integration and knowledge retrieval (Binder et al., 2009) , we might again forecast that integrating text and image information would boost performance, so Window2&Context was earmarked as a strong candidate. The frontal lobe, is traditionally associated with high-level processing and manipulation of abstract knowledge and rules and controlled behaviour (Miller et al., 2002) . Regarding semantics, the dorsomedial prefrontal cortex has been implicated in self-guided retrieval of semantic information (e.g., uncued speech production), the ventromedial prefrontal cortex in motivation and emotional processing, the inferior frontal gyrus in phonological and syntactic processing, (Binder et al., 2009) and integration of lexical information (Hagoort, 2005) . Given the association with linguistic processing we anticipated a bias in favour of Window2. The four lobes were identified and partitioned using Tzourio-Mazoyer et al. (2002) 's automatic anatomical labelling scheme. Voxel selection The set of 500 most stable voxels, both within the whole brain and from within each region of interest were identified for analysis. The most stable voxels were those showing consistent variation across the different stimuli between scanning sessions. Specifically, and following a similar strategy to Mitchell et al. (2008) , for each voxel, the set of 51 words from each unique pair of scanning sessions were correlated using Pearson's correlation (6 sessions and therefore 15 unique pairs), and the mean of the 15 resulting correlation coefficients was taken as the measure of stability. The 500 voxels with highest mean correlations were selected. Distributional models Distributional semantic models approximate word meaning by keeping track of word co-occurrence statistics from large textual input, relying on the distributional hypothesis: The meaning of a word can be induced by the context in which it occurs (Turney and Pantel, 2010) . Despite their great success, these models still rely on verbal input only, while humans base their meaning representation also on perceptual information (Louwerse, 2011) . Thanks to recent developments in computer vision, it is nowadays possible to take the visual perceptual channel into account, and build new computational models of semantics enhanced with visual information (Feng and Lapata, 2010; Bruni et al., 2011; Leong and Mihalcea, 2011; Bergsma and Goebel, 2011; Bruni et al., 2012a) . Given a set of target concepts and a collection of images depicting those concepts, it is indeed possible to first encode the image content into low-level features, and subsequently convert it into a higher-level representation based on the bag-of-visual-words method (Grauman and Leibe, 2011) . Recently, Bruni et al. (2012b) have shown that better semantic representations can be extracted if we first localize the concept in the image, and then extract distinct higher-level features (visual words) from the box containing the concept and from the surrounding context. We also follow this strategy here. In our experiments we utilize both traditional textbased models and experimental image-based models, as well as their combination. Textual models Verb We experiment with the original text-based semantic model used to predict fMRI patterns by Mitchell et al. (2008) . Each object stimulus word is represented as a 25-dimensional vector, with each value corresponding to the normalized sentencewide co-occurrence of that word with one of 25 manually-picked sensorimotor verbs (such as see, hear, eat, . . . ) in a trillion word text corpus. Window2 To create this model, we collect text co-occurrence statistics from the freely available ukWaC and Wackypedia corpora combined (about 3 billion words in total). 2 As collocates of our distributional model we select a set of 30K words, namely the top 20K most frequent nouns, 5K most frequent adjectives and 5K most frequent verbs. In the tradition of HAL (Lund and Burgess, 1996) , the model is based on co-occurrence statistics with collocates within a fixed-size window of 2 to the left and right of each target word. Despite their simplicity, narrow-window-based models have shown to achieve state-of-the-art results in various standard semantic tasks (Bullinaria and Levy, 2007) and to outperform both document-based and syntaxbased models trained on the same corpus (Bruni et al., 2012a) . Moreover, in Murphy et al. (2012) a window-based model very similar to ours was not significantly worse than their best model for brain decoding. We tried also a few variations, e.g., using a larger window or different transformations on the raw co-occurrences from those presented below, but with little, insignificant changes in performance. Given that our focus here is on visual information, we only report results for Window2 and its combination with visual models. Visual models Our visual models are inspired by Bruni et al. (2012b) , that have explored to what extent extracting features from images where objects are localized results in better semantic representations. They found that extracting visual features separately from the object and its surrounding context leads to better performance than not using localization, and using only object-and, more surprisingly, contextextracted features also results in performant models (especially when evaluating inter-object similarity, the context in which an object is located can significantly contribute to semantic representation, in certain cases carrying even more information than the depicted object itself). More in detail, with localization the visual features (visual words) can be extracted from the object bounding box (in our experiments, the Object model) or from only outside the object box (the Context model). A combined model is obtained by concatenating the two feature vectors (the Ob-ject&Context model). Visual model construction pipeline To extract visual co-occurrence statistics, we use images from ImageNet (Deng et al., 2009) , 3 a very large image database organized on top of the WordNet hierarchy (Fellbaum, 1998) . ImageNet has more than 14 million images, covering 21K WordNet nominal synsets. ImageNet stands out for the high quality of its images, both in terms of resolution and concept annotations. Moreover, for around 3K concepts, annotations of object bounding boxes is provided. This last feature allows us to exploit object localization within our experiments. To build visual distributional models, we utilize the bag-of-visual-words (BoVW) representation of images (Sivic and Zisserman, 2003; Csurka et al., 2004) . Inspired by NLP, BoVW discretizes the image content in terms of a histogram of visual word counts. Differently from NLP, in vision there is not a natural notion of visual words, hence a visual vocabulary has to be built from scratch. The process works as follows. First, a large set of low-level features is extracted from a corpus of images. The low-level feature vectors are subsequently clustered into different regions (visual words). Given then a new image, each of the low-level feature vectors extracted from the patches that compose it is mapped to the nearest visual word (e.g., in terms of Euclidean distance from the cluster centroid) such that the image can be represented with a histogram counting the instances of each visual word in the image. As low-level features we use SIFT, the Scale Invariant Feature Transform (Lowe, 2004) . SIFT features are good at capturing parts of objects and are designed to be invariant to image transformations 3 http://www.image-net.org/ such as change in scale, rotation and illumination. To construct the visual vocabulary, we cluster the SIFT features into 25K different clusters. 4 We add also spatial information by dividing the image into several subregions, representing each of them in terms of BoVW and then stacking the resulting histograms (Lazebnik et al., 2006) . We use in total 8 different regions, obtaining a final vector of 200K dimensions (25K visual words × 8 regions). Since each concept in our dataset is represented by multiple images, we pool the visual word occurrences across images by summing them up into a single vector. To perform the entire visual pipeline we use VSEM, an open library for visual semantics (Bruni et al., 2013 ). 5 Model transformations and combination Once both the textual and the visual models are built, we perform two different transformations on the raw co-occurrence counts. First, we transform them into nonnegative Pointwise Mutual Information (PMI) association scores (Church and Hanks, 1990) . As a second transformation, we apply dimensionality reduction to the two matrices. In particular, we adopt the Singular Value Decomposition (SVD), one of the most effective methods to approximate the original data in lower dimensionality space (Schütze, 1997) , and reduce the vectors to 50 dimensions. To combine text-and image-based semantic models in a joint representation, we separately normalize their vectors to unit length, and concatenate them, along the lines of Bruni et al. (2011) . More sophisticated combination models have been proposed in the recent literature on multimodal semantics. For example, Bruni et al. (2012a) use SVD as a mixing strategy, given its ability to smooth the matrices and uncover latent dimensions. Another example is Silberer and Lapata (2013) , where Canonical Correlation Analysis is used. We reserve the exploration of more advanced combination methods for further studies. Finally, to represent the 11 categories we experiment with (see Table 1 ), we average the vectors of the concepts they include. Experiments A question is posed over how to evaluate the relationship between the different distributional models and brain data. Comparing each model's predictive performance using the same strategy as Mitchell et al. (2008) (also followed by Murphy et al. (2012) ) is one possibility: they used multiple regression to relate distributional codes to individual voxel activations, thus allowing brain states to be estimated from previously unseen distributional codes. Regression models were trained on 58/60 words and in testing the regression models estimated the brain state associated with the 2 unseen distributional codes. The predicted brain states were compared with the actual fMRI data, and the process repeated for each permutation of left-out words, to build a metric of prediction accuracy. For our purposes, a fair comparison of models using this strategy is complicated by differences in dimensionality between both semantic models and lobes (which we compare to other lobes) in association with the comparatively small number of words in the fMRI data set. Large dimensionality models risk overfitting the data, and it is a nuisance to try to reliably correct for the effects of overfitting in performance comparisons. Not least, to thoroughly evaluate all possible cross-validation permutations is demanding in processing time, and we have many models to compare. An alternative approach, and that which we have adopted, is representational similarity analysis (Kriegeskorte et al., 2008) . Representational similarity analysis circumvents the previous problems by abstracting each fMRI/distributional data source to a common structure capturing the interrelationships between each pair of data items (e.g., words). Specifically, for each model/participant's fMRI data/anatomical region, the similarity structure was evaluated by taking the pairwise correlation (Pearson's correlation coefficient) between all unique category or word combinations. This produced a list of 55 category pair correlations and 121 word pair correlations for each data source. For all brain data, correlation lists were averaged across the nine participants to produce a single list of mean word pair correlations and a single list of mean category pair correlations for each anatomical region and the whole brain. Then to provide a measure of similarity between models and brain data, the correlation lists for respective data sources were themselves correlated using Spearman's rank correlation. Statistical significance was tested using a permutation test: The word-pair (or category-pair) labels were randomly shuffled 10,000 times to estimate a null distribution when the two similarity lists are not correlated. The p-value is calculated as the proportion of random correlation coefficients that are greater than or equal to the observed coefficient. Results Category-level analyses Do image models correlate with brain data? Table 2 displays results of Spearman's correlations between the per-category similarity structure of distributional models and brain data. There is a significant correlation between every purely imagebased model and the occipital, parietal and temporal lobes, and also the whole brain (.38≤ ρ ≥.51, all p ≤.01). The frontal lobe is less well described. Still, whilst not significant, correlations are only marginally above the conventional p = .05 cutoff (all are less than p = .064). This strongly suggests that the answer to our first question is yes: distributional models derived from images can be used to explain concept fMRI data. Otherwise Window2 significantly correlates with the whole brain and all anatomical regions except for the frontal lobe where ρ=.34, p = .07. In contrast Verb (the original, partially hand-crafted model used by Mitchell and colleagues) captures inter-relationships poorly and neither correlates with the whole brain or any lobe. Do different models correlate with different anatomical regions? 2-way ANOVA without replication was used to test for differences in correlation coefficients between the five pure-modality models (Verb, Window2, Object, , and the four brain lobes. This revealed a highly significant difference between models F(4,12)=45.2, p<.001. Post-hoc 2-tailed t-tests comparing model pairs found that Verb differed significantly from all other models (correlations were lower). There was a clear difference even when Verb (mean±sd over lobes = .1±.1) was compared to the second weakest model, Object (mean±sd=.4±.09), where t =-7.7, p <.01, df=4. 0.39 (0.04) 0.57 (0.00) 0.53 (0.00) 0.55 (0.00) 0.51 (0.00) Window2&Object&Context 0.37 (0.04) 0.52 (0.00) 0.55 (0.00) 0.55 (0.00) 0.53 (0.00) Table 2 : Matrix of correlations between each pairwise combination of distributional semantic models and brain data. Correlations correspond to the pairwise similarity between the 11 categories. In each column the first value corresponds to Spearman's rank correlation coefficient and the value in parenthesis is the p-value. Frontal Parietal Occipital Temporal Whole-Brain Verb -0.04 (0.72) 0.09 (0.06) 0.07 (0.20) 0.03 (0.31) 0.07 (0.18) Window2 0.07 (0.13) 0.19 (0.00) 0.12 (0.06) 0.21 (0.00) 0.13 (0.04) Object 0.01 (0.40) 0.08 (0.07) 0.17 (0.01) 0.18 (0.00) 0.17 (0.01) Context 0.04 (0.24) 0.14 (0.01) 0.01 (0.44) 0.12 (0.02) 0.02 (0.38) Object&Context 0.03 (0.31) 0.13 (0.01) 0.10 (0.07) 0.17 (0.00) 0.11 (0.06) Window2&Object 0.04 (0.24) 0.16 (0.00) 0.16 (0.01) 0.23 (0.00) 0.17 (0.00) Window2&Context 0.07 (0.12) 0.20 (0.00) 0.09 (0.11) 0.22 (0.00) 0.11 (0.07) Window2&Object&Context 0.05 (0.18) 0.18 (0.00) 0.12 (0.05) 0.23 (0.00) 0.13 (0.02) Table 3 : Matrix of correlations between each pairwise combination of distributional semantic models and brain data. Correlations correspond to the pairwise similarity between the 51 words. In each column the first value corresponds to Spearman's rank correlation coefficient and the value in parenthesis is the p-value. other significant differences between models. However there was a highly significant difference between lobes F(3,12)=13.77, p <.001. Post-hoc 2tailed t-tests comparing lobe pairs found that the frontal lobe yielded significantly different correlations (lower) than each other lobe. When the frontal lobe (mean±sd over models = .25±.14) was compared to the second weakest anatomical region, the parietal lobe (mean±sd=.38±.19), the difference was highly significant, t =-8, df=3, p <.01. This introduces the question of whether this difference in correlations is the result of differences in neural category organisation and representation, or differences in the quality of the signal, which we address next. Category-level inter-correlations between lobes were all relatively strong and highly significant. The occipital lobe was found to be the most distinct, being similar to the temporal lobe (ρ=.71, p <.001), but less so to the parietal and frontal lobes (ρ=.53, p <.001 and ρ=.57, p <.001 respectively). The temporal lobe shows roughly similar levels of correlation to each other lobe (all .71≤ ρ ≥.73, all p <.001). The frontal and parietal lobes are related most strongly to each other (ρ=.77, p <.001), to a slightly lesser extent to the temporal lobe (in both cases ρ=.73, p <.001) and least so to the occipital lobe. These strong relationships are consistent with there being a broadly similar category organisation across lobes. To appraise this assertion in the context of the previously detected difference between the frontal lobe and all other lobes, we examine the raw category pair similarity matrices derived from the occipital lobe and the frontal lobe (Figure 1 ). All the below observations are qualitative. Although it is difficult to have intuitions about the relative differences between all category pairs (e.g., whether tools or furniture should be more similar to animals), we might reasonably expect some obvious similarities. For instance, for animals to be visually similar to in-sects and clothing, because all have legs and arms and curves (of course we would not expect a strong relationship between insects and clothes in function or other modalities such as sound), buildings to be similar to building parts and vehicles (hard edges and windows), building parts to be similar to furniture (e.g., from Table 1 we see there is some overlap in category membership between these categories, such as closet and door) and tools to be similar to kitchen utensils. All of these relationships are maintained in the occipital lobe, and many are visible in the frontal lobe (including the similarity between insects and clothes), however there are exceptions that are difficult to explain e.g., within the frontal lobe, building parts are not similar to furniture, kitchen utensils are closer to clothing than to tools and vehicles are more similar to clothing than anything else. As such we conclude that category-level representations were similar across lobes with differences likely due to variation in signal quality between lobes. Are text-and image-based semantic models complementary? Turning to the question of whether text-and image-derived semantic information can be complementary, we observe from Table 2 that there is not a single instance of a joint model with a weaker correlation than its pure-image counterpart. The Window2 model showed a stronger correlation than the Window2&Object model for the frontal and parietal lobes, but was weaker than Win-dow2&Object&Context and Window2&Context in all tests and was also weaker than any joint model in whole-brain comparisons. The mean±sd correlations for all purely image-based results pooled over lobes (3 models * 4 lobes) was .42±.08 in comparison to .49±.08 for the joint models. The relative performance of Object vs. Context vs. Ob-ject&Context on the four different lobes is preserved between image-based and joint models: correlating the 12 combinations using Spearman's correlation gives ρ=.85, p <.001. Differences can be statistically quantified by pooling all image related correlation coefficients for each anatomical region (3 models * 4 regions), as for the respective joint models, and comparing with a 2-tailed Wilcoxon signed rank test. Differences were highly significant (W=0, p <.001,n=12). This evidence accumulates to sug- gest that text and image-derived semantic information can be complementary in interpreting concept fMRI data. Word-level analyses Do image models capture word pair similarities? Per-word results generally corroborate the relationships observed in the previous section in the sense that Spearman's correlation between perword and per-category results for the 40 combinations of models and lobes was ρ=.78, p <.001. There were differences, most obviously a dramatic drop in the strength of correlation coefficients for the per-word results, visible in Table 3 . Subsets of per-word image-based models correlated with three lobes and the whole brain. Correlations corresponding to significance values of p <.05 were observed in the temporal and parietal lobes, for Context, Object&Context and Window2 whereas Object was correlated with the occipital and temporal lobes (p <.05). 2-way ANOVA without replication was used to test for differences between models and lobes. This revealed a significant difference between models (F(4,12)=4.05, p =.027). Posthoc t-tests showed that the Window2 model significantly differed from (was stronger than) the Context (t=3.8, p =.03, df=3) and Object&Context models (t =4.5, p =.02, df=3). There were no other significant differences between models. There was again a significant difference between lobes (F(3,12)=7.89, p < .01), with the frontal lobe showing the weakest correlations. Post-hoc 2-tailed t-tests comparing lobe-pairs found that the frontal lobe differed significantly (correlations were weaker) from the parietal (t =-9, p <.001, df=4) and temporal lobes (t =-6.4, p <.01, df=4) but not from the occipital lobe (t =-2.18, p =.09, df=4). No other significant differences between lobes were observed. Are there differences between models/lobes? Word-level inter-correlations between lobes were all significant and the pattern of differences in correlation strength largely resembled that of the categorylevel analyses. The occipital lobe was again most similar to the temporal lobe (ρ=.57, p <.001), but less so to the parietal and frontal lobes (ρ=.47, p <.001 and ρ=.34, p <.001 respectively). The temporal lobe this time showed stronger correlation to the parietal (ρ=.68, p <.001) and frontal lobes (ρ=.61, p <.001) than the occipital lobe. The frontal and parietal lobes were again strongly related to one another (ρ=.67, p <.001). These results echo the category-level findings, that word-level brain activity is also organised in a similar way across lobes. Consequently this diminishes our chances of uncovering neat interactions between models and brain areas (where for instance the Window2 model correlates with the frontal lobe and Object model matches the occipital lobe). It is however noteworthy that we can observe some interpretable selectivity in lobe*model combinations. In particular the Context model better matches the parietal lobe than the Object model, which in turn better captures the occipital and temporal lobes (Observations are qualitative). Also as we see next, adding text information boosts performance in both parietal and temporal lobes (see Section 2 on our expectations about information encoded in the lobes). Does joining text and image models help wordlevel interpretation? As concerns the benefits of joining Text and Image information, per-word joint models were generally stronger than the respective image-based models. There was one exception: adding text to the Object model weakened correlation with the occipital lobe. Joint models were exclusively stronger than Window2 for the temporal and occipital lobes, and were stronger in 1/3 of cases for the frontal and parietal lobes. In an analogous comparison to the per-category analysis, a Wilcoxon signed rank test was used to examine the difference made by adding text information to image models (pooling 3 models over 4 anatomical areas for both image and joint models). The mean±sd of image models was .1±.06 whereas for Joint models it was .15±.07. The difference was highly significant (W=1, p <.001, n=12). Conclusion This study brought together, for the first time, two recent research lines: The exploration of \"semantic spaces\" in the brain using distributional semantic models extracted from corpora, and the extension of the latter to image-based features. We showed that image-based distributional semantic measures significantly correlate with fMRI-based neural similarity patterns pertaining to categories of concrete concepts as well as concrete basic-level concepts expressed by specific words (although correlations, especially at the basic-concept level, are rather low, which might signify the need to develop still more performant distributional models and/or noise inherent to neural data). Moreover, image-based models complement a state-of-the-art text-based model, with the best performance achieved when the two modalities are combined. This not only presents an optimistic outlook for the future use of image-based models as an interpretative tool to explore issues of cognitive grounding, but also demonstrates that they are capturing useful additional aspects of meaning to the text models, which are likely relevant for computational semantic tasks. The weak comparative performance of the original Mitchell et al.'s Verb model is perhaps surprising given its previous success in prediction (Mitchell et al., 2008) , but a useful reminder that a good predictor does not necessarily have to capture the internal structure of the data it predicts. The lack of finding organisational differences between anatomical regions differentially described by the various models is perhaps disappointing, but not uncontroversial, given that the dataset was not originally designed to tease apart visual information from linguistic context. It is however interesting that in the more challenging word-level analysis some meaningful trend was visible. In future experiments it may prove valuable to configure a fMRI stimulus set where text-based and image-based interrelationships are maximally different. Collecting our own fMRI data will also allow us to move beyond exploratory analysis, to test sharper predictions about distributional models and their brain area correlates. There are also many opportunities for focusing analyses on different subsets of brain regions, with the semantic system identified by Binder et al. (2009) in particular presenting one interesting avenue for investigation. Acknowledgments This research was partially funded by a Google Research Award to the fifth author. Animals",
    "abstract": "Traditional distributional semantic models extract word meaning representations from cooccurrence patterns of words in text corpora. Recently, the distributional approach has been extended to models that record the cooccurrence of words with visual features in image collections. These image-based models should be complementary to text-based ones, providing a more cognitively plausible view of meaning grounded in visual perception. In this study, we test whether image-based models capture the semantic patterns that emerge from fMRI recordings of the neural signal. Our results indicate that, indeed, there is a significant correlation between image-based and brain-based semantic similarities, and that image-based models complement text-based ones, so that the best correlations are achieved when the two modalities are combined. Despite some unsatisfactory, but explained outcomes (in particular, failure to detect differential association of models with brain areas), the results show, on the one hand, that imagebased distributional semantic models can be a precious new tool to explore semantic representation in the brain, and, on the other, that neural data can be used as the ultimate test set to validate artificial semantic models in terms of their cognitive plausibility.",
    "countries": [
        "Italy"
    ],
    "languages": [],
    "numcitedby": "45",
    "year": "2013",
    "month": "October",
    "title": "Of Words, Eyes and Brains: Correlating Image-Based Distributional Semantic Models with Neural Representations of Concepts"
}