{
    "article": "Various studies highlighted that topicbased approaches give a powerful spoken content representation of documents. Nonetheless, these documents may contain more than one main theme, and their automatic transcription inevitably contains errors. In this study, we propose an original and promising framework based on a compact representation of a textual document, to solve issues related to topic space granularity. Firstly, various topic spaces are estimated with different numbers of classes from a Latent Dirichlet Allocation. Then, this multiple topic space representation is compacted into an elementary segment, called c-vector, originally developed in the context of speaker recognition. Experiments are conducted on the DECODA corpus of conversations. Results show the effectiveness of the proposed multi-view compact representation paradigm. Our identification system reaches an accuracy of 85%, with a significant gain of 9 points compared to the baseline (best single topic space configuration). Introduction Automatic Speech Recognition (ASR) systems frequently fail on noisy conditions and high Word Error Rates (WER) make the analysis of the automatic transcriptions difficult. Speech analytics suffer from these transcription issues that may be overcome by improving the ASR robustness and/or the tolerance of speech analytic systems to ASR errors. This paper proposes a new method to improve the robustness of speech analytics by combining a semantic multi-model approach and a noise reduction technique based on the i-vector paradigm. This method is evaluated in the application framework of the RATP call centre (Paris Public Transportation Authority), focusing on the theme identification task (Bechet et al., 2012) . Telephone conversations are a particular case of human-human interaction whose automatic processing raises problems, especially due to the speech recognition step required to obtain the transcription of the speech contents. First, the speaker's behavior may be unexpected and the training/test mismatch may be very large. Second, the speech signal may be strongly impacted by various sources of variability: environment and channel noises, acquisition devices, etc. Telephone conversation issues Topics are related to the reason why the customer called. Various classes corresponding to the main customer's requests are considered (lost and founds, traffic state, timelines, etc). In addition to classical issues in such adverse conditions, the topic-identification system should deal with problems related to class proximity. For example, a lost & found request is related to itinerary (where was the object lost?) or timeline (when?), that could appear in most of the classes. In fact, these conversations involve a relatively small set of basic concepts related to transportation issues. Figure 1 shows an example of a dialogue which is manually labeled by the agent as an issue related to an infraction. However, words in bold suggest that this conversation could be related to a transportation card. Thus, we assume that a dialogue representation should be seen as a multi-view problem to substantiate the claims regarding the multi-theme representation of a given dialogue. On the other hand, multi-view approaches introduce additional variability due to the diversity of the views. This variability is also due to the vocabulary used by both agent and customer during a telephone conversation. Indeed, an agent have to follow an predefined scenario of conversation. Thus, the agent can find the main reason for the call which corresponds to the theme. Proposed solutions An efficient way to tackle both ASR robustness and class ambiguity could be to map dialogues into a topic space abstracting the ASR outputs. Then, dialogue categorization is achieved in this topic space. Numerous unsupervised methods for topic-space estimation were proposed in the past. Latent Dirichlet Allocation (LDA) (Blei et al., 2003) has been largely used for speech analytics; one of its main drawbacks is the tuning of the model, that involves various meta-parameters such as the number of classes (that determines the model granularity), word distribution methods, temporal spans. . . If the decision process is highly dependent on these features, the system's performance could be quite unstable. Classically, this abstract representation involves selecting the right number of classes composing the topic space. This decision is crucial since topic model perplexity, which expresses its quality, is highly dependent on this feature. Furthermore, the multi-theme context of the study (see Figure 1 ) involves a more complex dialogue representation. In this paper, we propose to deal with these two drawbacks by using a compact representation from multiple topic spaces. This model is based on a robust multi-view representation of the textual documents. A multi-view representation of a dialogue introduces both a relevant variability needed to represent different contexts of the dialogue, and a noisy variability related to topic space processing. Thus, a topic-based representation of a dialogue is built from the dialogue content itself. For this reason, the mapping process of a dialogue into several topic spaces generates a noisy variability related to the difference between the dialogue and the content of each class. In the same way, the relevant variability comes from the common content between the dialogue and the classes composing the topic space. We propose to reduce the noisy variability by using a factor analysis technique, which was initially developed in the domain of speaker identification. In this field, the factor analysis paradigm is used as a decomposition model that enables to separate the representation space into two subspaces containing respectively useful and useless information. The general Joint Factor Analysis (JFA) paradigm (Kenny et al., 2008) considers multiple variabilities that may be cross-dependent. Therefore, JFA representation allows us to compensate the variability within sessions of a same speaker. This representation is an extension of the GMM-UBM (Gaussian Mixture Model-Universal Background Model) models (Reynolds and Rose, 1995) . (Dehak et al., 2011) extract a compact super-vector (called an i-vector) from the GMM super-vector. The aim of the compression process (i-vector extraction) is to represent the supervector variability in a low dimensional space. Although this compact representation is widely used in speaker recognition systems, this method has not been used yet in the field of text classification. In this paper, we propose to apply factor analysis to compensate noisy variabilities due to the multiplication of LDA models. Furthermore, a normalization approach to condition dialogue representations (multi-model and i-vector) is presented. The two methods showed improvements for speaker verification: within Class Covariance Normalization (WCCN) (Dehak et al., 2011) and Eigen Factor Radial (EFR) (Bousquet et al., 2011) . The latter includes length normalization (Garcia-Romero and Espy-Wilson, 2011) . Both methods dilate the total variability space as a means of reducing the within-class variability. In our multimodel representation, the within class variability is redefined according to both dialogue content (vocabulary) and topic space characteristics (word distributions among the topics). Thus, the speaker is represented by a theme, and the speaker session is a set of topic-based representations (frames) of a dialogue (session). The paper is organized as follows. Section 2 presents previous related works. The dialogue representation is described in Section 3. Section 4 introduces the i-vector compact representation and presents its application to text documents. Sections 5 and 6 report experiments and results. The last section concludes and proposes some perspectives. Related work In the past, several approaches considered a text document as a mixture of latent topics. These methods, such as Latent Semantic Analysis (LSA) (Deerwester et al., 1990; Bellegarda, 1997) , Probabilistic LSA (PLSA) (Hofmann, 1999) or Latent Dirichlet Allocation (LDA) (Blei et al., 2003) , build a higher-level representation of the document in a topic space. ¿ Document is then considered as a bag-of-words (Salton, 1989) where the word order is not taken into account. These methods have demonstrated their performance on various tasks, such as sentence (Bellegarda, 2000) or keyword (Suzuki et al., 1998) extraction. In opposition to a multinomial mixture model, LDA considers that a theme is associated to each occurrence of a word composing the document, rather than associate a topic to the complete document. Therefore, a document can change topics from a word to another one. However, word occurrences are connected by a latent variable which controls the global match of the distribution of the topics in the document. These latent topics are characterized by a distribution of associated word probabilities. PLSA and LDA models have been shown to generally outperform LSA on IR tasks (Hofmann, 2001) . Moreover, LDA provides a direct estimate of the relevance of a topic given a word set. In this paper, probabilities of hidden topic features, estimated with LDA, are considered for possibly capturing word dependencies expressing the semantic contents of a given conversation. Topic-based approaches involve defining a number of topics composing the topic space. The choice of the \"right\" number of topics is a crucial step, especially when the documents may contain multiple themes. Many studies have tried to find a relevant method to deal with this issue. (Arun et al., 2010) proposed to use a Singular Value Decomposition (SVD) to represent the separability between the words contained in the vocabulary. Then, if the singular values of the topic-word matrix M equal the norm of the rows of M, this means that the vocabulary is well separated among the topics. This method has to be evaluated with the Kullback-Liebler divergence metric for each topic space. However, this process would be time consuming for thousands of representations of a dialogue. (Teh et al., 2004) proposed the Hierarchical Dirichlet Process (HDP) method to find the \"right\" number of topics by assuming that the data has a hierarchical structure. The HDP models were then compared to the LDA ones on the same dataset. (Zavitsanos et al., 2008) presented a method to learn the right depth of an ontology depending of the number of topics of LDA models. The study presented by (Cao et al., 2009) is quite similar to (Teh et al., 2004) . The authors consider the average correlation between pairs of topics at each stage as the right number of topics. All these methods assume that a document can have only one representation since they consider that finding the optimal topic model is the best solution. Another solution would be to consider a set of topic models to represent a document. Nonetheless, a multi-topic-based representation of a dialogue can involve a noisy variability due to the mapping of a dialogue in each topic space. Indeed, a dialogue does not share its content (i.e. words) with each class composing the topic space. Thus, a variability is added during the mapping process. Another weakness of the multi-view representation is the relation between classes in a topic space. (Blei and Lafferty, 2006) show that classes into a LDA topic space are correlated. Moreover, (Li and McCallum, 2006) consider a class as a node of an acyclic graph and as a distribution over other classes contained in the same topic space. Multi-view representation of automatic dialogue transcriptions in a homogeneous space The purpose of the considered application is the identification of the major theme of a humanhuman telephone conversation in the customer care service (CCS) of the RATP Paris transportation system. The approach considered in this paper focuses on modeling the variability between different dialogues expressing the same theme t. For this purpose, it is important to select relevant features that represent semantic contents for the theme of a dialogue. An attractive set of features for capturing possible semantically relevant word dependencies is obtained with Latent Dirichlet Allocation (LDA) (Blei et al., 2003) , as described in section 2. Given a training set of conversations D, a hidden topic space is derived and a conversation d is represented by its probability in each topic of the hidden space. Estimation of these probabilities is affected by a variability inherent to the estimation of the model parameters. If many hidden spaces are considered and features are computed for each hidden space, it is possible to model the estimation variability together with the variability of the linguistic expression of a theme by different speakers in different real-life situations. Even if the purpose of the application is theme identification and a training corpus annotated with themes is available, supervised LDA (Griffiths and Steyvers, 2004 ) is not suitable for the proposed approach. LDA is used only for producing different feature sets used involved in statistical variability models. In order to estimate the parameters of different hidden spaces, a set of discriminative words V is constructed as described in (Morchid et al., 2014a) . Each theme t contains a set of specific words. Note that the same word may appear in several discriminative word sets. All the selected words are then merged without repetition to form V . Several techniques, such as Variational Methods (Blei et al., 2003) , Expectation-propagation (Minka and Lafferty, 2002) or Gibbs Sampling (Griffiths and Steyvers, 2004), have been proposed for estimating the parameters describing a LDA hidden space. Gibbs Sampling is a special case of Markov-chain Monte Carlo (MCMC) (Geman and Geman, 1984) and gives a simple algorithm for approximate inference in high-dimensional models such as LDA (Heinrich, 2005) . This overcomes the difficulty to directly and exactly estimate parameters that maximize the likelihood of the whole data collection defined as:  ... In the LDA technique, topic z j , j is drawn from a multinomial over θ which is drawn from a Dirichlet distribution over − → α . Thus, a set of p topic spaces are learned using LDA by varying the number of topics n to obtain p topic spaces of size n. The number of topics n varies from 10 to 3, 010. Thus, a set of 3, 000 topic spaces is estimated. This is high enough to generate, for each dialogue, many feature sets for estimating the parameters of a variability model. The next process allows us to obtain a homogeneous representation of transcription d for the r th topic space r. The feature vector V z m d of d is mapped to the common vocabulary space V composed with a set of |V | discriminative words (Morchid et al., 2014a) of size 166, to obtain a new feature vector V w d,r = {P (w|d) r } w∈V of size |V | for the r th topic space r of size n where the i th (0 ≤ i ≤ |V |) feature is: p(W | − → α , − → β ) = w∈W p( − → w | − → α , − → β ) V w i d,r = P (w i |d) = n j=1 P (w i |z r j )P (z r j |d) = n j=1 V w i z r j × V z r j d = − − → V w i z r , − − → V z r d where •, • is the inner product, δ being the frequency of the term w i in d, V w i z r j = P (w i |z j ) and V z r j d = P (z j |d) evaluated using Gibbs Sampling in the topic space r. Compact multi-view representation In this section, an i-vector-based method to represent automatic transcriptions is presented. Initially introduced for speaker recognition, ivectors (Kenny et al., 2008) have become very popular in the field of speech processing and recent publications show that they are also reliable for language recognition (Martınez et al., 2011) and speaker diarization (Franco-Pedroso et al., 2010) . I-vectors are an elegant way of reducing the imput space dimensionality while retaining most of the relevant information. The technique was originally inspired by the Joint Factor Analysis framework (Kenny et al., 2007) . Hence, i-vectors convey the speaker characteristics among other information such as transmission channel, acoustic environment or phonetic content of speech segments. The next sections describe the i-vector extraction process, the application of this compact representation to textual documents (called c-vector), and the vector transformation with the EFR method and the Mahalanobis metric. Total variability space definition I-vector extraction could be seen as a probabilistic compression process that reduces the dimensionality of speech super-vectors according to a linear-Gaussian model. The speech (of a given speech recording) super-vector m s of concatenated GMM means is projected in a low dimensionality space, named Total Variability space, with: m (h,s) = m + Tx (h,s) , ( 1 ) where m is the mean super-vector of the UBM 1 . T is a low rank matrix (M D × R), where M is the number of Gaussians in the UBM and D is the cepstral feature size, which represents a basis of the reduced total variability space. T is named Total Variability matrix; the components of x (h,s) are the total factors which represent the coordinates of the speech recording in the reduced total variability space called i-vector (i for identification). 4.2 From i-vector speaker identification to c-vector textual document classification The proposed approach uses i-vectors to model transcription representation through each topic space in a homogeneous vocabulary space. These short segments are considered as basic semanticbased representation units. Indeed, vector V w d represents a segment or a session of a transcription d. In the following, (d, r) will indicate the dialogue representation d in the topic space r. In our model, the segment super-vector m (d,r) of a transcription d knowing a topic space r is modeled: m (d,r) = m + Tx (d,r) (2) where x (d,r) contains the coordinates of the topicbased representation of the dialogue in the reduced total variability space called c-vector (c for classification). Let N (d,r) and X (d,r) be two vectors containing the zero order and first order dialogue statistics respectively. The statistics are estimated against the UBM: N r [g] = t∈r γ g (t); {X (d,r) } [g] = t∈(d,r) γ g (t) • t (3) where γ g (t) is the a posteriori probability of Gaussian g for the observation t. In the equation, t∈(d,r) represents the sum over all the frames belonging to the dialogue d. Let X (d,r) be the state dependent statistics defined as follows: {X (d,r) } [g] ={X (d,r) } [g] − m [g] • (d,r) N (d,r) [g] (4) Let L (d,r) be a R × R matrix, and B (d,r) a vector Algorithm 1: Estimation algorithm of T and latent variable x. For each dialogue d mapped into the topic space r: x (d,r) ← 0, T ← random ; Estimate statistics: N (d,r) , X (d,r) (eq.3); for i = 1 to nb iterations do for all d and r do Center statistics: X (d,r) (eq.4); Estimate L (d,r) and B (d,r) (eq.5); Estimate x (d,r) (eq.6); end Estimate matrix T (eq. 7 and 8) ; end of dimension R, both defined as: L (d,r) = I + g∈UBM N (d,r) [g] • {T} t [g] • Σ −1 [g] • {T} [g] B (d,r) = g∈UBM {T} t [g] • Σ −1 g • {X (d,r) } [g] , (5) By using L (d,r) and B (d,r) , x (d,r) can be obtained using the following equation: x (d,r) = L −1 (d,r) • B (d,r) (6) The matrix T can be estimated line by line, with {T} i [g] being the i th line of {T} [g] then: T i [g] = LU −1 g • RU i g , (7) where RU i g and LU g are given by: LU g = (d,r) L −1 (d,r) + x (d,r) x t (d,r) • N (d,r) [g] RU i g = (d,r) {X (d,r) } [i] [g] • x (d,r) (8) Algorithm 1 presents the method adopted to estimate the multi-view variability dialogue matrix with the above developments where the standard likelihood function can be used to assess the convergence. One can refer to (Matrouf et al., 2007) to find out more about the implementation of the factor analysis. C-vector representation suffers from 3 raised cvector issues: (i) the c-vectors x of equation 2 have to be theoretically distributed among the normal distribution N (0, I), (ii) the \"radial\" effect should be removed, and (iii) the full rank total factor space should be used to apply discriminant transformations. The next section presents a solution to these 3 problems. C-vector standardization A solution to standardize c-vectors has been developed in (Bousquet et al., 2011) . The authors proposed to apply transformations for training and test transcription representations. The first step is to evaluate the empirical mean x and covariance matrix V of the training c-vector. Covariance matrix V is decomposed by diagonalization into: PDP T ( 9 ) where P is the eigenvector matrix of V and D is the diagonal version of V. A training i-vector x (d,r) is transformed in x (d,r) as follows: x (d,r) = D − 1 2 P T (x (d,r) − x) (x (d,r) − x) T V −1 (x (d,r) − x) ( 10 ) The numerator is equivalent by rotation to V − 1 2 (x (d,r) − x) and the Euclidean norm of x (d,r) is equal to 1. The same transformation is applied to the test c-vectors, using the training set parameters x and mean covariance Vas estimations of the test set of parameters. Figure 3 shows the transformation steps: (b) shows the rotation applied to the initial training set around the principal axes of the total variability when P T is applied; Figure 3-(c) shows the standardization of c-vectors when D − 1 2 is applied; and finally, Figure 3-(d) shows the cvector x (d,r) on the surface area of the unit hypersphere after a length normalization by a division of (x (d,r) − x) T V −1 (x (d,r) − x). Experimental Protocol The proposed c-vector representation of automatic transcriptions is evaluated in the context of the theme identification of a human-human telephone conversation in the customer care service (CCS) of the RATP Paris transportation system. The metric used to identify of the best theme is the Mahalanobis metric. Theme identification task The DECODA project corpus (Bechet et al., 2012) was designed to perform experiments on the identification of conversation themes. It is composed of 1,514 telephone conversations, corresponding to about 74 hours of signal, split into a training q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q −3 − 2 −1 0 1 2 3 −2 −1 0 1 2 a.Inital: M q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q −3 − 2 −1 0 1 2 3 −2 −1 0 1 2 b.Rotation: P t q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q −3 −2 −1 0 1 2 3 −2 −1 0 1 2 c.Standardization: D −1 2 q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q −3 −2 −1 0 1 2 3 −2 −1 0 1 2 d.Norm: (x − x) t V −1 (x − x) Figure 3 : Effect of the standardization with the EFR algorithm. set (740 dialogues), a development set (175 dialogues) and a test set (327 dialogues), and manually annotated with 8 conversation themes: problems of itinerary, lost and found, time schedules, transportation cards, state of the traffic, fares, infractions and special offers. An LDA model allowed us to elaborate 3,000 topics spaces by varying the number of topics from 10 to 3,010. A topic space having less than 10 topics is not suitable for a corpus of more than 700 dialogues (training set). For each theme {C i } 8 i=1 , a set of 50 specific words is identified. All the selected words are then merged without repetition to compose V , which is made of 166 words. The topic spaces are made with the LDA Mallet Java implementation 2 . The LIA-Speeral ASR system (Linarès et al., 2007) is used for the experiments. Acoustic model parameters were estimated from 150 hours of speech in telephone conditions. The vocabulary contains 5,782 words. A 3-gram language model (LM) was obtained by adapting a basic LM with the training set transcriptions. A \"stop list\" of 126 words 3 was used to remove unnecessary words (mainly function words), which results in a Word Error Rate (WER) of 33.8% on the training, 45.2% on the development, and 49.5% on the test. These high WER are mainly due to speech disfluencies and to adverse acoustic environments (for example, calls from noisy streets with mobile phones). Mahalanobis metric Given a new observation x, the goal of the task is to identify the theme belonging to x. Probabilistic approaches ignore the process by which c-vectors were extracted and they pretend instead they were generated by a prescribed generative model. Once a c-vector is obtained from a dialogue, its representation mechanism is ignored and it is regarded as an observation from a probabilistic generative model. The Mahalanobis scoring metric assigns a dialogue d with the most likely theme C. Given a training dataset of dialogues, let W denote the within dialogue covariance matrix defined by: W = K k=1 n t n W k = 1 n K k=1 nt i=0 x k i − x k x k i − x k t (11) where W k is the covariance matrix of the k th theme C k , n t is the number of utterances for the theme C k , n is the total number of dialogues, and x k is the centroid (mean) of all dialogues x k i of C k . Each dialogue does not contribute to the covariance in an equivalent way. For this reason, the term nt n is introduced in equation 11. If homoscedasticity (equality of the class covariances) and Gaussian conditional density models are assumed, a new observation x from the test dataset can be assigned to the most likely theme C k Bayes using the classifier based on the Bayes decision rule: C k Bayes = arg max k {N (x | x k , W)} = arg max k − 1 2 (x − x k ) t W −1 (x − x k ) + a k where W is the within theme covariance matrix defined in eq. 11; N denotes the normal distribution and a k = log (P (C k )). It is noted that, with these assumptions, the Bayesian approach is similar to Fisher's geometric approach: x is assigned to the class of the nearest centroid, according to the Mahalanobis metric (Xing et al., 2002) of W −1 : C k Bayes = arg max k − 1 2 ||x − x k || 2 W −1 + a k Experiments and results The proposed c-vector approach is applied to the same classification task and corpus proposed in (Morchid et al., 2014a; Morchid et al., 2014b; Morchid et al., 2013) (state-of-the-art in text classification in (Morchid et al., 2014a) ). Experiments are conducted using the multiple topic spaces estimated with an LDA approach. From these multiple topic spaces, a classical way is to find the one that reaches the best performance. Figure 4 presents the theme classification performance obtained on the development and test sets using various topic-based representation configurations with the EFR normalization algorithm (baseline). For sake of comparison, experiments are conducted using the automatic transcriptions only (ASR) only. The conditions indicated by the abbreviations between parentheses are considered for the development (Dev) and the test (Test) sets. Only homogenous conditions (ASR for both training and validations sets) are considered in this study. Authors in (Morchid et al., 2014a) notice that results collapse dramatically when heterogenous conditions are employed (TRS or TRS+ASR for training set and ASR for validation set). First of all, we can see that this baseline approach reached a classification accuracy of 83% and 76%, respectively on the development and the test sets. However, we note that the classification performance is rather unstable, and may completely change from a topic space configuration to another. The gap between the lower and the higher classification results is also important, with a difference of 25 points on the development set (the same trend is observed on the test set). As a result, finding the best topic space size seems crucial for this classification task, particularly in the context of highly imperfect automatic dialogue transcriptions containing more than one theme. The topic space that yields the best accuracy with the baseline method (n = 15 topics) is presented in Figure 5 . This figure presents each of the 15 topics and their 10 most representative words (highest P (w|z)). Several topics contain more or less the same representative words, such as topics 3, 6 and 9. This figure points out some interesting topics that allow us to distinguish a theme from the others. For example: • topics 2, 10 and 15 represent some words related to itinerary problems, • the transportation cards theme is mostly represented in topic 4 and 15 (Imagine and Navigo are names of transportation cards), • the words which represent the time schedules theme are contained in topic 5,6,7 and less in topic 9, • state of the traffic could be discussed with words such as: departure, line, service, day. These words and others are contained in topic 13, • topics 4 and 12 are related to the infractions theme with to words fine, pass, zone or ticket, • but topic 12 could be related to theme fares or special offers as well . Table 1 presents results obtained with the proposed c-vector approach coupled with the EFR algorithm. We can firstly note that this compact representation allows it to outperform the best topic space configuration (baseline), with a gain of 9.4 points on the development data and of 9 points on the test data. Moreover, if we consider the different c-vector configurations with the development  and test sets, the gap between accuracies is much smaller: classification accuracy does not go below 82.6%, while it reached 56% for the worst topic-based configuration. Indeed, as shown in Table 2, the difference between the maximum and the minimum theme classification accuracies is of 20% using the baseline approach while it is only of 2.4% using the c-vector method. We can conclude that this original c-vector approach allows one to better handle the variabilities  contained in dialogue conversations: in a classification context, better accuracy can be obtained and the results can be more consistent when varying the c-vector size and the number of Gaussians. Conclusions This paper presents an original multi-view representation of automatic speech dialogue transcriptions, and a fusion process with the use of a factor analysis method called i-vector. The first step of the proposed method is to represent a dialogue in multiple topic spaces of different sizes (i.e. number of topics). Then, a compact representation of the dialogue from the multiple views is processed to compensate the vocabulary and the variability of the topic-based representations. The effectiveness of the proposed approach is evaluated in a classification task of theme dialogue identification. Thus, the architecture of the system identifies conversation themes using the i-vector approach. This compact representation was initially developed for speaker recognition and we showed that it can be successfully applied to a text classification task. Indeed, this solution allowed the system to obtain better classification accuracy than with the use of the classical best topic space con-figuration. In fact, we highlighted that this original compact version of all topic-based representations of dialogues, called c-vector in this work, coupled with the EFR normalization algorithm, is a better solution to deal with dialogue variabilities (high word error rates, bad acoustic conditions, unusual word vocabulary, etc). This promising compact representation allows us to effectively solve both the difficult choice of the right number of topics and the multi-theme representation issue of particular textual documents. Finally, the classification accuracy reached 85% with a gain of 9 points compared to usual baseline (best topic space configuration). In a future work, we plan to evaluate this new representation of textual documents in other information retrieval tasks, such as keyword extraction or automatic summarization systems. Acknowledgements We thank the anonymous reviewers for their helpful comments. This work was funded by the SUMACC and ContNomina projects supported by the French National Research Agency (ANR) under contracts ANR-10-CORD-007 and ANR-12-BS02-0009.",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 1.0,
        "foundation": 0.0,
        "none": 5.51223498068687e-07
    },
    "reasoning": "Reasoning: The article explicitly mentions that the work was funded by the SUMACC and ContNomina projects supported by the French National Research Agency (ANR) under contracts ANR-10-CORD-007 and ANR-12-BS02-0009, which qualifies as a research agency. There is no mention of funding from defense, corporate entities, foundations, or an absence of funding.",
    "abstract": "Various studies highlighted that topicbased approaches give a powerful spoken content representation of documents. Nonetheless, these documents may contain more than one main theme, and their automatic transcription inevitably contains errors. In this study, we propose an original and promising framework based on a compact representation of a textual document, to solve issues related to topic space granularity. Firstly, various topic spaces are estimated with different numbers of classes from a Latent Dirichlet Allocation. Then, this multiple topic space representation is compacted into an elementary segment, called c-vector, originally developed in the context of speaker recognition. Experiments are conducted on the DECODA corpus of conversations. Results show the effectiveness of the proposed multi-view compact representation paradigm. Our identification system reaches an accuracy of 85%, with a significant gain of 9 points compared to the baseline (best single topic space configuration).",
    "countries": [
        "France",
        "Canada"
    ],
    "languages": [
        "French"
    ],
    "numcitedby": 14,
    "year": 2014,
    "month": "October",
    "title": "An {I}-vector Based Approach to Compact Multi-Granularity Topic Spaces Representation of Textual Documents",
    "values": {
        "building on past work": "In the past, several approaches considered a text document as a mixture of latent topics. Topic-based approaches involve defining a number of topics composing the topic space. The choice of the \"right\" number of topics is a crucial step, especially when the documents may contain multiple themes. Many studies have tried to find a relevant method to deal with this issue. Another solution would be to consider a set of topic models to represent a document. Nonetheless, a multi-topic-based representation of a dialogue can involve a noisy variability due to the mapping of a dialogue in each topic space.",
        "novelty": "     This model is based on a robust multi-view representation of the textual documents.     The first step of the proposed method is to represent a dialogue in multiple topic spaces of different sizes (i.e. number of topics).   Then, a compact representation of the dialogue from the multiple views is processed to compensate the vocabulary and the variability of the topic-based representations.   In fact, we highlighted that this original compact version of all topic-based representations of dialogues, called c-vector in this work, coupled with the EFR normalization algorithm, is a better solution to deal with dialogue variabilities (high word error rates, bad acoustic conditions, unusual word vocabulary, etc).   Finally, the classification accuracy reached 85% with a gain of 9 points compared to usual baseline (best topic space configuration).   This work was funded by the SUMACC and ContNomina projects supported by the French National Research Agency (ANR) under contracts ANR-10-CORD-007 and ANR-12-BS02-0009. ",
        "performance": "Finally, the classification accuracy reached 85% with a gain of 9 points compared to usual baseline (best topic space configuration)."
    }
}