{
    "article": "We compare the multinomial i-vector framework from the speech community with LDA, SAGE, and LSA as feature learners for topic ID on multinomial speech and text data. We also compare the learned representations in their ability to discover topics, quantified by distributional similarity to gold-standard topics and by human interpretability. We find that topic ID and topic discovery are competing objectives. We argue that LSA and i-vectors should be more widely considered by the text processing community as pre-processing steps for downstream tasks, and also speculate about speech processing tasks that could benefit from more interpretable representations like SAGE. Introduction The text processing and speech processing research communities have similar problems and goals, but the technical approaches in these two communities develop largely independently. In this paper we compare dimensionality reduction techniques on multinomial language data from the text and speech communities. We consider a multinomial formulation of the i-vector model (hereafter \"mi-vector\" model) from the speech community (Soufifar et al., 2011) , the sparse additive generative (SAGE) (Eisenstein et al., 2011) and latent Dirichlet allocation (LDA) (Blei et al., 2003b) topic models from the text community, and latent semantic analysis (LSA) (Deerwester et al., 1990) . Both the mi-vector model and the SAGE topic model represent a multinomial parameter vector as the softmax of a sum of vectors, one of which is a background vector representing overall word usage in the corpus, and so we might expect mi-vectors and SAGE to produce similar results on real-world data. We evaluate these two recent models and two more conventional models, LDA and LSA (a term describing a class of methods based on the singular value decomposition, or SVD, which is used broadly in both research communities). We assess the similarity of mi-vectors and SAGE and expose the strengths and weaknesses of all four learned representations by evaluating them on the supervised task of topic identification (topic ID), depicted in Figure 1 . We also evaluate the representations on the unsupervised, less easily-measurable task of topic discovery. As a proxy for controlled human annotations, we quantify topic discovery performance by distributional similarity to gold-standard topics. We use the bag-of-words multinomial representation of text data, i.e., each document is represented by a vector of counts over the word vocabulary. For speech data, we use a modern automatic speech recognition (ASR) system to produce frame-wise triphone state cluster posteriors and we take the sum of these posteriors across all frames in a document to obtain a documentlevel vector of triphone state cluster soft counts. Modern topic ID systems for speech use ASR output instead of a lower-resource representation like these soft counts to improve performance (Hazen et al., 2007) . ASR word counts are high-resource and can be viewed as a noisy version of word counts from text. We wish to assess the relative performance of our learned representations, not the quality of the data pre-processing scheme, and we desire to strengthen our results by evaluating performance on two distinct views of a corpus. Hence we break from convention and use triphone state cluster soft counts as speech data. While previous work has juxtaposed the mivector model against LDA (Chen et al., 2014; Morchid et al., 2014) , the current study is the first to provide cross-community evaluations of mi-vectors and a contemporaneous model from the text community on both text and speech data. This study is also novel in its direct application of the mi-vector model to topic ID and topic discovery, two separate tasks with different motivations and preferring different types of models, and in its use of low-resource triphone state cluster soft counts as speech data for topic ID. The lowresource setting reflects constraints often faced in real-world applications, and we report topic ID performance under limited supervision to better illuminate the practical strengths and weaknesses of the learned representations. Finally, we believe that the centralized comparison herein of several prominent learned representations on two complementary tasks on both text and speech will provide a useful point of reference for future research. Background Previous work has compared and composed the mi-vector model with older dimensionality reduction techniques, including LDA. Chen et al. ( 2014 ) compared a mi-vector language model against LDA and other models on the task of spoken document retrieval, and found the mi-vector model to significantly outperform the other models on words, but not on subwords (syllable pairs), derived from ASR. The syllable pairs are similar in granularity to the triphone state clusters used as multinomial speech data in the current work. Morchid et al. (2014) improved conversation theme identification by employing LDA and a Gaussian i-vector model in a pipeline. They learn LDA models of varying dimensions (numbers of topics) on ASR output and use them to generate a suite of feature vectors. The feature vector for each document-dimension pair is created by marginalizing over topics according to the document's inferred topic proportions. A Gaussian ivector model is then learned on those feature vectors; the i-vectors are normalized and used to iden-tify document themes via the Bayes decision rule. Note that we have fundamentally different approaches, goals and methodology from that of Morchid et al. (2014) . First, in an effort to provide a scientific comparison of independently created models, we use multinomial i-vectors, whereas Morchid et al., focusing on a particular task setting, used traditional Gaussian i-vectors. Similarly, while we treat multiple types of topic models as goals in their own rights, directly comparing SAGE and LDA, Morchid et al. use LDA as a pre-processing step to Gaussian i-vectors. Second, we use triphone state cluster soft counts instead of ASR word counts, hence our representation of speech data is significantly lower-resource. Third, we also evaluate performance on text data, and where Morchid et al. limit their vocabulary (from ASR) to 166 task-specific words, we use all 26,606 words present in our training data. Input Representations Our data is drawn from Part 1 of the Fisher English speech corpus (Cieri et al., 2004c) , which contains audio recordings (Cieri et al., 2004a) and manual transcriptions (Cieri et al., 2004b) of telephone conversations. Specifically, we use the topic ID training and evaluation test subsets defined in prior work (Hazen et al., 2007) . In each conversation in these subsets of the data, two study participants are prompted to speak on one of a predefined set of forty topics. There are 1374 training conversations and 686 test conversations. We represent each conversation by two documents, one for each side (speaker), resulting in a training set of 2748 documents and a test set of 1372 documents. The deep neural network (DNN) used to infer the triphone state cluster posteriors forming the basis of our speech data was trained on Parts 1 and 2 of the Fisher English speech corpus (Cieri et al., 2004a; Cieri et al., 2005) ; see the supplement for further The vertical lines are the respective upper bounds (entropy of the uniform distributions). The distribution of the entropy of the text documents has median 7.2, over seven bits away from the upper bound of 14.7, thus the text representation is approximately sparse. The speech distribution has median 11.6, within two bits of the upper bound of 12.9, thus the speech representation is nearly uniform. details about our dataset and ASR system. To quantify the sparsity of the raw text (word count) and speech (triphone state cluster soft count) representations, we consider the representation density (number of non-zero entries) on our training set. The text representation is sparse, with median density 292 and maximum 500 (out of 26,606 dimensions); the speech representation is dense, with median density 7586 and maximum 7591 (out of 7591 dimensions). To assess approximate sparsity, we plot histograms of the entropy of the normalized multinomial views of our training set in Figure 2 . The median entropy for speech is less than two bits away from the uniform entropy, so the speech data is neither sparse nor approximately sparse. Finally, we note that topic occurrence in the Fisher English training set is unbalanced, with quartiles (including minimum and maximum) of 6, 18.75, 29.5, 50.25, and 87. Learned Representations We consider four main dimensionality reduction models: the mi-vector model from the speech community, the SAGE and LDA topic models from the text community, and LSA. The learned representations we consider explain which words appear in a document d via a latent, lowerdimensional representation θ (d) . All representations operate under a bag-of-words assumption. To compare mi-vectors, topic models and LSA, we find it useful to formulate each learned representation as operating on different \"areas\" or \"contexts\" a of a document; such a formulation does not negate the fundamental bag-of-words assumption. The four models represent the words that appear in an area a-either the entire document or each token-via multinomial-style parameters φ (a) . 1,2 Each model consists of K components (e.g., a Kdimensional affine subspace), and shared parameters H k,v prescribe the amount of weight each component k places on each vocabulary word v. The models construct φ (a) by combining H and θ (d) ; often empirical word statistics m are also used to stabilize the representations. LSA LSA (Deerwester et al., 1990 ) factorizes a termdocument matrix by truncated SVD, learning the projection of the data onto a linear subspace of fixed rank such that the approximation error of the reconstructed term-document matrix (as measured by the Frobenius norm) is minimized. In the basic version of LSA, SVD is applied to the raw term counts, giving the low-dimensional representation φ (d) = Hθ (d) , (1) where φ (d) is the vector of observed multinomial counts in document d, H is the matrix of left singular vectors of the term-document count matrix, and θ (d) is the inferred representation of φ (d) . In practice, LSA is often applied instead to the termdocument matrix weighted by term frequencyinverse document frequency (tf-idf) in order to normalize terms by importance. We can also apply further pre-processing steps, such as term-wise centering by subtracting the column-wise mean m of the data, in which case LSA finds an affine subspace that approximates the data. Mi-vector Model The original acoustic i-vector model represents continuous, high-dimensional ASR system state (namely, Gaussian mixture model supervectors) in an affine subspace (Dehak et al., 2011) . Prior work has found this dense, low-dimensional representation to be effective for a number of tasks, including language recognition (Martínez et al., 2011) and speaker recognition (Dehak et al., 2011; Garcia-Romero and Espy-Wilson, 2011) . Recently the i-vector model was augmented for multinomial observations (Soufifar et al., 2011) and applied accordingly to language recognition (Soufifar et al., 2011; McCree and Garcia-Romero, 2015) , speaker recognition (Kockmann et al., 2010) , and spoken document retrieval (Chen et al., 2014) . In this version of the i-vector model the observations are draws from a multinomial and the (unnormalized) natural parameters of that distribution are represented in an affine subspace: φ (d) = softmax m + Hθ (d) (2) θ (d) ∼ N (0, I). We call this multinomial version of the i-vector model the mi-vector model. The latent variable θ (d) is the multinomial i-vector, or mi-vector. H is an unconstrained linear transformation. The bias term m is computed as the log of the l 1normalized background word count vector. The Gaussian prior on the mi-vector θ (d) is effectively an l 2 regularizer; mi-vectors are neither nonnegative nor sparse in general. Unlike many Bayesian topic models, word occurrences in the mi-vector model are i.i.d. draws from a document-level multinomial φ (d) ; as in LSA, each latent component contributes equally to each word within a given document. Specifically, in the mi-vector model, the natural parameter vector of the multinomial for all words in a given document is determined by an additive offset from a background parameter vector. Bayesian Discrete Topic Models Bayesian topic models explain word occurrences via K latent components H k (topics) each drawn from some prior distribution G. Unlike mi-vectors and LSA, multinomial topic models are admixture models: each token n is drawn from a particular distribution H k . Latent token assignment variables z (d) n , taking integral values between 1 and K, dictate the token's topic choice. A document d controls how often each topic is chosen via the K-dimension multinomial distribution θ (d) . In the parametric settings we consider, Dirichlet priors are often placed on θ (d) , allowing experimentation with the topic representation H. 3 A mapping Q(H k ), possibly the identity, ensures φ (d,n) are 3 There have been many efforts to provide or induce latent structure among the topics (Blei et al., 2003a; Li and Mc-Callum, 2006; Wallach et al., 2009; Paul and Girju, 2010) , but most models ground out to Dirichlet and discrete random variables. probability vectors. A general formulation is then φ (d,n) = Q H z (d) n (3) H k ∼ G (η) z (d) n ∼ Discrete θ (d) θ (d) ∼ Dirichlet (α) . The hyperparameters α and η dictate the informativeness of the priors over H k and θ (d) : often (empirically optimized) symmetric hyperparameters are employed, resulting in a form of Laplace smoothing during topic estimation. In the current work, we follow this strategy, noting that there have been concerted efforts to encode domain or expert knowledge via the hyperparameters (Gormley et al., 2012; Paul and Dredze, 2015) . SAGE Topic Model The Sparse Additive Generative (SAGE) model (Eisenstein et al., 2011) is a generative Bayesian modeling framework in which φ (d,n) are formed by summing a background vector and one or more sparse vectors generated from appropriate priors. The additive components can reflect the contributions of documents, aspects, topics, or other factors chosen by the modeler. A basic SAGE topic model sets φ (d,n) = softmax m + H z (d) n , and draws H k from some sparsity-inducing distribution G, e.g., the Laplace distribution. As m is a shared background frequency vector, H k is the learned residual frequency vector of topic k. Replacing the topic assignment in SAGE by its conditional expectation gives d) , H = softmax m + Hθ (d) . φ(d,n) = softmax m + E z (d) n H z (d) n θ ( (4) This modification of the SAGE topic model is the same as the mi-vector model but with different regularization on the representation vector θ (d)  and l 1 regularization on the basis vectors H k . This \"marginal SAGE\" model could be useful in future work: the marginalization may mitigate the problem of topic-switching, yielding a more identifiable (but perhaps less interpretable) model and lending to downstream tasks such as topic ID. LDA Latent Dirichlet Allocation (LDA) (Blei et al., 2003b ) is a generative Bayesian topic model similar to SAGE, but in which each topic is drawn from a Dirichlet prior G rather than a sparsityinducing distribution. LDA does not explicitly account for the background distribution; to account for this, it is common practice to threshold the vocabulary a priori to remove very common and very rare words (though in our experiments, we do not do this). Therefore, φ (d,n) is exactly H z (d) n , and H k ∼ Dirichlet (η). Experiments We compare these four models of learned representations empirically on two distinct tasks, topic ID and topic discovery. The essential implementation details of the models are as follows; further details are provided in the supplement. We learn the mi-vector model in a maximum a posteriori framework as in McCree and Garcia-Romero (2015) . Our own C++ implementation of SAGE, available online, 4 uses approximate meanfield variational inference, as in Eisenstein et al. (2011) . We learn the LDA model using Gibbs sampling, implemented in MALLET (McCallum, 2002) . 5 We perform LSA using centered tf-idfweighted word counts and centered l 2 -normalized triphone state cluster soft counts. We implement tf-idf by scaling the raw term count by the log inverse document frequency. We apply l 2 normalization rather than tf-idf weighting to the speech data because it is dense and tf-idf is thus inappropriate. On both text and speech, mean-centering is performed after the respective normalization, as this pre-processing recipe performed best of all the variants we tried. 6  For each of the four models, the lowdimensional real vector θ (d) represents a given document d in our experiments. We also consider two high-dimensional baseline representations: raw (soft) counts on both the text and speech data, and, only on the text data, tf-idfweighted word counts. These tf-idf weights constitute a high-dimensional learned representation. Topic ID In our first topic ID experiment we evaluate topic ID error on raw multinomial views of the data. To our knowledge, we are the first to adopt a multi-nomial view of triphone state clusters and apply it to topic ID. In subsequent experiments we explore the interaction of representation dimension with each model and dataset, and evaluate relative performance when the classifier is only given a fraction of the available data for training. This latter configuration is the most interesting, as it reflects the cost of obtaining supervised data in practice. Given feature vectors for some representation of the documents in a corpus, topic ID is performed in a one-versus-all framework. We use logistic regression as the per-class binary classifier, implemented using LIBLINEAR (Fan et al., 2008) . Results were similar when logistic regression was replaced by support vector machines. All document representations are length-normalized (divided by their l 2 norm) before they are input to the classifier. Performance is measured by topic ID error, the error of multi-class prediction where the class predicted for each document is that of the per-class classifier that gave it the highest weight. Baseline performance on the test set (where the baseline classifier chooses the most prevalent topic in the training set for all test examples) is 96.2% error. Note that this error rate differs from the uniformat-random classification error rate of 97.5% because of the uneven distribution of topics. Document Construction Prior work (Hazen et al., 2007; Wintrode and Khudanpur, 2014 ) treated whole conversations as documents in addition to separating each conversation into its two sides. We perform a small topic ID experiment in this configuration to probe the impact of this design choice. Ten-fold cross-validation (CV) is used to tune the logistic regression regularizers. On the test set, the classifier achieves topic ID error of 12.4% and 15.6% for whole-conversation and individual-side text data, respectively, and 20.1% and 29.5% for whole-conversation and individualside speech data, respectively. These results correspond roughly to results listed in Table 3 of Hazen et al. (2007) , specifically, the topic ID error of 8.2% and 12.4% for whole-conversation and individual-side transcriptions, respectively, and 22.9% and 35.3% for whole-conversation and individual-side triphones derived from ASR lattices, respectively (Hazen et al., 2007) . However, we use logistic regression without feature selection instead of Naïve Bayes with feature selection, and we apply our classifier to triphone state cluster soft counts inferred by a DNN instead of triphone q q q q q q q q q q q q 25 50 75 counts from ASR lattices. We believe that the discrepancies in performance with respect to prior work are due to these differences in experimental configuration. Our results and those of prior work show that using whole-conversation documents instead of individual-side documents make the topic ID task easier. As a result, we expect that differences in performance between the different learned representations will be more clearly pronounced on individual conversation sides and we restrict the rest of our study to that setting. Dimensionality Study We perform topic ID on learned representations at dimensions K ∈ {10, 50, 100, 200, 300, 600} on individual conversation sides, using ten-fold cross-validation to tune the logistic regression regularizers. Figure 3 gives topic ID error results on the test set, varying K. (Selected values are listed in Table 1 .) In both datasets, as the dimension K increases, topic ID error decreases, approaching (approximately) the raw baseline. On text, tf-idf performs slightly better than the raw representation. LSA is marginally the best-performing lower-dimensional learned representation; LDA and mi-vectors perform well at some representation sizes, depending on the data source, but their performance is less consistent. SAGE performs poorly overall. We run this experiment twice, using = 2 and = 6 labeled examples per topic, for a total of 80 and 240 classifier training examples, respectively. Ten-fold cross-validation is used to fit the regularizer; per-class loss coefficients are set according to the class prior in the original training set in order to counteract the artificial balancing of the classes in the limited-supervision dataset. We report cross-validation estimates of the topic ID error on the training set for K = 10 (Figure 4 ), K = 100 (Figure 5 ), and K = 600 (Figure 6 ). For K = 100 and K = 600, LSA dominates in the limited-supervision setting. Mi-vectors perform as well as or better than other low-dimensional learned representations at K = 10, and exhibit mixed performance for larger K. SAGE performs poorly overall. 7 LDA performs significantly bet- 7 We believe that approximately sparse posterior θ (d) values result in a kind of topic switching, contributing to the poor performance of SAGE. To examine this we \"tested on train\" and analyzed the top topics inferred for each document: while the highest-weighted topic tended to be consistent, SAGE infers approximately sparse θ (d) with large variation in the next four highest-weighted topics (the remaining topics are assigned trace mass). Second, a phenomenon known as conversation drift, explained in Section 3 of the supplement, is so pronounced in Fisher that the first 25% percent of words of each conversation side are nearly as predictive as the entire ter than SAGE, but not as well as mi-vectors. Finally, tf-idf-weighted word counts perform very well on text, often achieving the best performance of all representations, even under limited supervision (but at the same dimension as the raw data). Topic Discovery To quantitatively assess representations' potential for topic discovery we compute their V-measure against the gold-standard labels. V-measure is an unsupervised measure of similarity between two partitions (Rosenberg and Hirschberg, 2007) and is equivalent to the mutual information normalized by the sum of the entropy (Becker, 2011) . For all representations, we compute V-measure between a partition induced by that representation and the gold-standard topic labels on the test set. A partition is induced on a representation by assigning each document d to the cluster indexed by the coordinate of θ (d) with highest value (the argmax). Results of this analysis are displayed in Figure 7 . (Selected values are listed in Table 2 .) On the text data, SAGE dominates the lower-dimensional representations, LSA is next best overall, and LDA and mi-vectors exhibit relatively low performance; document (Wintrode, 2013) . All representations must contend with this drift, but θ (d) sparsity may make SAGE particularly susceptible. These two issues may make the classification we use much less robust.  the high-dimensional tf-idf weights are surpassed by SAGE for K > 10 but beat other representations by a significant margin. On speech, SAGE is best overall, mi-vectors exhibit similar but generally lower performance, LDA performs worse, and LSA is worst. We also measure the topic discovery potential of the mi-vector and SAGE representations more directly. First, we provide a manual inspection of the learned topics: in Table 3 we show the topfive word lists for five random topics from the 600dimensional mi-vector and SAGE models (respectively) learned on the text data. In both models, the top five words in a topic are selected according to the five largest positive values in the corresponding vector H k . Qualitatively, the SAGE topics are considerably more interpretable than the mi-vector topics: the SAGE topics represent issues of censorship, foreign relations, coffee fran- chises, welfare, and professional basketball, while the mi-vector topics are less succinctly characterizable and more polluted by uninformative words. We complement this qualitative analysis with Mimno et al. (2011) 's intrinsic coherence measure, a standard quantitative method. This scoring function, which correlates well with human quality judgments, averages estimates of the conditional log-likelihoods of each topic's M highestweighted words across all topics. Using K = 600 models on text as before and picking M = 20, we compute mi-vector coherence as −453.34 and SAGE coherence (averaged over three runs) as −407.52, indicating that SAGE is more amenable to topic discovery and human interaction. mi-vector you 've, florida, each, a-, bit hours, never, couldn't, check, communicate pregnant, water, lifestyle, awful, called forgot, ran, social, topics, unique tough, way, let's, fifties, hand SAGE censor, books, censorship, neat, agree sanctions, siblings, democratic, rely, u. n. starbucks, franchise, coffee, franchising, studio welfare, wage, minimum, cents, tips team, role, professional, blazers, basketball Table 3 : Top five words in five random mi-vector and SAGE topics learned on text data at K = 600. q q q q q q q q q q q q 0.2 Discussion We have theoretically and empirically compared several content-bearing representations of text and speech from prior work. We have measured the relative performance of these representations on topic ID, an easy-to-evaluate task familiar to both text and speech research communities. We have also assessed the representations in their ability to discover the topics inherent in a corpus, a task that is more prominent in the text community and more difficult to evaluate. On our subset of the Fisher English data, these tasks appear to have competing objectives: the best representations in one task are not necessarily the best in the other. In particular, while SAGE yields the worst performance as a feature learner for topic ID, it is demonstrably superior to other low-dimensional learned representations in topic discovery. We have evaluated performance in topic discovery by distributional similarity to gold-standard topics as a proxy for human-annotated judgments of topic quality, and briefly compared the interpretability of mi-vectors and SAGE; future work could pursue expert or crowd-sourced human evaluations. In the full-supervision setting of topic ID, the lower-dimensional learned representations converge in performance to the raw representation as the dimension K increases. However, if only a couple of labeled examples per class are available, reflecting the expense of obtaining labels in practice, then learned representations generally outperform the raw representation, which is more prone to overfitting. It is surprising that tf-idf performs so well in the limited supervision setting; it is learned from the data, but it should be prone to overfitting due to its high dimensionality. It is also surprising that SAGE performance on text degrades significantly at high dimensions; we suspect this is due to topic switching, but further investigation is warranted. Overall, though, for topic ID on word counts or triphone state cluster soft counts, if labeled data is scarce, we benefit from training on unsupervised learned representations. In the V-measure experiment, the documents were partitioned according to the heaviest coordinate in their representations. This choice of experimental protocol is a nuisance variable in our results; other partition constructions may yield different conclusions. In particular, the heaviestcoordinate partition may favor topic models, whose representations are probability vectors, and disfavor mi-vectors and LSA, whose representations may have positive and negative coordinates encoding general linear combinations. Within each task, the ranking of the representations (by performance) is generally consistent between the text and speech data; however, mivectors often outperform LDA on the speech data, while LDA often outperforms mi-vectors on the text data. This may be evidence that the two communities have already independently identified appropriate dimensionality reduction techniques for their respective data sources. However, our results support that the speech community can benefit from broader use of sparsity-inducing graphical models such as SAGE in tasks like spoken topic discovery and recommendation, in which humaninterpretable representations are desired. The text community may similarly benefit from parsimonious models such as LSA or mi-vectors in downstream tasks; underparametrized mi-vectors perform particularly well on text, and future work may benefit from investigating this setting. Word counts and triphone state cluster soft counts provide only one view of text and speech (respectively), and other input representations may yield different conclusions. The particular LSA approach we used for text, based on tf-idf weighting, is not as appropriate for our speech data, which is dense. Future work could evaluate other implementations of LSA or use a higher-level view of speech, such as triphone state cluster ngrams, that more naturally exhibits sparsity and lends to tf-idf weighting. In particular, weighting by a likelihood ratio test statistic and applying a log transform has generated better performance in several other tasks (Lapesa and Evert, 2014) . Future work could also test our conclusions on higher-resource views of speech, such as ASR word counts, or lower-resource views such as melfrequency cepstral coefficients (MFCCs). We have provided a brief cross-community evaluation of learned representations on multinomial text and speech data. Some prior work has evaluated related learned representations on text data alone, surveying parameters and tasks at greater breadth (Lapesa and Evert, 2014; Levy et al., 2015) . A similarly comprehensive evaluation spanning the text and speech research communities would demand great effort but provide a large and versatile resource. In complement, a detailed, case-by-case analysis of errors made by the models in our study could illuminate future modeling efforts by exposing exactly how and why each model errs or excels in each task. Conclusion Topic ID and topic discovery are competing objectives in our setting: we found that the bestperforming representations per task were the same whether considering text-or speech-based communications. By evaluating learned representations from both the text and speech communities on a common set of data and tasks, we have provided a framework for better understanding the topic ID and topic discovery objectives, among others. More generally, we hope to encourage cross-community collaboration to accelerate convergence toward comprehensive models of language. Acknowledgments We would like to thank the three anonymous reviewers for their feedback. A National Science Foundation Graduate Research Fellowship, under Grant No. DGE-1232825, supported the second author. We would like to thank the Johns Hopkins HLTCOE for providing support. Any opinions expressed in this work are those of the authors.",
    "abstract": "We compare the multinomial i-vector framework from the speech community with LDA, SAGE, and LSA as feature learners for topic ID on multinomial speech and text data. We also compare the learned representations in their ability to discover topics, quantified by distributional similarity to gold-standard topics and by human interpretability. We find that topic ID and topic discovery are competing objectives. We argue that LSA and i-vectors should be more widely considered by the text processing community as pre-processing steps for downstream tasks, and also speculate about speech processing tasks that could benefit from more interpretable representations like SAGE.",
    "countries": [
        "United States"
    ],
    "languages": [
        "English"
    ],
    "numcitedby": "10",
    "year": "2015",
    "month": "September",
    "title": "Topic Identification and Discovery on Text and Speech"
}