{
    "article": "Le projet ANR PORTMEDIA avait pour objectif de compléter le corpus MEDIA afin de favoriser le développement de méthodes performantes, notamment statistiques, pour la compréhension automatique de la parole dans le cadre des systèmes de dialogues homme-machines. Les principaux axes traités sont : la robustesse aux erreurs de reconnaissance de la parole, la portabilité multilingue, la portabilité multi-domaines et la représentation sémantique haut-niveau. Ainsi tout en élaborant au sein du projet des éléments de solution à ces problématiques nous nous sommes principalement attachés à élaborer des données et meta-données permettant ensuite à d'autres groupes de recherche d'évaluer dans les meilleures conditions possibles leurs propres propositions. Introduction Avec le développement rapide des communications homme-machine (centres d'appels, services téléphoniques, smartphones...), la compréhension automatique de la parole (CAP) a reçu un intérêt croissant ces dernières années. Les systèmes de CAP ont été déployés dans des applications industrielles mais avec des effets mitigés jusqu'à présent. Tout d'abord les systèmes de CAP sont généralement disponibles dans une seule langue et ne supportent donc pas le multilinguisme. Ensuite les services existants utilisant des composants de CAP sont très contraints et limités par la tâche ou le domaine d'application. Enfin la qualité de l'interaction utilisateur/système est toujours loin d'être aisée et naturelle. Le projet PORTMEDIA tente d'apporter des solutions à ces difficultés en développant de nouveaux corpus visant trois objectifs distincts mais complémentaires : -Robustesse des systèmes de CAP aux erreurs de reconnaissance. Les erreurs dues à la reconnaissance automatique de la parole doivent être prises en compte dans le processus de compréhension et pour cela des transcriptions automatiques doivent être mises à disposition avec les données d'apprentissage. -Portabilités multilingue et multi-domaines. Les systèmes de CAP sont très dépendants de la langue et du domaine. Adapter un système à un nouveau domaine ou une nouvelle langue requiert habituellement la collecte très coûteuse d'une nouvelle grande base de données de dialogues du langage ou domaine visé et un effort important de développement. PORTMEDIA vise à permettre l'évaluation de la généricité et de la portabilité de nouvelles approches pour les systèmes de CAP. -Représentation sémantique haut-niveau. Une représentation sémantique haut-niveau (Highlevel Semantics, HLS) est nécessaire pour prendre en compte le processus de composition sémantique intervenant au sein et entre des interactions successives de l'utilisateur. Le projet PORTMEDIA (2009-12) est une suite du projet MEDIA (2003-07) durant lequel un corpus de 1258 dialogues en français pour le domaine touristique a été produit. Les partenaires du projet sont : l'université d'Avignon, ELDA, le LIG, le LIUM et le LORIA. d'expertise. Dans ces conditions, il paraît naturel que les plus grands corpus de dialogues aient été développés par l'industrie des télécoms à l'aide de prototypes ou de systèmes déployés, comme chez AT&T how may I help you ? (Gorin et al., 1997) ou chez France-Télécom. PORTMEDIA a produit 2 nouveaux corpus spécifiques pour étudier la portabilité des systèmes de CAP à travers domaines et langues. Le premier corpus est composé de 604 dialogues en italien toujours sur le domaine touristique. Le second comprend 700 dialogues en français pour la réservation de billets de spectacles dans le cadre du Festival d'Avignon 2010. Les statistiques complètes sont reprises dans le tableau 1. PM-LANG : le corpus PORTMEDIA en italien La base de données en italien, nommée PM-LANG, a été enregistrée, transcrite et annotée en suivant les mêmes spécifications et configurations que le corpus MÉDIA initial. La seule différence entre les corpus MEDIA et PM-LANG est donc la langue parlée par les locuteurs. En 2004, 250 scénarii avaient été utilisés pour la collecte de MEDIA et une plateforme d'enregistrement téléphonique mise au point. La plateforme inclut un générateur automatique (textuel) de phrases afin d'aider les agents (compères) dans leurs réponses. Pour la base de données italienne, les mêmes outils, protocoles, scénarii et contraintes ont été retenus pour la collecte des dialogues. La seule adaptation a été de traduire les messages du WoZ et les scénarii du français vers l'italien, mais aucun changement n'a été opéré sur le contenu des scénarii (y compris les entités nommées qui ont été conservées telles quelles, par exemple les noms de lieux, d'hôtels. . .). Le protocole d'enregistrement est complètement décrit dans (Devillers et al., 2004) . La procédure d'annotation et les recommandations sont décrites dans (Maynard et al., 2005) . La base de données résultante est un corpus de 604 dialogues transcrits et annotés sémantiquement. reconnaisseur de parole performant pour transcrire le corpus PM-DOM. Une fois les données transcrites, elles ont été corrigées par un humain. Les corrections ont été retournées au LIUM afin de ré-entraîner les modèles et d'améliorer le système de reconnaissance de parole. Puis un nouveau lot de données était transcrit automatiquement, manuellement corrigé et retourné pour l'amélioration du système. Les détails sur le système de reconnaissance de la parole du LIUM peuvent être trouvés dans la section 3.1. Pour les annotations sémantiques, le LIA et le LIG ont pré-annoté les deux corpus automatiquement. La pré-annotation a été validée manuellement par deux linguistes pour chacune des langues (français pour PM-DOM et italien pour PM-LANG. Le même processus itératif que pour les transcriptions a été activé. Les détails sur les modules de CAP utilisés par le LIA et le LIG sont donnés dans la section 3.2. Nom Lang Gains de productivité Durant la transcription et l'annotation sémantique, nous avons régulièrement comparé les gains dus aux pré-transcriptions et annotations semi-automatiques. Dans cette optique, le protocole suivant a été implémenté. Lors de chaque itération un ensemble de 10 dialogues était transcrit (resp. annoté) par deux annotateurs différents. Le premier réalisait la transcription (resp. annotation) à partir de la pré-transcription (resp. pré-annotation) tandis que le second annotateur réalisait les mêmes opérations sans hypothèses initiales. Les gains en productivité mesurés sont reportés dans la figure 1 . Pour les transcriptions, on observe que le temps mis à transcrire un dialogue est divisé par deux avec l'utilisation des transcriptions automatiques. Pour l'annotation sémantique, les gains de productivité sont de plus de 50% pour l'italien et 40% pour le français. Annotation sémantique haut-niveau L'utilisation d'une sémantique haut-niveau (High Level Semantic, HLS), une représentation sémantique hiérarchique, a été étudiée pour l'annotation du corpus MEDIA. À cet effet, nous nous sommes référés au langage pour les interfaces multimodales (MultiModal Interface Language, MMIL) pour générer des structures guidées par l'ontologie du domaine qui supportent les informations linguistiques utiles de la syntaxe jusqu'au discours. Ainsi, les traits fins des actes de dialogues, prédicats et arguments sont correctement définis pour les énoncés par rapport à l'annotation conceptuelle séquentielle déjà disponible pour le corpus. Toutefois, cette annotation représente un véritable challenge. Pour commencer, nous avons traité les énoncés les plus complexes, contenant des prédicats et arguments se chevauchant et des énoncés elliptiques contenant des prédicats et/ou des arguments implicites. Nous avons élaboré le guide d'annotation et annoté manuellement un sous-ensemble d'énoncés supposés être représentatifs des aspects les plus complexes de l'annotation HLS, en terme de constituants (Rojas-Barahona et al., 2011) , à l'aide d'un outil graphique développé spécifiquement. Une architecture incrémentale a ensuite été élaborée pour l'annotation semi-automatique du corpus complet, ainsi que les moyens d'évaluer l'annotation fournie (Rojas-Barahona et Quignard, 2011) . Cette annotation est en cours de correction par des annotateurs experts afin de fournir un gold standard pour l'ensemble du corpus. Celui-ci servira à implémenter et tester des méthodes d'apprentissage supervisé pour l'annotation automatique de cette sémantique complexe. Conclusion Dans cet article, nous avons présenté les différents apports du projet PORTMEDIA visant à favoriser le développement de méthodes statistiques pour la compréhension de la parole. Principalement, le travail a pris la forme de la mise à disposition de corpus permettant une évaluation pertinente et aisée des méthodes étudiées. Ainsi, 4 axes principaux ont été couverts : -robustesse aux erreurs de reconnaissance : mise à disposition de transcriptions automatiques avec un système à l'état de l'art des données -portabilité multilingue : collecte d'un nouveau corpus en italien, comprenant un ensemble de test et un ensemble d'adaptation ; -portabilité multi-domaine : collecte d'un nouveau corpus sur un nouveau domaine (réservation de billets), avec un ensemble de test et d'adaptation ; -annotation sémantique hiérarchique : élaboration d'une représentation sémantique de hautniveau permettant la prise en compte d'informations au niveau de la phrase complète (les spécifications sont prêtes, l'annotation du corpus MEDIA complet est en cours de finition). Enfin une série d'évaluations a été réalisée sur les nouvelles données fournies permettant notamment de vérifier leur qualité. Ces évaluations seront poursuivies avec la recherche de collaboration externe au projet afin de fournir les données avec une référence de performance. L'ensemble du corpus ainsi réalisé rejoindra le catalogue d'ELDA 2 dans le courant de l'année. Remerciements Ce travail a été partiellement financé par l'Agence Nationale pour la Recherche : projet PORTMEDIA ANR 08 CORD 026 01. Plus d'informations sur www.port-media.org.",
    "abstract": "Le projet ANR PORTMEDIA avait pour objectif de compléter le corpus MEDIA afin de favoriser le développement de méthodes performantes, notamment statistiques, pour la compréhension automatique de la parole dans le cadre des systèmes de dialogues homme-machines. Les principaux axes traités sont : la robustesse aux erreurs de reconnaissance de la parole, la portabilité multilingue, la portabilité multi-domaines et la représentation sémantique haut-niveau. Ainsi tout en élaborant au sein du projet des éléments de solution à ces problématiques nous nous sommes principalement attachés à élaborer des données et meta-données permettant ensuite à d'autres groupes de recherche d'évaluer dans les meilleures conditions possibles leurs propres propositions.",
    "countries": [
        "France"
    ],
    "languages": [],
    "numcitedby": "9",
    "year": "2012",
    "month": "June",
    "title": "Robustesse et portabilit{\\'e}s multilingue et multi-domaines des syst{\\`e}mes de compr{\\'e}hension de la parole : les corpus du projet {P}ort{M}edia (Robustness and portability of spoken language understanding systems among languages and domains : the {PORTMEDIA} project) [in {F}rench]"
}