{
    "article": "Nous présentons dans cet article la méthodologie de constitution et les caractéristiques du corpus Sequoia, un corpus en français, syntaxiquement annoté d'après un schéma d'annotation très proche de celui du French Treebank (Abeillé et Barrier, 2004) , et librement disponible, en constituants et en dépendances. Le corpus comporte des phrases de quatre origines : Europarl français, le journal l'Est Républicain, Wikipédia Fr et des documents de l'Agence Européenne du Médicament, pour un total de 3204 phrases et 69246 tokens. En outre, nous présentons une application de ce corpus : l'évaluation d'une technique d'adaptation d'analyseurs syntaxiques probabilistes à des domaines et/ou genres autres que ceux du corpus sur lequel ces analyseurs sont entraînés. Cette technique utilise des clusters de mots obtenus d'abord par regroupement morphologique à l'aide d'un lexique, puis par regroupement non supervisé, et permet une nette amélioration de l'analyse des domaines cibles (le corpus Sequoia), tout en préservant le même niveau de performance sur le domaine source (le FTB), ce qui fournit un analyseur multi-domaines, à la différence d'autres techniques d'adaptation comme le self-training. Introduction L'analyse syntaxique statistique a fait de grands progrès ces quinze dernières années, avec de très nombreux travaux, majoritairement sur l'anglais, fondés sur un apprentissage sur les sections du Wall Street Journal du Penn Treebank (Marcus et al., 1993) . D'autres langues ont bénéficié de ces avancées, à la condition, de taille, que soit disponible pour ces langues un corpus arboré, en constituants ou en dépendances. Cependant, les analyseurs ainsi obtenus, appris sur un corpus bien précis, ont leur performance maximale sur des textes similaires à ce corpus, mais sont peu robustes : ils montrent une qualité nettement dégradée lorqu'ils sont évalués sur des textes de domaine ou genre différents. C'est particulièrement vrai pour l'anglais, car le WSJ montre peu de variété de thèmes : (McClosky et al., 2006) rapporte que l'analyseur de Charniak (Charniak, 2000) obtient une F-mesure en constituants labelés de 89.7% sur la section de test du WSJ, mais chute à 82.9% sur le corpus de test du Brown corpus (Francis et Kucera, 1964) , corpus anglais de genres variés. Pour le français, le French Treebank (ci-après FTB) (Abeillé et Barrier, 2004 ) a servi de corpus d'entraînement pour des analyseurs initialement développés pour l'anglais (voir (Seddah et al., 2009) pour une comparaison de plusieurs analyseurs en constituants, et (Candito et al., 2010b) pour une comparaison d'analyseurs en dépendances, pour le français). Le FTB est un corpus de phrases du journal Le Monde, annotées en morphologie et en constituants. Les évaluations disponibles des analyseurs appris sur le FTB sont dites intra-domaine : elles sont classiquement faites sur une partie du FTB, non vue à l'apprentissage. Les évaluations dites hors-domaine, c'est-à-dire simplement sur des phrases d'origine différente de celles du corpus d'apprentissage se heurtent à l'absence de corpus annotés dans le même schéma que le FTB. Le corpus EASy (Paroubek et al., 2005) comprend des phrases de domaines et genres textuels divers, mais son format mixte entre constituants (chunks) et dépendances (dépendances entre chunks) rend difficile l'évaluation des performances d'un analyseur en constituants sur ces textes. Pour cette raison, nous avons entrepris l'annotation syntaxique de quatre corpus en suivant, à quelques exceptions près, le schéma d'annotation du FTB, regroupés sous le nom de corpus Sequoia 1 . Nous présentons ici la méthodologie d'annotation et les caractéristiques du corpus arboré obtenu, ainsi que l'application sur ces corpus d'une méthode d'adaptation à de nouveaux domaines d'un analyseur statistique appris sur le FTB 2 . Si l'objectif premier est de pouvoir tester et améliorer la robustesse d'analyseurs statistiques, ces corpus, librement disponibles 3 , sont utilisables à d'autres fins, en particulier pour des études linguistiques. Nous décrivons section 2 la méthodologie d'annotation et les caractéristiques du corpus, puis section 3 la méthode d'adaptation d'analyseur et les travaux antérieurs dans ce domaine, et en section 4 les expériences réalisées et les résultats obtenus. Enfin nous concluons en section 5. Les corpus Sequoia Origine et méthode de sélection Le corpus Sequoia comporte des phrases ou textes de quatre origines différentes : l'agence européenne du médicament, Europarl, le journal régional l'Est Républicain et Wikipedia Fr. Le choix de ces quatre origines est en partie conjoncturel, car lié à la disponibilité des corpus : nous avons en effet eu le souci que les corpus soient librement disponibles, et qu'ils offrent une 1. Du nom du projet (SEQUOIA ANR-08-EMER-013) ayant financé l'annotation manuelle. 2. Cet article étend un article court publié à IWPT 2011 (Candito et al., 2011) , relatant des expériences d'adaptation d'analyseurs sur un des quatre sous-corpus aujourd'hui disponibles. 3. https ://www.rocq.inria.fr/alpage-wiki/tiki-index.php ?page=CorpusSequoia diversité variable par rapport au genre journalistique du FTB (diversité évaluée a priori, non précisément). D'autres critères ont guidé notre choix, comme l'existence d'autres annotations pour les phrases sélectionnées et la disponibilité de gros volume de corpus brut de même origine, en vue d'expériences d'apprentissage semi-supervisé. Domaine médical Nous avons sélectionné le domaine médical comme domaine potentiellement très éloigné de celui du FTB. Plus précisément, nous avons retenu deux documents provenant de la partie en français du corpus EMEA, lui-même inclus dans le corpus OPUS (Tiedemann, 2009) Annotation morpho-syntaxique Schéma d'annotation Choix linguistiques Notre objectif est d'obtenir des corpus compatibles avec le FTB, et donc en suivant les choix linguistiques du FTB, caractérisé comme un schéma syntagmatique surfacique, avec des annotations fonctionnelles pour les dépendants des verbes. Ainsi avons-nous suivi autant que possible les guides d'annotation du FTB (Abeillé et Clément, 2006; Abeillé et al., 2004; Abeillé, 2004) . (NC valeurs) (PP (P d') (NP (NC ACT)))))))) (PONCT ,) (NP-SUJ (DET le) (NC produit) (VPpart (VPP reconstitué) (COORD (CC et) (VPpart (VPP dilué))))) (VN (V doit)) (VPinf-OBJ (VN (VINF être) (ADV bien) (VPP mélangé))) (COORD (CC puis) (VN (V doit)) (VPinf (VN (VINF être) (VPP administré)) (PP-MOD (P en) (NP (NC bolus))) (PP-MOD (P par) (NP (NC poussée) (AP (ADJ intraveineuse)) (AP (ADJ rapide)))))) (PONCT .))) Le jeu de catégories morpho-syntaxiques que nous utilisons est celui mis ou point par (Crabbé et Candito, 2008) Conversion en dépendances Le corpus annoté en constituants a été automatiquement converti en dépendances en utilisant le convertisseur développé pour la conversion automatique du FTB (Candito et al., 2010a) . Au final, le corpus Sequoia est donc disponible sous deux formes : un format parenthésé annoté en constituants 10 décoré de fonctions syntaxiques, et un format tabulé CoNLL 11 pour la version en dépendances labelées. Méthodologie d'annotation Pour obtenir le corpus Sequoia, nous avons procédé en alternant traitements automatiques et validation de ces traitements pour passer à l'étape suivante. A toutes les étapes (segmentation, tagging, parsing, annotations des fonctions), les annotations précédentes pouvaient être remises en cause. La séquence a été la suivante : -Prétraitements automatiques : Segmentation en phrases, reconnaissance hors contexte de composés et tokenisation via l'outil Bonsai 12 -Etiquetage morpho-syntaxique en utilisant le tagger MElt (Denis et Sagot, 2009) -Validation manuelle en éditeur simple, par un seul annotateur expert, du tagging, de la segmentation en phrases, et de la reconnaissance de composés -Pour tous les sous-corpus sauf EMEA : Analyse syntagmatique automatique au moyen de deux parsers statistiques différents, en guidant les analyseurs avec les tags manuellement validés : les analyses doivent se conformer aux catégories fournies en entrée. Les analyseurs sont le parser de Berkeley (Petrov et Klein, 2007) et l'analyseur de Charniak (Charniak, 2000) , tous deux adaptés et entraînés sur le FTB. Pour EMEA : la validation syntaxique a été faite par un annotateur expert. -Validation manuelle indépendante des deux sorties d'analyseurs, via l'outil graphique Word-Freak (Morton et LaCivita, 2003) adapté pour le tagset et le jeu de fonctions du FTB, puis adjudication. -Annotation automatique des fonctions des dépendants des verbes finis, en utilisant l'annotateur en fonctions intégré à Bonsai -Validation manuelle des annotations fonctionnelles par deux annotateurs indépendamment, via WordFreak, puis adjudiction. -Vérifications systématiques par un expert de points repérés comme difficiles 13 ; vérification systématique de la cohérence du traitement des composés. Evaluation de l'annotation Pour évaluer l'accord inter-annotateurs, et la distance au corpus de référence après adjudication et vérifications systématiques, nous utilisons l'outil Evalb servant habituellement à l'évaluation des sorties d'un analyseur par rapport à des analyses de référence. (Crabbé et Candito, 2008) en corpus de test (1235 premières phrases), corpus de développement (1235 phrases suivantes) et 9881 phrases restantes comme corpus d'apprentissage. Le corpus original XML est prétraité tel que décrit dans (Candito et Crabbé, 2009) . En particulier les composés nominaux et verbaux syntaxiquement réguliers sont défaits et représentés syntagmatiquement, et chaque occurrence de composé restante traitée comme un seul token (par exemple (N (P à) (N cause) (P de)) est remplacé par (N à_cause_de)). FTB-dev et 28, 1 pour FTB-train), devant même Europarl (26, 3). La table fournit également la taille des vocabulaires (de formes fléchies), et en leur sein la proportion de formes qui sont absentes du FTB-train. Nous fournissons les chiffres calculés en utilisant tous les tokens (y compris la ponctuation) ainsi que ceux calculés sur les tokens alphanumériques minusculisés 15 , pour mieux évaluer la diversité lexicale. On peut constater que le corpus médical comporte de loin le vocabulaire le plus éloigné de celui du FTB (plus d'une forme sur trois est absente du FTB-train). Pour le corpus EMEA-dev, la proportion d'inconnus en comptant tous les types de formes fléchies est très haute, du fait d'un grand nombre de mots entièrement capitalisés (la proportion passe de 41, 4 à 36, 6 en ignorant la ponctuation et en minusculisant). Pour le corpus FrWiki, la forte proportion d'inconnus (34, 2%) peut s'expliquer par une grande fréquence des noms propres (cf. la ligne % d'occurrences de noms propres : environ une occurrence sur 10 est un nom propre dans FrWiki). Les lignes sur les nombres d'occurrences et le pourcentage d'inconnus parmi ces occurrences donnent une vision plus précise de la diversité lexicale des corpus. Dans les corpus médicaux, une occurrence sur 5 (et presque une sur 4 pour EMEA-dev) correspond à un inconnu du FTB-train, ce qui, avec la faible proportion d'occurrences de noms propres (1, 7 et 2, 7) indique que les mots inconnus sont plutôt des mots fréquemment utilisés dans ces corpus. Au contraire, pour FrWiki on voit que, calculée sur les occurrences, la proportion d'inconnus tombe à 12, 9 (la majorité des inconnus du vocabulaire sont des noms propres, apparaissant rarement). Le corpus le plus proche lexicalement du FTB semble être Europarl : seulement 6, 6% des occurrences sont des inconnus, formant un cinquième du vocabulaire, ce qui constitue moins d'occurrences d'inconnus que dans le FTB-dev. Adaptation de domaine par pont lexical Notre objectif est d'explorer une méthode d'amélioration des performances d'un analyseur statistique sur des textes d'origine différente de celle du corpus d'entraînement de l'analyseur, les différences pouvant relever du domaine et/ou du genre des textes. Pour simplifier, nous utilisons par la suite les termes domaine source pour les caractéristiques (domaine, genre, registre) du corpus d'entraînement, domaines cibles pour celles des textes d'origine différente et analyse hors-domaine pour l'analyse de textes des domaines cibles. Pour améliorer l'analyse hors-domaine, nous proposons d'adapter une technique testée au départ pour le parsing intra-domaine. S'inspirant de l'utilisation par (Koo et al., 2008) de clusters de mots comme traits d'un analyseur discriminatif en dépendances, (Candito et Crabbé, 2009) ont proposé une technique qui, en réduisant la dispersion des données lexicales, améliore les performances de parsing intra-domaine. Ils entraînent un analyseur statistique sur un corpus où les mots sont remplacés par des identifiants de clusters de mots, obtenus de manière non supervisée sur un corpus brut de grande taille. Le parsing se fait ensuite de la même manière, en remplaçant chaque mot par leur cluster correspondant, de manière déterministe et non contextuelle, puis en réinsérant les tokens originaux pour obtenir les sorties d'analyse. Plus précisément, le regroupement de formes fléchies en clusters se fait en deux étapes : -Les formes fléchies sont d'abord groupées en clusters morphologiques via un lexique morphologique. Il s'agit de ramener un ensemble de formes fléchies à une forme canonique, dite forme 15. Plus précisément les tokens comportant au moins une lettre ou un chiffre, et ramenés à une forme minusculisée. défléchie, avec comme principe de conserver exactement la même ambiguïté de catégories morpho-syntaxiques (contrairement par exemple à une lemmatisation). On veut en effet déléguer la désambiguisation de catégories à l'analyseur, et ne pas trancher par pré-traitement. Pour cela, pour une forme donnée, on récupère la liste de ses catégories recensées dans le dictionnaire, puis, tant que cette liste de catégories ne varie pas, le pluriel est ramené au singulier, le féminin au masculin, et pour les formes verbales conjuguées non ambiguës, les personnes, mode et temps verbaux sont ramenées à la deuxième personne présent pluriel (moyen rapide de trouver une forme n'introduisant pas de nouvelles ambiguïtés). Par exemple, analysées est ramené à analysé, mais entrées est ramené à entrée, de manière à conserver l'ambiguïté nom/participe. Toutes les formes finies de augmenter sont ramenées à augmentez, mais par exemple joue est inchangé pour préserver son ambiguïté catégorielle. -Ensuite un algorithme de clustering non supervisé (Brown et al., 1992) est appliqué sur gros corpus préalablement segmenté en phrases, tokenisé et défléchi (i.e. où les formes fléchies sont remplacées par leur forme défléchie correspondante). On obtient ainsi des clusters de formes défléchies. Il s'agit d'un algorithme hiérarchique et agglomératif, où le critère de fusion de deux clusters est la perte minimale de vraisemblance dans un modèle bigramme de séquences de clusters. Dans cet article, nous adaptons cette technique au problème spécifique de la non robustesse des analyseurs statistiques, en utilisant des clusters de mots appris sur la concaténation de corpus du domaine source (ou proche du domaine source) et des domaines cibles. L'objectif est d'obtenir que soient groupés sous le même cluster des mots appartenant au domaine source et des mots appartenant aux domaines cibles, de façon à réaliser un pont entre les vocabulaires respectifs de ces domaines (d'où le nom d'adaptation à de nouveaux domaines par \"pont lexical\"). Travaux antérieurs reliés Différentes techniques ont été proposées pour adapter des modèles d'analyse existants à de nouveaux genres : -Adaptation au domaine via de l'auto-entraînement (self-training) (Bacchiani et al., 2006; McClosky et al., 2006; Sagae, 2010) : un analyseur entraîné sur le domaine source est utilisé pour analyser du domaine cible, et on réentraîne un analyseur sur les données validées source et les données prédites cibles. Le corpus d'entraînement ainsi obtenu, bien que bruité, capture suffisamment de régularités du domaine cible pour améliorer les performances d'analyse sur ce domaine (tout en dégradant les performances sur le domaine source) ; -co-entraînement avec sélection d'exemples (Steedman et al., 2003) : deux analyseurs sont itérativement re-entraînés sur leurs sorties respectives, les phrases du domaine cible à utiliser étant choisies de manière à minimiser les erreurs d'analyse tout en maximisant l'utilité à l'entraînement ; -transformation de treebank et adaptation du domaine cible (Foster, 2010) ; -adaptation méticuleuse du domaine cible à la source d'entraînement (Foster et al., 2007) ; Bien que différentes, les techniques ici évoquées sont toutes conçues pour combler la variation syntaxique et lexicale entre le domaine source et les domaines cibles. La variation lexicale est en particulier problématique dans le cas d'une langue à la morphologie plus riche que l'anglais, la flexion augmentant la dispersion des données lexicales. Expériences et résultats Clusters de mots Pour calculer les clusters de mots nous utilisons diverses concaténations de quatre corpus, avec d'une part le corpus L'Est Républicain déjà cité section 2, de 150 millions de tokens, qui va jouer le rôle de corpus proche du domaine source malgré des différences manifestes concernant les sujets traités 16 . Et d'autre part, nous utilisons des tronçons de corpus de même origine que les sous-corpus Sequoia annotés : Europarl, Wikipedia Fr et domaine médical. Cela donne quatre corpus : -ER : 150 millions de tokens L'Est Républicain -MED : 12 millions de tokens du domaine médical, dont 5 millions du corpus EMEA français 17  cité section 2 et 7 millions de tokens provenant du site doctissimo 18 . -EP : la même taille, soit 12 millions de tokens, d'Europarl français, -FW : et 12 millions de tokens de Wikipedia Fr Pour le calcul des clusters, les phrases contenues dans le corpus arboré Sequoia ont été retirées. Le corpus ER, en tant que corpus journalistique régional, est choisi comme corpus proche du FTB, malgré des différences manifestes concernant les sujets traités. La concaténation du corpus ER et du corpus MED+EP+FW va jouer le rôle de pont lexical entre le domaine source (journalistique) et les domaines cibles. Les corpus bruts ER, MED, EP et FW sont d'abord prétraités par l'outil Bonsai (segmentés en phrases, tokenisés, et des mots composés sont reconnus hors-contexte). Puis nous appliquons le processus de défléchissement décrit section 3, pour remplacer chaque forme fléchie par sa forme défléchie équivalente. Le lexique morphologique utilisé est le Lefff (Sagot, 2010) . Enfin nous calculons des clusters de formes défléchies 19 en utilisant l'implémentation par (Liang, 2005) de l'algorithme de (Brown et al., 1992) : -les clusters source sont obtenus en appliquant l'outil sur le corpus ER, -les clusters pont mixtes sont obtenus sur la concaténation de ER + MED + EP + FW (soit environ 186 millions de tokens). -les clusters pont er-med sont obtenus sur la concaténation de ER + MED uniquement (soit environ 162 millions de tokens), pour tester la méthode avec des clusters plus ciblés sur le vocabulaire médical. Dans les trois cas, le nombre de clusters générés est de 1000, et les formes défléchies considérées sont celles apparaissant au moins 100 fois dans le corpus d'apprentissage 20 . Protocole et expériences Nous réalisons ces premiers tests en analyse en constituants sans annotations fonctionnelles. Tous les traitements (entraînement d'analyseur et tests) se font donc sur des versions des corpus où les annotations fonctionnelles sont supprimées 21 . Nous utilisons l'algorithme d'apprentissage et d'analyse de PCFG avec annotations latentes (ci-après PCFG-LA) de (Petrov et Klein, 2007) , et son implémentation 22 , avec modèle de lissage pour les mots rares et inconnus adapté au français. Pour cet algorithme, (Petrov, 2010) montre une variabilité des résultats selon les valeurs aléatoires choisies à l'initialisation de l'algorithme EM d'apprentissage des probabilités de règles avec annotations latentes. Aussi, nous réalisons pour chaque expérience quatre exécutions de l'apprentissage, avec quatre graines aléatoires différentes. Tous les apprentissages se font en utilisant 5 cycles de fission-fusion. Pour l'évaluation des performances, nous utilisons l'outil Evalb, et fournissons la moyenne des F-mesures de constituants labelés (moyenne sur les quatre graines aléatoires) pour les phrases de moins de 40 mots ainsi que pour toutes les phrases. Nous utilisons PCFG-LA pour apprendre quatre analyseurs, sur quatre versions du FTB-train (cf. section 2) différant par les symboles terminaux utilisés (les feuilles lexicales) : -forme fléchie : les formes fléchies sont laissées telles quelles -forme défléchie : chaque forme fléchie est remplacé par sa forme défléchie équivalente -cluster source : chaque forme défléchie est ensuite remplacée par son cluster source équivalent (clusters appris sur le corpus ER) -cluster pont mixte : idem mais en utilisant les clusters appris sur ER + MED + EP + FW -cluster pont er-med : idem mais en utilisant les clusters appris sur ER + MED Résultats et discussion Nous avons réalisé des tests en comparant les résultats sur le FTB et sur le corpus Sequoia. Plus précisément, d'une part avons considéré trois \"domaines\" : le domaine source (FTB), un domaine très éloigné (domaine médical, corpus Emea), et un domaine que nous appelons neutre, regroupant les autres parties du corpus Sequoia (phrases de Wikipédia Fr, Europarl et Est Républicain). D'autre part, pour chaque domaine (source, médical et neutre) nous avons séparé corpus de test pour les tests finaux, et corpus de développement pour la phase exploratoire, de la manière suivante : -domaine source : FTB-dev et FTB-train tels que décrits note 14 -domaine médical : EMEA-dev et EMEA-train, cf. les colonnes 2 et 3 de la Conclusion Nous avons présenté le corpus arboré Sequoia, comportant quatre sous-corpus annotés syntaxiquement en suivant le schéma du French Treebank, à quelques exceptions près. Les corpus sont librement disponibles sous forme de constituants et de dépendances. varier le corpus brut sur lequel calculer les clusters ne montrent pas d'avantage clair à utiliser du texte brut du domaine cible. Remerciements Nous remercions chaleureusement les trois annotatrices Vanessa Combet, Catherine Moreau-Mocquay et Virginie Mouilleron pour leur travail très consciencieux. L'annotation a été financée par l'ANR (projet SEQUOIA ANR-08-EMER-013).",
    "abstract": "Nous présentons dans cet article la méthodologie de constitution et les caractéristiques du corpus Sequoia, un corpus en français, syntaxiquement annoté d'après un schéma d'annotation très proche de celui du French Treebank (Abeillé et Barrier, 2004) , et librement disponible, en constituants et en dépendances. Le corpus comporte des phrases de quatre origines : Europarl français, le journal l'Est Républicain, Wikipédia Fr et des documents de l'Agence Européenne du Médicament, pour un total de 3204 phrases et 69246 tokens. En outre, nous présentons une application de ce corpus : l'évaluation d'une technique d'adaptation d'analyseurs syntaxiques probabilistes à des domaines et/ou genres autres que ceux du corpus sur lequel ces analyseurs sont entraînés. Cette technique utilise des clusters de mots obtenus d'abord par regroupement morphologique à l'aide d'un lexique, puis par regroupement non supervisé, et permet une nette amélioration de l'analyse des domaines cibles (le corpus Sequoia), tout en préservant le même niveau de performance sur le domaine source (le FTB), ce qui fournit un analyseur multi-domaines, à la différence d'autres techniques d'adaptation comme le self-training.",
    "countries": [
        "France"
    ],
    "languages": [],
    "numcitedby": "109",
    "year": "2012",
    "month": "June",
    "title": "Le corpus Sequoia : annotation syntaxique et exploitation pour l{'}adaptation d{'}analyseur par pont lexical (The Sequoia Corpus : Syntactic Annotation and Use for a Parser Lexical Domain Adaptation Method) [in {F}rench]"
}