{
    "article": "Cet article présente une approche de post-édition statistique pour adapter aux domaines de spécialité des systèmes de traduction automatique génériques. En utilisant les traductions produites par ces systèmes, alignées avec leur traduction de référence, un modèle de post-édition basé sur un alignement sous-phrastique est construit. Les expériences menées entre le français et l'anglais pour le domaine médical montrent qu'une telle adaptation a posteriori est possible. Deux systèmes de traduction statistiques sont étudiés : une implémentation locale état-de-l'art et un outil libre en ligne. Nous proposons aussi une méthode de sélection de phrases à post-éditer permettant d'emblée d'accroître la qualité des traductions et pour laquelle les scores oracles indiquent des gains encore possibles. Introduction La traduction automatique statistique basée sur l'alignement sous-phrastique (Koehn et al., 2003) est une approche très populaire qui mène à des performances intéressantes. Les modèles statistiques sous-jacents sont construits à l'aide de phrases en relation de traduction, d'où sont extraites des probabilités d'alignements entre les séquences de mots. Les ressources linguistiques nécessaires à l'estimation de ces probabilités sont les corpus parallèles, éléments indispensables dans le processus de construction du modèle de traduction. Cependant, ces ressources sont coûteuses à produire et limitent l'approche. Ce manque de données parallèles se fait ressentir plus fortement pour des domaines spécialisés. En effet, beaucoup d'activités humaines impliquent l'utilisation d'une langue spécifique comportant des particularités syntaxiques et terminologiques (Sager et al., 1980) . Ainsi, construire des systèmes de traduction pour tous les domaines semble hors de portée et nous pensons que l'adaptation d'un système « générique » représente une solution viable à la prise en charge des domaines dans leur diversité. Même dans les cas où la traduction automatique peut atteindre de bonnes performances, il est possible d'améliorer manuellement la sortie des systèmes. Mais cela implique une étape de post-édition qui peut se révéler coûteuse selon l'effort à fournir pour produire une traduction de qualité (Martínez, 2003) . Il paraît donc intéressant d'automatiser ce processus d'édition a posteriori afin de contrôler et d'améliorer les traductions produites par un système. Nous proposons, dans cet article, d'utiliser une approche de post-édition statistique (statistical postedition, SPE) basée sur l'alignement sous-phrastique afin d'adapter des systèmes de traduction automatique à un domaine de spécialité. Le domaine étudié est celui de la médecine et la paire de langues est français-anglais. Plusieurs systèmes de traductions statistiques sont utilisés et nous proposons différentes méthodes afin d'introduire une petite quantité de données spécialisées pendant le processus de traduction. Nous étudions aussi l'impact de la post-édition en l'appliquant systématiquement à toute traduction, puis en sélectionnant les phrases à post-éditer à l'aide d'un classifieur. L'organisation de cet article est la suivante. La section 2 présente l'approche de SPE par segments sous-phrastique. Puis, dans la section 3, nous proposons un cadre expérimental et donnons des détails sur les données utilisées ainsi que les différentes configurations évaluées. La section 4 contient les résultats en terme de traduction automatique, suivie de la section 5 présentant les résultats de notre approche pour la post-édition. La sélection des phrases à post-éditer est détaillée dans la section 6. L'adaptation aux domaines par post-édition statistique La post-édition d'une traduction automatique consiste à générer un texte T à partir d'une hypothèse de traduction T provenant d'un texte source S. Ainsi, ne sont nécessaires à la SPE que des données monolingues dans la langue cible. Le corpus parallèle utilisé pour la construction du modèle de post-édition peut être constitué d'hypothèses de traductions, de leurs références de traduction, d'hypothèses post-éditées manuellement, etc. Parmi les premiers travaux à relater de l'efficacité de la SPE, Simard et al. (2007a) proposent d'éditer automatiquement des hypothèses de traduction produites par un système à base de règles. Une étude détaillée de cette approche (traduction par règles et SPE par alignement sous-phrastique) est proposée par (Dugast et al., 2007) et les gains observés sur la mesure d'évaluation BLEU (Papineni et al., 2002) peuvent atteindre jusqu'à 10 points. L'amélioration de la qualité des traductions produites par un système à base de règles en utilisant la SPE est donc possible. Certains auteurs y voient la possibilité d'adapter le système de traduction à des domaines de spécialité. Selon (Isabelle et al., 2007; Simard et al., 2007b) , en introduisant des données spécialisées lors de la phase de post-édition, il est possible d'adapter un système de traduction a posteriori. Cette technique a aussi été appliquée par de Ilarraza et al. (2008) , à partir de traductions basées sur des règles post-éditées par alignement sous-phrastique, en y ajoutant des informations morphologiques. Parmi ces travaux, il est important de noter que  certains auteurs ont suggéré de combiner deux systèmes statistiques pour la traduction et la post-édition, sans toutefois poursuivre ces expérimentations (Isabelle et al., 2007; Oflazer et El-Kahlout, 2007) . Plus récemment, Béchara et al. (2011) sont les premiers à étudier la combinaison de la traduction et la post-édition par alignement sous-phrastique. Des améliorations sont observées entre le français et l'anglais, en introduisant des informations sur le contexte source dans la phase de post-édition. Mais il n'y a, à notre connaissance, aucune publication sur l'utilisation de l'approche pour l'adaptation aux domaines de spécialité. Nous proposons donc de l'étudier dans cet article, en relation avec la sélection automatique des phrases à post-éditer. Ce dernier aspect est abordé dans (Suzuki, 2011) , où les auteurs décrivent une sélection de phrases à post-éditer manuellement basée sur l'estimation de la qualité de traduction au niveau des phrases. Les travaux présentés dans cet article sont centrés sur l'adaptation de systèmes de traduction génériques en utilisant une petite quantité de données parallèles du domaine. La figure 1 illustre l'architecture générale de notre approche, combinant la traduction, la post-édition et la classification. Dans un premier temps, une traduction automatique d'un texte spécialisé est produite. Puis, en utilisant la référence de traduction, un corpus parallèle monolingue est construit. Ce corpus est utilisé pour construire le modèle de post-édition. Lorsqu'un nouveau texte est traduit, nous proposons alors deux méthodes : la post-édition naïve de toutes les phrases ou la sélection des phrases à post-éditer. Cette sélection est faite sur l'estimation des gains possibles par post-édition en recourant à la métrique automatique BLEU. Cadre expérimental L'idée générale des travaux présentés dans cet article est d'accroître la qualité de traductions de textes spécialisés produites par un système générique par une étape de post-édition. Nous considérons deux types de systèmes de traduction permettant de passer de la langue source à la langue cible : MOSES avec son implémentation de l'alignement sous-phrastique (Koehn et al., 2007) et le système en ligne GOOGLE TRADUCTION 1 . Nous utilisons MOSES pour postéditer les hypothèses de traduction produites par les deux types de systèmes de traduction individuellement. Ressources Systèmes de traduction Parmi les systèmes de traduction utilisés, l'outil accessible en ligne, noté google dans les expériences présentées dans cet article, ne peut être modifié. Nous pouvons cependant post-éditer et évaluer les traductions produites par ce système. La boîte à outils de traduction MOSES permet, quant à elle, de construire un modèle de traduction à partir des corpus parallèles et de contrôler chaque étape de ce processus. Ainsi, nous pouvons faire varier les données monolingues et bilingues utilisées. Pour les modèles de langue (ML), trois modèles 5-grammes sont construits. Un premier est établi sur les données monolingues génériques (M L g ), un second est construit sur la partie langue cible du corpus d'entraînement médical (M L m ). Ces deux modèles sont combinés par interpolation linéaire (M L g+m ) selon des poids estimés par le calcul de la perplexité sur le corpus de développement spécialisé. Pour ce dernier modèle, le vocabulaire générique est limité à 1 million de mots les plus fréquents. Le poids optimal associé au modèle de langue spécialisé est de 0, 9 malgré sa petite taille, ce qui montre le niveau de spécificité du domaine médical. Pour les modèles de traduction (MT), MOSES permet de construire une table de traduction et un modèle de réordonnancement en choisissant les données à utiliser. Un premier modèle de traduction est construit avec les données bilingues génériques (M T g ), un second avec les données médicales (M T m ). La combinaison de ces deux modèles permet d'obtenir un modèle mixte (M T g+m ). Pour ces trois configurations, les données bilingues sont alignées au niveau des mots avec l'outil MGIZA++ (Gao et Vogel, 2008) . Les poids associés aux éléments composant les modèles de traduction sont optimisés sur le corpus de développement médical pour la métrique BLEU selon la méthode MERT (Och, 2003) . Afin de construire des systèmes de post-édition pour l'adaptation au domaine médical, nous utilisons les traductions du corpus d'entraînement spécialisé produites par chaque système de traduction individuellement. Chaque sortie est alignée avec la référence de traduction puis utilisée pour construire un modèle de post-édition à l'aide de MOSES (avec les paramètres par défaut). Le corpus de développement spécialisé, une fois traduit par chaque système de traduction, est utilisé afin d'optimiser les poids des composants du modèle de post-édition. Traduction de textes spécialisés La première série d'expériences porte sur la traduction du corpus de test spécialisé. Les résultats obtenus selon les différentes configurations de systèmes sont présentés dans le tableau 1b. La comparaison entre les systèmes est effectuée selon la méthode d'approximation par souséchantillonnage aléatoire implémentée dans l'outil FASTMTEVAL (Stroppa et al., 2007) . Ces résultats indiquent que la meilleure configuration, avec un score BLEU de 47, 3%, est celle combinant les données génériques et spécialisées (M T g+m M L g+m ). Cependant, ces scores ne sont pas significativement supérieurs à ceux obtenus par M T g+m M L m (p-valeur=0, 75) . Nous pouvons donc en conclure que l'intégration des données génériques dans le modèle de langue ne permet pas d'améliorer les performances du système de traduction, ce qui démontre encore une fois la forte spécificité du domaine médical. Cette constatation est plus marquée encore lors de l'utilisation du modèle de traduction générique (M T g ). Introduire des données génériques dans le modèle de langue (M T g M L g+m ) dégrade d'un point de BLEU les performances en comparaison avec le score obtenu par M T g M L m (de 39, 2% à 38, 2%). Le système de traduction en ligne obtient quant à lui 44, 9% de BLEU, soit 1, 5 points de moins que le système construit uniquement sur les données spécialisées. Système générique Nous proposons à présent de post-éditer les sorties d'un système de traduction statistique par alignement sous-phrastique ne disposant pas de données spécialisées pour le modèle de traduction. Les résultats de la post-édition sont présentés dans le tableau 2 en utilisant (M T g M L m ) ou non (M T g M L g ) les données spécialisées pour construire un ML. Le recours à la post-édition montre un gain significatif pour M T g M L g en faisant progresser le score BLEU de 29, 9% à 45, 6% pour la meilleure configuration (S P E m M L g+m ). L'augmentation observée de 3,5 points de BLEU à partir de M T g M L m est moins importante, tout en restant statistiquement significative (p-valeur = 0, 001). (Boser et al., 1992) ), implémenté dans l'outil LIBSVM (Chang et Lin, 2011) . Les phrases traduites sont utilisées sous la forme de vecteurs de n-grammes (avec n ∈ [1; 3] dans notre cas). Post-édition des traductions Système spécialisé et mixte Nous évaluons notre approche de sélection de phrases à post-éditer en utilisant la configuration dont le score oracle est le plus élevé, c-à-d le système de traduction en ligne (google) avec le système de post-édition S P E m LM g+m (oracle atteignant 53, 5% 2a . En cumulant les seuils au dessus de 0, 8 pour la classe « à post-éditer », 1 point de BLEU est gagné par rapport à l'application naïve de la post-édition. Nous remarquons qu'une quantité plus importante de phrases sont post-éditées entre les seuils 0, 5 et 0, 8, et seulement 60 phrases le sont avec un score supérieur à 0, 9. Cet aspect influence les résultats en terme de score BLEU. L'évaluation globale du corpus de test après post-édition des phrases sélectionnées montre une amélioration selon les deux métriques utilisées (tableau 2b). L'utilisation d'une sélection apparaît donc comme une méthode apportant des gains en comparaison à l'application naïve de la post-édition (avec une p-valeur égale à 0, 004). Conclusion et perspectives Nous avons présenté dans cet article une approche de post-édition statistique fondée sur les segments pour l'adaptation aux domaines de spécialité en traduction automatique. Les expériences menées montrent qu'un système de traduction générique peut être adapté a posteriori par l'introduction de données spécialisées dans une étape de post-édition. L'application naïve de la SPE permet d'améliorer la qualité de traduction dans certains cas. Les scores oracles indiquent que pour toutes les configurations étudiées, des gains en terme de score BLEU sont possibles. Les meilleurs résultats sont obtenus par le système de traduction en ligne, couplé avec un système de post-édition construit sur des données mixtes, et en utilisant un classifieur pour sélectionner les traductions à post-éditer. Comparé au système de base, le score BLEU est amélioré de 4 points. L'apprentissage du classifieur est toutefois limité aux hypothèses de traduction et nous envisageons, dans des travaux futurs, d'enrichir les paramètres d'apprentissage pour mieux tenir compte du contexte de traduction afin de s'approcher des scores oracles mesurés.",
    "abstract": "Cet article présente une approche de post-édition statistique pour adapter aux domaines de spécialité des systèmes de traduction automatique génériques. En utilisant les traductions produites par ces systèmes, alignées avec leur traduction de référence, un modèle de post-édition basé sur un alignement sous-phrastique est construit. Les expériences menées entre le français et l'anglais pour le domaine médical montrent qu'une telle adaptation a posteriori est possible. Deux systèmes de traduction statistiques sont étudiés : une implémentation locale état-de-l'art et un outil libre en ligne. Nous proposons aussi une méthode de sélection de phrases à post-éditer permettant d'emblée d'accroître la qualité des traductions et pour laquelle les scores oracles indiquent des gains encore possibles.",
    "countries": [
        "France"
    ],
    "languages": [],
    "numcitedby": "2",
    "year": "2012",
    "month": "June",
    "title": "Post-{\\'e}dition statistique pour l{'}adaptation aux domaines de sp{\\'e}cialit{\\'e} en traduction automatique (Statistical Post-Editing of Machine Translation for Domain Adaptation) [in {F}rench]"
}