{
    "article": "This paper describes a system and set of algorithms for automatically inducing stand-alone monolingual part-of-speech taggers, base noun-phrase bracketers, named-entity taggers and morphological analyzers for an arbitrary foreign language. Case studies include French, Chinese, Czech and Spanish. Existing text analysis tools for English are applied to bilingual text corpora and their output projected onto the second language via statistically derived word alignments. Simple direct annotation projection is quite noisy, however, even with optimal alignments. Thus this paper presents noise-robust tagger, bracketer and lemmatizer training procedures capable of accurate system bootstrapping from noisy and incomplete initial projections. Performance of the induced stand-alone part-of-speech tagger applied to French achieves 96% core part-of-speech (POS) tag accuracy, and the corresponding induced noun-phrase bracketer exceeds 91% F-measure. The induced morphological analyzer achieves over 99% lemmatization accuracy on the complete French verbal system. This achievement is particularly noteworthy in that it required absolutely no hand-annotated training data in the given language, and virtually no language-specific knowledge or resources beyond raw text. Performance also significantly exceeds that obtained by direct annotation projection. TASK OVERVIEW A fundamental roadblock to developing statistical taggers, bracketers and other analyzers for many of the world's 200+ major languages is the shortage or absence of annotated training data for the large majority of these languages. Ideally, one would like to lever-  age the large existing investments in annotated data and tools for resource-rich languages (such as English and Japanese) to overcome the annotated resource shortage in other languages. . To show the broad potential of our approach and methods, this paper will investigate four fundamental language analysis tasks: POS tagging, base noun phrase (baseNP) bracketing, named entity tagging, and inflectional morphological analysis, as illustrated in Figures 1 and 2 . These bedrock tools are important components of the language analysis pipelines for many applications, and their low cost extension to new languages, as described here, can serve as a broadly useful enabling resource. BACKGROUND Previous research on the word alignment of parallel corpora has tended to focus on their use in translation model training for MT rather than on monolingual applications. One exception is bilingual parsing. Wu (1995 Wu ( , 1997) ) investigated the use of concurrent parsing of parallel corpora in a transduction inversion framework, helping to resolve attachment ambiguities in one language by the coupled parsing state in the second language. Jones and Havrilla (1998) utilized similar joint parsing techniques (twisted-pair grammars) for word reordering in target language generation. However, with these exceptions in the field of parsing, to our knowledge no one has previously used linguistic annotation projection via aligned bilingual corpora to induce traditional standalone monolingual text analyzers in other languages. Thus both our proposed projection and induction methods, and their application to multilingual POS tagging, named-entity classification and morphological analysis induction, appears to be highly novel. DATA RESOURCES The data sets used in these experiments included the English-French Canadian Hansards, the English-Chinese Hong Kong Hansards, and parallel Czech-English Reader's Digest collection. In addition, multiple versions of the Bible were used, including the French Douay-Rheims Bible, Spanish Reina Valera Bible, and three English Bible Versions (King James, New International and Revised Standard), automatically verse-aligned in multiple pairings. All corpora were automatically word-aligned by the now publicly available EGYPT system (Al-Onaizan et al., 1999), based on IBM's Model 3 statistical MT formalism (Brown et al., 1990) . The tagging and bracketing tasks utilized approximately 2 million words in each language, with the sample sizes for morphology induction given in Table 3 . All word alignments utilized strictly rawword-based model variants for English/French/Spanish/Czech and character-based model variants for Chinese, with no use of morphological analysis or stemming, POS-tagging, bracketing or dictionary resources. PART-OF-SPEECH TAGGER INDUCTION Part-of-speech tagging is the first of four applications covered in this paper. The goal of this work is to project POS analysis capabilities from one language to another via word-aligned parallel bilingual corpora. To do so, we use an existing POS tagger (e.g. Brill, 1995) to annotate the English side of the parallel corpus. Then, as illustrated in Figure 1 for Chinese and French, the raw tags are transferred via the word alignments, yielding an extremely noisy initial training set for the 2nd language. The third crucial step is to generalize from these noisy projected annotations in a robust way, yielding a stand-alone POS tagger for the new language that is considerably more accurate than the initial projected tags. Additional details of this algorithm are given in Yarowsky and Ngai (2001) . Due to lack of space, the following sections will serve primarily as an overview of the algorithm and its salient issues. Part-of-speech Projection Issues First, because of considerable cross-language differences in finegrained tag set inventories, this work focuses on accurately assigning core POS categories (e.g. noun, verb, adverb, adjective, etc.), with additional distinctions in verb tense, noun number and pronoun type as captured in the English tagset inventory. Although impoverished relative to some languages, and incapable of resolving details such as grammatical gender, this Brown-corpus-based tagset granularity is sufficient for many applications. Furthermore, many finer-grained part-of-speech distinctions are resolved primarily by morphology, as handled in Section 7. Finally, if one desires to induce a finer-grained tagging capability for case, for example, one should project from a reference language such as Czech, where case is lexically marked. Figure 3 illustrates six scenarios encountered when projecting POS tags from English to a language such as French. The first two show straightforward 1-to-1 projections, which are encountered in roughly two-thirds of English words. Phrasal (1-to-N) alignments offer greater challenges, as typically only a subset of the aligned words accept the English tag. To distinguish these cases, we initially assign position-sensitive phrasal parts-of-speech via subscripting (e.g. Les/NNS lois/NNS ), and subsequently learn a probablistic mapping to core, non-phrasal parts of speech (e.g. P DT NNS ! ) that is used along with tag sequence and lexical prior models to re-tag these phrasal POS projections. Noise-robust POS Tagger Training Even at the relatively low tagset granularity of English, direct projection of core POS tags onto French achieves only 76% accuracy using EGYPT's automatic word alignments (as shown in Table 1 ). Part of this deficiency is due to word-alignment error; when word alignments were manually corrected, direct projection core-tag accuracy increased to 85%. Also, standard bigram taggers trained on the automatically projected data achieve only modest success at generalization (86% when reapplied to the noisy training data). More highly lexicalized learning algorithms exhibit even greater potential for overmodeling the specific projection errors of this data. Thus our research has focused on noise-robust techniques for distilling a conservative but effective tagger from this challenging raw projection data. In particular, we modify standard n-gram modeling to separate the training of the tag sequence model \" # %$ & from the lexical prior models \" # (' ) $ & , and apply different confidence weighting and signal amplification techniques to both. Lexical Prior Estimation Figure 4 illustrates the process of hierarchically smoothing the lexical prior model 0\" # %1 2 3 & . One motivating empirical observation is that words in French, English and Czech have a strong tendency to exhibit only a single core POS tag (e.g. 4 or 5 ), and very rarely have more than 2. In English, with relatively high \" # POS 3 & ambiguity, only 0.37% of the tokens in the Brown Corpus are not covered by a word type's two most frequent core tags, and in French the percentage of tokens is only 0.03%. Tag Sequence Model Estimation In contrast, the training of the tag sequence model \" # %1 PI C 1 PI RQ TS HU WV XV YV focuses on confidence weighting and filtering of projected training subsequences. The contribution of each candidate training sentence is weighted proportionally with both its EGYPT/GIZA sentencelevel alignment score and an agreement measure between the projected tags and the 1st iteration lexical priors, a rough measure of alignment reasonableness. Given the observed bursty distribution of alignment errors in the corpus, this downweighting of low-confidence alignment regions substantially improves sequence model quality with tolerable reduction in training volume. Evaluation of POS Tagger Induction As shown in Table 1 , performance is evaluated on two evaluation data sets, including an independent 200K-word hand-tagged French dataset provided by Université de Montréal, which is used to gauge stand-alone tagger performance. Signal amplification and noise reduction techniques yield a 71% error reduction, achieving a core tagset accuracy of 96%, closely approaching the upper-bound 97% performance of an equivalent bigram model trained directly on an 80% subset of the hand-tagged evaluation set (using 5-fold cross-validation). Thus robust training on 500K words of very noisy but automatically-derived tag projections can approach the performance obtained by fully supervised learning on 80K words of hand-tagged training data. NOUN PHRASE BRACKETER INDUCTION Our empirical studies show that there is a very strong tendency for noun phrases to cohere as a unit when translated between languages, even when undergoing significant internal re-ordering. This strong noun-phrase cohesion even tends to hold for relatively free word order languages such as Czech, where both native speakers and parallel corpus data indicate that nominal modifiers tend to remain in the same contiguous chunk as the nouns they modify. This property allows collective word alignments to serve as a reliable basis for bracket projection as well. BaseNP Projection Methodology The projection process begins by automatically tagging and bracketing the English data, using Brill (1995) and Ramshaw & Marcus (1994) , respectively. As illustrated in Figure 5 , each word within an English noun phrase is then subscripted with the number of its NP in the sentence, and this subscript is projected onto the aligned French (or Chinese) words. In the most common case, the corresponding French/Chinese noun phrase is simply the maximal span of the projected subscript. Figure 6 shows some of the projection challenges encountered. Nearly all such cases of interwoven projected NPs are due to alignment errors, and a strong inductive bias towards NP cohesion was utilized to resolve these incompatible projections. J N VBD N N IN N [ ] [ ] [ DT N J VBD N de N DT N [ 1 1 2 2 3 (3) (2) (2) (1) (1) (1) ] ] ] [ ] O [ [ Figure 5: Standard NP projection scenarios. DT J N VBD N N [ ] 1 1 1 2 2 [ ] (1) (1) [ (2) } (1) { (2) ] [ DT N VBD N J de N ] O BaseNP Training Algorithm For stand-alone tool development, the Ramshaw & Marcus IOB bracketing framework and a fast transformation-based learning system (Ngai and Florian, 2001) were applied to the noisy baseNPprojected data described above. As with POS tagger induction, bracketer induction is improved by focusing training on the highest quality projected data and excluding regions with the strongest indications of word-alignment error. Thus sentences with the lowest 25% of model-3 alignment scores were excluded from training, as were sentences where projected bracketings overlapped and conflicted (also an indicator of alignment errors). Data with lower-confidence POS tagging were not filtered, `however, as this filtering reduces robustness when the stand-alone bracketers are applied to noisy tagger output. Additional details are provided in Yarowsky and Ngai (2001) . Current efforts to further improve the quality of the training data include use of iterative EM bootstrapping techniques. Separate projection of bracketings from aligned parallel data with a 3rd language also shows promise for providing independent supervision, which can further help distinguish consensus signal from noise. BaseNP Projection Evaluation Because no bracketed evaluation data were available to us for French or Chinese, a third party fluent in these languages handbracketed a small, held-out 40-sentence evaluation set in both languages, using a set of bracketing conventions that they felt were appropriate for the languages. Table 2 shows the performance relative to these evaluation sets, as measured by exact-match bracketing precision (Pr), recall (R) and F-measure (F). Exact Match Acceptable It is important to note, however, that many decisions regarding BaseNP bracketing conventions are essentially arbitrary, and agreement rates between additional human judges on these data were measured at 64% and 80% for French and Chinese respectively. Since the translingual projections are essentially unsupervised and have no data on which to mimic arbitrary conventions, it is also reasonable to evaluate the degree to which the induced bracketings are deemed acceptable and consistent with the arbitrary goldstandard (e.g. no crossing brackets). To this end, an additional pool of 3 judges were asked to further adjudicate the differences between the goldstandard and the projection output, annotating such situations as either acceptable/compatible or unacceptable/incompatible. Overall, these translingual projection results are quite encouraging. For the Chinese, they are similar to Wu's 78% precision result for translingual-grammar-based NP bracketing, and especially promising given that no word segmentation (only raw characters) were used. For French, the increase from 59% to 91% F-measure for the stand-alone induced bracketer shows that the training algorithm is able to generalize successfully from the noisy raw projection data, distilling a reasonably accurate (and transferable) model of baseNP structure from this high degree of noise. NAMED ENTITY TAGGER INDUCTION Multilingual named entity tagger induction is based on the extended combination of the part-of-speech and noun-phrase bracketing frameworks. The entity class tags used for this study were FNAME, LNAME, PLACE and OTHER (other entities including organizations). They were derived from an anonymously donated MUC-6 named entity tagger applied to the English side of the French-English Canadian Hansards data. Initial classification proceeds on a per-word basis, using an aggressively smoothed transitive projection model similar to those de-scribed in Section 7. For a given second-language word FW and all English words a b' cI aligned to it: \" # NEclassd e FW gf ih I \" # NEclassd e EWI p\" EWI FW \" # PLACE Corée qf r\" # PLACE Korea s\" T t Korea Corée vu wV XV YV The co-training-based algorithm given in Cucerzan and Yarowsky (1999) was then used to train a stand-alone named entity tagger from the projected data. Seed words for this algorithm were those French words that were both POS-tagged as proper nouns and had an above-threshold entity-class confidence from the lexical projection models. Performance was measured in terms of per-word entity-type classification accuracy on the French Hansard test data, using the 4class inventory listed above. Classification accuracy of raw tag projections was only 64% (based on automatic word alignment). In contrast, the stand-alone co-training-based tagger trained on the projections achieved 85% classification accuracy, illustrating its effectivess at generalization in the face of projection noise. Notably, most of its observed errors can be traced to entity classification errors from the original English tagger. In fact, when evaluated on the English translation of the French test data set, the English tagger only achieved 86% classification accuracy on this directly comparable data set. It appears that the projection-induced French tagger achieves performance nearly as high as its original training source. Thus further improvements should be expected from higher quality English training sources. MORPHOLOGICAL ANALYSIS INDUCTION Bilingual corpora can also serve as a very successful bridge for aligning complex inflected word forms in a new language with their root forms, even when their surface similarity is quite different or highly irregular. As illustrated in Figure 7 , the association between a French verbal inflection (croyant) and its correct root (croire), rather than a similar competitor (croître), can be identified by a single-step transitive association via an English bridge word (believing). However, in the case of morphology induction, such direct associations are relatively rare given that inflections in a second language tend to associate with similar tenses in English while the singular/infinitive forms tend to associate with analogous singular/infinitive forms, and thus croyaient (believed) and its root croire have no direct English link in our aligned corpus. However, Figure 2 (first page) illustrates that an existing investment in a lemmatizer for English can help bridge this gap by joining a multi-step transitive association croyaient 6 believed 6 believe 6 croire. lemmatization can be potentially utilized for all other English lemmas (such as THINK) with which croyaient and croire also associate, offering greater potential coverage and robustness via multiple bridges. Formally, these multiple transitive linkages can be modeled as shown below, by summing over all English lemmas (a d fe hg ) with which either a candidate foreign inflection (i infl ) or its root (i root) exhibit an alignment in the parallel corpus: \" Te gj k i Tl Cm Cm on C i I Ap !q gf rh I \" i rl Pm Cm on o a d fe g o p\" a d fe g H i I Xp sq For example: \" re gj t croire croyaient qf \" T t croire BELIEVE s\" T p BELIEVE croyaient Pu \" croire THINK p\" THINK croyaient tu wV YV YV This projection/bridge-based similarity measure \" mp i root i infl can be quite effective on its own, as shown in the MProj only entries in Table 3 (for multiple parallel corpora in 3 different languages), especially when restricted to the highest-confidence subset of the vocabulary (5.2% to 77.9% in these data) for which the association exceeds simple fixed probability and frequency thresholds. When estimated using a 1.2 million word subset of the French Hansards, for example, the MProj measure alone achives 98.5% precision on 32.7% of the inflected French verbs in the corpus (constituting 97.6% of the tokens in the corpus). Unlike traditional stringtransduction-based morphology induction methods where irregular verbs pose the greatest challenges, these typically high-frequency words are often the best modelled data in the vocabulary making these multilingual projection techniques a natural complement to existing models. Trie-based Morphology Models The high precision on the MProj-covered subset also make these partial pairings effective training data for robust supervised algorithms that can generalize the string transformation behavior to the remaining uncovered vocabulary. While any supervised morphological analysis technique is possible here, we employ a trie-based modeling technique where the probability of a given stem-change (from the inventory observed in the MProj-paired training data) is modeled hierarchically using variable suffix context, as described in Yarowsky and Wicentowski (2000) : \" # root inflection gf u\" # Rv xw h v zy q gf r\" # Ry 6 w h v zy q gf { I }| I \" # Ry  Table 3 illustrates the performance of a variety of morphology induction models. When using the projection-based MProj and trie-based MTrie models together (with the latter extending coverage to words that may not even appear in the parallel corpus), full verb lemmatization precision on the 1.2M word Hansard subset exceeds 99.5% (by type) and 99.9% (by token) with 95.8% coverage by type and 99.8% coverage by token. A backoff model based on Levenshtein-distance and distributional context similarity handles the relatively small percentage of cases where MProj and MTrie together are not sufficiently confident, bringing the system coverage to 100% coverage with a small drop in precision to 97.9% (by type) and 99.8% (by token) on the unrestricted space of inflected verbs observed in the full French Hansards. As shown in Section 7.3, performance is strongly correlated with size of the initial aligned bilingual corpus, with a larger Hansard subset of 12M words yielding 99.4% precision (by type) and 99.9% precision (by token). Performance on Czech is discussed in Section 7.3. Precision Morphology Induction via Aligned Bibles Performance using even small parallel corpora (e.g. a 120K subset of the French Hansards) still yields a respectable 93.2% (type) and 98.9% (token) precision on the verb-lemmatization test set for the full Hansards. Given that the Bible is actually larger (approximately 300K words, depending on version and language) and available on-line or via OCR for virtually all languages (Resnik et al., 2000) , we also conducted several experiments on Bible-based morphology induction, further detailed in Table 3 . Boosting Performance via Multiple Parallel Translations Even though at most one translation of the Bible is typically available in a given foreign language, numerous English Bible versions are freely available and a performance increase can be achieved by simultaneously utilizing alignments to each English version. As illustrated in Figure 10 , different aligned Bible pairs may exhibit (or be missing) different full or partial bridge links for a given word (due both to different lexical usage and poor textual parallelism in some text-regions or version pairs). However, \" i rl Pm om on o a d fe g and \" T t a d fe g x i infl need not be estimated from the same Bible pair. Even if one has only one Bible in a given source language, each alignment with a distinct English version gives new bridging opportunities with no additional resources needed on the source language side. The baseline approach (evaluated here) is simply to concatenate the different aligned versions together. While wordpair instances translated the same way in each version will be repeated, this rather reasonably reflects the increased confidence in this particular alignment. An alternate model would weight version pairs differently based on the otherwise-measured translation faithfulness and alignment quality between the version pairs. Doing so would help decrease noise. Increasing from 1 to 3 English versions reduces the type error rate (at full coverage) by 22% on French and 28% on Spanish with no increase in the source language resources. x y % R R x y % e R R R x y % % R Boosting Performance via Multiple Bridge Languages Once lemmatization capabilities have been successfully projected to a new language (such as French), this language can then serve as an additional bridging source for morphology induction in a third language (such as Spanish), as illustrated in Figure 11 . This can be particularly effective if the two languages are very similar (as in Spanish-French) or if their available Bible versions are a close translation of a common source (e.g. the Latin Vulgate Bible). As shown in Table 3 , using the previously analyzed French Bible as a bridge for Spanish achieves performance (97.4% precision) com-parable to the use of 3 parallel English Bible versions. % X R R Y R Morphology Induction: Observations This section includes additional detail regarding the morphology induction experiments, supplementing the previous details and analyses given in Section 7 and Table 3 . Performance induction using the French Bible as the bridge source is evaluated using the full test verb set extracted from the French Hansards. The strong performance when trained only using the Bible illustrates that even a small single text in a very different genre can provide effective transfer to modern (conversational) French. While the observed genre and topic-sensitive vocabulary differs substantially between the Bible and Hansards, the observed inventories of stem changes and suffixation actually have large overlap, as do the set of observed high-frequency irregular verbs. Thus the inventory of morphological phenomena seem to translate better across genre than do lexical choice and collocation models. Over 60% of errors are due to gaps in the candidate rootlists. Currently the candidate rootlists are derived automatically by applying the projected POS models and selecting any word with the probability of being an uninflected verb greater than a generous threshold and also ending in a canonical verb suffix. False positives are easily tolerated (less than 5% of errors are due to spurious non-root competitors), but with missing roots the algorithms are forced either to propose previously unseen roots or align to the closest previously observed root candidate. Thus while no non-English dictionary was used in the computation of these results, it would substantially improve performance to have a dictionary-based inventory of potential roots, increasing coverage and decreasing noise from competing non-roots and spelling errors. Performance in all languages has been significnatly hindered by low-accuracy parallel-corpus word-alignments using the original Model-3 GIZA tools. Use of Och and Ney's recently released and enhanced GIZA++ word-alignment models (Och and Ney, 2000) should improve performance for all of the applications studied in this paper, as would iterative realignments using richer alignment features (including lemma and part-of-speech) derived from this research. The current somewhat lower performance on Czech is due to several factors. They include (a) very low accuracy initial word-alignments due to often non-parallel translations of the Reader's Digest sample and the failure of the initial word-alignment models to handle the highly inflected Czech morphology. (b) the small size of the Czech parallel corpus (less than twice the length of the Bible). (c) the common occurrence in Czech of two very similar perfective and non-perfective root variants (e.g. odolávat and odolat, both of which mean to resist). A simple monolingual dictionaryderived list of canonical roots would resolve ambiguity regarding which is the appropriate target. Many of the errors are due to all (or most) inflections of a single verb mapping to the same incorrect root. But for many applications where the function of lemmatization is to cluster equivalent words (e.g. stemming for information retrieval), the choice of label for the lemma is less important than correctly linking the members of the lemma. The learning curves in Figure 12 show the strong correlation between performance and size of the aligned corpus. Given that large quantities of parallel text currently exist in translation bureau archives and OCR-able books, not to mention the increasing online availability of bitext on the web, the natural growth of available bitext quantities should continue to support performance improvement. The system analysis examples shown in Table 4 are representative of model performance and are selected to illustrate the range of encountered phenomena. All system evaluation is based on the task of selecting the correct root for a given inflection (which has a long lexicography-based consensus regarding the \"truth\"). In contrast, the descriptive analysis of any such pairing is very theory dependent without standard consensus. The \"TopBridge\" column shows the strongest English bridge lemma utilized in mapping (typically one of many potential bridge lemmas). These results are quite impressive in that they are based on essentially no language-specific knowledge of French, Spanish or Czech. In addition, the multilingual bridge algorithm is surface-form independent, and can just as readily handle obscure infixational or reduplicative morphological processes. CONCLUSION This paper has presented a detailed survey of original algorithms for cross-language annotation projection and noise-robust tagger induction, evaluated on four diverse applications. It shows how previous major investments in English annotated corpora and tool development can be effectively leveraged across languages, achieving accurate stand-alone tool development in other languages without comparable human annotation efforts. Collectively this work is the most comprehensive existing exploration of a very promising new paradigm for cross-language resource projection. Acknowledgements This research has been partially supported by NSF grant IIS-9985033 and ONR/MURI contract N00014-01-1-0685. The authors thank Silviu Cucerzan, Radu Florian, Jan Hajic, Gideon Mann and Charles Schafer for their valuable contributions and feedback. ",
    "abstract": "This paper describes a system and set of algorithms for automatically inducing stand-alone monolingual part-of-speech taggers, base noun-phrase bracketers, named-entity taggers and morphological analyzers for an arbitrary foreign language. Case studies include French, Chinese, Czech and Spanish. Existing text analysis tools for English are applied to bilingual text corpora and their output projected onto the second language via statistically derived word alignments. Simple direct annotation projection is quite noisy, however, even with optimal alignments. Thus this paper presents noise-robust tagger, bracketer and lemmatizer training procedures capable of accurate system bootstrapping from noisy and incomplete initial projections. Performance of the induced stand-alone part-of-speech tagger applied to French achieves 96% core part-of-speech (POS) tag accuracy, and the corresponding induced noun-phrase bracketer exceeds 91% F-measure. The induced morphological analyzer achieves over 99% lemmatization accuracy on the complete French verbal system. This achievement is particularly noteworthy in that it required absolutely no hand-annotated training data in the given language, and virtually no language-specific knowledge or resources beyond raw text. Performance also significantly exceeds that obtained by direct annotation projection.",
    "countries": [
        "United States"
    ],
    "languages": [
        "Japanese",
        "English",
        "Spanish",
        "French"
    ],
    "numcitedby": "536",
    "year": "2001",
    "month": "",
    "title": "Inducing Multilingual Text Analysis Tools via Robust Projection across Aligned Corpora"
}