{
    "article": "Introduction The COUNSELOR PROJECT began in the fall of 1984 with the goal of exploring basic problems in discourse structure and text processing within an integrated interface to a strong expert system. The program that we have developed, COUNSELOR, integrates separately developed components for natural language generation (MUMeLE see [7] , [8] , [9] ), parsing (PLUM [5] ), and case-based legal reasoning (Hvpo [1], [2] ). It adds a newly developed component, CICERO ([ 10] ), positioned between the two text processors and the expert system; CIc~o is responsible for managing textual inferences (\"reading between the lines\") by using common sense models of legal events. Coussez~t can provide advise to an attorney about how to argue cases involving violations of trade secret law in the computer field. The attorney presents the facts of their case to the system, which may ask questions to elicit other facts that it knows to be relevant. The system then suggests lines of argument that the attorney might use, drawing on its library of litigated cases to find ones with analogous dimensions. Motivations Consequential results in natural language research will only come from working with a strong underlying program whose communicative needs will challenge the capabilities of state of the art of language interfaces. As a group, we are not interested in building yet another question answering system: our goal is to understand the structure of discourse. We believe that an effective place to begin is with task specific, mixed initiative dialog where the particiants' goals cannot be satisfied by single utterances. Working with a legal reasoning system like Kevin Ashley and Edwina Rissland's Hvpo provides particular challenges to natural language research: (I) Legal text is structurally complex. The need to avoid ambiguity leads to deeply embedded clauses and heavy noun phrases. (2) As both the user and the system have a thorough knowledge of the law, they communicate vastly more information in conversations about legal arguments than ever appears in their literal utterances. (3) Hvpo's role as an advisory system creates a natural motivation to communicate through language. (4) Legal cases are large, complex objects that can be viewed from many alternative perspectives. The purpose for which a case is being described strongly influences which of its attributes are salient and how that information should be structured as a text. Component Parts We began the project with three partially developed components, Hvpo, MUMBLE, and PLUM, each designed with independent motivations. An initial tension was whether to convert aspects of these programs that did not seem apt in their new setting, or alternatively to interpose new components between them to smooth out the differences. We concluded that the motivations underlying each component were strong enough that we should not change them just because they were now working together. H~o reasons with cases and hypotheticals. Actually litigated legal cases are encoded and indexed by \"dimensions\", which capture the utility of a case for making a particular kind of argument. When evaluating new cases, Hvpo first analyzes them in terms of the dimensions they involve. Relevant cases are then retrieved to guide the reasoning. The system may ask pertinent questions about facts now found to be relevant. When the analysis is complete, H~o describes the arguments available to the user, and responses and counter responses that may follow. MUHSLS, the linguistic component for generation, is responsible for realizing conceptual specifications as grammatical text cohesive with the discourse which proceeds it. MU~LE works within a description directed framework. Its input specification is a description of the message the underlying program wants to communicate. This description is executed incrementally, producin~ an intermediate llnguistic representation wl~ich defines the text's grammatical relatlons and imposes constraints on further realization. This surface structure description is concurrently executed, producing the actual text. PLUM is a conceptual analyzer which has been given a well defined schematic structure so that it can be easily extended. It parses by doing prediction and completion over semantic concepts implied by the words rather than over syntactic categories. As in other conceptual analyzers, no explicit surface structure is recovered. Pt,uM's output is the set of completed frames. Clcmto is a new component, a discourse and inference manager between the language components and the expert system. From the understanding side, CICE20 must integrate the clause by clause output of the parser into the larger discourse context, recognizing, for example, when noun phrases refer to the same object. In interpreting these small, lexically derived frames, CIcEio draws on its own representation of events which bridges the gap between the way such information is expressed in language and the way it is organized for expert legal reasoning. For generation, CIcEI~o is responsible for planning the message that is given to the generator. In particular, it determines what information should be included and what may be omitted as inferable, and it selects pivotal lexical items with appropriate perspective and rhetorical force. Future Directions While the accomplishments of the individual components of Counselor are interesting in their own right, the greatest effect of the project has been to provide a workbench for studying the problems of language in an integrated context. Perennial problems in anaphora, lexical semantics, aspect, etc. become more tractable in an integrated system where there is a discourse context and intensional motivation. There are also semantic generalizations between the level at which the text processors operate and the level of the expert system which are more easily captured when parsing and generation can be studied in unison. On a larger scale, an explicit discourse manager, a requisite for more complex dialogs, can only be developed once an integrated system exists.",
    "abstract": "",
    "countries": [
        "United States"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "0",
    "year": "1986",
    "month": "",
    "title": "The {C}ounselor Project at the {U}niversity of {M}assachusetts"
}