{
    "article": "This paper documents the third in a series of Benchmark Tests for the DARPA Air Travel Information System (ATIS) common task domain. The first results in this series were reported at the June 1990 Speech and Natural Language Workshop [1], and the second at the February 1991 Speech and Natural Language Workshop [2]. The February 1992 Benchmark Tests include: (1) ATIS domain spontaneous speech recognition system tests, (2) ATIS natural language understanding tests, and (3) ATIS spoken language understanding tests. Since the February 1991 tests, a large ATIS spoken language corpus has been collected, coordinated by a DARPA \"Multi-Site ATIS Data COllection Working\" (MADCOW) Group. The activities of this group, and NIST's role in that effort, are documented in another paper in this Proceedings [3]. OCTOBER 1991 \"DRY RUN\" TESTS The procedures for test set selection, testing, scoring, adjudication, and reporting for the February 1992 ATIS Benchmark Tests were developed and used for a \"dry run\" test in October 1991, with unpublished results. A somewhat smaller test set was used at that time, which did not include test data from AT&T. The implementation of the tests was generally regarded as successful within the DARPA MADCOW Group and by the DARPA Spoken Language Program Coordinating Committee. • Following the February 1991 Workshop, minor revisions (e.g., to accommodate connecting flights, clar-ify terminology, revise headings and restructure tables, improve representation of fare structures, bug fixes, etc) were made to the relational air-travelinformation database. The MADCOW data collection effort, and systems developed with this data, made use of this revised relational database (Version 3.3). • The MADCOW data collection effort provided data from five sites (AT&T, BBN, CMU, MIT/LCS, and SRI), rather than the single ATIS data collection site (TI) used for the June 1990 and February 1991 tests. • Some (but not all) of the collecting sites provided secondary (Crown PCC-160) microphone data in addition to the primary (close-talking Sennheiser) microphone. The use of the secondary microphone data was encouraged, but not required, for the February 1992 tests. • The definition of \"Class D\" queries was broadened to include \"Class DI\" queries. • The files indicating the \"classification\" (i.e., Class A, D or X) for each query were not provided along with the test queries (as they had been in previous tests), so'that each site had no extra information regarding the context-dependency or answerability of each query. • Similarly, \"unanswerable\" (Class X) queries were not identified when the test material was released. If system developers provided answers for these queries, they were not scored. • No utterances were to be treated differently on the grounds of the presence of disfluencies such as false starts or restarts. In the February 1991 tests, these utterances were regarded as \"Optional\". • Concern had been expressed at the February 1991 meeting that some sites might have chosen to \"overgenerate\" (by providing verbose) NL and SLS answers rather than provide more succinct answers. It was argued that \"correct\" answers should have at least the information in the \".ref\" files previously used in scoring answers, but no more than in some specified maximal answer. Bob Moore and Eric Jackson, at SRI, proposed and implemented an algorithmic procedure for deriving maximal reference answers (\".rf2\") from the NLParse-generated SQL files used to generate the .ref files. Bill Fisher at NIST subsequently modified the NIST comparator (used in scoring the NL and SLS results) to implement the new \"minimum~maximum\" scoring procedure. The Principles of Interpretation document was modified to accommodate these changes. * Special reports were to be prepared by NIST to partition the tabulations of results according to the originating sites for the test data. • Following completion of each phase of scoring the results, NIST was to prepare and make available to all participants both detailed and summary reports via anonymous ftp. • Because there had been a recommendation to report results for all answerable queries in complete subject-scenarios (i.e., the material collected during one subject's working of one scenario), test material was to be provided to the testing sites in complete subject-scenarios. Emphasis was to be placed on analysis of the subset of \"answerable\" queries (i.e., Class A+D), rather than on the individual classes A and/or D. Further, the weighted error percentage (defined as twice the percentage of incorrect or \"false\" answers plus the percentage of \"No_Answer\" responses) was identified as preferable to the single-number \"Score\" reported at the February 1991 meeting (Score (%) = 100 (%)-[Weighted Error (%)1) TEST MATERIAL SELECTION AND DISTRIBUTION With the approval of the MADCOW Group, NIST had reserved approximately 20% of the pooled MADCOW data for test purposes. NIST screened this data for the occurrence of truncated utterances, rejected the subjectscenarios that included these phenomena, and determined that there was a sufficient quantity of reserved potential test material to permit release of a test set consisting of approximately 200 utterances from each of the five MADCOW sites contributing data. NIST did not monitor the audio quality of the .wav files nor review the accuracy of the transcriptions, since no criteria for acceptability based on these have been defined, although in retrospect this might have simplified the adjudication process. The test material, subsequent to deletion of some material during the adjudication process, consisted of 970 non-null (and 1 null) utterances in all classes. The number of distinct scenarios used by all subjects was 42, with a total of 37 subjects (\"speakers\") completing 122 subject-scenarios. There were 17 male subjects, and 20 were female. Seven of the 122 subject-scenarios used the \"Common-l\" scenario; however, the test material selected from BBN and CMU did not include any instances of this scenario. The average number of queries per subject-scenario was 8. The MIT subject-scenarios had an average number of 4.6 queries, and SRI and CMU each had an average number of 12.1 queries per subjectscenario. There were 508 lexemes represented in the test material. The average number of words per utterance was about 11. After NIST selected the test material, it was produced on CD-ROM. The test disc (NIST Speech Disc T3-1.1) was distributed to the testing sites on Jan. 6, 1992. Concurrent with preparation of the CD-ROMs, NIST staff and the \"Annotation Group\" at SRI initiated preparation of the annotation files required to implement scoring. TEST PROCEDURE Following completion of locally administered single-passper-system tests, participating sites submitted results for (at least) three ATIS tests: the SPeech RECognition (SPREC), Natural Language (NL) and Spoken Language System (SLS) tests. The format for data submission via e-mail was specified by NIST and all \"official\" results were received at NIST by 6:00 AM on Jan. 20, 1992. As in previous ATIS tests, answer hypotheses were to be in the form of lexical SNOR (.lsn) files for the SPREC results and in Common Answer Specification (CAS) format files for the NL and SLS results. Each submission was to be accompanied by a text file for each system providing a system description following a suggested format. TEST SCORING, ADJUDICATION AND REPORTING PROCEDURE Upon receipt of the test results, NIST implemented preliminary scoring with a reference answer set including .cat, .ref and .rff2 files developed at NIST and SRI for the NL and SLS tests, and the \"lexical SNOR\" (.lsn) files derived from the detailed (.sro) transcriptions provided by the collecting sites for the SPREC tests. On Jan. 24, 1992, upon completion of the preliminary scoring and preparation of the required reports, NIST released the preliminary results by anonymous ftp. A detailed and formal procedure was established at NIST at the MADCOW group's request for handling requests for adjudication. The participating sites filed a total of 122 requests for adjudication, which were treated by NIST and the SRI Annotation group in a manner similar to that followed for the training data's bug reports. Some of these requests involved more than one utterance, or reported on more than one \"bug\" in an utterance, so that the number of unique utterances potentially affected by the requests for adjudication was 193, or approximately 19% of the test material. Of these utterances, the adjudicators determined that 99 (51%) actually required one or more changes. \"No Action\" decisions were made for the remaining 49%. NIST was advised by Francis Kubala at BBN during the adjudication period that some of the reference transcriptions used for scoring the SPREC test appeared to be inaccurate. NIST subsequently reviewed all of the transcriptions noted by Kubala and corrected them as deemed appropriate. In addition to the 99 utterances noted as part of the formal requests for adjudication requiring changes to the annotations, 26 test utterances were identified by the adjudicators as requiring changes. The final total of 125 utterances (12.9% of the entire test set) for which annotation changes were made includes the following breakdown (by category): • 42 with software problems related to annotations or scoring (e.g., NLParse, batching, or Comparator bugs), • 36 for which annotation errors had been made, • 27 involved problems with the transcriptions developed at the originating sites, and • 20 involved differences of opinion in applying the Principles of Interpretation or the use of context in interpreting the query. Following completion of the adjudication process, NIST released a set of \"Official\" ATIS Benchmark Test results to the community on Feb. 5, 1992. NIST was subsequently advised by Paramax that corrections to the reference answer set that were to have been made during the adjudication process did not appear to have been made. NIST and SRI determined that this had in fact been the case, and a total of 19 .rf2 files were corrected. The entire set of NL and SLS results were then re-scored, and a \"Revised Official\" set of results was made available to the community. Analysis of the differences between these two sets of \"official\" results shows that only 5 of Paramax's NL and 4 of their SLS answers were scored differently. Paramax also noted, following release of the \"Revised Official\" results, that 20 of their NL as well as another 20 of their SLS answers were scored as \"False\" because of known limitations in the NIST official scoring software. NIST had determined that the degree to which Paramax's answers were affected by this known limita- Results are presented for a number of defined subsets of the utterances, with the utterance classes defined in the annotation process. The set Class ATDWX is the set of all utterances in all classes, consisting of 971 utterances. The set Class A+D includes all answerable utterances, 687 in all. Individual scores for the component subsets Class A, Class D, and Class X are also included. The utterances in Classes D and X tend to have a greater degree of disfluency than those in Class A. This factor may be reflected in the corresponding error rates, since the lowest subset error rates are to be found for Class A utterances, and the highest for Class X. In the set of answerable queries, Class A+D, the word error ranges from 6.2% to 13.8%, and the \"Utterance error rate\" (corresponding approximately to \"sentence error rate\", but acknowledging the fact that some utterances consist of more than one sentence) range from 34.6% to 60.1%. The lowest word error rate, in any of the subsets, 5.8%, is noted for the BBN system described in [5] for the subset of Class A utterances. Table 2 presents a matrix tabulation of ATIS SPREC results for the set of answerable queries, Class A+D. This matrix form of tabulation of results was developed at the MADCOW group's request to shed light on potential variabilities in the data for test set components from differing originating sites. The five columns of the matrix block correspond to the five originating sites for the MADCOW test data. In this case, the six rows of the matrix block correspond to the six sets of SPREC test results sent to NIST. The \"Overall Totals\" column at the right of the central block presents results corresponding to those cited for the Class A+D subset in Table 1 . Note, for example, that the previously cited lowest Class A+D subset word error of 6.2% (for the BBN system) is shown in the second row entry of this column. The \"Overall Totals\" row presents results accumulated over all systems for which results were reported to NIST. Note that the Overall (subset) Total Word Error (\"W. Error\") ranges from a low of 5.9%, for the data originating at MIT/LCS, to 14.6% for the AT&T data subset. These data suggest that the MIT data subset is less challenging for ATIS SPREC systems than the data from other sites, but the reasons for this are not immediately evident. Analysis of the transcriptions suggests that the AT&T data subset has a higher incidence of disfluencies than other subsets, partially explaining why it is more challenging than the other data subsets. For the \"Class A+D\" data, the lowest subset word error for any SPREC system is 3.2%, again for the BBN SPREC system and for the MIT data subset. Analysis of a similar matrix for the Class A data (not shown) indicates that the lowest subset word error (again for the MIT data subset) is 2.6% for the BBN system, with a corresponding utterance error of 20.7%. Secondary (Crown PCC-160) Microphone Data Three ATIS MADCOW sites provided data for both the Sennheiser close-talking microphone and the secondary (Crown PCC-160) microphone: CMU, MIT/LCS, and SRI. Two sites agreed to use the Crown microphone data with SPREC systems, using \"robust\" recognition algorithms: CMU and SRI. In some cases, results for other algorithms for comparable subsets of the data are available, and these have been excised from larger sets of data provided to NIST by CMU and SRI for the purposes of comparisons. Table 3 presents a matrix tabulation of the SPREC data for the Class A+D data from CMU, MIT/LCS and SRI for 5 systems (i.e., 3 from CMU and 2 from SRI). The \"cmu4\" system is the CMU Sphinx II system [6] processing the close-talking microphone data, the \"cmu6\" system is the CMU codeword-dependentcepstral-normalization (CDCN) system [7] processing the close-talking data, and the \"cmu3\" system is the CMU CDCN system processing the Crown microphone data. The \"sri3\" system (processing the close-talking microphone data) and \"sri4\" system (processing the Crown microphone data) are versions of the Sl:tI Decipher system incorporating the \"I:tASTA\" procedure for high-pass filtering of a log-spectral representation of speech [8] . For the close-talking microphone data subset, the lowest word error rate (7.0%) is for the sri4 system, which may be compared to the cmu4 system (10.4%) and the cmu6 system (13.7%). According to the system description provided by CMU, the two CMU systems differ in the amount of training material, among other factors. For the secondary microphone data subset, the word error rate for the cmu3 system is 17.8%, and for the sri4 system is 30.4%. There are indications of substantial variabilities due to originating site for the secondary microphone data, with both the SRI and CMU data secondary microphone data subsets giving rise to higher error rates than for the MIT data subsets. Natural Language (NL) Tests Table 5 presents a tabulation of the February 1992 ATIS Natural Language (NL) understanding tests results. Results are presented for the set of all \"answerable utterances\", Class A+D, and for the individual Class A and Class D subsets. As was the case for the SPREC results, in general the error rates are higher for Class D than for Class A utterances. For the set of answerable queries, Class A+D, the weighted error ranges from 30.1% to 75.4%. Note that five of the systems have weighted error percentages between 30.1% and 33.9%. Table 6 presents a matrix tabulation for the NL test results for the set of answerable queries, Class A+D. There were a total of 687 queries in this set. The numbers tabulated for this set in Table 5 appear in the \"Overall Totals\" column, along with corresponding percentages. The \"Overall Totals\" row indicates the variability due to the test subsets' originating site. Of the 5 data subsets, the lower weighted error percentages in the \"Overall Totals\" row are to be found for the CMU and MIT data, with the SPd, AT&T, and BBN data giving rise to higher weighted error percentages. Since the AT&T data was collected using a significantly different collection paradigm-with the subject interfacing with the ATIS system simulation only over a phone line, rather than viewing a screen display of travel information [10] -the fact that the AT&T data subset is more difficult than three other sites is perhaps not surprising. However, the BBN ATIS data collection effort also differed somewhat from that at other MADCOW sites in that -although information was presented using a screen display -the BBN scenarios \"included not only trip planning scenarios, but also problem solving involving more general kinds of database access... This was done to try to elicit a richer range of language usage.[3]\" This factor (\"richer language usage\") may provide a partial explanation for the high NL error rates noted for the BBN data subset. For the CMU and MIT [11] systems, there appears to be some indication that the error percentages for \"locallycollected\" data are lower than for \"foreign\" data, perhaps because of greater familiarity with the local datacollection scenarios and environment, or use of a variant of the system under test when collecting the MADCOW data from which the test set was selected. 7.3 Spoken Language Systems (SLS) Tests Table 7 presents a tabulation of the February 1992 Spoken Language System understanding test results. As was the case for Table 5 (for the corresponding NL results), results are shown for several classes of the data, but emphasis in this material is placed on the answerable utterances, comprising Class A+D. For the Class A+D set, the seven SLS systems have weighted error ranging from 43.7% to 90.2%. Note that four systems (from three sites: BBN, MIT and SRI [12] ) have weighted error percentages between 43.7% and 52.8%. Of the 5 data subsets corresponding to different collection sites, the range in weighted error is from 49.5% (for the MIT data) to 73.1% (for the AT&T data). ACKNOWLEDGEMENT The authors would like to acknowledge the help provided by the entire MADCOW community throughout the ordeal of collecting, annotating, distributing and using the MADCOW corpus for test purposes. A companion paper in this Proceedings provides a detailed acknowledgement, but special credit was earned by Lynette I-Iirschman as Chair of the MADCOW Group. It is to everyone's credit that the essential data was collected, annotated, and distributed and that \"deadlines\" were usually honored! Special thanks are also due to the group at MIT, particularly Michael Phillips and Christie Clark Winterton, for quick turn-around in producing recordable CD-ROM discs for distribution of the MADCOW training corpus from master tapes produced by Brett Tjaden at NIST. The Annotation Group at SRI, consisting of Kate Hunicke-Smith, Harry Bratt and Beth Bryson, was invaluable to the NIST effort to implement these tests. They participated actively and cheerfully in annotation of the test material and the adjudication process, in addition to \"training\" one of the authors (ND) in the use of the NLParse software and annotation techniques. Francis Kubala, at BBN, called NIST's attention to some problematic transcriptions for the SPREC tests. NIST reviewed and revised these as appropriate, and in the process noted 3 truncated utterances (in one subjectscenario collected at BBN). While the revised transcriptions were used in NIST's \"revised official\" scoring, NIST neglected to delete this subject-scenario from the NL and SLS tests, as specified by MADCOW protocols for handling data with truncated utterances. Analysis of performance on this particular subject-scenario indicates that most sites did well, nonetheless. References APPENDIX: \"OFFICIAL\" \"UNOFFICIAL\" RESULTS VS. Several sites expressed interest in having results for additional systems included in NIST's \"official\" summary, although these results typically were not available at the required time for \"official\" scoring. At least one site took exception to an idiosyncratic property of the \"official\" comparator's treatment of their system's responses to several queries, and requested permission to present \"unofficial\" results at the meeting. Another site noted that they had identified a \"bug\" in their CAS-answer-format software, and after it was fixed, they also requested permission to report unofficial results. It was subsequently decided that the results submitted to NIST by the specified deadline, and uniformly scored at NIST with the \"official\" comparator and the adjudicated final set of reference answers would comprise the only \"official\" results, and that locally scored results should be represented as \"unofficial\", even if scored with the same scoring software and answer set as the \"official\" results. It should be noted that since the results are for locally implemented tests, and since NIST's role in the tests is principally one of selecting and distributing the test material, and implementing the scoring software and uniformly tabulating the results of the tests, the results are not to be construed or represented as endorsements of any systems or official findings on the part of NIST, DARPA or the U.S. Government. Class A+D+X Subset ",
    "abstract": "This paper documents the third in a series of Benchmark Tests for the DARPA Air Travel Information System (ATIS) common task domain. The first results in this series were reported at the June 1990 Speech and Natural Language Workshop [1], and the second at the February 1991 Speech and Natural Language Workshop [2]. The February 1992 Benchmark Tests include: (1) ATIS domain spontaneous speech recognition system tests, (2) ATIS natural language understanding tests, and (3) ATIS spoken language understanding tests. Since the February 1991 tests, a large ATIS spoken language corpus has been collected, coordinated by a DARPA \"Multi-Site ATIS Data COllection Working\" (MADCOW) Group. The activities of this group, and NIST's role in that effort, are documented in another paper in this Proceedings [3]. OCTOBER 1991 \"DRY RUN\" TESTS The procedures for test set selection, testing, scoring, adjudication, and reporting for the February 1992 ATIS Benchmark Tests were developed and used for a \"dry run\" test in October 1991, with unpublished results. A somewhat smaller test set was used at that time, which did not include test data from AT&T. The implementation of the tests was generally regarded as successful within the DARPA MADCOW Group and by the DARPA Spoken Language Program Coordinating Committee.",
    "countries": [
        "United States"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "25",
    "year": "1992",
    "month": "",
    "title": "{DARPA} {F}ebruary 1992 {ATIS} Benchmark Test Results"
}