{
    "article": "We explore the feasibility of contextual healthiness classification of food items. We present a detailed analysis of the linguistic phenomena that need to be taken into consideration for this task based on a specially annotated corpus extracted from web forum entries. For automatic classification, we compare a supervised classifier and rule-based classification. Beyond linguistically motivated features that include sentiment information we also consider the prior healthiness of food items. (3) Vegetables are healthy, in particular, if you suffer from diabetes. (4) Potatoes are healthy since they are actually low in calories. Introduction Food plays a substantial part in each of our lives. With the growing health awareness in many parts of the population, there is consequently a high demand for the knowledge about healthiness of food. In view of the variety of both different types of food and nutritional aspects it does not come as a surprise that there is no comprehensive repository of that knowledge. Since, however, much of this information is preserved in natural language text, we assume that it is possible to acquire some of this knowledge automatically with the help of natural language processing (NLP). In this paper, we take a first step towards this endeavour. We try to identify mentions that a food item is healthy (1) or unhealthy (2). (1) There is not a healthy diet without a lot of fruits, vegetables and salads. (2) The day already began unhealthy: I had a piece of cake for breakfast. This task is a pre-requisite of more complex tasks, such as finding food items that are suitable for certain groups of people with a particular health condition (3) or identifying reasons for the healthiness or unhealthiness of particular food items (4). The major problem of identifying some Is-Healthy or Is-Unhealthy relation is that the simple co-occurrence of a food item and the word healthy or unhealthy is not sufficiently predictive as shown in ( 5 )-( 7 ). (5) Chocolate is not healthy. (6) The industry says chocolate is healthy, but I guess this is just a marketing strategy. (7) If chocolate is healthy, then I will run for the next presidential election. We describe the contextual phenomena that underlie these cases and provide detailed statistics as to how often they occur in a typical text collection. From this analysis we derive features to be incorporated into a classifier. Our experiments are carried out on German data. We believe, however, that our findings carry over to other languages since the aspects addressed in this work are (mostly) language universal. For the sake of general accessibility, all examples will be given as English translations. To the best of our knowledge, this is the first work that addresses the classification of healthiness of food items using NLP. Related Work In the food domain, the most prominent research addresses ontology or thesaurus alignment (van Hage et al., 2010) , a task in which concepts from different sources are related to each other. In this context, hyponymy relations (van Hage et al., 2005) and part-whole relations (van Hage et al., 2006) have been explored. More recently, Wiegand et al. (2012a) examined extraction methods for relations involved in customer advice in a supermarket. In Chahuneau et al. (2012) , sentiment information has been related to food prices with the help of a large corpus consisting of restaurant menus and reviews. In the health/medical domain, the majority of research focus on domain-specific relations involving entities, such as genes, proteins and drugs (Cohen and Hersh, 2005) . More recently, the prediction of epidemics (Fisichella et al., 2011; Torii et al., 2011; Diaz-Aviles et al., 2012; Munro et al., 2012) has attracted the attention of the research community. In addition, there has been research on processing healthcare claims (Popowich, 2005) and detecting sentiment in health-related texts (Sokolova and Bobicev, 2011) . The Dataset In order to generate a dataset for our experiments, we used a crawl of chefkoch.de 1 (Wiegand et al., 2012a) consisting of 418, 558 webpages of foodrelated forum entries. chefkoch.de is the largest German web portal for food-related issues. While we are aware of the fact that the healthiness of food items is also discussed in scientific texts we think that the text analysis on social media serves its own purpose. The language in social media is much more accessible to the general population. Moreover, social media can be considered as an exclusive repository of popular wisdom containing, for example, home remedies. Healthiness Markers & Food Items As it is impractical for us to manually label the entire web corpus with healthiness information, we extracted for annotation sentences in which there is a healthiness marker and a mention of a food item. By healthiness marker, we understand an expression that conveys the property of being healthy. Apart from the word healthy itself, we came up with 17 further common expressions (e.g. nutritious, healthful or in good health). Since the word healthy covers more than 95% of the mentions of healthiness markers in our entire corpus, however, we decided to restrict our healthiness marker exclusively to mentions of that expression. Thus, our main focus in this classification task is the contextual disambiguation, i.e. the task to decide whether a specific co-occurrence of the expression healthy and some food item denotes a genuine Is-(Un)Healthy relation. The food items for which we extract cooccurrences with the healthiness marker healthy (Table 7 ) will henceforth be referred to as target food items. In order to obtain a suitable list of items for our experiments, we manually compiled a list of frequently occurring types of food. 1 www.chefkoch.de \"Unhealthy\" vs. \"Not Healthy\" In order to obtain instances that express an Is-Unhealthy relation, we exclusively consider negated instances of the Is-Healthy relation (8). We also experimented with a dataset with mentions of the word unhealthy (paired with our target food items) to extract instances such as (9). (8) I am convinced that cake is not healthy. (9) I am convinced that cake is unhealthy. Using the same target food items, the unhealthydataset is, however, less than 14% of the size of the healthy-dataset. We also found that instances of the Is-Unhealthy-relation are not easier to detect on the unhealthy-dataset, since the unhealthydataset produced much poorer classifiers for detecting Is-Unhealthy relations than the healthydataset using negations as a proxy. Annotation Our final dataset comprises 2, 440 instances, where each instance consists of a sentence with the co-occurrence of some food item and the word healthy accompanied by the two sentences immediately preceding and the two sentences immediately following it. The dataset was manually annotated by two German native speakers. On 4 target food items (this corresponds to 574 target sentences) 2 we measured an inter-annotation agreement of Cohen's κ = 0.7374 (Landis and Koch, 1977) which should be sufficiently high for our experiments. The annotators had to choose from a rich set of category labels that particularly divide the negative examples (i.e. those cases in which the cooccurrence of the target food item and healthy neither expresses an Is-Healthy nor an Is-Unhealthy relation) into different categories. In the following, we describe the different category labels. Their distribution is shown in Table 1 . Is-Healthy Relation (HLTH) This class describes instances in which there holds an Is-Healthy relation between the mention of healthy and the target food item (10). (10) Potatoes are incredibly healthy, versatile in the kitchen and very tasty. Is-Unhealthy Relation (UNHLTH) We already stated in §3.2 that we consider negated instances (11) as instances for the Is-Unhealthy relation. We have a fairly broad notion of negation, e.g. ( 12 ) and (13) will also be assigned to this category. These partial negations are at least as frequent as full negations (11). However, we assume that the latter are often employed only as a means of being polite even though the speaker's intention is that of a full negation. The fact that we also observed fewer mentions of unhealthy cooccurring with a target food item than negated mentions of healthy would be in line with this theory (unhealthy is usually perceived to be more intense/blunter than not healthy). (11) Chocolate is not healthy. (12) Chocolate is not very healthy. (13) Chocolate is hardly healthy. Other Relations Apart from the two target relations, we observe the following other relationships: Restricted Relation (RESTR) This category describes cases in which the Is-Healthy relation holds provided some additional condition is fulfilled. Typical conditions address a special kind of preparing the target food item ( 14 ) or make quantitative restrictions as to the amount of the target food item to be consumed (15). As such, one cannot infer from restricted relations to general properties of food items. (14) Steamed vegetables are extremely healthy. (15) A teaspoon of honey each day has been proven to be quite healthy. Unspecified Intersection (INTERS) In relation extraction, syntactic relatedness between the candidate entities of a relation is usually considered an important cue (Zhou et al., 2005; Mintz et al., 2009) . In particular, the specific type of syntactic relation needs to be considered. If in our task healthy is an attributive adjective of the target food item (16), this is not an indication of a genuine Is-Healthy relation that we are looking for. With this construction, one usually refers to all those entities that share the two properties (intersection) of being the target food item and being healthy. This case is different from both HLTH (17) and RESTR (18). ( 16 ) I usually buy the healthy fat. (17) Fat is healthy. (18) I usually buy the healthy fat, the one that contains a high degree of unsaturated fatty acids. HLTH, typically realized as a predicative adjective ( 17 ), requires that this intersection of properties includes the entire set of entities representing the target food item. For both RESTR and INTERS, on the other hand, this intersection only includes a proper subset of the target food item. In addition, RESTR provides some (vital) additional information about this subset that allows it to be (easily) identified (e.g. the property of containing a high degree of unsaturated fatty acids in ( 18 )). However, for INTERS, no further properties are specified in order to identify it -the information of being healthy is not telling as we actually want to find out how to detect healthy food. As a consequence, instances of type INTERS are hardly informative when it comes to answering whether a particular food item is healthy or not. We do not even know how large the proportion of the intersection with regard to the overall amount of the target food item is. It may well be extremely small. That is why in this work, instances of INTERS will neither be used as evidence for the healthiness nor the unhealthiness of a particular food item. Comparison Relation (COMP) If the target food item is compared with another food item with regard to their healthiness status ( 19 ) & (20), one cannot conclude anything regarding the absolute healthiness of the target food item. This is due to the fact that a comparison assumes healthiness as a (continuous) scale rather than a binary (discrete) property. It determines the positions of the two food items relative to each other on that particular scale. (19) Honey is healthier than chocolate. (target food item: honey) (20) Honey is as healthy as chocolate. (target food item: honey) Unsupported Claim (CLAIM) In our initial data analysis, we found frequent cases in which the author of a forum entry reports a (controversial) statement regarding the healthiness status of a particular food item. These claims are often used as a means of starting a discussion about that issue (21). (21) Some people claim that chocolate is healthy. What do you make of it? If it is not possible to infer from such reported statement that the reported view is shared by the author (and we found that this is true for many reported statements), we tag it as CLAIM. Question (Q) There may also be cases in which the Is-(Un)Healthy relation is embedded in a question ( 22 ). ( 22 ) Is chocolate healthy? Irony (IRO) Irony ( 23 ) is a figure of speech that can frequently be observed in user-generated text (Tsur et al., 2010) . With a proportion of less than 1%, this, however, does not apply for the forum entries that comprise our data collection. (23) Everyone knows that sweets are healthy, in particular, chocolate with its many calories even makes you lose weight. Embedding (EMB) In addition to the previous categories CLAIM and IRO, there exist other ways of embedding the healthiness relation into a context so that the general validity of it is discarded. We introduce a common label for all those other remaining types that include, for instance, modal embedding (24) or irrealis construction (25). (24) Honey could be healthy. (25) If chocolate were healthy, people eating it wouldn't put on so much weight. Other Sense (SENSE) Both the target food item and the German healthiness cue gesund are (potentially) ambiguous expressions. For instance, gesund can be part of several multiword expressions, such as gesunder Menschenverstand (engl. common sense). No Relation (NOREL) While in all previously discussed cases the target food item and healthy are somehow related, there are cases in which the co-occurrence is merely coincidental ( 26 ). (26) Tomatoes are very healthy and they can be ideally served on bread. (target food item: bread) On our dataset, this is the most frequent label. Feature Design All features we use are summarized in Table 2 along examples. Apart from bag of words (word), we use following features: Linguistic Features The linguistic features are mainly derived from our quantitative data analysis in §4. Given the limited space of this paper, we will only point out some special properties. The first group of (linguistic) features (Table 2 ) is designed to detect some relationship between target food item and healthy. The co-occurrence within the same clause is usually a good predictor. There are three features to establish this property: clause, boundary and otherFood. We already pointed out in §4.3.2 that not only syntactic relatedness between healthy and the target food item as such but also the specific syntactic relation plays a decisive role for this task. The two most common relations are that healthy is a predicative adjective (of the target food item), which is usually indicative of HLTH, and that healthy is an attributive adjective (of the target food item), which is usually indicative of INTERS (on our dataset in more than 90% of the instances labeled with INTERS this is the case). This is reflected by the two features predRel and attrRel (and the backoff features pred and attr). An additional feature attrFood captures a special construction in which healthy as an attributive adjective actually denotes HLTH instead of INTERS. For the conditional healthiness RESTR ( § 4.3.1), we found two predominant subcategories of restrictions: restrictions with regard to the quantity with which the target food item should be consumed (quant) and references to a specific subtype of the target food item, which we want to capture with a few precise surface patterns (spec) and a feature that checks whether the target food item precedes an attributive adjective (attrNoH). Table 2 also contains features to detect various contextual embeddings (opHolder, question, irrealis, modal and irony). opHolder is to detect cases of CLAIM. We assume once some opinion holder other than the author of the forum post (i.e. 1st person pronoun) is identified, there is a CLAIM. We also investigate whether healthiness correlates with sentiment. For instance, if the author promotes the healthiness of some food item, does this also coincide with positive sentiment (e.g. tasty, good etc.)? Our features positive/negative polar check for the presence of polar expressions. Knowledge-based Features using a Healthiness Lexicon We also incorporate features referring to the prior knowledge of healthiness of food items. We use a lexicon introduced in Wiegand et al. (2012b) which covers approximately 3000 food items, and we refer to it as healthiness lexicon. Each food item is specified as being either healthy or unhealthy in that lexicon. The healthiness judgment has been carried out based on the general nutrient content of each food item. A detailed description of the annotation scheme and annotation agreement can be found in Wiegand et al. (2012b) . The specific features derived from that lexical resource are listed in Table 2 . They are divided into two groups. prior describes the prior healthiness of the target food item. Since our task is to determine the contextual healthiness, the usage of such a feature is legitimate. The contextual healthiness need not to coincide with the prior healthiness. For instance, in (27), chocolate is described as a healthy food item even though it is a priori considered unhealthy. (27) Chocolate is healthy as it's high in magnesium and provides vitamin E. We use this knowledge as a baseline. If we cannot exceed the classification performance of prior (alone), then acquiring the knowledge of healthiness with the help of NLP is hardly effective. priorCont describes the prior healthiness status of neighbouring food items in the given context. Rule-based Classification We also examine rule-based classifiers since they can be built without any training data. Each classifier is defined by a (large) conjunction of linguistic features. Features indicating a class other than the target class are used as negated features in that conjunction. The rule-based classifiers only consider features where a positive or negative correlation towards the target class is (more or less) obvious. Table 3 shows the rule-based classifiers for each of our classes. For HLTH, it basically states that healthy has to be a predicative adjective of the target food item (predRel), and the target food item and healthy have to appear within the same clause (or there is no boundary sign between them). After that, a long list of negated features follows: quant, spec and attrNoH, for exam- Experiments In this section we present the results on automatic classification. Classification of Individual Utterances In this subsection, we evaluate the performance of the different feature sets on sentence-level classification using supervised learning and rule-based classification. We investigate the detection of the two classes HLTH ( §4.1) and UNHLTH ( §4.2). Each instance to be classified is a sentence in which there is a co-occurrence of a target food item and a mention of healthy along its respective context sentences. The dataset was parsed using the Stanford Parser (Rafferty and Manning, 2008) . We carry out a 5-fold cross-validation on our manually labeled dataset. As a supervised classifier, we use Support Vector Machines (SVM light (Joachims, 1999) with a linear kernel). For each class, we train a binary classifier where positive instances represent the class to be extracted while negative instances are the remaining instances of the entire dataset ( §4). Is there a cue indicating an opinion holder other than the author? opHolder Some people claim that chocolate is healthy. This feature relies on a set of predicates indicating the presence of an opinion holder (Wiegand and Klakow, 2011) . Is target sentence a (direct) question? question Is chocolate healthy? Is healthy embedded in some irrealis context? irrealis If honey were healthy; I wonder, whether honey is healthy. Translation of the cues used in hedge classification (Morante and Daelemans, 2009) . Is healthy modified by a modal verb? modal Honey might be healthy. Is target food item negated? Comparison of Various Feature Sets negTarget No cake is healthy. We adapted to German the negation word lists and the scope modeling from Wilson et al. (2005) . Is healthy negated? negHealth Chocolate is not healthy. We adapted to German the negation word lists and the scope modeling from Wilson et al. (2005) . Is there any occurrence of a weird word? weird Sure, chocolate is veeeeery healthy. Regular expression detecting suspicious reduplications of characters in order to detect irony. Does the context suggest that healthy is part of a comparison? comp We check for typical inflectional word forms (i.e. healthier and healthiest) and constructions, such as as healthy as. Does the context of healthy suggest another sense of the word? sense Contexts in which healthy has a different meaning (using online dictionaries, such as www.duden.de/rechtschreibung/gesund and de.wiktionary.org/wiki/gesund). Number of positive/negative polar expressions (excluding mentions of healthy) polar* Usage of the German PolArt sentiment lexicon (Klenner et al., 2009) . Number of near synonyms of (un)healthy syno* Examples for healthy: high in vitamin, tonic, etc.; examples for unhealthy: carcinogenic, harmful, etc. (manually compiled list of 99 synonyms by an annotator not involved in feature engineering). Number of diseases disease* 411 entries, created with the help of the web (bildung.wikia.com/ wiki/Alphabetische Liste der Krankheiten). Task-specific Knowledge-based Features using a Healthiness Lexicon Feature Abbrev. Illustration/Further Information Is target food item a priori healthy? prior* Feature employs the healthiness lexicon from Wiegand et al. (2012b) . Is target food item a priori unhealthy? Number of food items (excluding target food item) that are a priori healthy priorCont* Feature employs the healthiness lexicon from Wiegand et al. (2012b) . Number of food items (excluding target food item) that are a priori unhealthy *: there exist two features which differ in the context they consider: (a) only target sentence (indicated by suffix -TS) (b) entire context (indicated by suffix -EC) Table 2 : Description of the feature set; the set contains several cue word lists, in order to avoid overfitting, we either translated existing resources from English or used diverse web-resources that are not related to our dataset. HLTH UNHLTH Features Pre Rec F1 Pre Rec F1 take-all (baseline 1) 20.3 100.0 33.7 6.9 100.0 13.0 prior (baseline 2) 28.0 87.  take-all has optimal recall but a very poor precision. The second baseline prior is notably better. prior may help to distinguish between HLTH and UNHLTH but it does not contribute to distinguishing these classes from the rest of the relation types (Table 1 ). If we turn to the features that largely exploit contextual information, i.e. word and linguistic ( §5.1), we find that both features are better than the previous features. This is an indication that learning from text is effective. The same can be said about word+linguistic and word+prior, which also outperform word. word+linguistic+prior is the best feature set outperforming both word+linguistic and word+prior. We conclude that all of the three groups of features we presented in §5 are relevant for this task. In terms of recall and F-score the supervised classifier always outperforms the rule-based classifier. This does not come as a surprise as the supervised classifier learns from labeled training data while the rule-based classifier is unsupervised. On the other hand, we also find that the precision of the rule-based classifier largely outperforms our best supervised classifier on HLTH. The fact that the best overall F-score achieved is not higher may be ascribed to the heavy noise (spelling/grammar mistakes) contained in our web-data. However, we believe that even with those data we can show the relative effectiveness of the different feature types which is the most relevant aspect in our proof-of-concept investigation. prom, attrNoH, predRel, comp, negHealth, negative polarEC, sense, opHolder, irrealis UNHLTH negHealth, negTarget, attrRel, comp, diseaseTS, negative po-larEC Table 5 : List of the best subset of linguistic features (Table 2 ) for each individual class. Class Features HLTH Inspection of Linguistic Features Table 5 shows the best performing feature subset using a best-first forward selection as implemented in Weka (Witten and Frank, 2005) . The Detecting Anti-Prior Healthiness We now take a closer look at anti-prior instances which are utterances in which the relation expressed is opposite to the relation that one would a priori assume, e.g. chocolate is healthy instead of chocolate is unhealthy. In our gold standard, we identified these instances with the help of the actual (manually assigned) label and our healthiness lexicon ( §5.2). 4 Such instances may be very interesting to extract, even though they are rare (15% on HLTH and UNHTLH). Previously, supervised classifiers with word+prior produced similar performance as classifiers with word+linguistic (Table 4). Since linguistic features are fairly expensive to produce, the prior knowledge of healthiness seems an attractive alternative. But this is misleading. Aggregate Classification Finally, we automatically rank food items according to healthiness based on the aggregate of text mentions. Ideally, the ranking should separate healthy from unhealthy food items. We want to know whether with our text corpus and contextual classification, one can actually approximate a correct prior healthiness. Aggregate classification means that we make a healthiness prediction for a specific food item based on all text mentions of that food item co-occurring with the word healthy. It may be easier to achieve a robust aggregate classification than a robust individual classification. This is because in aggregate-based tasks, there is a certain degree of redundancy contained in the data, as instances of a group of utterances (belonging to the same food item) may often comprise similar information. For such classifiers, one should focus on a higher precision since a reasonable recall is enabled by the redundancy in the data. Our baseline RAW is completely unsupervised and does not include any linguistic processing. We use the Pointwise Mutual Information (PMI) which is estimated on our large web corpus ( §3). 5 P MI(f ood item, healthy) = log P (f ood item, healthy) P (f ood item)P (healthy) For the automatic classification, we consider LEARN which uses the output of the supervised classifier comprising the features word+linguistic (we must exclude the feature prior as this would include the knowledge we want to predict automatically in this experiment) 6 while RB is the output of the rule-based classifier we presented in §6 (which does not contain prior as a feature either). In order to convert the classifications of individual utterances for a target food item (by LEARN and RB) to one ranking score (according to which we rank all the target food items), we simply compute the ratio between instances predicted to be healthy and those predicted to be unhealthy: score LEARN/RB (f ood item) = #HLTH predicted (f ood item) #UNHLTH predicted (f ood item) (2) 5 For P (f ood item, healthy), we consider all sentences in which the target food item and healthy co-occur. 6 We train for each target food item a classifier using only the instances with the other target food items as training data. where #HLTH predicted (f ood item) are the number of instances the classifier predicts the label HLTH for the target food item while UNHLTH predicted (f ood item) are the number of instances labeled as UNHLTH, respectively. Table 7 shows the results of the three rankings. The actual labels are derived from the healthiness lexicon ( §5.2). The table clearly shows that the ranking produced by RAW contains most errors. fat is the second most highly ranked food item. This can be explained by the high proportion of INTERS ( §4.3.2) among the co-occurrences of fat and healthy (almost 50%). LEARN and RB produce a better ranking, thus proving that a contextual (linguistic) analysis is helpful for this task. RB also outperforms LEARN presumably because of its much higher precision (as measured for individual classification in Conclusion We presented a first step towards contextual healthiness classification of food items. For this task, we introduced a new annotation scheme. Our annotation revealed that many different linguistic phenomena are involved. Thus, this problem can be considered an interesting task for NLP. We demonstrated that a linguistic analysis is not only necessary for classifying individual utterances but also for ranking food items based on an aggregate of text mentions. Acknowledgements This work was performed in the context of the Software-Cluster project EMERGENT. Michael Wiegand was funded by the German Federal Ministry of Education and Research (BMBF) under grant no. \"01IC10S01\". The authors would like to thank Stephanie Köser and Eva Lasarcyk for annotating the dataset presented in this paper. We would also like to thank Benjamin Roth for interesting discussions.",
    "abstract": "We explore the feasibility of contextual healthiness classification of food items. We present a detailed analysis of the linguistic phenomena that need to be taken into consideration for this task based on a specially annotated corpus extracted from web forum entries. For automatic classification, we compare a supervised classifier and rule-based classification. Beyond linguistically motivated features that include sentiment information we also consider the prior healthiness of food items. (3) Vegetables are healthy, in particular, if you suffer from diabetes. (4) Potatoes are healthy since they are actually low in calories.",
    "countries": [
        "Germany"
    ],
    "languages": [
        "English",
        "German"
    ],
    "numcitedby": "5",
    "year": "2013",
    "month": "October",
    "title": "Towards Contextual Healthiness Classification of Food Items - A Linguistic Approach"
}