{
    "article": "We describe a data-driven approach for automatically explaining new, non-standard English expressions in a given sentence, building on a large dataset that includes 15 years of crowdsourced examples from UrbanDictionary.com. Unlike prior studies that focus on matching keywords from a slang dictionary, we investigate the possibility of learning a neural sequence-tosequence model that generates explanations of unseen non-standard English expressions given context. We propose a dual encoder approach-a word-level encoder learns the representation of context, and a second character-level encoder to learn the hidden representation of the target non-standard expression. Our model can produce reasonable definitions of new non-standard English expressions given their context with certain confidence. Introduction In the past two decades, the majority of NLP research focused on developing tools for the Standard English on newswire data. However, the nonstandard part of the language is not well-studied in the community, even though it becomes more and more important in the era of social media. While we agree that one must take a cautious approach to automatic generation of non-standard language (Hickman, 2013) , but for many practical purposes, it is also of crucial importance for machines to be able to understand and explain this important subversion of the language. In the NLP community, using dictionaries of non-standard language as an external knowledge source is useful for many tasks. For example, Burfoot and Baldwin (2009) consult the slang defini-Figure 1 : An example Tweet with a non-standard English expression. Our model aims at automatically explaining any newly emerged, non-standard expressions (generating the blue box). tions from Wiktionary to detect satirical news articles. Wang and McKeown (2010) show that using a slang dictionary of 5K terms can help detecting vandalism of Wikipedia edits. Han and Baldwin (2011) make use of the same slang dictionary, and achieve the best performance by combining the dictionary lookup approach with word similarity and context for Twitter and SMS text normalization. However, using a 5K slang dictionary may suffer from the coverage issue, since slang is evolving rapidly in the social media age 1 . Recently, Thanapon Noraset (2016) shows that it is possible to use word embeddings to generate plausible definitions. Nonetheless, one weakness is that definition of a word may change within different contexts. In contrast, we take a more radical approach: we aim at building a general purpose sequence-tosequence neural network model (Sutskever et al., 2014) to explain any non-standard English expression, which can be used in many NLP and social media applications. More specifically, given a sentence that includes a non-standard English expression, we aim at automatically generating the translation of the target expression. Previously, this is not possible because the resources of labeled non-standard expressions are not available. In this paper, we collect a large corpus of 15 years of crowdsourced examples, and formulate the task as a sequence-to-sequence generation problem. Using a word-level model, we show that it is possible to build a general purpose non-standard English words and phrases explainer using neural sequence learning techniques. To summarize our contributions: • We present a large, publicly available corpus of non-standard English words and phrases, including 15 years of definitions and examples for each entry via crowdsourcing; • We present a hybrid word-character sequence-to-sequence model that directly explains unseen non-standard expressions from social media; • Our novel dual encoder LSTM model outperforms a standard attentive LSTM baseline, and it is capable of generative plausible explanation for unseen non-standard words and phrases. In the next section, we outline related work on non-standard expressions and social media text processing. We will then introduce our dual encoder based attentive sequence-to-sequence model for explaining non-standard expressions in Section 3. Experimental results are shown in Section 4. And finally, we conclude in Section 5. Related Work The study of non-standard language is of interests to many researchers in the social media and NLP communities. For example, Eisenstein et al. (2010) propose a latent variable model to study the lexical variation of the language on Twitter, where many regional slang words are discovered. Zappavigna (2012) identifies the Internet slang as an important component in the discourse of Twitter and social media. Gouws et al. (2011) provide a contextual analysis of how social media users shorten their messages. Notably, a study on Tweet normalization (Han and Baldwin, 2011) finds that, even when using a small slang dictionary of 5K words, Slang makes up 12% of the ill-formed words in a Twitter corpus of 449 posts. In the NLP community, slang dictionary is widely used in many tasks and applications (Burfoot and Baldwin, 2009; Wang and McKeown, 2010; Rosenthal and McKeown, 2011) . However, we argue that using a small, fixed-size dictionary approach may be suboptimal: it suffers from the low coverage problem, and to keep the dictionary up to date, maintaining such dictionary is also expensive and time-consuming. To the best of our knowledge, our work is the first to build a general purpose machine learning model for explaining non-standard English terms, using a large crowdsourced dataset. 3 Our Approach Sequence-to-Sequence Model Since our goal is to automatically generate explanations for any non-standard English expressions, we select sequence-to-sequence models with attention mechanisms as our fundamental framework (Bahdanau et al., 2014) , which can produce abstractive explanations, and assign different weights to different parts of a sentence. To model both the context words and the non-standard expression, we propose a hybrid word-character dual encoder. An overview of our model is shown in Figure 2 . Context Encoder Our context encoder is basically a recurrent neural network with long-short term memory (LSTM) (Hochreiter and Schmidhuber, 1997) . LSTM consists of input gates, forget gates and output gates, together with hidden units as its internal memory. Here, i controls the impact of new input, while f is a forget gate, and o is an output gate. Ct is the candidate new value. h is the hidden state, and m is the cell memory state. \" \" means element-wise vector product. The definition of the gates, memory, and hidden state is: i t = σ(W i [x t , h t−1 ]) f t = σ(W f [x t , h t−1 ]) o t = σ(W o [x t , h t−1 ]) Ct = tanh(W c [x t , h t−1 ]) m t = m t−1 f t + i t Ct h t = m t o t At each step, RNN is given a vector as input, changes its hidden states and produces outputs from its last layer. Hidden states and outputs are stored and later passed to a decoder, which produces final outputs based on hidden states, outputs, and the decoder's own parameters.The context encoder learns and encodes sentence-level information for the decoder to generate explanations. Attention Mechanism The idea of designing an attention mechanism is to select key focuses in the sentence. More specifically, we would like to pay attention to specific parts of encoder outputs and states. We follow a recent study (Vinyals et al., 2015) to setup an attention mechanism. We have a separate LSTM for decoding. Here we briefly explain the method. When the decoder starts its decoding process, it has all hidden units from the encoder, denoted as (h 1 ..h T 1 ). Also we denote the hidden state of the decoder (d 1 ..d T 2 ). T 1 and T 2 are input and output lengths. At each time step, the model computes new weighted hidden states based on encoder states and three learnable components: v, W 1 and W 2 . u t i = v T tanh(W 1 h i + W 2 d t ) a t i = sof tmax(u t i ) d t = T 1 i=1 a t i h i Here a denotes the attention weights. u t has length T 1 . After the model computes d t , it concatenates d t and d t as new hidden states used for prediction and next update. Dual Encoder Structure Given a single context encoder, it is challenging for any decoder to generate explanation in the instance. The reason is that there could be multiple non-standard expressions in the sentence, and it confuses the decoder on which one it should explain. In practice, the user can often pin point to the exact expression she or he does not know, so in this work, we design a second encoder to learn the representation of the target non-standard expression. Since our goal is to explain any non-standard English words and phrases, we consider a character-level encoder for this purpose. This second encoder reads the embedding vector of each character at each time step, and produces an output vector, and hidden states. Our dual encoder model linearly combines the hidden states of the character-level target expression encoder with the hidden states of the word-level encoder with the following equation: h new = h 1 W 1 + h 2 W 2 + B Here, h 1 is the context representation, and h 2 is the target expression representation. The Bias B and the combination weights W 1 and W 2 are learnable. Experiment Dataset We collect the non-standard English corpus 2 from Urban Dictionary (UD) 3 -the largest online slang dictionary, where terms, definitions and examples are submitted by the crowd. UD is made a reliable resource, due to the quality control of its publishing procedure. To prevent vandalism, a user must have a Facebook or Gmail account, and when each user submits an entry, the UD editors will vote \"Publish\" or \"Don't Publish\" (Lloyd, 2011) . Each editor is also distinguished by IP addresses, and HTTP cookies are used to prevent each editor from cheating. In recent years, United States Federal government has consulted UD for the definition of \"murk\" in a threat case (Jackson, 2011) , whereas UD is also referred in a financial restitution case in Wisconsin (Kaufman, 2013) , as well as determining appropriate license plates in Las Vegas (Davis, 2011) . A total of 421K entries (words and phrases) from the period of 1999-2014 are collected. Each entry includes a list of candidate definitions and examples, as well as the surface form of the target Instance: \"dude taht roflcopter was pretty loltastic!!1!\" Target: loltastic Reference: something funnyishly fantastic. Generated Explanation (Single): a really cool , amazing , and good looking . Generated Explanation (Dual): a word that is extremely awesome . Instance: \"danny is so jelouse of my work!\" Target: jelouse Reference: how unintelligent people who think they are better than someone spells \"jealous\". Generated Explanation (Single): your friend ' s way of saying \" Generated Explanation (Dual): a word used to describe a situation , or a person who is a complete idiot . Instance: \"that sir right there, is being quite adoucheous\" Target: adoucheous Reference: a person acting in a conformative manner that causes social upset and violence. Generated Explanation (Single): when a male is being a male and a male . Generated Explanation (Dual): the act of being a douchebag . term. Using the UD API, we can pinpoint the token positions of the words/phrases, and obtain the ground truth labels for tagging. Our training and testing data use all the examples in an entry (a non-standard expression). We randomly select 371,028 entries for training, resulting in 907,624 sequence pairs of instance and reference explanation. The test set includes 50,000 entries, and 61,330 sentences. Note that all testing target non-standard expressions, instances and examples do not overlap with those in the training dataset. Experimental Settings Our implementation is based on Tensorflow 4 . For input embeddings, we randomly initialize the word vectors. We use stochastic gradient descent with adaptive learning rate to optimize the cross entropy function. We use BLEU scores (Papineni et al., 2002) for the evaluation. Quantitative and Qualitative Results Quantitative experimental results are showed in We see that the single encoder and full character level context models do not offer the best empirical performances on this dataset. Our novel dual encoder method, which combines the strengths of word-level and character-level sequence-tosequence models, obtained the best performance. For qualitative analysis, we provide some generated explanations in Figure 3 . For example, the first target non-standard expression is the word \"loltastic\", which is a combination of the words \"lol\" and \"fantastic\". To explain this composite non-standard expression, a character-level encoder is needed. The generated explanation from our dual encoder approach clearly makes more sense than the single decoder result. Overall, dual encoder can explain words with more confidence partly because it knows which words it needs to explain, especially for sentences containing multiple non-standard English words and phrases. Our model can also accurately explain many known acronyms. We also notice that LSTM cells outperform gated recurrent units (GRUs) (Cho et al., 2014) , and attention mechanism improves the performance. Conclusion In this paper, we introduce a new task of learning to explain newly emerged, non-standard English words and phrases. To do this, we collected 15year of UrbanDictionary data, and designed a dual encoder attentive sequence-to-sequence model to learn the hidden context representation and the hidden non-standard expression embedding. We showed that combining word-level and characterlevel models improved the performance for this task",
    "abstract": "We describe a data-driven approach for automatically explaining new, non-standard English expressions in a given sentence, building on a large dataset that includes 15 years of crowdsourced examples from UrbanDictionary.com. Unlike prior studies that focus on matching keywords from a slang dictionary, we investigate the possibility of learning a neural sequence-tosequence model that generates explanations of unseen non-standard English expressions given context. We propose a dual encoder approach-a word-level encoder learns the representation of context, and a second character-level encoder to learn the hidden representation of the target non-standard expression. Our model can produce reasonable definitions of new non-standard English expressions given their context with certain confidence.",
    "countries": [
        "United States"
    ],
    "languages": [
        "English"
    ],
    "numcitedby": "27",
    "year": "2017",
    "month": "November",
    "title": "Learning to Explain Non-Standard {E}nglish Words and Phrases"
}