{
    "article": "Linking concepts and named entities to knowledge bases has become a crucial Natural Language Understanding task. In this respect, recent works have shown the key advantage of exploiting textual definitions in various Natural Language Processing applications. However, to date there are no reliable large-scale corpora of sense-annotated textual definitions available to the research community. In this paper we present a large-scale high-quality corpus of disambiguated glosses in multiple languages, comprising sense annotations of both concepts and named entities from a unified sense inventory. Our approach for the construction and disambiguation of the corpus builds upon the structure of a large multilingual semantic network and a state-of-the-art disambiguation system; first, we gather complementary information of equivalent definitions across different languages to provide context for disambiguation, and then we combine it with a semantic similarity-based refinement. As a result we obtain a multilingual corpus of textual definitions featuring over 38 million definitions in 263 languages, and we make it freely available at http://lcl.uniroma1.it/disambiguated-glosses. Experiments on Open Information Extraction and Sense Clustering show how two state-of-the-art approaches improve their performance by integrating our disambiguated corpus into their pipeline. Introduction In addition to lexicography, where their use is of paramount importance, textual definitions drawn from dictionaries or encyclopedias have been widely used in various Natural Language Processing tasks and applications. Some of the areas where the use of definitional knowledge has proved to be key in achieving state-of-the-art results are Word Sense Disambiguation (Lesk, 1986; Banerjee and Pedersen, 2002; Navigli and Velardi, 2005; Agirre and Soroa, 2009; Fernandez-Ordonez et al., 2012; Chen et al., 2014; Camacho-Collados et al., 2015b) , Taxonomy and Ontology Learning (Velardi et al., 2013; Flati et al., 2014; Espinosa-Anke et al., 2016) , Information Extraction (Richardson et al., 1998; Delli Bovi et al., 2015) , Plagiarism Detection (Franco-Salvador et al., 2016) , and Question Answering (Hill et al., 2015) . In fact, textual definitions (or glosses) are today widely to be found in resources of various kinds, from lexicons and dictionaries, such as WordNet (Miller et al., 1990) or Wiktionary, to encyclopedias and knowledge bases, such as Wikidata and OmegaWiki. These include Wikipedia itself: indeed, the first sentence of a Wikipedia article is generally regarded as the definition of its subject 1 . In any case, an accurate semantic analysis of a definition corpus is made difficult by the short and concise nature of definitional text. Furthermore, the majority of approaches making use of definitions are restricted to corpora where each concept or entity is associated with a single definition, while definitions coming from different resources are often complementary and might give different perspectives on the definiendum. Moreover, equivalent definitions of the same concept or entity may vary substantially according to the language, and be more precise or self-explanatory in some languages than others. This has the potential to be especially valuable in the context of disambiguation (Navigli, 2009) , where highly ambiguous terms in one language may become less ambiguous (or even unambiguous) in other languages. In this paper we bring together definitions coming from both different resources and different languages, and disambiguate them by exploiting their cross-lingual and crossresource complementarities. Our goal is to obtain a largescale high-quality corpus of sense-annotated textual definitions. In order to do this we leverage BabelNet 2 (Navigli and Ponzetto, 2012) , a multilingual lexicalized semantic network obtained from the automatic integration of lexicographic and encyclopedic resources. Due to its wide coverage of both lexicographic and encyclopedic terms, Babel-Net gives us a very large sense inventory for disambiguation, as well as a vast and comprehensive target corpus of textual definitions. In fact, as it is a merger of various different resources, BabelNet provides a large heterogeneous set of over 35 million definitions for over 250 languages from WordNet, Wikipedia, Wiktionary, Wikidata and OmegaWiki. To the best of our knowledge, this set constitutes the largest available corpus of definitional text. We evaluate our sense-annotated corpus intrinsically, obtaining a disambiguation precision of over 90% on a random sample of definitions in three different languages, and extrinsically on Open Information Extraction and Sense Clustering tasks. Our experiments show the potential of exploiting our disambiguated glosses within the pipelines of two state-of-the-art systems, improving on their original performance. Related Work Among all resources using textual definitions, WordNet has definitely been the most popular and the most exploited to date. In fact, WordNet glosses have still been used successfully in recent work (Khan et al., 2013; Chen et al., 2015) . A first attempt to disambiguate WordNet glosses automatically was proposed as part of the eXtended WordNet project 3 (Novischi, 2002) . However, this attempt's estimated coverage did not reach 6% of the total amount of sense-annotated instances. Moldovan and Novischi (2004) proposed an alternative disambiguation approach, specifically targeted at the WordNet sense inventory and based on a supervised model trained on the SemCor sense-annotated corpus (Miller et al., 1993) . In general, the drawback of supervised models arises from the so-called knowledgeacquisition bottleneck, a problem that becomes particularly vexed when such models are applied to larger inventories, due to the vast amount of annotated data they normally require. Another disambiguation task focused on WordNet glosses was presented as part of the SensEval-3 workshop (Litkowski, 2004) . However, the best reported system obtained precision and recall figures below 70%, which arguably is not enough to provide high-quality senseannotated data for current state-of-the-art NLP systems. In addition to annotation reliability, another issue that arises when producing a corpus of textual definitions is wide coverage. In fact, reliable corpora of sense-annotated definitions produced to date, such as the Princeton Word-Net Gloss Corpus 4 , have usually been obtained by relying on human annotators. The Princeton corpus of WordNet disambiguated glosses has already been shown to be successful as part of the pipeline in semantic similarity (Pilehvar et al., 2013) , domain labeling (González et al., 2012) and Word Sense Disambiguation (Agirre and Soroa, 2009; Camacho-Collados et al., 2015b) systems. However, as new encyclopedic knowledge about the world is constantly being harvested, keeping up using only human annotation is becoming an increasingly expensive endeavor. With a view to tackling this problem, a great deal of research has recently focused on the automatic extraction of definitions from unstructured text (Navigli and Velardi, 2010; Benedictis et al., 2013; Espinosa-Anke and Saggion, 2014; Dalvi et al., 2015) . On the other hand, the prominent role of collaborative resources (Hovy et al., 2013) has created a convenient development ground for NLP systems based on encyclopedic definitional knowledge. Nevertheless, extending the manual annotation of definitions to much larger and up-todate knowledge repositories like BabelNet is not feasible. First of all, the number of items to disambiguate is massive; moreover, as the number of concepts and named entities increases, annotators would have to deal with the added difficulty of selecting context-appropriate synsets from an extremely large sense inventory. In fact, WordNet 3.0 comprises 117 659 synsets and a definition for each synset, while BabelNet 3.0 covers 13 801 844 synsets with a total of 40 328 194 definitions. Instead, in this paper we propose an automatic disambiguation approach which leverages multilinguality and cross-resource information along with a state-of-the-art shtml multilingual Word Sense Disambiguation/Entity Linking system (Moro et al., 2014) and a vector-based semantic representation of concepts and entities (Camacho-Collados et al., 2015a) . By exploiting these features, we are able to produce a large-scale high-quality corpus of glosses, automatically disambiguated with BabelNet synsets 5 . Methodology The gist of our approach lies in the combination of different languages and resources for high-quality disambiguation. In fact, since many definitions are short and concise, the lack of meaningful context would negatively affect the performance of a Word Sense Disambiguation/Entity Linking system targeted at individual definitions. To improve the data quality before the disambiguation step, we tokenize and Part-of-Speech (PoS) tag the definitions for a subset of languages: Tokenization. We use the tokenization system available from the polyglot project 6 for 165 languages. Part-of-Speech tagging. We train the Stanford tagger (Toutanova et al., 2003) , for 30 languages using the available data from the Universal Dependencies project 7 (Nivre, 2015) . Our disambiguation strategy is based on two steps: (1) all definitions are gathered together, grouped by definiendum and disambiguated using a multilingual disambiguation system (Section 3.1.); (2) the disambiguation output is then refined using semantic similarity (Section 3.2.). Context-rich Disambiguation As an example, consider the following definition of castling in chess as provided by WordNet: Interchanging the positions of the king and a rook. (1) The context in ( 1 ) is limited and it might not be obvious for an automatic disambiguation system that the concept being defined relates to chess: an alternative definition of castling where the game of chess is explicitly mentioned would definitely help the disambiguation process. Following this idea, given a BabelNet synset, we carry out a context enrichment procedure by collecting all the definitions of this synset in every available language and resource, and gathering them together into a single multilingual text. We use a state-of-the-art graph-based approach to Entity Linking and Word Sense Disambiguation, Babelfy 8 (Moro et al., 2014) , to disambiguate definitions after preprocessing and context-enrichment. Our methodology relies on the fact that, as shown in Section 3. Babelfy incorrectly disambiguates rook as \"rookie, inexperienced youth\". However, by using additional definitions from other resources and languages, Babelfy exploits the added context and disambiguates rook with its correct chess sense. This approach is particularly advantageous for languages with low resources, where standard disambiguation techniques have not yet proved to be reliable, due to the shortage of annotated data. Disambiguation Refinement Babelfy outputs a set D of disambiguated instances, i.e. mappings from text fragments to items in the BabelNet sense inventory, each associated with a confidence score (Babelfy score henceforth). When Babelfy score goes below 0.7, a back-off strategy based on the most common sense is used by default for that instance. Our aim is to correct or discard these low-confidence instances using Semantic Similarity. First, for each disambiguated instance d ∈ D we compute a coherence score C d . The coherence score is provided by Babelfy as the number of semantic connections from d to the rest of disambiguation instances in the semantic graph (normalized): C d = |Disambiguated instances connected to d| |Disambiguated instances| − 1 (2) We empirically set a coherence score threshold to 0.125 (i.e. one semantic connection out of eight disambiguated instances). Let L be the set of disambiguated instances below both Babelfy and coherence score thresholds (low confidence). In order to refine the disambiguated instances in L, we use NASARI 9 (Camacho-Collados et al.,  2015a; Camacho-Collados et al., 2015b). NASARI provides vector representations for over four million BabelNet synsets built by exploiting the complementary knowledge of Wikipedia and WordNet. These semantic representations have proved capable of obtaining state-of-the-art results in various lexical semantics tasks such as Semantic Similarity, Sense Clustering and Word Sense Disambiguation.We consider those instances in L for which a NASARI vector can be retrieved (virtually all noun instances), and compute an additional score (NASARI score). First, we calculate the centroid µ of all the NASARI vectors for instances in D \\ L. Then, for each disambiguated instance l ∈ L, we retrieve all the candidate senses of its surface form in BabelNet and calculate a NASARI score N s for each candidate sense. N s is calculated as the cosine similarity between the centroid µ and its corresponding NASARI vector N ASARI(s): N s = Sim(µ, N ASARI(s)) (3) The NASARI score allows us to both discard lowconfidence disambiguated instances and correct the original disambiguation output by Babelfy in some cases. Then, each l ∈ L is re-tagged with the sense obtaining the highest NASARI score: ŝ = argmax s∈S l N l (4) where S l is the set containing all the candidate senses for l. For what concerns the high-precision disambiguated glosses release (see Section 6.) we set the NASARI threshold to 0.75. Considering example (1) again, Babelfy does not provide a high-confidence disambiguation for the word king, which is then incorrectly disambiguated using the most common sense strategy. However, the error is fixed during the refinement step: our system accurately selects the chess sense of king thanks to its high semantic connection with the disambiguated instances in D \\ L. Statistics The output of our disambiguation procedure is a corpus of 38 820 114 glosses extracted from BabelNet (corresponding to 8 665 300 BabelNet synsets), covering 263 languages and 5 different resources (Wiktionary, WordNet 10 , Wikidata, Wikipedia 11 and OmegaWiki) and including 249 544 708 annotations from the BabelNet sense inventory (6.4 annotations per definition on average). Table 1 reports some general statistics of the complete corpus of disambiguated textual definitions and for five sample languages: English, Spanish, French, Italian and Persian. The number of disambiguated instances, before and after the refinement step, are displayed in Tables 2 and 3 , organized, respectively, by language and Part-of-Speech (PoS). Babelfy and NASARI refer to the instances disambiguated by the two respective approaches and MCS to the instances which were disambiguated using the Most Common Sense (MCS) heuristic. After refinement, 24.7% of the low-confidence noun annotations are fixed using semantic similarity (see Section 3.2.). Assuming the coverage of our first disambiguation step (see Section 3.1.) to be 100% 12 , the coverage of our system after the refinement step is estimated to be 65.3%. As shown in Table 3 , discarded annotations mostly include verbs, adjectives and adverbs, often harder to disambiguate as they are not directly related to the definiendum. In fact, the coverage of noun instances after refinement is estimated to be 73.9%. Evaluation Intrinsic evaluation We first carry out an intrinsic evaluation of the resource, by manually assessing the quality of disambiguation on some randomly extracted samples of definitions. We rely on three human judges and evaluate samples of 100 items for three languages. We evaluated the disambiguation output before and after the refinement step, and compared against a baseline where each definition is disambiguated in isolation with Babelfy. Table 4 reports the evaluation on the three sample languages: English, Spanish and Italian. Although the disambiguation of context-free definitions improves only slightly with respect to the disambiguation of definitions in isolation, this improvement is consistent across languages. Furthermore, our system significantly increases the precision after the refinement step. Refinement reduces the coverage by 35% for English, and by 43% for Spanish and Italian, but increases precision by almost 11% for English, 20% for Spanish and 13% for Italian. Extrinsic evaluation The sense-annotated corpus of definitions is also evaluated extrinsically with two experiments. The first experiment (Section 5.2.1.) evaluates our corpus before the highprecision refinement, and is focused on DEFIE (Delli Bovi et al., 2015) , an Open Information Extraction (OIE) system that works on textual definitions. In its original implementation DEFIE uses Babelfy to disambiguate definitions oneby-one before extracting relation instances. We modified that implementation and used the glosses disambiguated with our approach as input for the system, and we compared the extracted information with the information obtained by the original implementation. The second experiment (Section 5.2.2.), instead, evaluates our refined highprecision corpus, and focuses on the semantic representations of NASARI (Section 3.2.). These representations were constructed based on the BabelNet semantic network. We reimplemented NASARI using the same network enriched with the high-precision disambiguated glosses and compared these with the original glosses in the sense clustering task. Open Information Extraction In this experiment we investigated the impact of our disambiguation approach on the definitional corpus used as input for the pipeline of DEFIE. The original OIE pipeline of the system takes as input an unstructured corpus of textual definitions, which are then preprocessed one-by-one to extract syntactic dependencies and disambiguate word senses and entity mentions. After this preprocessing stage, the algorithm constructs a syntactic-semantic graph representation for each definition, from which subject-verbobject triples (relation instances) are eventually extracted. As highlighted in Section 3.1., poor context of particularly short definitions may introduce disambiguation errors in the preprocessing stage, which then tend to propagate and reflect on both relations and relation instances. To assess the quality of our disambiguation methodology as compared to a standard approach, we modified the implementation of DEFIE to consider our disambiguated instances instead of executing the original disambiguation step, and then we evaluated the results obtained at the end of the pipeline in terms of quality of relation and relation instances. Experimental setup. We first selected a random sample of 150 textual definitions from our disambiguated corpus (Section 4.). We generated a baseline for the experiment by discarding all disambiguated instances from the sample, and treating the sample itself as an unstructured text of textual definitions which we used as input for DEFIE, letting the original pipeline of the system carry out the disambiguation step. Then we carried out the same procedure using, instead, the modified implementation for which our disambiguated instances are taken into account. In both cases, we ran the extraction algorithm of DEFIE and evaluated the output in terms of both relations and relation instances. Following Delli Bovi et al. (2015) , we relied on two human judges and performed the same evaluation procedure described therein over the set of distinct relations extracted from the sample, as well as the set of extracted relation instances. Results. Results reported in Tables 5 and 6 show a slight but consistent improvement resulting from our disambiguated glosses over both the number of extracted relations and triples and over the number of glosses with at least one extraction (Table 5 ), as well as over the estimated precision of such extractions (Table 6 ). Context-rich disambiguation of glosses across resources and languages enabled the extraction of 6.5% additional instances from the sample (2.26 extractions on the average from each definition) and, at the same time, increased the estimated precision of relation and relation instances over the sample by ∼1%. Sense Clustering This experiment focuses on the sense clustering task. Knowledge resources such as Wikipedia or WordNet suffer from the high granularity of their sense inventories. A meaningful cluster of senses within these sense inventories would help boost the performance in different applications (Hovy et al., 2013) . In this section we will explain how to deal with this issue in Wikipedia. We integrate the high-precision version of the network as enrichment of the BabelNet semantic network in order to improve the results of the state-of-the-art system based on NASARI lexical vectors (more details of NASARI in Section 3.2.). NASARI uses Wikipedia ingoing links and the BabelNet taxonomy in the process of obtaining contextual information for a given concept. We simply enrich the BabelNet taxonomy with the high-precision disambiguated glosses (see Section 3.2.) of the target language. The highprecision disambiguated glosses are synsets that are highly semantically connected with the definiendum, which makes them particularly suitable for enriching a semantic network. The rest of the default NASARI lexical pipeline for obtaining semantic representations (lexical specificity applied to the contextual information) remains unchanged. By integrating the high-precision disambiguated glosses into the NASARI pipeline, we obtain a new set of vector representations for BabelNet synsets, increasing its initial coverage (4.4M synsets covered by the default NASARI compared to 4.6M synsets covered by NASARI enriched with our disambiguated glosses). Experimental setup. We used the two sense clustering datasets created by Dandala et al. (2013) . The task in these datasets consists of, given a pair of Wikipedia articles, to decide whether they should be merged into a single cluster or not. The first dataset (500-pair henceforth) contains 500 pairs of Wikipedia articles, while the second dataset (SemEval) consists of 925 pairs coming from a set of highly ambiguous words taken from disambiguation tasks of SemEval workshops. We follow the original setting of (Camacho-Collados et al., 2015a ) and only cluster a pair of Wikipedia articles if their similarity, calculated by using the square-rooted Weighted Overlap comparison measure (Pilehvar et al., 2013) , surpasses 0.5 (i.e. the middle point in the Weighted Overlap similarity scale). Results. Table 7 shows the results of different systems in the sense clustering task. As a naive baseline we include a system which clusters all pairs. For comparison we also include the Support Vector Machine classifier of Dandala et al. (2013) exploiting information of Wikipedia in four different languages (Dandala-multilingual) . Finally, we report the results of the default NASARI English lexical vectors (NASARI 13 ) and the NASARI-based vectors obtained from the BabelNet semantic network enriched with our high-precision disambiguated glosses (NASARI+glosses). As we can see from Table 7 , the enrichment produced by our glosses proved to be highly beneficial, significantly improving on the original results obtained by NASARI. Moreover, NASARI+glosses obtains the best performance overall, outperforming Dandala-multilingual in terms of accuracy in both datasets.  Table 7 : Accuracy (Acc.) and F-Measure (F1) percentages of different systems on the Wikipedia sense clustering datasets. Release The corpus of disambiguated glosses is freely available at http://lcl.uniroma1.it/ disambiguated-glosses. We released both the complete (Section 3.1.) and the high-precision (Section 3.2.) versions of our corpus. The format for each of the two versions is almost identical: the corpus is first divided by resource (WordNet, Wikipedia, Wiktionary, Wikidata and OmegaWiki) and each resource is then divided by language. The disambiguated glosses for each language and resource are stored in standard XML files. Figures 1 and  2 show a sample definition as displayed in the XML files of, respectively, the high-precision and complete version of our disambiguated corpus. Each file contains a list of definition tags, with their respective id 14 as attribute. Then, each definition tag is composed by the original definition as plain text and annotations. The annotation tag refers to the sense-annotations provided as a result of our disambiguation process. Each annotation includes its disambiguated BabelNet id and has four (or five) attributes (see Section 3. for more details about the attributes): • source: this indicates whether the disambiguation has been performed by Babelfy, the Most Common Sense (\"MCS\") heuristic (only in the complete version of the corpus) or NASARI (only in the high-precision version of the corpus). • anchor: this corresponds to the exact surface form match found within the definition. • bfScore: this corresponds to the Babelfy score. • coherenceScore: this corresponds to the coherence score. • nasariScore: this corresponds to the NASARI score (only for the high-precision annotations). Conclusion In this paper we presented a large-scale multilingual corpus of disambiguated glosses. Disambiguation was performed by exploiting cross-resource and cross-language complementarities of textual definitions. By leveraging the structure of a wide-coverage semantic network and sense inventory like BabelNet, we obtained a fully disambiguated corpus of textual definitions coming from multiple sources and multiple languages which, to the best of our knowledge, constitutes the largest available corpus of its kind. Additionally, we refined our sense annotations by integrating a module based on semantic similarity into our disambiguation pipeline, in order to identify a subset of highprecision disambiguated instances across the definitions. This refined version of the corpus has a great potential in high-precision low-coverage applications, where having a disambiguation error as low as possible is the first requirement. Since the disambiguated instances in this version of the corpus are directly connected to the definiendum, this high-precision disambiguated corpus may also be used to enrich a semantic network, or even used as a semantic network on its own. We evaluated our corpus intrinsically on three different languages, showing that our system outperforms previous approaches and a standard state-of-theart disambiguation system in terms of coverage, precision and recall. We also carried out an extrinsic evaluation that shows some applications of our resource: we integrated the complete and high-precision versions of our corpus into the pipeline of both an Open Information Extraction system and a Sense Clustering system, improving on their original results and obtaining state-of-the-art figures in both tasks. Acknowledgments The authors gratefully acknowledge the support of the ERC Starting Grant Multi-JEDI No. 259234.",
    "abstract": "Linking concepts and named entities to knowledge bases has become a crucial Natural Language Understanding task. In this respect, recent works have shown the key advantage of exploiting textual definitions in various Natural Language Processing applications. However, to date there are no reliable large-scale corpora of sense-annotated textual definitions available to the research community. In this paper we present a large-scale high-quality corpus of disambiguated glosses in multiple languages, comprising sense annotations of both concepts and named entities from a unified sense inventory. Our approach for the construction and disambiguation of the corpus builds upon the structure of a large multilingual semantic network and a state-of-the-art disambiguation system; first, we gather complementary information of equivalent definitions across different languages to provide context for disambiguation, and then we combine it with a semantic similarity-based refinement. As a result we obtain a multilingual corpus of textual definitions featuring over 38 million definitions in 263 languages, and we make it freely available at http://lcl.uniroma1.it/disambiguated-glosses. Experiments on Open Information Extraction and Sense Clustering show how two state-of-the-art approaches improve their performance by integrating our disambiguated corpus into their pipeline.",
    "countries": [
        "Italy"
    ],
    "languages": [
        "Italian",
        "French",
        "Persian",
        "English",
        "Spanish"
    ],
    "numcitedby": "20",
    "year": "2016",
    "month": "May",
    "title": "A Large-Scale Multilingual Disambiguation of Glosses"
}