{
    "article": "In this paper we conduct an initial study on the dialects of Romanian. We analyze the differences between Romanian and its dialects using the Swadesh list. We analyze the predictive power of the orthographic and phonetic features of the words, building a classification problem for dialect identification. Introduction and Related Work The rapid development of the online repositories has lead to a significant increase in the number of multilingual documents, allowing users from all over the world to access information that has never been available before. This accelerated growth created the stringent need to overcome the language barrier by developing methods and tools for processing multilingual information. Nowadays, NLP tools for the official languages spoken in the European Union and for the most popular languages are constantly created and improved. However, there are many other language varieties and dialects that could benefit from such NLP tools. The effort for building NLP tools for resource-poor language varieties and dialects can be reduced by adapting the tools from related languages for which more resources are available. The importance of adapting NLP tools from resource-rich to resource-poor closely related languages has been acknowledged by the research communities and has been materialized through multiple events, such as the workshop on Language Technology for Closely Related Languages and Language Variants (Nakov et al., 2014) or the workshop on Applying NLP Tools to Similar Languages, Varieties and Dialects (Zampieri et al., 2014) . A related problem occurs when researchers are interested in the cultural heritage of small communities, who developed their own techniques of communication and prefer using dialects instead of the official language of the region they live in. In some situations, these dialects are close enough to the standard language, but in other situations the difference is consistent, so much so that some dialects have become languages of their own (for example Friulian, spoken in the North-East of Italy). These matters raise interesting research problems, since many such dialects are used only in speaking. Moreover, they often tend to be used only in very specific situations (such as speaking in the family), very rarely being taught in schools. Thus, many dialects are in danger of extinction, according to the UNESCO list of endangered languages (Moseley, 2010) . In this paper, we conduct an initial study on the dialects of Romanian. This investigation has the purpose of providing a deeper understanding of the differences between dialects, which would aid the adaptation of existing NLP tools for related varieties. The aim of our investigation is to assess the orthographic and phonetic differences between the dialects of Romanian. In this paper, we quantify only the orthographic and phonetic differences, but the morphology and the syntax are other important aspects which contribute to the individualization of each variety, that we leave for further study. Previously, Tonelli et al. (2010) proposed such an adaptation for a morphological analyzer for Venetan. Similarly, Kanayama et al. (2014) built a dependency parser for Korean, leveraging resources (transfer learning) from Japanese. They showed that Korean sentences could be successfully parsed using features learnt from a Japanese training corpus. In the field of machine translation, Aminian et al. (2014) developed a method for translating from dialectal Arabic into English in which they reduce the OOV ratio by exploiting resources from standard Arabic. Although dialects and varieties have been investigated for other languages, such as Spanish and Portuguese (Zampieri and Gebre, 2012; Zampieri et al., 2013) , Romanian dialects did not receive much attention in NLP. To our knowledge, while the syllabic structure of Aromanian has been previously investigated (Nisioi, 2014) , this is one of the very first computational comparative studies on the Romanian dialects. The Romanian Dialects Romanian is a Romance language, belonging to the Italic branch of the Indo-European language family, and is of particular interest regarding its geographic setting. It is surrounded by Slavic languages and its relationship with the big Romance kernel was difficult. According to Tagliavini (1972) , Romanian has been isolated for a long period from the Latin culture in an environment of different languages. Joseph (1999) emphasizes the reasons which make Romanian of special interest to linguists with comparative interests. Besides general typological comparisons that can be made between any two or more languages, Romanian can be studied based on comparisons of genetic and geographical nature. Joseph further states that, regarding genetic relationships, Romanian can be studied in the context of those languages most closely related to it and that the well-studied Romance languages enable comparisons that might not be possible otherwise, within less well docu-mented families of languages. Romanian is of particular interest also regarding its geographic setting, participating in numerous areally-based similarities that define the Balkan convergence area. Romanian is spoken by over 24 million people as native language, out of which 17 million are located in Romania, and most of the others in territories that surround Romania (Lewis et al., 2015) . According to most Romanian linguists (Pus ¸cariu, 1976; Petrovici, 1970; Caragiu Mariot ¸eanu, 1975) , Romanian has four dialects: • Daco-Romanian, or Romanian (RO) -spoken primarily in Romania and the Republic of Moldova, where it has an official status. • Macedo-Romanian, or Aromanian (AR) -spoken in relatively wide areas in Macedonia, Albania, Greece, Bulgaria, Serbia and Romania. • Megleno-Romanian (ME) -spoken in a more narrow area in the Meglen region, in the South of the Balkan Peninsula. • Istro-Romanian (IS) -spoken in a few villages from the North-East of the Istrian Peninsula in Croatia. It is much closer to Italy than to Romania, from a geographical point of view, but shows obvious similarities with Romanian. It seems that the community of Istro-Romanians exists here since before the 12th century. Istro-Romanian is today on the \"selected\" list of endangered languages, according to the UNESCO classification. 1 Romanian was originally a single language, descendant of the oriental Latin, spoken in the regions around the romanized Danube: Moesia Inferior and Superior, Dacia and Pannonia Inferior (Rosetti, 1966) . The period of common Romanian begun in the 7th-8th century and ended in the 10th century, when a part of the population migrated to the South of the Danube, beginning the creation of the dialects. Densus ¸ianu (1901) places the migration to the South even earlier in time, in the 6th and 7th century. Thus, starting with the 10th century, given a series of political, military, economical and social events, the 4 dialects of Romanian were born: Daco-Romanian (to the North of the Danube), Aromanian, Megleno-Romanian and Istro-Romanian (to the South of the Danube). Among these dialects, only Daco-Romanian could develop into a national standard language, in the context of several political and historical factors, leading to the Romanian language that is spoken today inside the borders of Romania. The other three dialects are spoken in communities spread in different countries. An explanation for this fact is the setting of the Slavic people at the South of the Danube, which has lead, among others, to the dispersion of the groups that spoke the three dialects to the South of the Danube. According to the Ethnologue (Lewis et al., 2015) , the three dialects to the South of the Danube were developed between the 5th and the 10th century, while according to Rosetti (1966) , this process took place after the 10th century. Thus, according to Rosetti (1966) , Aromanian and Megleno-Romanian developed in the 11th century, while Istro-Romanian developed in the 13th century. Rosetti (1966) states that there are, actually, two main dialects of Romanian: Daco-Romanian and Aromanian, the other two being derived from them (Megleno-Romanian derived from Aromanian and Istro-Romanian derived from Daco-Romanian). RO Experiments In this section we describe our investigations and experiments on the dialects of Romanian. We are mainly interested in assessing the differences between the dialects from the South of the Danube and Daco-Romanian. We henceforth refer to Daco-Romanian, the standard language spoken in Romania, as Romanian. Data We use a dataset of 108 words comprising the short Swadesh list for the Romanian dialects. 2 The Swadesh list has been widely used in lexicostatistics and comparative linguistics, to investigate the classification of the languages (Dyen et al., 1992; McMahon and McMahon, 2003) . The dataset is provided in two versions: orthographic and phonetic. In Figure 1 we represent the average word length (considering their orthographic form) for the Romanian dialects. Istro-Romanian has the shortest words, followed by Romanian. Megleno-Romanian and Aromanian have slightly longer words, on average, but the differences are not significant. The orthographic or phonetic distance has been widely used for analyzing related words and for reconstructing phylogenies (Kondrak, 2004; Delmestri and Cristianini, 2012) . We use the edit distance to observe how close the Romanian dialects are to one another (Table 1 ). The edit distance (Levenshtein, 1965) Using the orthographic form of the words (see also Figure 2 ), Aromanian words are closest to the Romanian words (0.44), followed by Megleno-Romanian (0.47) and Istro-Romanian (0.55). When using the phonetic form of the words, Megleno-Romanian words are closest to the Romanian words (0.39), followed by Aromanian (0.40) and Istro-Romanian (0.42). At the phonetic level, the distance between Romanian and the other three dialects is much smaller than the same distance measured at the orthographic level. In both situations, Istro-Romanian is farthest from the other dialects. One possible reason could be the geographical regions in which Istro-Romanian is spoken, farther from the regions where the other dialects are spoken. In Figure 3 IS Dialect Identification We are interested to see if the orthographic or phonetic differences between Romanian and the other Romanian dialects (spoken at the South of the Danube) are dialect-specific (i.e., if they have enough discriminative power to identify the dialect to which a word belongs). To this end, we build a classification problem as follows: given the parallel list of 108 words (in all the Romanian dialects), we extract pairs having the form (romanian-word, dialect-word), where dialect ∈ {Istro-Romanian, Megleno-Romanian, Aromanian}. We obtain, thus, a dataset of 324 such input pairs. The goal is to automatically decide to which dialect the dialect-word belongs. The dialect identification problem is not trivial and our goal, in this paper, is not to improve on the state-of-the-art methods in this research area, but to investigate the predictive power of the orthographic and phonetic differences between Romanian and its dialects. We use a methodology that has been previously used for discriminating between related and unrelated words, and for distinguishing the type of relationship between the words (Ciobanu and Dinu, 2014b; Ciobanu and Dinu, 2015) . We align the words using the Needleman-Wunsch alignment algorithm (Needleman and Wunsch, 1970) and we extract n-gram features from the alignment of the words. Additionally, we also extract n-grams of characters from the dialect-word. We search for the optimum n-gram size in {1, 2, 3, 4}, both for the n-grams extracted from the alignment and for the n-grams extracted from the dialect-word. We train a Logistic Regression classifier, using the imple- mentation provided by Weka (Hall et al., 2009) . Since our dataset is small, we evaluate the performance of the model with 5-fold cross-validation. For both experiments (orthographic and phonetic), n = 2 proves to be the optimal n-gram size. In Table 2 we report the most common 2-grams for each dialect (using the orthographic version of the words) and in Table 3 we show examples of word pairs aligned with the Needleman-Wunsch algorithm. Results In Table 4 we report the cross-validation results for dialect identification, for the orthographic version of the dataset (Table 4a ) and for the phonetic version of the dataset (Table 4b ). For the former, the best results, in terms of F-score values, are obtained for Istro-Romanian (0.70), followed by Aromanian (0.60) and Megleno-Romanian (0.56). This shows that the Istro-Romanian dialect can be identified easier, and the orthographic features of the Istro-Romanian words have the highest predictive power. For the later, the ranking is different: Aromanian is identified with the highest F-score (0.71), followed by Istro-Romanian (0.70), Megleno-Romanian being on the last position (0.53). At the phonetic level, we notice that the Megleno-Romanian dialect is the most difficult to identify. In Table 5 we report the confusion matrix for both experiments (orthographic and phonetic). We report the number  Table 5 : Confusion matrix for dialect identification using the orthographic (a) and the phonetic (b) form of the words. We report the number of correctly classified and misclassified instances. Conclusions In this paper we conducted an initial study on the Romanian dialects. We analyzed the orthographic and phonetic differences between the Romanian dialects, using the Swadesh list and building a classification problem for dialect identification. The results obtained so far show that Istro-Romanian has more dialect-specific differences from Romanian, followed by Aromanian and Megleno-Romanian. The next steps in our investigation will be to conduct a similar study on corpora (Ciobanu and Dinu, 2014a) instead of word lists, as far as resources are available, and to assess the mutual intelligibility of the Romanian dialects. The necessity of such a study is increased by the fact that at least one of the Romanian dialects (namely Istro-Romanian) is today on the \"selected\" list of endangered languages, according to the UNESCO classification (Moseley, 2010). Acknowledgements We thank the anonymous reviewers for their helpful and constructive comments. The research of Liviu P. Dinu was supported by a grant of the Romanian National Authority for Scientific Research, CNCS UEFISCDI, project number PN-II-ID-PCE-2011-3-0959.",
    "abstract": "In this paper we conduct an initial study on the dialects of Romanian. We analyze the differences between Romanian and its dialects using the Swadesh list. We analyze the predictive power of the orthographic and phonetic features of the words, building a classification problem for dialect identification.",
    "countries": [
        "Romania"
    ],
    "languages": [
        "Aromanian",
        "Romanian"
    ],
    "numcitedby": "20",
    "year": "2016",
    "month": "May",
    "title": "A Computational Perspective on the {R}omanian Dialects"
}