{
    "article": "The Open Linguistics Working Group (OWLG) brings together researchers from various fields of linguistics, natural language processing, and information technology to present and discuss principles, case studies, and best practices for representing, publishing and linking linguistic data collections. A major outcome of our work is the Linguistic Linked Open Data (LLOD) cloud, an LOD (sub-)cloud of linguistic resources, which covers various linguistic databases, lexicons, corpora, terminologies, and metadata repositories. We present and summarize five years of progress on the development of the cloud and of advancements in open data in linguistics, and we describe recent community activities. The paper aims to serve as a guideline to introduce and involve researchers with the community and more generally with Linguistic Linked Open Data. The Open Linguistics Working Group Linguistics, natural language processing, and related disciplines share a fundamental interest in language resources and their availability beyond individual research groups. This is necessary not only to fullfill fundamental principles of science (replicability), but also to facilitate subsequent re-use of resources created from public funding, e.g., as training data for novel tools, as a basis to increase the amount of data available for quantitative analyses, or as a component of innovative applications. The latter may include quite unforeseen uses, as in the case of the psycholinguistic resource WordNet (Fellbaum, 1998) turning into a significant component in numerous information technology systems. Publishing language resources under open licenses, to facilitate exchange of knowledge and information across boundaries between disciplines as well as between academia and the IT business, has thus been an area of increasing interest in academic circles, including applied linguistics, lexicography, computational linguistics, and information technology. Interested individuals began to organize themselves in the context of the Open Knowledge Foundation (OKFN) 1 , a community-based non-profit organization aiming to promote open data. In 2010, we established the Open Linguistics Working Group (OWLG) 2 of the Open Knowledge Foundation as an interdisciplinary network open to anyone interested in publishing and using language resources, or in open licenses. The OWLG facilitates information exchange through a mailing list, regular meetings, joint publications, community projects, and interdisciplinary workshops, including the Linked Data in Linguistics workshop series with recent editions in Reykjavik and Beijing, and the next event in this series co-located with this conference (LREC 2016) in Portorož, Slovenia. In parallel to forming the OWLG, we have seen a rising interest in using Semantic Web standards to represent webaccessible, but distributed and heterogeneous language resources in a uniform and interoperable way, and as a means to facilitate the access of openly available language resources. As these two trends in the field converged, the OWLG not only spearheaded the creation and collection of open linguistic data, but also initiated the creation of the Linguistic Linked Open Data (LLOD) Cloud (Sect. 2.), our most influential community project. Subsequently, we have seen not only a number of approaches to provide linguistic data as linked data, but also the emergence of additional initiatives that aim to interconnect these resources (Sect. 3.). The LLOD cloud is hence being developed in collaboration with several W3C Community Groups and with European projects, especially Lider 3 , which was a community support action for linguis-tic linked data, and also LOD2 4 and QTLeap. 5 These efforts have led to a growth of about 357% since the first instantiation of the cloud (28 linked resources in February 2012, 128 in February 2016). The LLOD Cloud The Linguistic Linked Open Data Cloud is the most prominent community project of the OWLG. It was established to measure and visualize the adoption of linked and open data within the linguistics community. Since its first conceptualization in 2011 and its first materialization in 2012, considerable work has gone into improving the definition and infrastructure that supports the cloud, with the result that, since Spring 2015, the cloud is generated on a monthly basis, as shown in Figure 1 . In particular, we have further refined the criteria for inclusion and the methods for tracking resources. Linguistically Relevant Resources An important criterion is that a dataset must be linguistically relevant in that it provides or describes language data that can be used for the purpose of linguistic research or natural language processing. In particular, we define the following kinds of resources: 1. Linguistic resources in a strict sense are resources that were intentionally created for the purpose of linguistic research or natural language processing, and which contain linguistic classifications, annotations, or analyses or have been used to provide such information about language data. 2. Other linguistically relevant resources include all other resources used for linguistic research or natural language processing, but not necessarily created for this purpose, e.g., large collections of texts such as news articles, terminological or encyclopedic and general-purpose knowledge bases such as DBpedia (Bizer et al., 2009) , or metadata collections. Infrastructure and Metadata The OWLG provides guidelines to data publishers on how to include their resources in the LLOD cloud. We classify LLOD resources into three broad groups: Corpora (blue in Fig. 1 ) are collections of language data, e.g., examples, text fragments, or entire discourses. Lexical-conceptual resources (green in Fig. 1 ) focus on the general meaning of words and the structure of semantic concepts. Metadata (red in Fig. 1 ) includes resources providing information about language and language resources, i.e., typological databases (collections of features and inventories of individual languages, e.g., from linguistic typology), linguistic terminology repositories (e.g., grammatical categories or language identifiers), and metadata about language resources (linguistic resource metadata repositories, including bibliographical data). Among LLOD data sets, we encourage the use of open licenses. As defined by the Open Definition, open refers to \"[any] piece of content or data [that] is open if anyone is free to use, reuse, and redistribute it -subject only, at most, to the requirement to attribute and share-alike.\" 9 At the moment, this condition is monitored but not strictly enforced as a criterion for inclusion in the LLOD cloud. This is in part due to the lack of information about the licensing of the resources and ongoing discussions within the group about the use of non-commercial licenses. However, we expect to reach a consensus within the next few months. Extracting the LLOD Cloud The LLOD cloud is extracted on the basis of the metadata in Datahub 10 . These resources are collected directly by means of the API and validated using the steps described below. Then a D3.js 11 script is used to generate the image and update the site, which is carried out on a monthly basis. All the diagrams are available at http: //linguistic-lod.org and some statistics are given in Table 1 , showing a continuous growth of the cloud in the past years. Validation The first draft of the LLOD diagram, presented at LREC 2012 (Chiarcos et al., 2011) , still included many resources whose providers had at the time merely promised to provide linked open data. The criteria for inclusion have DBpedia in Korean Galician EuroWordNet-lemon lexicon (3.0) DBpedia in Czech General Apertium RDF FR-CA subsequently been strengthened by requiring availability of a resource and its links (thus manifesting the first actual LLOD diagram rather than a draft, since September 2012), metadata quality, etc. Since early 2015, we introduced increasing automatic verification routines for the metadata provided by the resource providers. In order to bring resources into the linked data cloud we rely on the metadata recorded in Datahub. In particular, we attempt to find resources by looking for specific groups and tags that are associated with linguistic resources. We then check that the resource's metadata includes some link to some other resource in the LLOD cloud, and we hope to automatically detect the links in the immediate future by building on the work of the LODVader project. 12 We then check that the resource is available by attempting to download it and discarding all resources that are no longer available. We have attempted to notify the authors of resources that no longer meet the criteria for inclusion in the cloud. However, our experience has been that this did not motivate many authors to update their resources. DBpedia in Portuguese Vocabularies The Linguistic Linked Open Data Cloud has grown significantly in the last few years and most notably, unlike the non-linguistic LOD Cloud, is not centered around one nu-cleus but instead has used many different vocabularies and datasets to link to. Among these are BabelNet (Ehrmann et al., 2014) , LexInfo (Cimiano et al., 2011), and Lexvo (de Melo, 2015) . In addition, a number of new vocabularies have emerged including the OntoLex model, 13 the NLP Interchange format NIF (Hellmann et al., 2013) , the Word-Net Interlingual Index (Sect. 5.2.), and the FrameBase schema (Rouces et al., 2015a) (Sect. 5.3.) . These vocabularies have increased the power of linked data to represent the complete spectrum of language resources and show that new resources can be created that use the power of linked data to link across different types of languages resources, such as terminologies and dictionaries (Siemoneit et al., 2015) and corpora and dictionaries (McGovern et al., 2015) . Other Community Group Efforts OWLG members have been very active in promoting the development and adoption of linguistic linked data, which had an effect not only in the growth of the LLOD cloud but in the development of representation models, guidelines, and best practices. These activities have been developed in the context of a number of W3C groups and projects, as it is detailed in the rest of this section. OntoLex The Ontology-Lexica Community (OntoLex) Group 14 was founded in September 2011 as a W3C Community Group. It aims to produce specifications for a lexiconontology model that can be used to provide rich linguistic grounding for domain ontologies. Rich linguistic grounding includes the representation of morphological and syntactic properties of lexical entries as well as the syntaxsemantics interface, i.e., the meaning of these lexical entries with respect to a given ontology. An important issue herein will be to clarify how extant lexical and language resources can be leveraged and reused for this purpose. As a byproduct of this work on specifying a lexicon-ontology model, we are establishing a network of lexical and terminological resources that are linked according to the Linked Data principles, forming a large network of lexico-syntactic knowledge. LIDER, BPMLOD and LD4LT The LIDER project was a support action funded by the FP7 European program aimed to exploit and build upon multilingual and linguistic linked data for content analytics by establishing a strategy for progressing from existing industry practices and technological capabilities to the vision of the LLOD. The project built a global community of stakeholders in industry, research and standards, interested in the use of LLOD for multilingual, cross-media content analytics. Upon the conclusion of the project, we understand that OWLG can play an important role in the continuation of the community. The main outcomes of the project have been the development of a reference architecture (Brümmer et al., 2015) and a roadmap (Cimiano et al., 2015) for LODbased multilingual, cross-media content analytics in enterprises. Also with the support of the LIDER project, the W3C Best Practices for Multilingual Linked Open Data (BPMLOD) community group 15 have developed a set of guidelines and best practices for integrating language and media resources into the LOD cloud, as well as generating and exploiting LOD-based language and media resources for content analytics. This has constituted an important step towards the dissemination and adoption of LLOD. Most of these guidelines and reference cards have been developed by members of OWLG and feedback have been gathered through the BPMLOD and OWLG groups. Finally, we shall mention the W3C Linked Data for Language Technologies (LD4LT) community group 17 . Its activities, complementary to those at OWLG, have been focused on gathering use cases and requirements from industry for linguistic linked data based content analytics. Also, it served as forum for discussions such as the convergence of broadly accepted metadata schemes into a unified model for describing language resources, which resulted in the OWL model that LingHub adopted (McCrae et al., 2015b) . Due to the common goals and interest of both LD4LT and OWLG, the possibility of creating joint mailing lists and occasional joint calls is under consideration. Community Events Since the foundation of the OWLG in 2010, various events have taken place, which went along with its main goals of promoting the creation of open data in linguistics and intensifying the communication between researchers from different communities that use, distribute, or maintain open linguistic data. A very well received event is the OWLG-organized workshop series on Linked Data in Linguistics (LDL), which was established in 2012 and attracts an interdisciplinary and international community on a yearly basis. A significant outcome of the recent editions in Reykjavik ( 2014 ) and Beijing (2015) Given the central focus on language data within the OWLG, events that aim at increasing the involvement of linguists are of great importance. Occasions such as the Association for Linguistic Typology 10th Biennial Conference 23 and the LLOD workshop at the Summer Institute of the Linguistic Society of America 24 have been taken as opportunities to not only present the Linked Data standards as a new method for language resource representation to linguists but also to learn from their longstanding expertise and concomitant challenges of language data compilation, comparison and re-use for linguistic research. Due to the openness of the language resources provided in the LLOD cloud, practitioners, industry and infrastructure providers operating across language barriers are increasingly interested in the possibilities offered by the multilingual Linked Data resources. Hence, OWLG community members have been engaged in events such as the Multilingual Linked Open Data for Enterprises (MLODE 2014) Wordnet Interlingual Index (ILI) A recent development (Vossen et al., 2016; Bond et al., 2016) has been the adoption of LLOD technology by the wordnet community, with a new plan that uses LLOD as the basic mechanism for the creation of links between wordnets in different languages. This Collaborative InterLingual Index enables wordnets to share and link their resources for concepts lexicalized in any of the group's languages. This was supported directly by a workshop at the 2016 Global WordNet Conference and will lead to the adoption of LLOD technology by a new community. In addition, the open multilingual wordnet (Bond et al., 2014) provides all open wordnets for download using the lemon (McCrae et al., 2012) and RDF standard. FrameBase FrameBase (Rouces et al., 2015a) is a new large-scale vocabulary, based on FrameNet and WordNet, that uses the linguistic notion of semantic frames for general-purpose knowledge representation. It can thus serve as a bridge between the linguistic knowledge in the LLOD cloud and the general LOD cloud. Knowledge from different sources such as YAGO and Freebase can be mapped into this schema, even if they use very heterogeneous forms of representations. For instance, YAGO has an isMarriedTo relation and uses a form of reification to describe its properties, while other sources model a marriage as an instance. FrameBase was used in the European Union FP7 project ePOOLICE as part of an integrated knowledge repository to represent knowledge related to organized crime obtained from several conceptual graphs (Rouces et al., 2015b) . Further details are available on the FrameBase website 28 . Conclusion The activity and impact made by the use of linked and open data have been significant in the last few years, as shown by the increasing growth of the LLOD cloud and the wealth of events and groups that have developed within the last two years. However, as the community has grown larger, it has also become harder to manage, and new tools are needed to motivate the continuing adoption of the paradigm. We believe that with the strong basis of our existing community these will easily be met and lead to further revolutionary change in the field of language resources. Acknowledgements"
}