{
    "article": "This paper presents a new Vietnamese text corpus which contains around 4.05 billion words. It is a collection of Wikipedia texts, newspaper articles and random web texts. The paper describes the process of collecting, cleaning and creating the corpus. Processing Vietnamese texts faced several challenges, for example, different from many Latin languages, Vietnamese language does not use blanks for separating words, hence using common tokenizers such as replacing blanks with word boundary does not work. A short review about different approaches of Vietnamese tokenization is presented together with how the corpus has been processed and created. After that, some statistical analysis on this data is reported including the number of syllable, average word length, sentence length and topic analysis. The corpus is integrated into a framework which allows searching and browsing. Using this web interface, users can find out how many times a particular word appears in the corpus, sample sentences where this word occurs, its left and right neighbors. Introduction Vietnamese text processing started to become active about twelve years ago. Since then, several corpora have been built for some specific natural language processing tasks. (Pham et al., 2007) presented a corpus consisting of newspapers coming from two news sources collected within 6 months in 2005. This corpus was annotated with entity classes such as person, location, organization for named entity recognition. (Tu et al., 2006) released a corpus of 305 newspaper articles together with a list of 2,000 personal names and 707 locations. 1 (Do et al., 2009) prepared a parallel corpus of Vietnamese-French consisting of around 12 million (M) document pairs for machine translation. The EVC corpus produced at the national university of Ho Chi Minh (VNUHCM) consists of 400,000 pairs of Englist-Vietnamese sentences with approximately 5,500,000 words in the fields of Science and Technology. (Pham et al., 2008) presented a corpus of 1 million words collected from newspapers and children's literature for a comparison in the word uses in children's literature and in general text. SEAlang Library Vietnamese Text Corpus introduced a corpus search interface with word neighbors and sample sentences including more than 79M characters. 2 The Vietnamese corpus project 3 also collected data from newspapers and annotate them with information such as author, public date, register date. In comparison to other available Vietnamese news corpora, this collection is one of the most comprehensive corpora containing a large amount of text collected from various sources. It can serve as a resource for different Vietnamese natural language processing tasks and text analysis. 1 http://www.jaist.ac.jp/ hieuxuan/vnwordseg/data/ 2 http://sealang.net/vietnamese/corpus.htm 3 http://pers-www.wlv.ac.uk/ĩn6930/corpus.htm The construction of the Vietnamese corpus Data sources The Text preprocessing The corpus pre-processing is described in full detail in (Goldhahn et al., 2012) and results after language identification and text cleaning in sentence separated text without duplicates. After word segmentation and frequency counting word co-occurrences are calculated. All the data are available both for online web searching and for download. Vietnamese language and problems with word segmentation Tokenization, the process of breaking strings into words, is an important language pre-processing step for further tasks such as parsing, text mining. Since most Vietnamese words are composed of more than one syllable where each syllable is separated by blanks (Dinh et al., 2008) , using common tokenizers such as replacing blanks with word boundaries does not work for Vietnamese. As reported in (Hong Phuong et al., 2008) , there are about 82% syllables in Vietnamese are words themselves, which correspond to 16% of total Vietnamese words. 71% of words are composed of two syllables, 14% have at least three syllables. There are many syllables that are words themselves, but can also be parts of other words. For example, \"bóng\" can be shadow, while \"bóng đèn\" means bulb; \"mặt\" is face but \"mặt trăng\" is moon. A review of Vietnamese tokenizers Most studies in this field employ statistical methods such as using probabilistic models (Le Trung et al., 2010) , conditional random fields (CRF) and support vector machine (SVM) (Tu et al., 2006) . (Tu et al., 2006) considered the problem of detecting word boundaries in a sentence is modeled as that of labeling each syllables as either I W (inside a word), B W (begin a word) and O (outside a word). The segmentation tool trained on about 8,000 sentences using CRF and is available online with the name JVnSegmenter 4 . Some other systems use hybrid methods such as in (Pham et al., 2009) , (Hong Phuong et al., 2008) . (Pham et al., 2009) exploit part-of-speech (POS) information based on maximum matching algorithm combined with stochastic models to tackle the task of word segmentation. In (Hong Phuong et al., 2008) , the authors combine finite state automata techniques with the maximal matching strategy and regular expression parsing. This algorithm is implemented in the vnTokenizer tool, a tokenizer for Vietnamese texts. 5  A comparison of available Vietnamese tokenization tools is reported in (Dinh et al., 2008) . In particular, the CRFbased tool of the group (Tu et al., 2006) , the PVnSeg tool (unknown source) and the hybrid method of (Hong Phuong et al., 2008) are compared using a test corpus containing 1,264 articles from Politics-Society section of a Vietnamese online newspaper \"Tuoi Tre\", where words have been manually segmented by linguists. The result shows that both vnTokenizer and JVnSegmenter achieve roughly 94% F-measure. In our preprocessing steps, we will use the JVnSegmenter for preparing the Vietnamese corpus. Statistical analysis of the corpus Corpus statistics has two different aspects: General language statistics (in the case of a large and representative corpus) and special corpus analysis (to compare the values measured for the corpus with representative values). We will give two examples here. For a more general discussion see (Eckart et al., 2012) .  • Word length in characters is calculated without the possible blanks within a word. In most languages, syllable boundaries are not represented by a character, so the same counting strategy is applied for Vietnamese. Word length for different frequency ranges • The number of syllables is trivial to count by counting the blanks within a word plus one. But, the correctness of this value clearly depends on the correctness of the word segmentation. • For the average syllable length, the average is taken per word, i.e. the syllable length per word is averaged. The average values for these numbers are calculated for the most frequent N words for N=1, 10, 100, ..., 1.000.000. The average word length increases as expected as a consequence of language economy: Words of higher frequency tend to be shorter. Economy in language also implies an increasing average number of syllables with N. The additional increase in syllable length is due to the fact that for less frequent words some of the syllables tent to become more complex and longer. These near duplicates, of course, reduce the quality of word frequencies and word co-occurrences. This example illustrate the importance of quality checking during the preprocessing, with a special emphasis on near duplicates. The frequency data extracted from the corpus together with word related statistics will be used for the Vietnamese Frequency Dictionary to appear in 2016 (Quasthoff et al., 2011 ) . Sentence length in characters Topic modeling on the Vietnamese corpus A sample of topics estimated from the Vietnamese corpus using Latent Dirichlet Allocation is illustrated in Table 2 . It provides a way of organizing and browsing the data to discover hidden topics within the corpus. Within the same framework, we have also estimated topics for other languages (Figure 3 ). The topics inferred from different languages could be used to map and compare among languages, for example: to discover widely reported news events around the world using topic timelines, to find out the difference in topics of interests among countries, etc. A search interface We provide a web interface to enable search within the corpus 7 . In figures 4 and 5, the searched word \"mai\" is ambiguous, it can mean tomorrow, ochna flower, etc. The search results show the number of times this term occurs in the whole corpus, its frequent rank and its frequency class (i.e., the frequency of a word in relation to the most frequent word, the term \"mai\" appears ≈ 2 7 times more frequently than the most frequent word of the whole corpus). Some sample sentences where this term occurs are also shown in the search result. In Figure 5 , terms that co-occur most frequently with the given term are shown together with the number of times they co-occur together. Similarly, left and right neighbor cooccurrences of the given term are also listed. An interactive graph shows how the term is associated to its neighbors. From this graph, one can see different meanings and contexts of the searched term (e.g., \"ngày mai\" refers to tomorrow, \"phô mai\" is cheese, \"mỉa mai\" means sarcasm, \"mai táng\" is burial, \"mai sau\" expresses later on, etc.). Conclusions In this paper, we have presented a Vietnamese corpus containing around 4.05 billion words, coming from textual data collected on the internet. We have described main steps for data collection and processing for Vietnamese. From this corpus, we have extracted statistical information such as average word length, number of syllables and syllable length, topic models estimated from the data. A webinterface is also available to search within the corpus, find ",
    "abstract": "This paper presents a new Vietnamese text corpus which contains around 4.05 billion words. It is a collection of Wikipedia texts, newspaper articles and random web texts. The paper describes the process of collecting, cleaning and creating the corpus. Processing Vietnamese texts faced several challenges, for example, different from many Latin languages, Vietnamese language does not use blanks for separating words, hence using common tokenizers such as replacing blanks with word boundary does not work. A short review about different approaches of Vietnamese tokenization is presented together with how the corpus has been processed and created. After that, some statistical analysis on this data is reported including the number of syllable, average word length, sentence length and topic analysis. The corpus is integrated into a framework which allows searching and browsing. Using this web interface, users can find out how many times a particular word appears in the corpus, sample sentences where this word occurs, its left and right neighbors.",
    "countries": [
        "Germany"
    ],
    "languages": [
        "Vietnamese",
        "French"
    ],
    "numcitedby": "1",
    "year": "2016",
    "month": "May",
    "title": "Construction and Analysis of a Large {V}ietnamese Text Corpus"
}