{
    "article": "This paper introduces Port4NooJ v3.0, the latest version of the Portuguese module for NooJ, highlights its main features, and details its three main new components: (i) a lexicon-grammar based dictionary of 5,177 human intransitive adjectives, and a set of local grammars that use the distributional properties of those adjectives for paraphrasing (ii) a polarity dictionary with 9,031 entries for sentiment analysis, and (iii) a set of priority dictionaries and local grammars for named entity recognition. These new components were derived and/or adapted from publicly available resources. The Port4NooJ v3.0 resource is innovative in terms of the specificity of the linguistic knowledge it incorporates. The dictionary is bilingual Portuguese-English, and the semantico-syntactic information assigned to each entry validates the linguistic relation between the terms in both languages. These characteristics, which cannot be found in any other public resource for Portuguese, make it a valuable resource for translation and paraphrasing. The paper presents the current statistics and describes the different complementary and synergic components and integration efforts. Introduction NooJ (Silberztein, 2015; Silberztein, 2016) is a multilingual linguistic environment to develop linguistic resources, and process written texts. Currently, NooJ includes over 20 language modules. Port4NooJ is the Portuguese language module of NooJ, and it includes linguistic resources, such as: (i) a large coverage dictionary with English transfers 1 ; (ii) rules to formalize and document Portuguese inflectional and derivational descriptions, and (iii) local grammars, namely morphological, disambiguation, semantico-syntactic, morphological grammars to inflect and generate multiword expressions, and translation grammars. Port4NooJ different components interact among them and are used to process texts. Several processing functions can be performed with these resources, among others, part of speech annotation, semantic analysis, named entity recognition, translation and paraphrasing. The module can be downloaded from the NooJ website 2 . In this paper we present the Port4NooJ v3.0, focusing in the description of its three main new components: (i) a lexicongrammar based dictionary of human intransitive adjectives, and a set of local grammars that use the distributional properties of those adjectives for paraphrasing, (ii) a polarity dictionary for sentiment analysis, and (iii) linguistic resources for named entity recognition. There is no other public resource for Portuguese that incorporates such a variety of linguistic knowledge. This research work was developed in the scope of the eS-PERTo 3 project. The main objective of this project is twofold: (i) develop a context-sensitive and linguistically enhanced paraphrase generator that recognizes semanticosyntactic, multiwords and other phrasal units, and transforms them into semantically equivalent phrases, expressions, or sentences, and (ii) develop a new hybrid technique that combines statistics and local grammars to acquire linguistic knowledge applied in the identification and generation of new and increasingly more complex paraphrases. Currently, eSPERTo is integrated in an interactive online application that helps Portuguese language learners in producing and revising their texts. The utility of eSPERTo's paraphrasing capabilities are now being explored in two other application scenarios: (i) in a question-answering system to increase the linguistic knowledge of an intelligent conversational virtual agent, and (ii) in a summarization tool to assist the paraphrasing task. Among other functionalities, the platform includes text-editing mechanisms, which provide a variety of alternatives for each expression, allowing the user to choose among several suggestions that can be immediately applied to text. Port4NooJ Module The initial Port4NooJ linguistic resources derive from OpenLogos. OpenLogos is an open source derivative of the commercial Logos system downloadable from the DFKI website 4 , and available at INESC-ID. 5 In order to create Port4NooJ, the OpenLogos English-Portuguese dictionary was converted into NooJ format and enhanced with new properties, including derivational and morphosyntactic and semantic relations that allowed generation of paraphrases for Portuguese (Barreiro, 2009) . These paraphrases are used to feed the linguistic engine of the eS-PERTo's paraphrasing system 6 , which is based on the NooJ technology (Silberztein, 2015) . semantic \"understanding\" in its linguistic knowledge. The entry is represented by (i) its lemma: mesa, (ii) its PoS, noun (N), (iii) its inflectional paradigm: FLX=CASA (mesa inflects according to paradigm class CASA, i.e. inflects like the noun casa (house/home), the example word to represent the paradigm), (iv) its semantico-syntactic properties: SAL=COsurf, which stands for a concrete noun surface, and (v) its English transfer: EN=table. The SAL Property One important characteristic of the Port4NooJ dictionary is that it already provides some level of disambiguation by the use of SAL. For example, there is an entry for corredor (runner) and another entry for corredor (hallway), the first one classified as an animate noun denoting a profession or other human designation (SAL =ANdes) and the second one defined as a place that has the general structure of a path (SAL=PLpath). Words integrate different hierarchical ontology classes and subclasses, according to their linguistic attributes (in the Logos Model, supersets, sets and subsets). Accordingly in the Port4NooJ dictionary, syntactic-semantic (SAL) properties provided for each entry represent these ontological classes and subclasses. A dictionary of multiwords is currently under development and comprises nominal expressions such as cabo de vassoura (broomstick) or luz solar (sunlight); verbal expressions, such as marcar pontos (score) or piscar o olho (wink); adjectival expressions such as fraco de espírito (feeble-minded), cor-de-rosa (pink) or norte-americano (North-American); adverbial expressions, such as com entusiasmo (enthusiastically) or de parte (aside). Support Verb Constructions Meyers et al. (2004) present evidence to consider suport verb constructions (SVCs) as multiwords, based on predicate-argument structure. Extended syntactic and semantic information was added to the lexicon, in order to formalize and process them. In particular, (i) 33 support verbs were identified as such in the lemma dictionary with the attribute +SUP, (ii) nominalizations that are predicative nouns were assigned the attributes +Npred+Nom, and were formalized by adding derivation codes to 4,968 verbal entries, which allow the generation of the corresponding predicative noun, and (iii) the attribute +VSUP is assigned the support verb that occurs with the predicative noun in the SVC. The following example illustrates the formalization of a support verb (fazer), a verbal entry that has a corresponding nominalization, which is a predicative noun (ameaçar) and the derived nominalization ameaça. (Gross, 1982) are formalized directly in the lemma dictionary and are assigned only the attribute +Npred, such as in: barulho,N+Npred+FLX=ANO+ME+abs+EN=noise+VSUP=fazer 827 lemma entries also include aspectual or stylistic variants of the main support verb, which is marked with the attribute +VSTYLE as in the following entry: visitar,V+FLX=FALAR+Aux=1+OBHUM68+Subset=515 +EN=visit+VSUP=fazer+VSTYLE=efectuar +VSTYLE=realizar+DRV=NDRV16:CASA Inflectional and Derivational Descriptions Inflectional paradigms are independent standard pattern models (prototypes) based on morphological suffixation rules. These rules cover variation in gender and number (adjectives and nouns), person (verbs and pronouns), tense (verbs), diminutives, augmentatives and superlatives (nouns, adjectives and some adverbs), and nominalizations. In general, NooJ dictionaries are connected with inflectional and derivational descriptions, which can be represented in the form of graphs or plain rules, for simple words and compounds. Port4NooJ contains 310 inflectional paradigms, and 738 derivational paradigms. Grammars NooJ grammars are represented by finite state transducers (FSTs); i.e., graphs that represent many different linguistic phenomena and can be used to add annotations to the text, or to filter out annotations. Local grammars describe frozen or semi-frozen phenomena or morphological phenomena. Syntactic grammars are used to disambiguate a word, perform an active to passive transformation or a syntactic agreement check and describe phrase and sentence structure. Grammars for multiword units can describe phrases such as SVCs and other multiwords. Grammars can also be used for semantic analysis and representation of named entities and paraphrases, for example, and we have also been using them to perform translation. Morphological Grammars Port4NooJ includes a morphological grammar to process contracted forms such as das (EN: of the) resulting from the contraction of the preposition de (EN: of ) and the determiner as (EN: the), or neste (EN: in this) resulting from the contraction between preposition em (EN: in) and the demonstrative pronoun este (EN: this). When applying the contracted forms grammar to text, during the normalization phase, it is possible to decompose the word in its different basic constituents. Syntactic Grammars Whereas morphological grammars are applied at the word level, by contrast, syntactic grammars are applied at the phrase and sentence level. They can be used for identifying and annotating both syntactic patterns, and semantic units. More specifically they can perform local, structural and transformational analysis. Port4NooJ includes grammars to: (i) identify and annotate dates and temporal expressions, (ii) disambiguate words or sequences of words, i.e., to filter out lexical or syntactic annotations in the text, (iii) to paraphrase several types of constructions, and (iv) to translate simple sentences. In the following sections, we describe the new three main components of Port4NooJ: (i) a lexicon grammar based dictionary of human intransitive adjectives for paraphrasing, (ii) a polarity lexicon for sentiment analysis, and (iii) a set of linguistic resources for named-entity recognition. Lexicon-Grammar of Human Intransitive Adjectives for Paraphrasing Carvalho (2007) studied, formalized, and classified the distributional properties of human intransitive adjectives in lexicon-grammar tables, corresponding to 15 semanticosyntactic classes: disease, membership, geographical adjectives, such as nationality, and 12 generic human adjective subclasses. The 12 subclasses are based on the auxiliary verbs with which they co-occur: either ser, estar or both, and also based on the possibility of being preceded by an indefinite article, and finally, by the syntactic and semantic nature of the subject modified by each adjective, which can correspond to a human noun, a complex noun phrase involving an appropriate noun, or to a finite or non-finite clause. The properties formalized in the lexicon-grammar tables enable eSPERTo to paraphrase: • adjective, noun and verb morphologically related constructions: está zangado (is angry) = zangou-se (got (self ) angry) = esteve envolvido numa zanga (was involved in anger); • adjective constructions supported by different copulative verbs: estar perdido (be lost) = andar perdido (walk around lost); • constructions involving nationality and other membership relations: de origem portuguesa (of Portuguese origin/roots) = portugueses (Portuguese) = de Portugal (from Portugal), benfiquista (Benfica fan) = do Sport Lisboa e Benfica (a fan of Sport Lisboa e Benfica); • cross-constructions: o idiota do rapaz (the idiot of the boy) = o rapaz é um idiota (the boy is an idiot); • appropriate noun constructions: foi moderado nos seus comentários (was moderated in his comments) = os seus comentários foram moderados (his comments were moderated) = foi moderado (was moderated); • generic noun phrases: é um indivíduo estúpido (he is a fool) = é um estúpido (he is a fool) = é estúpido (he is a fool). As referred in Mota et al. (forthcoming) , which describes the detailed process of integrating the lexicon grammar tables into Port4NooJ, the new standalone dictionary of human intransitive adjectives of Port4NooJ includes 5,151 entries, corresponding to 4,138 different adjectives. Given Table 3 shows the distribution of adjectives in the new standalone lemma dictionary by table attribute sorted by the most frequent attribute in the dictionary. Some tables include information about the nouns and/or verbs morphological and semantically related to those adjectives. The derivation between the adjective and the noun or verb was automatically assigned from the derivations that already made part of Port4NooJ. In cases where the derivation did not exist, new derivational descriptions (1,202) were created. A dictionary of toponyms with 676 entries was derived from the adjectival entries marked with the attribute +Ta-ble=SAN, which marks geographical adjectives that are derived from toponymms. Each toponym includes the attribute =Adj, which is assigned the adjective derived from that toponym, and also the attribute +TopDET, which is assigned the determiner that most likely occurs before the toponym. Norte da Europa,N+Top+TopDET=o+Adj=nórdico Tunísia,N+Top+TopDET=a+Adj=tunisino This dictionary does not distinguish the types of toponyms, but that information can be inferred from the corresponding adjective properties. For instance, tunisino has the attribute +NclassPnacionalidade, but nórdico does not, which means the first Tunísia is a country, but Norte da Europa is not: A first set of grammars was also constructed to extend eS-PERTo's paraphrastic knowledge. These grammars recognize and paraphrase (i) constructions involving patronymic adjectives, (ii) characterizing indefinite constructions, (iii) the possibility of alternating Vcop ser and estar with other aspectual variants, and (iv) cross constructions. SentiLex-PT: a Polarity Lexicon for Sentiment Analysis SentiLex-PT is a sentiment lexicon to mine social judgments from Portuguese texts, i.e., to detect opinions about human entities (Silva et al., 2012) . SentiLex-PT's dictionary contains 7,014 lemmas that generate 82,347 inflected forms (see Table 4 for a distribution of PoS tag and idiomatic expressions). SentiLex-PT's lexicon entries correspond to human predicates, i.e., predicates modifying human nouns, compiled from different publicly available resources (corpora and dictionaries). The sentiment attributes for each entry are (i) the target of sentiment, (ii) the predicate polarity, and (iii) the polarity assignment. Most entries were manually labeled regarding polarity, but some adjectives had their attributes assigned automatically. The inflected forms associated with the verbs and idiomatic expressions, and their corresponding morphological attributes, were extracted semiautomatically from LABEL-LEX, a publicly available lexicon for Portuguese, developed by Ranchhod et al. (2004) . The integration of SentiLex-PT into Port4NooJ consisted in converting each entry of the lemma dictionary to the NooJ format according to the following procedure: 4. Add the entry to a new lemma dictionary, unless inflectional code assignment was impossible to achieve. After following the previous procedure, a new lemma dictionary was created with 9,196 entries, of which 165 needed manually assigned inflectional paradigms. Table 4 shows the distribution of part of speech tags before and after the conversion. 7 The number of entries in SentiLex is higher after conversion to Port4NooJ, because Port4NooJ includes English transfers for each Portuguese dictionary entry. In many cases, however, the transfer does not correspond to the word formalized in SentiLex and should be removed after manual revision. About 28% of the 7,014 lemmas of SentiLex (i.e., 1,994 lemmas) already existed in Port4NooJ, and were hence merged with the homographic lemmas of Port4NooJ. We created 53 new inflectional paradigms for idioms from inflectional paradigms that already existed in Port4NooJ. • 81 lemmas that may be in the beginning of a sequence of proper names where the complete sequence is not a person, organization or location (e.g., protocolo (EN: protocol)); Resources for Named Entity Recognition • words that should be delimited as independent names when occurring in the beginning of a sequence of proper names, such as parlamento europeu (EN: European Parlament), secretaria de estado (EN: State Department); • 1,724 nouns that in general precede person names, such as names of job titles (e.g., presidente -EN: president) and occupations (e.g., jornalista -EN: journalist); • 530 patronymic adjectives (e.g., nortenho (EN: northern) and americano (EN: American)); • 162 grammatical words that are ambiguous with nouns, adjectives or verbs. These words were assigned only the grammatical POS tag. For example, the conjunction e (EN: and) that is ambiguous with the noun that refers to the letter e, was added to this dictionary only as conjunction. (iii) a set of chunking grammars that: identify and tag sequences of words that are named entity candidates, multiword cardinals, ordinals and determiners, particular noun phrases, and sequences of auxiliary verbs; (iv) a set of local grammars that identify pairs of named entity candidates and their surrounding contexts, among the following types of contexts: proper name in the context of a noun phrase, proper name in the left context of a verb, proper name in the right context of a verb, coordination of proper names, apposition involving proper names, and proper name within an age context. Integrating in Port4NooJ the previous resources that were specifically developed for named entity recognition is fairly straightforward, because they were already in NooJ format. Besides minor updates to the grammars due to NooJ evolving since they were first created, the main modification that we introduced was to remove from the priority dictionaries adjectival entries marked with the attribute +Patrio, assigned to nationality adjectives. When those entries existed in the dictionary of human intransitive adjectives with the attribute +Table=SAN, assigned to geographical adjectives, including nationality adjectives, they were eliminated. About 65% of the entries marked +Patrio (i.e., 342 entries) were hence removed, leaving However, in order to make the resources fully compatible with Port4NooJ, i.e., so they can run based on Port4NooJ main dictionary, PT-Dict 2.0, instead of Lusolex 3.0, it is necessary to either add the equivalent information to the grammars, in the case of the attributes assigned to the same word in Port4Nooj and Lusolex are different, or create a new set of grammars that only uses attributes from Port4NooJ. Ideally, we create a new dictionary that merges information from the two Portuguese dictionaries. Even assuming that Lusolex can be made publicly available, Port4NooJ dictionary has at least one feature that makes the merging task more challenging: many predicative nouns are derived from their equivalent verbal predicates. This means that a noun in Lusolex may not exist in Port4NooJ as a lemma -in such case, we should not add it to the merged dictionary. Conclusions and Future Work In comparison to other available public resources, Port4NooJ offers two strong competitive advantages, its bilingual nature and the integration of semantico-syntactic knowledge associated to each entry, characteristics that make possible its use in complex natural language processing tasks, such as translation and paraphrasing. In this paper, we presented three new components of the Port4NooJ module. These components are fairly autonomous, but further integration is required to fully take advantage of the several combined modules. Furthermore, in the near future we envisage to improve eSPERTo's paraphrasing capabilities by integrating additional lexicongrammar tables, such as of the nominal predicative constructions with Vsup ser de (Baptista, 2000) and Vsup fazer (Chacoto, 2005) . Acknowledgements",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 1.9361263126072004e-07,
        "foundation": 1.9361263126072004e-07,
        "none": 1.0
    },
    "reasoning": "Reasoning: The article mentions the eS-PERTo project but does not specify any funding sources such as defense, corporate, research agency, or foundation. Without explicit mention of funding, we cannot assume any specific source was involved.",
    "abstract": "This paper introduces Port4NooJ v3.0, the latest version of the Portuguese module for NooJ, highlights its main features, and details its three main new components: (i) a lexicon-grammar based dictionary of 5,177 human intransitive adjectives, and a set of local grammars that use the distributional properties of those adjectives for paraphrasing (ii) a polarity dictionary with 9,031 entries for sentiment analysis, and (iii) a set of priority dictionaries and local grammars for named entity recognition. These new components were derived and/or adapted from publicly available resources. The Port4NooJ v3.0 resource is innovative in terms of the specificity of the linguistic knowledge it incorporates. The dictionary is bilingual Portuguese-English, and the semantico-syntactic information assigned to each entry validates the linguistic relation between the terms in both languages. These characteristics, which cannot be found in any other public resource for Portuguese, make it a valuable resource for translation and paraphrasing. The paper presents the current statistics and describes the different complementary and synergic components and integration efforts.",
    "countries": [
        "Portugal"
    ],
    "languages": [
        "Portuguese",
        "English"
    ],
    "numcitedby": 7,
    "year": 2016,
    "month": "May",
    "title": "{P}ort4{N}oo{J} v3.0: Integrated Linguistic Resources for {P}ortuguese {NLP}"
}