{
    "article": "The paper presents the strategy and results of mapping adjective synsets between plWordNet (the wordnet of Polish, cf. Piasecki et al. 2009 , Maziarz et al. 2013 ) and Princeton WordNet (cf. Fellbaum 1998). The main challenge of this enterprise has been very different synset relation structures in the two networks: horizontal, dumbbell-model based in PWN and vertical, hyponymy-based in plWN. Moreover, the two wordnets display differences in the grouping of adjectives into semantic domains and in the size of the adjective category. The handle the above contrasts, a series of automatic prompt algorithms and a manual mapping procedure relying on corresponding synset and lexical unit relations as well as on inter-lingual relations between noun synsets were proposed in the pilot stage of mapping (Rudnicka et al. 2015). In the paper we discuss the final results of the mapping process as well as explain example mapping choices. Suggestions for further development of mapping are also given. Introduction The goal of this paper is to present solutions developed for the purposes of mapping two different relation structures describing adjectives in Princeton WordNet (henceforth, PWN, cf. Fellbaum 1998) and in plWordNet (Polish wordnet, henceforth, plWN, cf. Maziarz et al. 2013) . plWordNet is one of the few world wordnets built fairly independently of PWN with the help of a unique method of lexico-semantic relations extraction from large text corpora (Piasecki et al. 2009 ). Nevertheless, the actual construction process is manual -a supervised team of lexicographers verifies automatic hints in lexicographic resources and only then introduces them into a database. Thus, it belongs in with the so called merge approach (cf. Vossen et al. 2002) . It allows for a more truthful language description, but leads to differences in lexical coverage and relational structures between wordnets. This is clearly the case of plWN and PWN adjective domain, which has vertical, hyponymy-based structure in plWN (akin to that of nouns and verbs) (cf. Maziarz et al. 2012) , and a horizontal, dumbbell model-based structure in PWN (cf. Miller 1998 , Sheinman et al. 2013) . Moreover, plWN has a slightly more fine-grained set of semantic domains comprising qualitative, relational and material adjectives, while PWN distinguishes only relational adjectives from the general adjective category. Another key issue in the process of adjective mapping is wordnet size. At the beginning the sizes of plWN and PWN adjective domains were comparable 1 . However, the process of mapping has been carried out parallel to the process of the extension of adjective category in plWN, and at the final stage of 1 This is based on the data from plWN 2.1 version, downloadable from http://nlp.pwr.wroc.pl/plwordnet/download/?lang=pl mapping the number of adjective synsets in plWN outgrew that of PWN twice 2 . In view of the above mentioned contrasts, the design of the mapping strategy for plWN and PWN adjectives had been a real challenge. We started with a detailed analysis of both synset and lexical relation structures with an eye to any common points between the two wordnets. Wordnet mapping is carried out at the level of synsets (cf. the EuroWordNet project, Vossen 2002; OpenMultilingual WordNet, Bond et al. 2013) , but here lexical units relations looked much more promising. We designed a series of rule-based, automatic prompt algorithms capitalising on corresponding synset and lexical unit relations in the two wordnets and on the already existing inter-lingual noun synset relations (cf. Rudnicka et al. 2012 , Rudnicka et al. 2015) . The latter was possible because many of the adjective relations are relations to nouns (Maziarz et al. 2012 ). The rules were accompanied by lemma filtering of the achieved synset pairs by a large Polish-English cascade dictionary, similarly as in the process of generating automatic prompts for nouns (cf. Kędzia et al. 2013) . We also took advantage of noun mapping experience in drawing a procedure for manual mapping and an inventory of inter-lingual relations. Main relations stayed the same including synonymy, hyponymy and partial synonymy, but their definitions had to be adjusted to the specificity of adjective category. Also, new relations had to be added, especially varieties of crosscategorial synonymy to nouns. The paper is structured as follows. Section 2 offers a comparative analysis of adjective relation structure in plWN and in PWN, Section 3 describes our proposal of the manual mapping procedure and automatic prompt algorithms, Section 4 presents the discussion of the achieved results. The paper closes with conclusions and suggestions for further research given in Section 5. Adjectives in plWordNet and in Princeton WordNet The very idea of a wordnet-type dictionary has its origins in the psycholinguistic research of 60-ties of the XX-tieth century (cf. Miller 1998 , Sheinman et al. 2013 ). Below we illustrate the dumbbell model with printscreens from the WordNetLoom editing tool. Synset relation structures for the adjecitives small and large are given, together with Antonymy relation between their lexical units. Notwithstanding the psycho-linguistic reality of the dumbbell model, it is criticised for hindering natural language processing tasks such as semantic similarity measure critical for word sense disambiguation (cf. Sheinman et al. 2013) . Crucially, these require hierarchical, hyponymy based-structures. Such structures have been developed for adjective synsets by the constructors of plWordNet. Apart from Antonymy relation between adjective lexical units, they defined Hyponymy relation between adjective synsets (cf. Maziarz et al 2012) . Thus, adjective domain in plWordNet has vertical structure, akin to that of nouns and verbs. Again, it is illustrated in the screenshot from the WordNetLoom editing tool given in Figure 2 below. It shows the structure of synset relations for the Polish adjective duży -'large'. The graph structure given in Fig. 2 shows the set of hyponyms for the adjective duży -'large' represented by vertical black lines with the index 'hipo'. Still, apart from Hyponymy relations, also other relations are visible on the graph: 'war' standing for Value of the attribute and 'grad' standing for Gradability. The whole list of plWN and PWN synset relations and their counts is given in Table 1 :  Another area of contrast between plWN and PWN constitute semantic domains adjectives are grouped into. In plWN, adjectives are divided into relational, qualitydenoting and material-denoting, while in PWN only relational adjectives are singled out, the remaining ones are not further classified and appear under a general 'adj' heading. Synset relation counts Domain counts Domain plWN PWN [jak] quality-denoting 23644 ------- [rel] -relational 14843 3665 [adj] -adjective -------14460 [mat]material-denoting 1118 -------Table 3 . plWN and PWN adjective domain counts (in lexical units) compared The domains provide information on the semantic content of adjectives and as such the differences in their number and counts will also need to be reflected by appropriate choices when establishing inter-lingual relations. At least the criteria for distinguishing relational adjectives are similar in plWN and in PWN. In plWN, they need to be linked to nouns by Cross-categorial synonymy relation, while in PWN by Pertainym relation. The two relations are largely corresponding in terms of their semantic import. The last key issue in the process of adjective mapping has become wordnet size. At the beginning of the mapping process the sizes of plWN and PWN adjective category domains were comparable. However, the process of mapping has been carried out parallel to the process of the extension of adjective category in plWN. Mapping strategy In designing the strategy for mapping adjective synsets between plWN and PWN, we focused on relations common or similar in the two networks and used them as a starting point for the first stage of mapping (cf. Rudnicka et al. 2015) . Two types of algorithms generating automatic prompts were developed. The first one relied on synset relations, exclusively, such as Attribute and Value of the attribute and Similar to and Hyponymy and Gradability. The second one capitalised on both synset and lexical unit relations taking in addition Derivationally related form and Derivativity, Pertainym and Crosscategorial synonymy. Apart from adjective relations, both algorithms took advantage of the existing network of inter-lingual relations between noun synsets, because some of adjective relations are relations to nouns. Finally, lemmas of the generated candidate pairs were filtered by a large cascade dictionary. The results of sample implementation of the algorithms were next confronted with the results of independent manual mapping. Tests showed higher effectiveness of the 'mixed' type of algorithm (figures from TSD). Notwithstanding the usability of the proposed automatic prompt algorithms, it was necessary to design the manual mapping procedure and define a set of interlingual relations. In its main assumptions, it follows the general mapping procedure proposed for nouns (cf. Rudnicka et al. 2012) . The procedure consists of three main stages: recognising the sense of a source synset, searching for a target language synset and establishing a relevant inter-lingual relation. The set of inter-lingual relations also largely corresponds to a set of inter-lingual relations defined for the purposes of noun mapping and it includes Synonymy, Partial synonymy, Inter-register synonymy, Hyponymy, Hypernymy and, in addition, Crosscategorial synonymy to nouns. The latter relation is used in the cases of very general I-hyponymy links for more detailed specification of the sense of a source synset. Three subtypes are distinguished: made of used for adjectives describing a material denoted by a noun, resembling used for adjectives naming a physical property denoted by noun and related to used for adjectives describing a non-physical property denoted by a noun. Mapping results and discussion In this section, we discuss the results of mapping adjective synsets in plWN 2.3. Tables 5 and 6 Table 5 . Adjective inter-lingual relation counts Cross-domain inter-lingual relation counts plWN / PWN [adj] [rel] [jak] -qualitydenoting 11035 2271 [mat] -materialdenoting 550 479 [rel] -relational 3875 10172 Table 6. Adjective cross-domain interlingual relation counts Bearing in mind size differences of the adjective category in plWN and PWN (see Section 2), it comes as no surprise that the most frequent inter-lingual relation is I-hyponymy, with 17654 links (48%). It is followed by I-crosscategorial synonymy, with 13792 links (38%). Still, it must be remembered that I-cross-categorial synonymy is established only as a 'follow-up' of I-hyponymy when its links are very general. The majority of these links are cases of Polish adjectives derived from nouns by productive morphological rules and having no direct adjective counterparts in English (78% of the mapped adjectives with I-hyponymy relation). Thus, if we subtract the number of those cases from the total number of Ihyponymy links, we obtain 3862 'true' I-hyponymy links and 22663 plWN adjective synsets linked to PWN adjective synsets by non-cross-categorial inter-lingual relations. Also, the contrast in I-hyponymy and Isynonymy counts becomes then much less sharp. It is only 3862 against 3549 links. I-synonymy provides the most specific type of link, hence it is always the most desired relation from the perspective of mapping. The last notable inter-lingual relation is partial synonymy with 1397 links. Productive affixal adjective derivation in Polish is not the only source of mapping problems. Another issue is domain mismatch. plWN and PWN semantic domains only partially overlap (see Section 2). This motivates the necessity of establishing inter-lingual relations between plWN and PWN adjective synsets belonging to different domains. In Table 6 , we present the statistics of crossdomain mappings. The most interesting piece of data is the number of links established between plWN qualitydenoting adjectives and PWN relational adjectives, which is 2271. One would expect plWN quality-denoting adjectives to be mapped rather on PWN adjectives from the general 'adj' domain. The most troublesome cases are those in which plWN quality-denoting adjectives and PWN relational adjectives are to be linked by means of (full) I-synonymy due to the fact that establishing any other inter-lingual relation would falsify the semantic correspondence between lexical units forming the synsets in question. In such cases, lexicographers choose to violate the requirements posed by wordnet design, i.e. not using I-synonymy to link adjective synsets of different domains, and establish I-synonymy relation between the synsets. To illustrate this, consider the synsets {postkomunistyczny 2 (jak)} -'postcommunist' (qualitydenoting) and {post-communist 2 (rel)}: events that happen after communism. Semantically, they can be thought of as equivalents. Furthermore, they have corresponding positions in the synset networks in respectful wordnets. Yet, their qualifiers (jak) -'qualitydenoting' and (rel) -'relational' indicate that in plWN the adjective postkomunistyczny denotes the quality of an object it modifies, i.e. occurring after communism is an inherent quality of a given object, whereas in PWN postcommunist denotes relation to communism, i.e. the object modified might as well occur during communism and continue its occurrence after it. Naturally, the decision to establish full I-synonymy between the two synsets irrespective of domain differences raises the question whether the emphasis should be put on the mapping of senses or the mapping of structures. A question which we leave unanswered for the time being. Conclusion Mapping between two independently created networks is always a challenge. In plWN-PWN adjective mapping, we had to deal with relation structure, semantic domain and size differences between the two wordnets. To handle them, an advanced mapping strategy was proposed subsuming a three stage mapping procedure, a set of interlingual relations and automatic prompt algorithms. Both manual mapping procedure and automatic prompt algorithms capitalise on pairs of relations that are corresponding between the two wordnets, such as, for instance, Value of (the Attribute), Derivativity/Derivationally related form and Crossparadigm synonymy/Pertainym. The algorithms also take advantage of inter-lingual noun mapping between plWN and PWN, since some of intra-wordnet adjective relations are relations to nouns. The most frequently established inter-lingual relation is I-hyponymy, yet the vast majority of these links result from morphological differences between English and Polish, namely very productive affixal derivation of Polish adjectives from nouns. Many of these adjectives do not have direct equivalents in English. To make their semantic import more specific we have introduced I-crosscategorial synonymy relation to English nouns and its links comprise about three fourths of I-hyponymy links. The remaining number of I-hyponymy links is comparable to the number of I-synonymy links. High frequency of Icross-categorial synonymy appears inevitable and is dependent on the number of noun derived adjectives in plWN and the number of noun synset pairs that exist in linked plWN and PWN. The fact that I-cross-categorial synonymy works in correlation with I-hyponymy will undoubtedly increase the number of I-hyponymy links characterised by a limited information input as far as semantic relations between inter-lingually linked adjectives are concerned. With respect to future works, Icross-categorial synonymy could gain more fine-grained distinctions that will allow lexicographers to establish more precise meaning correspondences between Polish derived adjectives and English nouns that correspond to Polish nouns which are bases for the derived adjectives, e.g. I-cross-categorial synonymy of the type Related to could be further divided into relations coding narrower semantic correspondences, for instance (Related_to)_Location for adjectives derived from place names; {Warsaw}---I-cross-categorial------synonymy_(Related_to)_Location----{warszawski (Warsaw(Adj))} ← {Warszawa (Warsaw(N))}. Different semantic domains of adjective synsets to be linked have turned out secondary to their semantic closeness. The choice of meaning correspondence over even the grammatical category mismatch is nothing uncommon as far as multi-lingual wordnets are concerned. A parallel approach is visible for instance in EuroWordNet (see Vossen 2002) , or Open Multilingual WordNet (Bond et al. 2014 ). Acknowledgement Work co-financed by EU's 7FP under grant agreement No. 316097 [ENGINE] . Proceedings of COLING 2012 : Technical Papers. COLING 2012 Organizing Committee, pp. 1039 -1048 . Rudnicka, E., Witkowski, W., Kaliński M. (2015)",
    "abstract": "The paper presents the strategy and results of mapping adjective synsets between plWordNet (the wordnet of Polish, cf. Piasecki et al. 2009 , Maziarz et al. 2013 ) and Princeton WordNet (cf. Fellbaum 1998). The main challenge of this enterprise has been very different synset relation structures in the two networks: horizontal, dumbbell-model based in PWN and vertical, hyponymy-based in plWN. Moreover, the two wordnets display differences in the grouping of adjectives into semantic domains and in the size of the adjective category. The handle the above contrasts, a series of automatic prompt algorithms and a manual mapping procedure relying on corresponding synset and lexical unit relations as well as on inter-lingual relations between noun synsets were proposed in the pilot stage of mapping (Rudnicka et al. 2015). In the paper we discuss the final results of the mapping process as well as explain example mapping choices. Suggestions for further development of mapping are also given.",
    "countries": [
        "Poland"
    ],
    "languages": [
        "Polish",
        "English"
    ],
    "numcitedby": "1",
    "year": "2016",
    "month": "May",
    "title": "Challenges of Adjective Mapping between pl{W}ord{N}et and {P}rinceton {W}ord{N}et"
}