{
    "article": "This paper describes the development and evaluation of a chatbot platform designed for the teaching/learning of Irish. The chatbot uses synthetic voices developed for the dialects of Irish. Speech-enabled chatbot technology offers a potentially powerful tool for dealing with the challenges of teaching/learning an endangered language where learners have limited access to native speaker models of the language and limited exposure to the language in a truly communicative setting. The sociolinguistic context that motivates the present development is explained. The evaluation of the chatbot was carried out in 13 schools by 228 pupils and consisted of two parts. Firstly, learners' opinions of the overall chatbot platform as a learning environment were elicited. Secondly, learners evaluated the intelligibility, quality, and attractiveness of the synthetic voices used in this platform. Results were overwhelmingly positive to both the learning platform and the synthetic voices and indicate that the time may now be ripe for language learning applications which exploit speech and language technologies. It is further argued that these technologies have a particularly vital role to play in the maintenance of the endangered language. Introduction This paper describes the design, development and evaluation of a chatbot which can be used as a simple interactive dialogue system for the teaching of the Irish language (Gaeilge) in the realm of Computer-Assisted Language Learning (CALL). Chatbots are programs that can interact with humans using natural language. They come in a variety of forms, many having avatars with greater or lesser similarities to a human being. The chatbot presented here is part of the ABAIR speech technology initiative, School of Linguistic, Speech and Communication Studies, Trinity College, Dublin (TCD). ABAIR has developed synthetic voices for the three main Irish dialects (available to the public at www.abair.ie) and is exploring their exploitation for educational and disability applications. Chatbots are still a very new addition to CALL: there is little information available on their use and few evaluations of their effectiveness as a component of CALL (Georgila et al., 2012) . Similarly, there has been little use to date of synthetic speech in CALL applications. The system developed here is thus in many ways quite exploratory, not only in the use of chatbots, but also in showcasing how synthetic speech can enhance the learning environment. In this paper, we describe the development and evaluation of a specific chatbot application with synthetic voices. The development of the synthetic voices has been described elsewhere (ABAIR, 2016; Ní Chasaide et al., 2015) and we focus specifically here on the chatbot and on how it exploits these voices. In terms of the evaluation that is carried out, there is a dual goal. Firstly, we set out to elicit learners' opinions of the chatbot as a learning environment. Furthermore, we set out to ascertain learners' responses to the synthetic voices in this CALL context. In the context of the endangered language, speech/language technology and CALL resources offer potentially powerful tools, that can help redress the many challenges that confront these lesser spoken languages. Background and Motivation Endangered and minority languages exist in a very different context to the major world languages. Understanding this context is important to appreciate the specific challenges that the teaching/learning of such languages present (Ní Chasaide et al., 2015) . While the difficulties presented are considerable, the incorporation of new speech and language technologies into CALL may be one important key to addressing these same challenges. Nowadays, attaining communicative competence in the target language is considered the main goal of language pedagogy and an effective communicative setting is considered key to a successful acquisition process (Richards & Rodgers, 2001; Savignon, 2006) . Therefore, the ideal learning environment should provide a setting and materials whereby the learner can communicatei.e. negotiate meaning with an interlocutor in the target language. Successful learning also depends greatly on the level of motivation: having attractive learning materials and tasks and a context of learning that is truly communicative is vital in order to engage the learner. Currently popular CALL activities such as telecollaboration activities, or human-human tandem learning provide ways to provide learning settings that are inherently communicative and engaging for learners. The ideal pedagogical conditions are difficult to meet in the case of the endangered language. CALL activities, such as the telecollaborative activities mentioned, may not be workable due to the demographics. The Irish language is classified by UNESCO as being 'definitely endangered' and only 1.25% of Irish people are native speakers (Moseley, 2010) . They are mostly based in Gaeltacht (Irish-speaking) regions in the west of Ireland, but there are some in urban and other locations throughout the island. There are virtually no monolingual speakers of Irish. The three main Gaeltacht regions are indicated by the yellow highlighted circles in Figure 1 . Irish is nonetheless Ireland's first official language and it enjoys considerable State support. Irish is a compulsory school subject up to University level. Furthermore, there is a large public demand for Irish-medium education and recent years have shown a large grown in the number of Irish-medium schools, particularly at primary level, as can be seen in Figure 1 . However, for the majority of schools, which are English-medium schools, Irish is simply taught as one of a number of school subjects. Thus, despite a small number of native speakers, there are large numbers of learners and a diversity of school-types, and the State is committed to delivering a nationwide programme of Irish language education (Rialtas na hÉireann, 2010). The teaching of Irish presents many challenges, as is likely to be the case with all minority languages. Most learners do not have ready access to the spoken language in a truly communicative setting. In the classroom, most Irish teachers are themselves second language learners, so learners do not have ready access to native speaker models of the language. And as there are few, if any, native monolingual speakers, the kinds of telecollaboration activities, or human-human tandem learning resources, are of relatively little value: the native speakers of Irish, all of whom have native-like competency in English, would have little or nothing to gain from such telecollaborative interactions and they would be very unlikely to persist. Furthermore, the dearth of modern teaching materials for Irish is often pointed out by teachers as failing to motivate learners and contributing to sometimes negative attitudes to the learning process. The recent development of text-to-speech (TTS) systems for Irish, providing high quality synthesis in the three main dialects, presents an opportunity to exploit the synthetic voices for language teaching and learning in ways that can help redress the lack of access to native speaker models. CALL applications are being explored, such as multimodal interactive games that can greatly enhance learners' exposure to native speaker speech (Ní Chasaide et al., 2011; Ní Chiaráin, 2014; Ní Chiaráin & Ní Chasaide, 2014; Ní Chiaráin & Ní Chasaide, 2015) , while hopefully also providing a way of making the language learning environment more communicative, as well as more engaging and motivating. The chatbot platform explored in this paper is of particular interest, in that it engages the learner in a real communication, even if that communication is with an artificial agent. It involves a simple spoken dialogue system. It offers the possibility to the language learner of engaging with a virtual dialogue partner in a way that is more complex than simply providing a predetermined response to a given input. Such a system offers the possibility of learner and chatbot accommodating to each other and arriving at an agreed meaning. We have developed other interactive games using the synthetic voices. However, while prerecorded speech could, in principle, be used in these games (Ní Chiaráin, 2014) , the chatbot dialogue system here requires synthetic speech to allow for the generation of open-ended utterances and to provide the illusion that one is actually communicating. As mentioned, chatbots are still a very new addition to CALL, and if they are to become a serious part of CALL, then considerably more research into their development is needed. This work is a contribution in this direction: the application has been developed to proof-of-concept level, and evaluation is key to its future development. In the following sections the system development is described (Section 3) as well as the evaluation carried out on it (Section 4). Note that the evaluation covers two distinct aspects: evaluation of the overall effectiveness of the chatbot dialogue system as a learning environment, and evaluation of the ABAIR synthetic voices, which are used by the chatbot. Development From the users' perspective, this system presents a very animated, smartly dressed monkey typing into a laptop (see Figure 2 ). Learners can take the initiative and ask their own questions or respond to questions from the chatbot. The learner inputs text (Step 1 in Figure 2 ), which is then spoken aloud using a voice that the learner has chosen from the three dialect voices, including male and female. The monkey's voice (male/female/choice of dialect) is also chosen at the outset by the learner. The game proceeds by the learner posing questions of the monkey. The dialogue manager then generates an answer and follow up questions based on the learner's input (Step 2 in Figure 2 ) and the monkey speaks it aloud (Step 3 in Figure 2 ). The topics in which conversations can take place at this point in the development cover general greetings; name; age; where you live; members of your family; hobbies and holidays. It should be noted that these are topics that are in line with the curriculum for second level school oral examinations. The chatbot for the present study is given the name Taidhgín. The name is derived from the phrase in Irish \"Tuigeann Tadhg Taidhgín, ach ní thuigeann Taidhgín tada\" (literal translation: 'Tim understands Little Tim but Little Tim understands nothing'; figurative meaning: 'it takes ones to know one'). 'Taidhgín' is the diminutive version of Tadhg and the name suggests a subservient role for him in any dialogue interaction. Taidhgín was built using Artificial Intelligence Markup Language (AIML), an XML-based open-source programming language which was developed by Richard Wallace and the Alicebot free software community during the period 1995-2000. Taidhgín is hosted and run from which is a 'free open-source-based community web service which enables you to develop and publish chatbots on the web' (pandorabots.com). The chatbot has integrated Irish language synthetic voices which are developed as part of the ABAIR initiative in TCD. Ideally, the chatbot would be part of an end-to-end spoken dialogue system with speech input and output but as there is not yet an automatic speech recognition system for the Irish language, the user must input speech to the Taidhgín system by typing into a text box. AIML, used for the development of the chatbot, enabled us to avoid a unidimensional program such that a particular input always generated a predetermined output. It produces highly interactive output, which is able to respond to input in a non-linear fashion. It is able to handle novel linguistic turns and make appropriate responses. The use of synthetic speech as a feature of CALL is also quite novel and somewhat controversial. In the past, 'canned' utterances were used as the quality of synthetic speech was not deemed high enough for CALL applications. The use of prerecorded speech would be too restrictive for the chatbot application here as the point of Taidhgín is precisely that it should be capable of making such novel responses. Synthetic speech is thus a prerequisite for the spoken output. It should be noted that the quality of synthetic speech has improved dramatically in recent years and it is now potentially usable in CALL. Not all synthetic voices are equally intelligible, natural, attractive, etc. and it goes without saying that the synthetic speech needs to be of a sufficiently high quality to give the learner the appropriate linguistic input to enable him/her to progress in his/her language acquisition. In the case of the ABAIR synthetic voices, the quality is, in our view, rather high. Importantly, also, the voices preserve the nuanced pronunciation of the individual dialects, making it authentic to the ears of the listener. Nonetheless, in evaluating the chatbot system, it was clearly advisable to also elicit evaluations from learners on the voices used. The ABAIR Irish language synthetic voices were linked to the Pandorabots framework so that Taidhgín could speak out a variety of responses from within his repertoire. These responses are designed to vary in such a way that an appropriate utterance, taken from a randomly generated selection of outputs, is selected in response to the learner's input. As mentioned, the topics that Taidhgín can converse on include general greetings: your name, where you live, information pertaining to your family, your hobbies, etc. Taidhgín's responses contain questions and implicatives that encourage the user to continue the conversation. There are also built-in conditional strategies to redirect the user to specific topics when the input is not recognised. The avatar is represented by a four minute mp4 video of a lively, friendly monkey typing into a laptop (see Figure 2 ), who gesticulates quite a lot. While Taidhgín is speaking, the video plays on a loop and stops once his contribution is complete. While the learner is inputting their contribution, Taidhgín is quite still, giving the impression that he is listening. The learner interactions can involve a response to a question posed by Taidhgín or learners can pose their own questions. The chatbot builds up a personal profile for each student which allows for personalised responses. It has natural language understanding and generation built into its AIML code so that it can recognize a variety of syntactic structures in the input as having approximately the same semantic value and respond appropriately. Additional features such as 'smart answers' have also been added using language independent AIML compatible tags. These include time and date information which Taidhgín can deliver on request, as the tags are set to the nearest hour in the time zone specified. There are a number of monitoring and correction devices embedded at different stages of the dialogue process. Grammar and spelling checkers have been included in the browser window such that errors in the input are highlighted in the learners' text box, allowing correction of the text before submission. These work up to a point. A further internal correction system is used, based on the most common grammatical and orthographic errors documented for Irish Leaving Certificate students (pre-University examinations) (Ó Baoill, 1981) . When input is erroneous but close to the correct version Taidhgín reprises a correct version as part of his response, thus avoiding a break in the flow of conversation, which explicit correction would entail. In addition, log files are available to the learner and tutor for later review. Evaluation and Results Evaluation was carried out on a population of 228 learners, consisting of 16-17 year old students in Irish second level schools. This cohort was from a variety of backgrounds, from learners with native/near-native proficiency to those who had only experienced Irish as an academic subject in school. It was intended that all sections of the Irish school community would be represented in the study, and a good geographical spread was included incorporating schools from each of the four provinces and a mixture of pupils from urban and rural backgrounds and from Irish-medium, English-medium and Gaeltacht schools. was presented to the students as a type of interactive playful activity where learners simply had to experiment with the chatbot. The task was to spend some time (roughly 20 minutes) 'chatting' with Taidhgín, asking him questions about himself and answering his questions. Learners each had the opportunity to interact or to 'chat' individually with Taidhgín online for 20 minutes on their school PCs. As mentioned earlier, there were two distinct goals in the evaluation and it was carried out accordingly in two parts. The first was designed to elicit learners' reactions to the chatbot as a learning environment. The second investigated learners' opinions on the intelligibility, quality and attractiveness of the synthetic voices used in the platform. The terms 'quality' and 'attractiveness' were not defined for the learners but rather left to their own interpretations. It was felt that defining such terminology for school students would overcomplicate the evaluation at this stage and that these more general terms would be sufficient to judge reactions. Learners' opinions were elicited using a 5-point Likert scale-based questionnaire. The main findings on the disposition of the respondents towards the chatbot are set out in Table 1 below, on a 5-point scale ranging from 'very negative' (1) to 'very positive' (5). Results for the second (TTS) part of the evaluation are presented in Table 2 . These results shown in Table 1 (see below) indicate an extremely high approval rating to Taidhgín as an effective learning environment. The very positive evaluation stood out in comparison to evaluations obtained from other learning platforms we had developed. These involved a multimodal interactive game and a virtual reality scenario, and when similarly evaluated yielded considerably lower overall ratings (Ní Chiaráin, 2014), even though on the whole they were actually quite positively rated too. The attractiveness of the chatbot as a learning aid had an 86% positivity rating. It was also highly rated for its motivational value (82%). 90% were 'positive' or 'very positive' towards the playfulness of interacting with the avatar and this is likely a reflection of the personalised nature of the responses which the avatar could give, such as its referring to the respondents by their names and its ability to seemingly establish a rapport with them. While the avatar and its environment do not have sophisticated graphics, nevertheless they were viewed 'positively' or 'very positively' by 87% of the respondents. Respondents did notice the less than perfect alignment of the speech with the movements of the chatbot and this is reflected in the somewhat lower scores given to that particular questionnaire item. Nevertheless, it is striking that even that item attains an almost 70% positivity rating. The overall usefulness of the concept of a virtual conversation partner also got a high rating (82%). The synthesized voices were sufficiently clear to make the speech intelligible. 73% 2 Give your opinion on the quality of the synthesized voices: do you think the voices are adequate for the type of game presented here? 73% 3 Give your opinion of the attractiveness of the voices. 57% Table 2 : Responses to the TTS aspects of Taidhgín: percentage of pupils who were 'positive' or 'very positive' towards the Intelligibility, Quality and Attractiveness of the Synthetic Voices. Of particular significance in Table 2 is the respondents' evaluation of the intelligibility of the synthetic speech used. This got a high approval rating by 73% of respondents. This was higher than anticipated given that interpreting learners' evaluations of synthetic speech is problematic (Pellegrini, Costa and Transcoso, 2012; Kang, Kashiwagi, Treviranus and Kaburagi, 2008) and may be negatively biased. If a learner judges synthesised speech in a target language to be unclear, one cannot say with any degree of certainty whether the weakness lies with the quality of the synthesised speech or with the learners' lack of proficiency. The quality of the voices also received high ratings (73%). The attractiveness rating is considerably lower (57%). It should be noted, however, that the learners chose the Connemara male voice (a middle-aged male voice) as the default voice for Taidhgín and learners frequently gave informal feedback that the monkey sounded old. Attractiveness, thus, is a rather loaded entity to which perceived age can contribute positively or negatively. Nonetheless, given the high ratings for quality, we can be reasonably confident that the voice is credible and authentic, even if it not conjure up the typical teenager's image of 'attractive'. Conclusion In the absence of an easily accessible Irish-only speech environment for the typical learner, spoken dialogue tutorial systems offer learners a quasi-realistic communicative setting to aid in the learning process. It may thereby also increase motivation as well as promote positive attitudes towards the language. Task-based language learning (TBLL) activities, where the task gives authenticity to the language use situation, are particularly needed for Irish and for endangered languages generally. Taidhgín has been introduced as a means of encouraging quasi-authentic linguistic interactivity between the learner and the computer. There are few interactive digital Irish language facilities available and the present study is part of a larger project aiming to develop such facilities. It is intended that such systems be highly interactive, in the sense that learner can act and react towards the virtual world situations giving at least a semblance of a genuine communicative experience. The evaluations indicate that learners found the CALL platform attractive and that the program could interact with the learner in a non-linear and in a seemingly 'intelligent' fashion. TTS is essential to this platform as learners are free to input self-composed unpredictable conversational turns. This is the first time also that the ABAIR TTS voices have been evaluated, and the intelligibility these voices in this CALL environment were given a high approval rating. The synthetic voices used for the present implementation proved 'fit-for-purpose' and this adds weight to a growing body of research suggesting that high quality synthetic speech can play a significant role in CALL. And while the case of majority language may differ, there is undoubtedly a very great need in the case of the endangered language, such as Irish. The evaluation results provide strong support for the use of highly interactive dialogue partners along with synthetic voices in CALL. The high level of acceptability reflects not only the quality of the voices, but also the sociolinguistic and learner context where so few attractive materials are available to the learner. Note also the extremely low rate of 'negative' or 'very negative' dispositions towards the overall experience of the chatbot. Future Directions We aim in the future to develop a more complex AI system capable of building personal profiles for individual language learners so that the responses by the avatar may be more finely tuned to the individual, engaging and establishing a rapport with the learner. It is planned to incorporate more Natural Language Processing (NLP) resources which will both ensure that the flow of dialogue is less likely to fail, but also enable the monkey to pick up on incorrect forms, respond appropriately to the learner and provide intelligent corrective feedback. Some such resources already exist, such as a grammar checking engine (Scannell, 2005) Scannell, & Uí Dhonnchadha, 2016) , and more research in this area is envisaged for the coming years. A further priority will be the development of speech recognition for Irish, which is also part of future research plans. This will enable end-to-end spoken dialogue systems. While a full recognition system will inevitably take time to develop, an even partial system could, in the short-term, provide interesting options. The overall goal is to harness the emerging technologies in a way that will enable more effective language learning. It is undoubtedly the case that the future survival of Irish and many such endangered languages will depend on how effectively we can transmit them to the next generation. In this context, there is some urgency with ensuring that our educational resources make full use of what modern speech and language technologies have to offer. Acknowledgements The authors are grateful for the support of An Roinn Ealaíon, Oidhreachta agus Gaeltachta (ABAIR project) and An Chomhairle um Oideachas Gaeltachta & Gaelscolaíochta (CabairE project). % responses on Likert Scale",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 0.9822826215981071,
        "foundation": 0.8739437016407458,
        "none": 0.0
    },
    "reasoning": "Reasoning: The acknowledgements section of the article mentions support from An Roinn Ealaíon, Oidhreachta agus Gaeltachta (ABAIR project) and An Chomhairle um Oideachas Gaeltachta & Gaelscolaíochta (CabairE project). These entities are associated with government or cultural heritage organizations in Ireland, which suggests funding from a research agency or foundation, but there is no direct mention of defense, corporate, or other specific types of funding sources."
}