{
    "article": "In this paper, we present the CItA corpus (Corpus Italiano di Apprendenti L1), a collection of essays written by Italian L1 learners collected during the first and second year of lower secondary school. The corpus was built in the framework of an interdisciplinary study jointly carried out by computational linguistics and experimental pedagogists and aimed at tracking the development of written language competence over the years and students' background information. Introduction Over the last ten years, language technologies have been successfully exploited to study the development of language learning processes. A variety of different approaches based on Natural Language Processing (NLP) tools has been developed for different purposes, such as to track the syntactic development in child language (Sagae et al., 2005; Lu, 2007; Lubetich and Sagae, 2014) , to measure the developmental language progress using child speech patterns (Sahakian and Snyder, 2012) . NLP-based approaches have been devised also to detect mild cognitive impairments using measures of syntactic complexity (Roark et al., 2007) or of semantic and pragmatic atypicality (Rouhizadeh et al., 2013) , and to select reading material that are appropriate for students' reading proficiency considered a fundamental component of language competency (Schwarm and Ostendorf, 2005; Petersen and Ostendorf, 2009) . As witnessed by the increasing success of the Workshop on Innovative Use of NLP for Building Educational Applications (BEA) arrived in 2016 at its eleventh edition 1 , language technologies have been also exploited in educational settings to design and develop educational applications such as for instance Intelligent Computer-Assisted Language Learning systems (ICALL) (Granger, 2003) or Automatic Essay Scoring systems (Attali and Burstein, 2006) . For all these studies and applications, the availability of electronically accessible corpora of student essays is of pivotal importance. So far, several learner corpora have been built mainly differing at the level of typologies of collected essays (i.e. written or speech transcriptions), goals of analysis (e.g. theoretical studies or development of educational applications), typologies of considered learners (e.g. learners of first or second language, adults or children). A specific interest has been devoted to the construction of written learners' corpora where errors (i.e. erroneous forms written by learners) are annotated and classified; this is especially (but not only) the case of corpora of students learning a 1 http://www.cs.rochester.edu/∼tetreaul/naacl-bea10.html foreign language (L2). Corpora enriched with this kind of information can offer insight into learners' development of competencies and difficulties (Deane and Quinlan, 2010) , they can be used to investigate the characteristics of interlanguage (Brooke and Hirst, 2012) or as reference resources for automatic error detection and correction tasks. The latter is the case of the NUS Corpus of Learner English (NUCLE) (Dahlmeier et al., 2013) exploited during 2013 and 2014 editions of the \"Shared Task on Grammatical Error Correction\" (Ng et al., 2013; Ng et al., 2014) . Interestingly, corpora of L2 learners annotated for errors have been built for a number of languages other than English, e.g. for Arabic as L2 (Zaghouani et al., 2015) , German (Lüdeling et al., 2005) , Hungarian (Dickinson and Ledbetter, 2012) , Basque (Aldabe et al., 2005) , Czech and Italian (Andorno and Rastelli, 2009; Boyd et al., 2014) . In this paper, we would like to narrow the focus on those studies devoted to build corpora of essays written by learners a first language (L1). Among the others, similar corpora have been built for example by Parr (2010) who collected a corpus of essays written by 20,947 New Zealand students in years 4 to 12 of schooling that were manually evaluated considering seven different rubrics (ranging from content organization to features of grammar, spelling, etc.); his study aimed at tracking the relative rate of progress in writing over the years and types of schools (e.g. private vs. public schools, urban vs. rural). Or by McNamara et al. (2010) who collected 120 essays written by U.S. undergraduate students that were manually evaluated to investigate linguistic factors (e.g. syntactic complexity and lexical diversity) related to the level of student writing quality. If great attention has been payed so far to the construction of corpora of written essays to study English language development of L1 learners, little work has been carried out for other languages. The KoKo corpus (Abel et al., 2014) and the corpus collected by Berkling et al. (2014) represent two main exceptions for the German language. The former is a collection of authentic texts (for a total of 716,000 tokens) written by 1,319 German-speaking students attend-ing the last year of secondary school, linguistically annotated using a battery of linguistic annotation tools and manually annotated for background information and errors. It was built to get insight into pupils writing competencies and difficulties. The latter is a corpus of essays collected via elicitation and written by 1,730 students (for a total of 159,111 tokens) from grade 1 to 8 attending elementary and secondary schools. It was manually annotated for a wide range of spelling errors (i.e. orthographic, morphosyntactic, etc.) to study the different categories of errors years. In this paper, we introduce CItA (Corpus Italiano di Apprendenti L1), the first freely available and digitalized corpus of essays written by Italian L1 learners collected in the first and second year of the lower secondary school 2 . Notably, it contains not-scored essays, it was manually annotated for errors and corrections, and it is accompanied by a questionnaire containing students' background information. The diachronic nature, the considered school period and the manual annotation for errors and corrections represent the main novelties of the CItA corpus. Italian corpora of L1 written productions built so far are characterized by a quite different internal composition. It is worth mentioning here the collection of 5,000 essays written by students from the first to the fifth years of elementary school (1,000 for each school year) collected in all the Italian regions by Marconi et al. (1993) and the corpus built by Borghi (2013) , a collection of 2,500 essays (for a total of 276,849 tokens) written by students of the fist year of different high schools in Rome. The latter is a synchronic corpus, the former (although diachronic) does not include essays written by the same group of students over the five years of elementary school. To our knowledge, CItA is the first corpus built to track the development of L1 writing competence of a same group of students over two school years and several students' background information. This makes possible to compare the characteristics of a set of chronologically ordered essays written by the same student over the years. Thus, as discussed in what follows, CItA is currently used within an interdisciplinary study jointly carried out by computational linguistics and experimental pedagogists and devoted to investigate how a wide set of linguistic features automatically extracted from the corpus can be related to different aspects of written language development. The CItA Corpus The CItA corpus (Corpus Italiano di Apprendenti L1) is a collection of essays written by Italian L1 learners collected during the first and second year of lower secondary school. It was collected during the two school years 20012-2013 and 2013-2014 as part of a broader on-going study carried out in the framework of the IEA-IPS (Association for the Evaluation of Educational Achievement) activities (Lucisano, 1988; Lucisano and Benvenuto, 1991) . The study is devoted to introduce an innovative NLP-based methodology to track the evolution of written language competence over the first two years of the Italian lower secondary school, a temporal span that is quite crucial in the school career of L1 students (Barbagli et al., 2015) . CItA contains essays written by the same students chronologically ordered and covering a two-year temporal span. This makes the corpus particularly suitable to track the evolution of L1 written language competence over the time, as suggested by the results of the first experiments carried out by Richter et al. (2015) . The underlying hypothesis is that a number of quite relevant transformations in writing competence occurs during the transition from the first to the second year of lower secondary school and that these transformations are mainly due to a different instructional approach to teach writing. The idea is that these transformations can be captured by inspecting how a wide set of linguistic features automatically extracted from text and different typologies of learners' errors are differently distributed in the two considered years. It should also be noted that none of the already existing Italian corpora of L1 written productions have been annotated for errors. As discussed in what follows, we defined a new annotation schema to mark-up different typologies of errors made by students, together with the corresponding corrections. To our knowledge, this is the first time that an error annotation scheme is designed to annotate errors made by L1 Italian learners. Annotated errors can be used as a further index of the development of written language competence and they make CItA suitable for being used in the construction of Automatic Error Correction systems. The corpus is also accompanied by a questionnaire including 34 questions about biographical, socio-cultural and sociolinguistic background of students. This makes it possible to investigate whether and to which extent some of the student background information are related to the observed written competence changes. Corpus Collection The CItA essays were collected in 7 different lower secondary schools located in different areas of Rome: 3 schools are in the historical center and 4 schools in suburbs (see Table 1 ). The underlying idea is that the city area where the school is located is highly correlated with the socio-cultural context: the historical center is considered representative of a medium-high context while suburbs of a medium-low context. The corpus contains a total of 1,352 essays (369,456 word tokens) written by 153 students the first year and 155 the second year. The students were asked to respond to different writing prompts that can be grouped into five textual typologies: reflexive, narrative, descriptive, expository and argumentative corresponding to different communicative language abilities and different writing skills. As shown in Table 2 , there are some differences over the two considered years and the seven schools. First of all, it can be noted that the number of prompts differs among the seven schools: teachers of the schools located in the city center tend to give a higher numbers of prompts than their colleagues in the suburban schools. Secondly, if reflexive prompts are the most frequent textual type in the two years, from the first to the second year the distribution of narrative prompts are halved while the expository and argumentative ones are doubled. This different distribution follows from the approach to teach writing adopted by teachers: writing a narrative essay is considered simpler, i.e. it requires simpler cognitive and writing skills, than writing an argumentative or expository essays where more complex linguistic and discoursestructuring competences are required. As we will discuss later, this different distribution of prompts is also related to the different distribution of some categories of errors made by students. A prompt common to all schools was also assigned at the end of the first and second year. At the end of second year, students were asked to respond to the Italian version of Task 9 of the IEA-IPS (Lucisano, 1984; Corda Costa and Visalberghi, 1995) study, i.e. a letter of advice to a younger fellow student on how one should write in order to get good grades in the school; and at the end of the first year a modified version of Task 9. The two common prompts were meant to provide evidence of how students perceive the different writing instructions received in the two considered school years. First investigations in this directions were carried out by Barbagli et al. (2015) combining automatic linguistic annotation tools and knowledge extraction techniques. It resulted that in the first year students tend to mostly provide emotive advises expressed by terms such as e.g. non aver paura 'not to have fear', paura dei compiti 'fear of the essay', rifletti prima di scrivere 'reflect before writing'; while in the second year, their advises refer more to meta-linguistic traits, such as e.g. the use of calligraphy, the use of verbs, the adherence to the prompt, thus reflecting the different typology of writing instructions that they received. The students were also asked to answer to a questionnaire that we designed and that includes 34 questions about their biographical, socio-cultural and sociolinguistic background. We considered two main types of questions: a first group of thirteen concern biographical information such as the language(s) the students usually speak at home, when and where they were born, their parents' education and employment, etc.; the other questions are meant to investigate how students perceive the writing activity in general and particularly the school writing, if they like writing outside school, which kind of texts they prefer writing, etc. Interestingly enough, the distribution of the answers to the first set of questions is in line with our starting hypothesis that the city area where the school is located is highly correlated with the socio-cultural context. As shown in Tables 3 and 4 , it resulted that the schools located in the historical center are mostly attended by students who at home usually speak Italian or Italian and a foreign language, and whose parents are employed in highly ranked jobs; while students attending schools in suburbs belong to a different sociocultural context where dialects and foreign languages are more frequently spoken, and where low ranked jobs (i.e. artisan and workman jobs) are the main typology of employment. As far as the attitude towards writing is concerned, the majority of students claims that teaching writing is \"very important\" (78,9%) even though students attending the schools in the city center (88,7%) believe that it is more important than those attending a school in suburbs (69%). Interestingly, all students agree that writing is mostly useful to \"find a job\" than to \"put in order ideas\" , and they prefer writing essays that require few discourse-structuring competences and allow conveying emotions and feelings. Error Annotation The CItA corpus was manually annotated for different typologies of errors by a lower secondary school teacher. She also hand-corrected the errors made by students. Error annotation is a quite challenging task since it assumes that a deviation from a linguistic norm is occurring, a norm which is in its turn an arbitrary concept defined only according to social conventions. Besides, an L1 error taxonomy applicable in corpus annotation is lacking for the Italian language. This is the reason why we defined a new annotation schema starting from Berruto (1997)'s definition of   \"neo-standard Italian\" as linguistic norm, according to the literature on evaluation of written skills of L1 Italian learners (Corda Costa and Visalberghi, 1995; De Mauro, 1983; Emilia-Romagna, 2010; Colombo, 2011) and checking the frequency distribution of errors in CItA. To our knowledge, this is the first time that an error annotation scheme is designed to annotate errors made by L1 Italian learners. Table 5 reports the typology of errors considered in the error annotation schema we defined as well as some statistical distributions. We designed a three-level schema including: the macro-class of error, i.e. grammatical, orthographic and lexical; the class of error, i.e. the linguistic element involved (e.g. verbs, prepositions, monosyllables); and the corresponding type of modification required to correct the error (e.g. the misuse of verb with respect to the use of verbal tense). We chose to consider these three macro-classes of errors since they correspond to the main areas of linguistic skills required by the report \"Rilevazione degli errori più diffusi nella padronanza della lingua italiana nella prima prova di italiano\" 3 issued by the INVALSI national institute 4 and the Accademia della Crusca in 2012. This three-layered schema is also in line with the one defined by Granger (2003) for the annotation of errors made by second language learners. According to the annotation format defined by Ng et al. (2013) for the \"Shared Task on Grammatical Error Correction\", CItA is annotated as follows: [...] dopo aver fatto le squadre <M t=\"11\" c=\"abbiamo\">avevamo</M> subito iniziato a giocare [...] (once we splitted into teams we have suddenly started playing) where the textual span of error is marked by <M> and </M> (Mistake), the attribute t (type) is the macro-class and class of error (in this is case the error is a grammatical errror and it refers to a misuse of verbal tense), and c (correction) reports the corrected form. Examples of annotation are reported in Table 6 . Inspecting the statistical distribution reported in Table 5 , it can be noted that in both years (Column Total %) orthographic and grammatical errors are the most frequent ones (46.55% and 47.33% respectively) while the lexical errors are far less (about 6%). In particular, the most frequent errors are the orthographic not-classified (Other) ones (22.32%) followed by the erroneous use of verb tenses (11.26%), the grammatical not-classified errors (6.37%) and the erroneous use of prepositions (6.6%). Interestingly enough, the majority of errors (the ones bolded in Table 5 ) has a statistically significant variation over the two years thus showing that several common trends in the development of writing competence occur during the transition from the first to the second year. As far as the frequency distribution (Column Freq.%) and the average occurrence (Column Avg.) per year is concerned, the most frequent errors are the orthographic and grammatical not-classified ones, the erroneous use of verbs, prepositions, articles, pronouns and the redundant use of double consonants. More in particular, the total number of errors decreases over years even if this is not the case for all the classes of errors. The most interesting exception is represented by the erroneous use of verbs and, in particular, by the misuse of verbal tense that increases. This may be due to the different typology of prompts given by teachers. As reported above, in the first year students were mostly asked to respond to narrative prompts that require quite simple linguistic abilities including the use of 'simple' verb moods and tenses to express temporal sequences; while, in the second year students have to write more argumentative essays where more complex linguistic and discourse-structuring competences are required. This can suggest that students in the transition from the first to the second year are requested to use more complex verb forms thus making more errors. Interestingly, the statistical distribution of some typologies of errors is correlated with the student background information we collected. This is the case, for example, of the distribution of lexical errors that correlates with the attitude towards reading: the students who claim to read \"frequently\" make less errors of this type over the two considered years. And, this is also the case e.g. of the grammatical errors that vary significantly with respect to the city area where the schools are located, as Table 7 shows. The average occurrence of this type of errors decreases over the two years in all the schools located the center of Rome and in two of those in suburbs; while, in two of the suburban schools they increase. Surprisingly, the highest number of grammatical errors (on average) is made in a school of the center even though in this school the difference over the years is doubled with respect the other schools. If we compare Table 5 : Error annotation schema. For each year: frequency distribution and number of occurrences (Freq.%), average occurrence per year (Avg), Standard Deviation (SD). The column Tot. % reports the percentage and the number of occurrences of errors in the two years. Errors varying significantly over the two years (i.e. p < 0.05) are bolded. the average occurrences of these errors made by students born in Italy and abroad, we can claim that students born abroad make more errors than their mates in both the first and second year (see Table 8 ). However, the difference over the years varies importantly: during the transition from the first to the second year the students born abroad make significantly less errors; on the contrary, the number of errors made by students born in Italy increases a little bit. This demonstrates two different speed of development: students born abroad start from a lower level of grammatical competence but they improve faster their skills. On the contrary, orthographic errors do not vary significantly with respect to any background information. This provides evidence of linguistic studies claiming that language competence is not related with the orthographic correctness: orthographic skills are learned only over a longer time span (Colombo, 2011; Ferreri, 1971; Lavino, 1975; De Mauro, 1977) . 3. CItA for ... Syntactic features Distribution of dependency types Verbal predicates features (i.e. arity of verbal predicates, percentage of verbal predicates with elliptical subject) Parse tree depth features (i.e. depth of the whole parse tree, average length of dependency links) Subordination features (i.e. distribution of subordinate vs main clauses, relative ordering of subordinates with respect to the main clause, average depth of 'chains' of embedded subordinate clauses) Nominal modification features (i.e. average depth of embedded complement 'chains' governed by a nominal head) Relative ordering of subject and object with respect to the main verbal predicates Table 9 : Linguistic features automatically extracted from the CItA corpus. of text quality change over time according to the development of student writing skills and that these features can be identified by relying on the automatically annotated student essays. In order to test this hypothesis, CItA was morphosyntactically tagged by the POS tagger described in Dell'Orletta (2009) and dependency-parsed by the DeSR parser (Attardi et al., 2009) . The linguistically annotated corpus is further inspected using MONITOR-IT 5 , a tool able to carry out the linguistic profiling of texts following the methodology devised by Dell'Orletta et al. ( 2013 ) that relies on the wide set of linguistic features reported in Table 9 and extracted on the basis of the different levels of automatic linguistic analysis, i.e. tokenization, lemmatization, morpho-syntactic tagging and dependency parsing.  Table 10 : % distribution of morpho-syntactic features varying over the school years (significance: p < 0.05). Table 10 reports an excerpt of the results of the statistical distributions of some morpho-syntactic features. It can be noted that the essays written in the second year contain a lower percentage of conjunctions, pronouns, clitic and per-sonal pronouns, and a higher percentage of prepositions and nouns with respect to the essays of the first year. These statistically significant differences suggest that in the second year students learned to write possibly exploiting the pro-drop potentiality of the Italian language. According to the literature on register variation (Biber, 1993) , they write more informative essays, i.e. characterized by more prepositions and nouns. Note that this can also be influenced by the type of prompt the students are asked to write in the second year, i.e. descriptive and expository (see Table 2 ). CItA is also currently used to investigate whether the linguistic features of student essays are significantly related to the students' background information. Table 11 reports an example of this investigation showing how the lemma occurring in the essays written by students attending schools in the historical center and in suburbs are differently distributed over the years with respect to the De Mauro's usage classification classes. It can be noted that in the first year students attending the suburban schools use a higher percentage of 'fundamental words' (i.e. very frequent and simple words) with respect to their peers attending the schools in the historical center, even if this variation resulted to be not statistically significant. On the contrary, it is significant that in the second year they use a lower percentage of this class of words and a higher percentage of 'high availability' words (i.e. relatively lower frequency words referring to everyday life). This suggests that they learned to write more complex words. The corpus can be also used to develop innovative NLP approaches for use in educational applications that can be used for example in MOOCs (Massive Open Online Courses) such as e.g. automatic error detection and correction systems, automatic essay scoring tools, intelligent tutoring systems or also tools for assisting teachers and test developers. ",
    "abstract": "In this paper, we present the CItA corpus (Corpus Italiano di Apprendenti L1), a collection of essays written by Italian L1 learners collected during the first and second year of lower secondary school. The corpus was built in the framework of an interdisciplinary study jointly carried out by computational linguistics and experimental pedagogists and aimed at tracking the development of written language competence over the years and students' background information.",
    "countries": [
        "Italy"
    ],
    "languages": [
        "Italian",
        "Czech",
        "German",
        "Arabic",
        "Hungarian",
        "Basque"
    ],
    "numcitedby": "8",
    "year": "2016",
    "month": "May",
    "title": "{CI}t{A}: an {L}1 {I}talian Learners Corpus to Study the Development of Writing Competence"
}