{
    "article": "We present OSMAN (Open Source Metric for Measuring Arabic Narratives) -a novel open source Arabic readability metric and tool. It allows researchers to calculate readability for Arabic text with and without diacritics. OSMAN is a modified version of the conventional readability formulas such as Flesch and Fog. In our work we introduce a novel approach towards counting short, long and stress syllables in Arabic which is essential for judging readability of Arabic narratives. We also introduce an additional factor called \"Faseeh\" which considers aspects of script usually dropped in informal Arabic writing. To evaluate our methods we used Spearman's correlation metric to compare text readability for 73,000 parallel sentences from English and Arabic UN documents. The Arabic sentences were written with the absence of diacritics and in order to count the number of syllables we added the diacritics in using an open source tool called Mishkal. The results show that OSMAN readability formula correlates well with the English ones making it a useful tool for researchers and educators working with Arabic text. Introduction and background Readability measures the ease with which a written text can be understood by readers from different educational levels. Early research by Kitson (1921) showed that sentence and word length were best indicators of a text being easy to read. Other factors include number of characters, the count of hard and complex words as well as the number of syllables in each word. Since then several popular readability metrics have been introduced such as Dale-Chall (Dale and Chall, 1948) Fog (Gunning, 1968) and Flesch (Kincaid et al., 1975) . Readability formulas predict reading difficulty associated with text. This helps educators in selecting the appropriate text for their audience. The majority of the current readability formulas work with text written in English (Gunning, 1968; McLaughlin, 1969; Kincaid et al., 1975) by counting the number of syllables in the words. Applying those formulas to other languages is more problematic, especially when syllables are not easy to count. For other languages such as Arabic the only current solution is to use language independent metrics such as Laesbarheds-Index (Lix) (Björnsson, 1968) and Automated Readability Index (ARI) (Smith et al., 1967) . These metrics are restricted to other factors such as number of words and sentences in addition to the number of long words 1 but do not consider any language specific factors. Arabic is highly inflectional and derivational, therefore word length and number of sentences cannot be used as the only indicators of text readability (Al-Ajlan et al., 2008) . Previous work on Arabic readability and Natural Language Processing has suggested the removal of diacritics to simplify the language processing but this results in missing vital information about the syllables leading to pronunciation ambiguity (Habash et al., 2007) . Pronunciation in the absence of diacritics could be challenging even for native Arabic speakers and in particular problematic in proper names and other words associated with locations. For example, the Arabic name \" \" is mostly associated with the mas-1 Words with more than five letters. culine name \"Hasan\" even though the name could be feminine by changing the pronunciation to \"Husn\". This can be easily inferred having the diacritics added to the word as in \" \" and \" \" respectively. Similarly the common confusion between \"Amman\" the capital of Jordan and the country \"Oman\", both in Arabic have the exact spelling but can be identified with diacritics added in as in \" \" [Amman] and \" \" [Oman] . The remainder of the paper is organised as follows. We review related work in section 2. and summarise the main features of Arabic script in section 3. which further motivates the requirement for a new readability measure for Arabic. In section 4., the multilingual United Nations corpus is described, from which we selected our data for the experiment. Our novel Arabic readability metric and a comparison with factors used in other readability metrics is presented in section 5. The evaluation results and discussion appear in section 6. Section 7. concludes. Related Work There has been a growing interest in Arabic language processing and translation, but despite this increasing interest only a few researchers have tackled the problem of finding a proper Arabic readability index. Al-Rashidi (2005) experiments on the readability of 4th grade school books in Kuwait showed low readability scores falling in what they called \"the depression level of readability\". They also found that the texts in the Arabic language textbook are not graded according to level. There was no difference between female and male students in terms of the readability level with all the participants agreeing on the difficulty of the textbook material. The experiments found that Arabic textbooks taught for 4th grade students were unsuitable for their age showing the need to adopt readability as an indicator when preparing textbooks. The study was conducted with 632 students from 26 classes in a number of schools from different areas in Kuwait by asking the students to read parts of the textbooks and manually score their readability level. Earlier research by Al-Heeti (1984) examined readability by only looking into the average word length. Al-Heeti's 2 formula calculates as: Heeti = (AW L × 4.414) − 13.468 Although appealingly simple, the formula does not work as a good indicator of Arabic text readability, especially given that Arabic is a highly inflectional and derivational language and word length by itself does not reflect difficulty. Schwarm and Ostendorf (2005) used a statistical language model to train SVM classifiers in order to classify text for different grade levels building a classifier with a variable precision of 38% to 75% that is dependent on the grade level. Similarly, Ajlan et. al (2008) research on Arabic readability used word length along with numbers of characters and sentences and compared their method to other language independent measures such as ARI and LIX. 3 Ajlan presented ARABILITY, an Arabic Readability tool, using machine learning. In their work they stripped out diacritics and counted the number of syllables by estimating the number of vowels in the documents divided by the total number of words. Their estimation does not work as expected here since counting the number of syllables in a language like Arabic is dependent on the presence of diacritics. Al-Tamimi et. al (2013) introduced AARI, an automatic readability index for Arabic. In their work they extracted seven features which they used to calculate readability, including the number of characters, words, sentences and difficult words. 4 Since AARI does not include the use of any Arabic specific characteristics this makes the method close in function to the original ARI formula, where the number of characters and average word count plays a crucial role in the output score. In previous work (El-Haj et al., 2014b) we tested whether language independent readability scores correctly preserve the variation in style and complexity in the original text when translating into other languages at various document levels including chapters and parts. We hypothesised that the readability scores for each block of text in the original and translated versions should be similarly ranked if the translation quality is good. In this paper we adopt the same hypothesis in determining whether our Arabic readability metrics correlate well with the English metrics. We base our hypothesis on the fact that the Arabic translation of the UN English resolutions is of high quality being translated by UN language professionals. 5 We hypothesise the Arabic readability scores should correlate well with the English ones when no language dependent factors are being considered and lower otherwise. In our paper, we use additional features to improve on the previous work on Arabic readability by counting the number of Arabic syllables in the text. In contrast to Al-Tamimi et. al (2013) we include diacritics in order to correctly count the number of syllables in a word. We used Mishkal 6 , an open source tool to add diacritics to Arabic text with an accuracy over 85% (Azmi and Almajed, 2013; Bahanshal and Al-Khalifa, 2012) , and evaluated our new metric by correlating the readability of high quality translations in a parallel English-Arabic corpus. Arabic Script To measure readability of Arabic text one needs to understand the characteristics of the Arabic script. Arabic vocabulary is very rich with a high frequency of heteronyms. 7  For example the word \" \" could be used to mean both \"gold\" and \"gone\" depending on the context it was used in. Ambiguity to this level can be unraveled through the use of \"Tashkil\" [forming], which is the process of adding diacritics to written text. Diacritics in Arabic are used as a phonetic guide, especially for non-native speakers. Adding diacritics to the previous example will result in \" \" [Dhahab] and \" \" [Dhahaba] to mean \"gold\" and \"gone\" respectively. Diacritics were formed as a method to transcribe correct reading and they are directly associated with syllables. Counting syllables in Arabic is not a straightforward process as it is not affiliated with certain vowels as in English (e.g. 'a', 'e', 'i', 'o' and 'u'). There are eight diacritics in Arabic with only four associated with vowels: \"damma\", \"fatHa\", \"kasrah\" and \"shadda\". The sounds of the first three diacritics can be doubled resulting in a 'aN' sound at the end of the word (e.g. \" \", [AhlaN wa sahlaN], \"welcome\"]), in Arabic this is called \"Tanween\". Arabic syllables are divided into two types, long and short. Short syllables are simply a single consonant followed by a single short vowel (e.g. \" \" [ka-ta-ba], \"he wrote\"). A long syllable usually is a consonant plus a long vowel (e.g. \" \" [ki-taab], \"book\") the example shows a short syllable followed by a long one. Stress syllables are those considered as double letters, indicating a double consonants with no vowel in between (e.g. \" , [shaDDaDa], \"he stressed\"). In our work we count short, long and stressed syllables. Diacritics are, most of the time, omitted from the Arabic text, which makes it hard to infer the word's meaning and therefore, it requires complex morphological rules to tokenise and parse the text (El-Haj et al., 2014a) . In order to correctly calculate Arabic readability we need to count the number of syllables. An Arabic word could contain more than three syllables and still be considered a non-complex word (Al-Ajlan and Al-Khalifa, 2010). To illustrate this we analysed two million Arabic words and found the average word length and syllable count to be five and four respectively. When counting the syllables we only considered the 4 diacritics in Figure 1 in addition to the Tanween. We did not consider the diacritics when calculating word length. and ' '. In some cases ' ', and ' ' are mistakenly replaced by ' ', and ' ' with the latter being more common. Arabic scholar Al-Khawlani 9 mentioned ninety-three words in Arabic that contain the letter ' ' with 32 of them are still common nowadays. Words ending with ' ' or ' ' refer to masculine verbs and nouns, one common error is usually forgetting to add alif ' ' at the end of a word ending with ' ' or using ' ' instead of ' '. Throughout the paper we refer to those misspelled letters as \"Faseeh\". Misspelling those letters could result in prosaic Arabic \"Rakeek\" -weak pronunciation -and therefore affect text readability. Dataset and method In our experiment, we used 73,000 parallel English and Arabic paragraphs from the United Nations (UN) corpus 10 -a collection of resolutions of the General Assembly from Volume I of GA regular sessions 55-62 (Rafalovitch and   8 Hamza is a letter in the Arabic alphabet, representing the glottal stop [P] . Hamza is not one of the 28 Arabic alphabet. 9 Abi Al-Hasan Ali bin Muhammed Alkhawlani (also know as Alhaddad Almuhdawi). 10 http://www.uncorpora.org/  The Arabic text by the UN has been written with the absence of diacritics. We used Mishkal 11 to add diacritics to the Arabic text. Each language has around 3 million words from more than 2,000 documents with each document containing 36 paragraphs on average. 12 The dataset was originally in TMX 13 file format. We parsed the files and extracted the parallel information and added identifiers to make distinguishing the files a much easier process. The identifiers include document (docID), sentence (sen-tID) and language (lang), which we used in the publicly available version. 14 Each file follows the following naming patters [docID_sent.lang] (e.g. 1_3.ar). 15 Figure 3 shows a sample of the parallel dataset. Parallel paragraphs share the same docID and sentID across languages. English: \"Conscious of the benefits of confidence-and securitybuilding measures in the military field,\" Arabic (no diacritics) \" ‫وإدراكا‬ ‫منها‬ ‫لفوائد‬ ‫تدابير‬ ‫بناء‬ ‫الثقة‬ ‫واألمن‬ ‫في‬ ‫الميدان‬ ‫العسكري،‬ \" Arabic )with diacritics( \" ‫َا‬ ‫اك‬ ‫رَ‬ ‫دْ‬ ِ ‫إ‬ ‫وَ‬ ‫َا‬ ‫ه‬ ْ ‫ِن‬ ‫م‬ ِ ‫ِد‬ ‫ائ‬ ‫وَ‬ َ ‫ِف‬ ‫ل‬ ِ ‫ير‬ ِ ‫اب‬ ‫َدَ‬ ‫ت‬ ‫اءِ‬ َ ‫ن‬ ِ ‫ب‬ ِ ‫َة‬ ‫ق‬ ِّ ‫الث‬ ‫نَ‬ ‫مْ‬ َ ْ ‫األ‬ ‫وَ‬ ‫ِي‬ ‫ف‬ ِ ‫ان‬ ‫ْدَ‬ ‫َي‬ ‫م‬ ْ ‫ال‬ ِ ‫ي‬ ِ ‫َر‬ ‫ك‬ ‫سْ‬ ‫عَ‬ ْ ‫ال‬ ، \" Readability Metrics and Methodology In order to evaluate our work we used several readability metrics in addition to our new Arabic readability score -OSMAN. The readability metrics used in our experiments 11 http://sourceforge.net/projects/mishkal/ 12 The resulting dataset as parallel documents and sentences can be downloaded directly from http://drelhaj.github.io/OsmanReadability/. 13 Translation Memory eXchange are Laesbarheds-Index (LIX) (Björnsson, 1968), Automated Readability Index (ARI) (Smith et al., 1967) , Flesch Reading Ease and Flesch-Kincaid Grade Level (Kincaid et al., 1975), and Gunning Fog (Gunning, 1968) . We modified the formulas to work properly for Arabic by counting words using the Stanford Arabic tokenizer. 16 Here, we do not report results from Flesch-grades (Kincaid) or Fog as these formulas are close to Flesch, we still include details on the formulas as they are presented in the open source code. The readability metrics formulas are as follows: LIX = A B + C × 100 A F og = 0.4 × A B + 100 G A ARI = 4.71 × E A + 0.50 × A B − 21.43 F lesch = 206.835 − 1.015 × A B − 84.6 × D A F leschg = 0.39 × A B + 11.8 × D A − 15.59 Starting with the UN parallel corpus (see Section 4.). We stripped out any empty sentences and sentences with less than three characters. We then replicated the Arabic sentences by adding in diacritics using Mishkal which was trained using the Tashkeela corpus which consists of more than 6 million diacriticised words from a large variety of Arabic textbooks. 17 We calculated readability for the English text using the conventional readability metrics. For the Arabic text, we calculated readability using the same formulas by adapting them to Arabic using the Arabic Stanford tokenizer to count words. We used the diacritics to count syllables. For both versions of the Arabic text we calculated readability using our OSMAN readability formula below which is an updated version of the Flesch formula. Osman = 200.791 − 1.015 × A B − 24.181 × C A + D A + G A + H A where 'A' is the total number of words counted using Stanford Arabic word tokenizer 18 , 'B' is the total number of sentences counted automatically using common delimiters to split text into sentences 19 , 'C' is the number of hard words (words with more than 5 letters -long words); the word length was counted with the absence of diacritics in order to avoid counting the diacritics as letters, 'D' is the number of syllables in a word, 'E' is the total number of characters ignoring digits, 'G' is the number of complex words in Arabic (words with more than four syllables as measured by our analysis), 'H' is the number of \"Faseeh\" words (complex word with any of the following Arabic letters (' ', ' ', ', ' ', ' ' ) or ending with (' ', ' '). As these letters could appear frequently we only consider counting Faseeh in complex words, which indicates a higher level of readability. In the formula we count Faseeh by considering the number of complex words containing at least one Faseeh indicator. The OSMAN formula has been set up to work with plain and diacriticised Arabic text. We use the same formula for both versions, the absence of syllables and complex words in the nondiacriticised text results in higher OSMAN score, which erroneously indicates the text is easier to read, therefore we recommend using diacriticised text or Mishkal to add diacritics to a text before calculating OSMAN score. In order to match the expected distributions across the English and Arabic readability metrics we started by calculating readability for each of the English and Arabic documents in our sample using Flesch with its original arithmetic factors (206.835 and 84.6) but using additional linguistic factors for the Arabic version of the formula as described above. Figure 4 shows sample sentences from a variety of other texts and their OSMAN score, in order to show the range of scores obtained. (1) - -------------------------------- -------------------------------- Taking the UN English documents and Flesch results as goldstandards our aim was to make the distribution of the Arabic texts' (with diacritics) readability scores match the distribution of the English documents' scores. Flesch scores indicate UN text to be best understood by university graduates. We tuned the factors in the OSMAN formula to generates scores between 0 and 100 but as with Flesch the scores can be negative or greater than 100. Using the R statistical package we calculated the density distribution of the resulting readability metrics. Figure 5 shows the distribution of the readability metrics before tuning the arithmetic factors. To reduce the gap between the distributions we calculated the median for the readability scores for each set of documents then updated the Arabic formula by reducing the arithmetic factor by the difference between the Arabic (with and without diacritics) and the English scores median. Recalculating OSMAN readability with the new arithmetic factors resulted in a closer distribution as shown in Figure 6 , and this tuned version is the one presented above. As expected, calculating OSMAN for non-diacriticised text results in higher scores due to syllables and complex words counts being zero. We can therefore conclude that including diacritics helps to reflect the actual ease of reading of Arabic text. - Sentence from children book َ ‫ذ‬ َ ‫ه‬ َ ‫ب‬ َ ‫ْد‬ ‫ِن‬ ‫ه‬ َ ‫د‬ ‫م‬ ‫حْ‬ ‫أ‬ ‫و‬ ‫الى‬ َ ‫ة‬ ‫س‬ ‫ْر‬ ‫د‬ ‫م‬ ْ ‫ال‬ . َ ‫ْد‬ ‫ِن‬ ‫ه‬ َ ‫ب‬ ‫حِ‬ ‫ت‬ َ ‫ْم‬ ‫س‬ ‫الرَّ‬ َ ‫ة‬ ‫ع‬ ‫ال‬ ‫ط‬ ‫م‬ ْ ‫ال‬ ‫و‬ Osman Score: 97.617 (2) - - Sentence from sports news َ ‫ك‬ َ ‫ش‬ َ ‫ف‬ ‫تَْ‬ َ ‫ة‬ ‫اس‬ ‫ِر‬ ‫د‬ ‫ا‬ ‫ِه‬ ‫ت‬ ‫ر‬ ‫جْ‬ ‫أ‬ ‫ي‬ ِ ‫ب‬ ‫ي‬ ِ ‫ب‬ ‫ي‬ ‫سِ‬ ‫نََّ‬ ِ ‫إ‬ َ ‫ة‬ ‫ِف‬ ‫ْل‬ ‫ك‬ ‫ت‬ َ ‫اه‬ ‫ش‬ ‫م‬ َ ِ ‫ة‬ ‫د‬ َ ِ ‫ات‬ ‫ِي‬ ‫ا‬ ‫ار‬ ‫ب‬ ‫م‬ َ ِ ‫ة‬ ‫ر‬ ‫ك‬ ‫مَِ‬ ‫د‬ ‫ق‬ ْ ‫ال‬ ‫ِي‬ ‫ف‬ ‫ِيا‬ ‫يطان‬ ِ ‫بر‬ َ ِ ‫ت‬ ‫ضْ‬ ‫ف‬ ‫ْخ‬ ‫ِن‬ ‫ا‬ ‫وَْ‬ ‫أ‬ ‫تَْ‬ َّ ‫ل‬ ‫ظ‬ ‫ى‬ ‫ل‬ ‫ع‬ ‫ا‬ ‫م‬ ‫ِي‬ ‫ه‬ ‫يه‬ ‫ل‬ ‫ع‬ َ ِ ‫َّة‬ ‫ي‬ ِ ‫ِب‬ ‫ال‬ ‫ِغ‬ ‫ل‬ ‫ي‬ ‫عِ‬ ‫جِّ‬ ‫ش‬ ‫م‬ َ ِ ‫ة‬ ‫ب‬ ‫عْ‬ ‫الل‬ . Osman Score: 72.887 (3) ---------------------------------- Sentence from university science book ‫نََّ‬ ‫أ‬ ‫و‬ َ ‫ِين‬ ‫ام‬ ‫ض‬ ‫م‬ َ ِ ‫ِج‬ ‫اذ‬ ‫َّم‬ ‫الن‬ َ ِ ‫َّة‬ ‫ي‬ ‫ياضِ‬ ‫الرِّ‬ ‫ِي‬ ‫ف‬ َ ‫ي‬ ‫أ‬ َ ‫م‬ ْ ‫ل‬ ‫عِ‬ َ ‫ِن‬ ‫م‬ ‫ومَِ‬ ‫ل‬ ‫ع‬ ْ ‫ال‬ َ ِ ‫َّة‬ ‫ي‬ ‫ِيعِ‬ ‫ب‬ َّ ‫الط‬ َ ‫ل‬ ‫لَْ‬ ‫خَّ‬ ‫د‬ ‫ت‬ ‫ي‬ ‫ِي‬ ‫ف‬ ‫ا‬ ‫ِه‬ ‫ن‬ ْ ‫أ‬ ‫ش‬ ‫مَِ‬ ْ ‫ل‬ ‫عِ‬ ‫ياضَِ‬ ‫الرِّ‬ َ ِ ‫َّات‬ ‫ي‬ ، َ ‫ة‬ ‫ل‬ ‫اد‬ ‫ع‬ ‫م‬ ْ ‫ال‬ ‫ف‬ َ ‫ة‬ ‫ائي‬ ‫ي‬ ِ ‫ِيز‬ ‫ف‬ ْ ‫ال‬ َ ‫َّة‬ ‫ي‬ ‫ياضِ‬ ‫الرِّ‬ ‫ِي‬ ‫ه‬ َ ‫ة‬ ‫غ‬ ‫ل‬ Osman Score: 33.372 Evaluation Results and Discussion To evaluate our new metric further, we compared the readability scores for the UN corpus Arabic paragraphs with and without diacritics to the parallel English paragraphs. We calculated readability metrics for the Arabic and English text using the readability measures mentioned earlier aside from OSMAN score for the English text. To test the similarity of the readability scores between English and Arabic and between diacriticised and non-diacriticised Arabic text we used Spearman's Rank Correlation Coefficient. Our assumption is that parallel translations should preserve the readability scores, or at least the same rank ordering of scores for the paragraphs. For this purpose we used language independent readability methods. The results confirm our expectations with the language-independent metrics (ARI and LIX) appearing to be fairly consistent between the English and Arabic translations (scores of 0.764 and 0.548 respectively). The correlation scores drop when linguistic factors are part of the formula. This can be observed by considering the Flesch scores in particular where there is lower correlation between Arabic and English (0.439) and for English compared with the Arabic diacriticised version (0.221). The Flesch formula applied to the Arabic text will not produce accurate results since the syllables count will always be zero, thus giving a higher Flesch score and therefore erroneously indicating the text is easy to read, which is not the case with the UN data. Spearman's scores showed very low correlation between OSMAN scores of the two Arabic versions (0.035) which indicates the importance of the presence of diacritics, which plays a vital role in determining the text ease of reading. On the other hand the OS-MAN scores (0.329) for the diacriticised Arabic showed a higher positive correlation with the English Flesch scores. This was noticed when measuring the Flesch score difference between the two Arabic texts. We found the diacriticised text to score lower (harder to read) when there are more syllables. This is not surprising as the UN resolution data are of high quality of translation and strict adherence to editorial conventions (Rafalovitch and Dale, 2009) . We measured mean and standard deviation of each metric on each version of the corpus. We would expect that good measures should show the same variability, and for the UN corpus which is fairly homogeneous and that this variability should be quite low. Here again, our OSMAN measure performs consistently on the diacriticised Arabic (mean: 25.89 and stdev: 9.08) with the Flesch on English (mean: 27.26 and stdev: 8.63). The non-diacriticised Arabic mean (88.49) shows how the absence of diacritics (thus syllables and complex words) resulting in inaccurate scores indicating the text to be easy to read in contrast to both Flesch and OSMAN with diacritics. We observe again that the language independent measures (ARI and LIX) are not able to make this distinction. In terms of a complementary qualitative evaluation, we asked two groups of native Arabic and English speakers (five speakers per language) to read and manually score ten documents on a five point Likert scale. We measured the correlation between the human scores and the scores by OSMAN and Flesch. The scores show high correlation between human and OSMAN scores for the diacriticised Arabic text, which confirms our finding that diacritics are important to determine the text readability. The results also show slightly lower scores for the English text but low correlation between human and OSMAN scores for the non-diacriticised text. Figure 7 shows the scores by the human participants compared to OSMAN for the diacriticised Arabic text confirming with our previous findings on the absence of diacritics. Conclusion The paper describes a novel approach for calculating the readability of Arabic text and compares results for text with and without diacritics. The open source Java tool allows users to calculate readability for Arabic text. The tool provides methods to split the text into words and sentences, count syllables, Faseeh letters, hard and complex words in addition to adding and removing diacritics. This makes the tool useful for researchers and educators working with Arabic text. To evaluate the results we used correlation rank and calculated the mean and standard deviation for readability of English and Arabic parallel translations. Spearman's scores showed very low correlation between OSMAN scores of the two Arabic versions which indicates the importance of the presence of diacritics, which plays a vital role in determining the text ease of reading. On the other hand the OSMAN scores for the diacriticised Arabic showed a higher positive correlation with the English Flesch scores. All the readability metrics mentioned earlier are included within the open source code, they all work with diacriticised and non-diacriticised text but based on the results presented here we recommend adding the diacritics in by using the addTashkeel() method. The tool and dataset have been made publicly available for research purposes. 20   Al-Ajlan, A. and Al-Khalifa, H. (2010) Habash, N., Soudi, A., and Buckwalter, T. (2007) . On Arabic Transliteration, volume 38 of Text, Speech and Language Technology. Springer Netherlands. Kincaid, J., Fishburne, R., Rogers, R., and Chissom, B. (1975) . Derivation of new readability formulas (automated readability index fog count and flesch reading ease formula) for navy enlisted personnel. In Research Branch Rep, pages 8-75, Memphis, TN. Kitson, H. (1921) . The Mind of the Buyer: A Psychology of Selling. Macmillan. McLaughlin, H. (1969) . SMOG grading -a new readability formula. Journal of Reading, pages 639-646, May.",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 0.0,
        "foundation": 4.320199066265573e-07,
        "none": 0.9971987014796481
    },
    "reasoning": "Reasoning: The article does not provide any specific information regarding funding sources for the research. Therefore, without explicit mention of support from defense, corporate entities, research agencies, foundations, or an indication of no funding, it is not possible to accurately determine the funding sources based on the provided text.",
    "abstract": "We present OSMAN (Open Source Metric for Measuring Arabic Narratives) -a novel open source Arabic readability metric and tool. It allows researchers to calculate readability for Arabic text with and without diacritics. OSMAN is a modified version of the conventional readability formulas such as Flesch and Fog. In our work we introduce a novel approach towards counting short, long and stress syllables in Arabic which is essential for judging readability of Arabic narratives. We also introduce an additional factor called \"Faseeh\" which considers aspects of script usually dropped in informal Arabic writing. To evaluate our methods we used Spearman's correlation metric to compare text readability for 73,000 parallel sentences from English and Arabic UN documents. The Arabic sentences were written with the absence of diacritics and in order to count the number of syllables we added the diacritics in using an open source tool called Mishkal. The results show that OSMAN readability formula correlates well with the English ones making it a useful tool for researchers and educators working with Arabic text.",
    "countries": [
        "United Kingdom"
    ],
    "languages": [
        "Arabic",
        "English"
    ],
    "numcitedby": 17,
    "year": 2016,
    "month": "May",
    "title": "{OSMAN} ― A Novel {A}rabic Readability Metric",
    "values": {
        "building on past work": "We base our hypothesis on the fact that the Arabic translation of the UN English resolutions is of high quality being translated by UN language professionals. In our paper, we use additional features to improve on the previous work on Arabic readability by counting the number of Arabic syllables in the text. In contrast to Al-Tamimi et. al (2013) we include diacritics in order to correctly count the number of syllables in a word.",
        "novelty": "We present OSMAN (Open Source Metric for Measuring Arabic Narratives) -a novel open source Arabic readability metric and tool. In our work we introduce a novel approach towards counting short, long and stress syllables in Arabic which is essential for judging readability of Arabic narratives. We also introduce an additional factor called \"Faseeh\" which considers aspects of script usually dropped in informal Arabic writing."
    }
}