{
    "article": "The BAS CLARIN speech data repository is introduced. At the current state it comprises 31 pre-dominantly German corpora of spoken language. It is compliant to the CLARIN-D as well as the OLAC requirements. This enables its embedding into several infrastructures. We give an overview over its structure, its implementation as well as the corpora it contains. Introduction The BAS CLARIN speech data repository (BAS, 2016a; Reichel, 2013) is maintained by the Bavarian Archive for Speech Signals (BAS, 2016c) in the context of the CLARIN-D project (CLARIN, 2016b) . It is located at the Institute of Phonetics and Speech Processing, Ludwig-Maximilian-University in Munich, Germany. At its current state (March 2016) it comprises 31 pre-dominantly German corpora of spoken language summing up to 2.62 TB of signal and annotation files, and 16.6 GB of metadata. 29 of these corpora are freely available for academic research. The repository is compliant to the CLARIN-D as well as the OLAC requirements, so that it can be harvested by several infrastructures such as the Virtual language observatory (VLO, 2015; Goosen and Eckart, 2014) and the Open Language Archives Community (OLAC, 2011) . Figures 1 and  2 show the repository's and a corpus' landing page, respectively. This paper describes the structure of this repository, its main features, and gives an overview over the provided corpora. Figure 1 : The repository's landing page. Repository structure and main features 2.1. Structure The repository is based on a file system and is hierarchically structured into corpus, recording session and primary data items. Each corpus contains one or more recording sessions, and each session comprises primary data, i.e. signal and annotation files. The repository is divided into a freely accessible and a protected part. The protected part contains the primary resources, whereas the metadata is freely accessible. In compliance with the CLARIN-D requirements the BAS repository adheres to standardized file formats, provides metadata, supports persistent data storage and versioning, and requires user authentication for its protected part. Metadata Each corpus and each recording session is described by a CMDI metadata record (CLARIN, 2016d) that is dynamically rendered to a landing page for this item to be accessed by the users. Next to CMDI also Dublin Core and OLAC format (DC, 2016; OLAC, 2011) are supported. The metadata can be harvested via an OAI-PMH endpoint (BAS, 2016b). Persistence The BAS Repository supports a persistent storage of the contained data: each version of a repository item is permanently stored without changes. Primary data is stored together with its MD5 checksum (Rivest, 1992 ) so that consistency can be regularly checked. Furthermore, each version of a corpus and of a session is assigned an ePIC Handle persistent Identifier (PID) (ePIC, 2016) , by which its landing page is durably accessible via the handle system. The repository is constantly backed-up by the Leibniz Rechenzentrum, Garching (LRZ, 2016) via the IBM Tivoli system. Versioning The insertion, editing or removal of a signal or annotation file leads to a new version of this file as well as transitively of the recording session and thus of the corpus it is part of. New versions of a session and a corpus each are assigned a new PID, by which they can be addressed uniquely. For each version of an item the versions of the super-ordinate items are stored by means of is-part-of relations. Repository internally all versions of a repository item are bundled by a unique repository ID. User authentication The protected primary data part of the repository can only be accessed by members of academic institutions after Shibboleth authentication (Shibboleth, 2016) . The user can log in via her/his institution, provided that it is part of the CLARIN Service Provider Federation (SPF) (CLARIN, 2016c), which consists of a growing number of national Identity Federations (e.g. the DFN-AAI for Germany (DFN-AAI, 2010) or SURFconext for the Netherlands (SURFconext, 2016) ). If the user's entitlement is classified as 'academic', access to the protected part of the repository is granted. If the academic institution has not joined any national federation, that is part of the SPF, the user can apply for a CLARIN-D account to get repository data access. For non-academic users access can be enabled for selected corpora after having obtained a BAS user license. Figure 2 : A corpus landing page. Cross-corpora metadata and federated content search The user can collect recording sessions across corpora depending on the respective research question related to metadata such as modality, speaker sex or mother tongue. After successful authentication the collection can be downloaded as a zipped archive. The back-end of this search engine is implemented as an SQLite database which is also used by the SRU endpoint (BAS, 2015) for federated content search (CLARIN, 2016a) . The latter allows users to search CLARIN corpora world-wide across different centers. The search engine's front-end and an example search result are shown in Figures 3 and 4 , respectively. Accessing primary and metadata All corpora and sessions can be accessed via their landing pages and as mentioned in section 2.3. by the PID of the respective repository item. To give an example, the landing page of session 1006 of the corpus ALC is accessible by its PID as follows: http://hdl.handle.net/11858/00-1779-0000-0006-BDA2-3 Next to a short description this landing page provides the link to the item's metadata. For an automatized processing the metadata can be accessed directly by two methods: • by using a part identifier @format=cmdi, as in http://hdl.handle.net/11858/00-1779-0000-0006-BDA2-3@format=cmdi • by means of content negotiation. In this case on the client's side the Accept Header has to be set to 'application/x-cmdi+xml'. After successful authentication the links to the primary data items are shown on the landing page as well, and a direct access via the part identifier @partId is enabled. The values of this identifier are given by the Resource Proxy IDs in the CMDI metadata. To give an example: http://hdl.handle.net/11858/00-1779-0000-0006-BDA2-3@partId=m 0000000001 directs the user to an annotation file referenced by the ID m 0000000001 in the CMDI metadata file. Furthermore, the authorized user is enabled to download the corpora or single sessions as zipped archives, as is shown in Figure 2 . Corpus Ingest The fully automatized ingest of a new corpus into the BAS repository consists of the following steps: 1. CMDI files are validated and compared with a repository content table in order to find out whether new data is ingested or already stored data is updated. 2. For all new or updated sessions and transitively for the corpus PIDs are retrieved from the GWDG PID Handle Service (GWDG, 2009) . Each version of a corpus and a session thus receives its own unique identifier. 3. CMDI files are copied to the public space and adjusted. Resources are copied to the protected area. For regular consistency checks and for versioning checksums are calculated. 4. The search database and the OAI-PMH interface are updated. Software A FORMTASK FORMTASK is a German telephone speech database of prompted descriptions of typical forms found in everyday life (e.g. public transport tickets, money transfer form). HEMPEL HEMPEL is a collection of more than 3900 spontaneous speech items recorded as extra material during the German SpeechDat-II project. Speakers were asked to report what they had been doing during the last hour. A more detailed description can be found in Draxler and Schiel (2002) . HOESI -Siemens Hoergeraete Corpus This corpus contains spontaneous speech dialogs in German. Each pair of dialog partners is recorded conversing under real-noise conditions (in a noisy cafeteria and in a car going at different velocities), as well as in a studio at various levels of Lombard noise played directly into the subjects' ears. PD2 -PhonDat 2 The corpus contains German read speech recordings of 16 speakers in from a train query task. They were recorded at three different sites in Germany (Kiel, Bonn, and Munich). PHATTSESSIONZ -Ph@ttsessionz Adolescents Speech Corpus This speech database contains recordings of 1019 adolescent speakers of German (age range 12-20). The recordings were performed via the WWW in public secondary schools (Gymnasium) in 45 locations in Germany. RVG-1 CLARIN -Regional Variants of German 1 The corpus is a collection of more than 500 speakers of different dialect regions of Germany. It contains read and spontaneous speech recorded by four different low-and high-quality microphones in normal office environments. RVG-J -Regional Variants of German J -Juveniles The corpus contains read and non-scripted German utterances by adolescent speakers between 13 and 20 years of age recruited in public schools in or near Munich. SaGA Acknowledgments We thank the European CLARIN ERIC and the German CLARIN-D consortium funded by the German Ministry of Science and Education for establishing the infrastructure. The current work of the first author is funded by the Alexander von Humboldt society."
}