{
    "article": "We report here empirical results of a series of studies aimed at automatically predicting information quality in news documents. Multiple research methods and data analysis techniques enabled a good level of machine prediction of information quality. Procedures regarding user experiments and statistical analysis are described. Introduction As a part of a large-scale multi-institutional project HITIQA (High-quality Interactive Question Answering), we worked on developing an extended model for classifying information by quality, in addition to, and as an extension of the traditional notion of relevance. The project involves Computer and Information Science researchers from University at Albany and Rutgers University. Our serving clientele are intelligent analysts, and the documents that we targeted were news articles. Research Approach The term \"Quality\" is defined by International Organization of Standards (1986) as \"the totality of characteristics of an entity that bear on its ability to satisfy stated and implied need\" (Standard 8402, 3.1). Among numerous study on classification of information quality, Wang and Strong (1996) proposed four dimensions of qualities as detailed in Strong, Lee, Wang, 1997, p.39) Empirical attempts to assess quality have primarily focused on counting hyperlinks in a networked environment. Representative studies include the work by Amento and his colleagues (Amento, Terveen, & Hills, 2000) , Price and Hersh (1999) , and Zhu and Gauch (2000) . However, as a whole, previous studies were only able to produce algorithmic measures for Web documents based on link counts and with a limited number of quality aspects such as popularity. Our approach is to record actual users' quality assessments of news articles and conduct advanced statistical models of association between users' quality scoring and occurrence and prevalence of certain textual features. Methodology and Results Multiple research methods were used. Firstly, we conducted focus-group sessions to elicit key quality aspects from news analysts. Secondly, we performed experts and students quality judgment experimental sessions. Thirdly, we identified a set of textual features, ran programs to generate counts of the features, and performed statistical analysis to establish the correlation between features and users' quality ratings. Two focus group sessions were conducted during March and April of 2002. Participants included journalism faculty members, professional editors, and a number of journalists from a local newspaper Albany Times Union. Nine information quality criteria were considered to be salient to the context of news analysis: Accuracy, Source reliability, Objectivity, Depth, Author credibility, Readability, Conciseness, Grammatically Correctness, and Multiple Viewpoints. A computerized quality judgment system that incorporated the nine quality aspects was developed. One thousand medium-sized (100 to 2500 words) news articles were selected from the TREC collection (Voorhees, 2001) with 25 relevant documents each from five TREC Q&A topics. We recruited expert and student participants for judgment experiments. Expert sessions were performed first and ten documents judged by experts were selected and used as the training and testing material for the student participants. The entire judgment experiment period ran from May to August of 2002. As a result, each of the 1,000 documents was rated twice, by two different judges, one at Albany, and one at Rutgers. There were high inter-judge agreements between Albany and Rutgers. Figure 1 is the normality plot of the difference between scores assigned by Rutgers' judges and Albany's judges on the variable of \"accuracy,\" with a mean almost equals to zero (with range from -9 to + 9). The curves of the other eight quality variables are similar to the one below, indicating a very insignificant disagreement in judgments. Principle component analysis (PCA) revealed the same two components from Albany data as from Rutgers data. As shown in Figure 2 , one component (the lower one) consists of \"credibility\", \"source reliability\", \"accuracy\", \"multi-view\", \"depth\", and \"objectivity.\" The second component (the upper one) consists of \"grammar\", \"readability\", and \"verbose and conciseness\". Together they explain 58% of the variance. We recoded users' scores 1 to 5 as low and scores 6 to 10 as high. We split the 1,000 documents into two halves by random selection. In our training round the first half was used to estimate the parameters that would give best discriminant and logistic regression functions. In our testing round, we applied the functions to the other half to predict the quality criteria of the documents. We then employed stepwise discriminant analysis to select the dominant predictive variables from a range of 104 textual features. These features included elements of punctuations, special symbols, length of document segments, upper case, quotations, key terms, POS, and entities. Our further analysis suggested that certain text features are highly correlated with each of the nine aspects. Discriminant Summary In this study, we were able to identify important quality criteria relevant to intelligent analysts' work and we were also able to generate automatic quality metrics of news documents using users' quality judgments. Our next step is to apply our machine prediction method to produce measures of a new set of documents and have users to verify and modify machines' scoring. We hope that through this, we can collect new data to test our quality metrics and to further improve its' performance. Acknowledgement",
    "abstract": "We report here empirical results of a series of studies aimed at automatically predicting information quality in news documents. Multiple research methods and data analysis techniques enabled a good level of machine prediction of information quality. Procedures regarding user experiments and statistical analysis are described.",
    "countries": [
        "United States"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "17",
    "year": "2003",
    "month": "",
    "title": "Automatically Predicting Information Quality in News Documents"
}