{
    "article": "We propose a new document vector representation specifically designed for the document clustering task. Instead of the traditional termbased vectors, a document is represented as an -dimensional vector, where is the number of documents in the cluster. The value at each dimension of the vector is closely related to the generation probability based on the language model of the corresponding document. Inspired by the recent graph-based NLP methods, we reinforce the generation probabilities by iterating random walks on the underlying graph representation. Experiments with k-means and hierarchical clustering algorithms show significant improvements over the alternative ¡¢ £¤¥¢ vector representation. Introduction Document clustering is one of the oldest and most studied problems of information retrieval (van Rijsbergen, 1979) . Almost all document clustering approaches to date have represented documents as vectors in a bag-of-words vector space model, where each dimension of a document vector corresponds to a term in the corpus (Salton and McGill, 1983) . General clustering algorithms are then applied to these vectors to cluster the given corpus. There have been attempts to use bigrams or even higher-order ngrams to represent documents in text categorization, the supervised counterpart of document clustering, with little success (Caropreso et al., 2001; Tan et al., 2002) . Clustering can be viewed as partitioning a set of data objects into groups such that the similarities between the objects in a same group is high while inter-group similarities are weaker. The fundamental assumption in this work is that the documents that are likely to have been generated from similar language models are likely to be in the same cluster. Under this assumption, we propose a new representation for document vectors specifically designed for clustering purposes. Given a corpus, we are interested in the generation probabilities of a document based on the language models induced by other documents in the corpus. Using these probabilities, we propose a vector representation where each dimension of a document vector corresponds to a document in the corpus instead of a term in the classical representation. In other words, our document vectors are -dimensional, where is the number of documents in the corpus to be clustered. For the vector ¦ §¨of document ¥© , the th element of ¦ is closely related to the generation probability of ¥© based on the language model induced by document ¥ . The main steps of our method are as follows: For each ordered document pair ¥© ¥ in a given corpus, we compute the generation probability of ¥© from the language model induced by ¥ making use of language-model approaches in information retrieval (Ponte and Croft, 1998) . We represent each document by a vector of its generation probabilities based on other documents' language models. At this point, these vectors can be used in any clustering algorithm instead of the traditional term-based document vectors. Following (Kurland and Lee, 2005) , our new document vectors are used to construct the underlying generation graph; the directed graph where documents are the nodes and link weights are proportional to the generation probabilities. We use restricted random walk probabilities to reinforce the generation probabilities and discover hidden relationships in the graph that are not obvious by the generation links. Our random walk model is similar to the one proposed by Harel and Kohen (2001) for general spatial data represented as undirected graphs. We have extended their model to the directed graph case. We use new probabilities derived from random walks as the vector representation of the documents. Generation Probabilities as Document Vectors Language Models The language modeling approach to information retrieval was first introduced by Ponte and Croft (1998) as an alternative (or an improvement) to the traditional ¡¢ £ ¤¥¢ relevance models. In the language modeling framework, each document in the database defines a language model. The relevance of a document to a given query is ranked according to the generation probability of the query based on the underlying language model of the document. To induce a (unigram) language model from a document, we start with the maximum likelihood (ML) estimation of the term probabilities. For each term that occurs in a document , the ML estimation of with respect to is defined as ! \" # $ %& ' ( ) 01 %& 2 where %& is the number of occurences of term in document . This estimation is often smoothed based on the following general formula: # $ 3 ! \" # 4 5 6 3 ! \" # 7 89 @ A where ! \" # 7 89 @ A is the ML estimation of over an entire corpus which usually is a member of. 3 is the general smoothing parameter that takes different forms in various smoothing methods. Smoothing has two important roles (Zhai and Lafferty, 2004) . First, it accounts for terms unseen in the document preventing zero probabilities. This is similar to the smoothing effect in NLP problems such as parsing. Second, smoothing has an ¤¥¢like effect that accounts for the generation probabilities of the common terms in the corpus. A common smoothing technique is to use Bayesian smoothing with the Dirichlet prior (Zhai and Lafferty, 2004; Liu and Croft, 2004) : 3 $ ' ( ) 01 tf 2 ' ( ) 01 tf 2 4 B Here, B is the smoothing parameter. Higher values of B mean more aggressive smoothing. Assuming the terms in a text are independent from each other, the generation probability of a text sequence C given the document is the product of the generation probabilities of the terms of C : C # $ D ( 0E # (1) In the context of information retrieval, C is a query usually composed of few terms. In this work, we are interested in the generation probabilities of entire documents that usually have in the order of hundreds of unique terms. If we use Equation 1, we end up having unnatural probabilities which are irrepresentably small and cause floating point underflow. More importantly, longer documents tend to have much smaller generation probabilities no matter how closely related they are to the generating language model. However, as we are interested in the generation probabilities between all pairs of documents, we want to be able to compare two different generation probabilities from a fixed language model regardless of the target document sizes. This is not a problem in the classical document retrieval setting since the given query is fixed, and generation probabilities for different queries are not compared against each other. To address these problems, following (Lavrenko et al., 2002; Kurland and Lee, 2005) , we \"flatten\" the probabilities by normalizing them with respect to the document size: flat C # $ C # F GH G (2) where # C # is the number of terms in C . flat provides us with meaningful values which are comparable among documents of different sizes. Using Generation Probabilities as Document Representations Equation 2 suggests a representation of the relationship of a document with the other documents in a corpus. Given a corpus of documents to cluster, we form an -dimensional generation vector I §¨$ P §¨Q P §¨R S S S P §¨T for each document ¥© where P §¨ $ U V if ¤ $ flat ¥© # ¥ otherwise (3) We can use these generation vectors in any clustering algorithm we prefer instead of the classical term-based ¡¢ £ ¤¥¢ vectors. The intuition behind this idea becomes clearer when we consider the underlying directed graph representation, where each document is a node and the weight of the link from ¥© to ¥ is equal to flat ¥© # ¥ . An appropriate analogy here is the citation graph of scientific papers. The generation graph can be viewed as a model where documents cite each other. However, unlike real citations, the generation links are weighted and automatically induced from the content. The similarity function used in a clustering algorithm over the generation vectors becomes a measure of structural similarity of two nodes in the generation graph. Work on bibliometrics uses various similarity metrics to assess the relatedness of scientific papers by looking at the citation vectors (Boyack et al., 2005) . Graph-based similarity metrics are also used to detect semantic similarity of two documents on the Web (Maguitman et al., 2005) . Cosine, also the standard metric used in ¡¢ £¤¥¢ based document clustering, is one of these metrics. Intuitively, the cosine of the citation vectors (i.e. vector of outgoing link weights) of two nodes is high when they link to similar sets of nodes with similar link weights. Hence, the cosine of two generation vectors is a measure of how likely two documents are generated from the same documents' language models. The generation probability in Equation 2 with a smoothed language model is never zero. This creates two potential problems if we want to use the vector of Equation 3 directly in a clustering algorithm. First, we only want strong generation links to contribute in the similarity function since a low generation probability is not an evidence for semantic relatedness. This intuition is similar to throwing out the stopwords from the documents before constructing the ¡¢ £ ¤¥¢ vectors to avoid coincidental similarities between documents. Second, having a dense vector with lots of non-zero elements will cause efficiency problems. Vector length is assumed to be a constant factor in analyzing the complexity of the clustering algorithms. However, our generation vectors are -dimensional, where is the number of documents. In other words, vector size is not a constant factor anymore, which causes a problem of scalability to large data sets. To address these problems, we use what Kurland and Lee (2005) define as top generators: Given a document ¥© , we consider only W documents that yield the largest generation probabilities and discard others. The resultantdimensional vector, denoted I X §¨, has at most W non-zero elements, which are the largest W elements of I §¨. For a given constant W, with a sparse vector representation, certain operations (e.g. cosine) on such vectors can be done in constant time independent of . Reinforcing Links with Random Walks Generation probabilities are only an approximation of semantic relatedness. Using the underlying directed graph interpretation of the generation probabilities, we aim to get better approximations by accumulating the generation link information in the graph. We start with some definitions. We denote a (directed) graph as Y ` where `is the set of nodes and a `b `c d is the link weight function. We formally define a generation graph as follows: Definition 1 Given a corpus e $ f¥ Q ¥ R S S y ¨¨ F $ h © h ©r Q ' 0 h © @ y is called the transition probability from node @ to node h. For example, for a generation graph Y X , there are at most W 1-step random walks that start at a given node with probabilities proportional to the weights of the outgoing generation links of that node. Suppose there are three documents , , and 7 in a generation graph. Suppose also that there are \"strong\" generation links from to and to 7 , but no link from to 7 . The intuition says that must be semantically related to 7 to a certain degree although there is no generation link between them depending on 7 's language model. We approximate this relation by considering the probabilities of 2-step (or longer) random walks from to 7 although there is no 1-step random walk from to 7 . Let y q denote the probability that an ¡ -step random walk starts at @ and ends at h. An interesting property of random walks is that for a given node h, y does not depend on @ . In other words, the probability of a random walk ending up at h \"in the long run\" does not depend on its starting point (Seneta, 1981) . This limiting probability distribution of an infinite random walk over the nodes is called the stationary distribution of the graph. The stationary distribution is uninteresting to us for clustering purposes since it gives an information related to the global structure of the graph. It is often used as a measure to rank the structural importance of the nodes in a graph (Brin and Page, 1998) . For clustering, we are more interested in the local similarities inside a \"cluster\" of nodes that separate them from the rest of the graph. Furthermore, the generation probabilities lose their significance during long random walks since they get multiplied at each step. Therefore, we compute y q for small values of ¡ . Finally, we define the following: Definition 3 The ¡ -step generation probability of docu- ment ¥© from the language model of ¥ : gen q ¥© # ¥ $ ' q x Q y §¨ § ¡ I q §¨$ gen q ¥© # ¥ Q gen q ¥© # ¥ R S S S gen q ¥© # ¥ T is the ¡ -step generation vector of document ¥© . We will often write I q omitting the document name when we are not talking about the vector of a specific document. gen q ¥© ¥ is a measure of how likely a random walk that starts at ¥© will visit ¥ in ¡ or fewer steps. It helps us to discover \"hidden\" similarities between documents that are not immediately obvious from 1-step generation links. Note that when ¡ $ 5, I Q §¨i s nothing but I X §n ormalized such that the sum of the elements of the vector is 1. The two are practically the same representations since we compute the cosine of the vectors during clustering. Related Work Our work is inspired by three main areas of research. First, the success of language modeling approaches to information retrieval (Ponte and Croft, 1998) is encouraging for a similar twist to document representation for clustering purposes. Second, graph-based inference techniques to discover \"hidden\" textual relationships like the one we explored in our random walk model have been successfully applied to other NLP problems such as summarization (Erkan and Radev, 2004; Mihalcea and Tarau, 2004; Zha, 2002) , prepositional phrase attachment (Toutanova et al., 2004) , and word sense disambiguation (Mihalcea, 2005) . Unlike our approach, these methods try to exploit the global structure of a graph to rank the nodes of the graph. For example, Erkan and Radev (2004) find the stationary distribution of the random walk on a graph of sentences to rank the salience scores of the sentences for extractive summarization. Their link weight function is based on cosine similarity. Our graph construction based on generation probabilities is inherited from (Kurland and Lee, 2005) , where authors used a similar generation graph to rerank the documents returned by a retrieval system based on the stationary distribution of the graph. Finally, previous research on clustering graphs with restricted random walks inspired us to cluster the generation graph using a similar approach. Our ¡ -step random walk approach is similar to the one proposed by Harel and Koren (2001) . However, their algorithm is proposed for \"spatial data\" where the nodes of the graph are connected by undirected links that are determined by a (symmetric) similarity function. Our contribution in this paper is to use their approach on textual data by using generation links, and extend the method to directed graphs. There is an extensive amount of research on document clustering or clustering algorithms in general that we can not possibly review here. After all, we do not present a new clustering algorithm, but rather a new representation of textual data. We explain some popular clustering algorithms and evaluate our representation using them in Section 4. Few methods have been proposed to cluster documents using a representation other than the traditional ¡¢ £¤¥¢ vector space (or similar term-based vectors). Using a bipartite graph of terms and documents and then clustering this graph based on spectral methods is one of them (Dhillon, 2001; Zha et al., 2001) . There are also general spectral methods that start with ¡¢ £ ¤¥¢ vectors, then map them to a new space with fewer dimensions before initiating the clustering algorithm (Ng et al., 2001) . The information-theoretic clustering algorithms are relevant to our framework in the sense that they involve probability distributions over words just like the language models. However, instead of looking at the word distributions at the individual document level, they make use of the joint distribution of words and documents. For example, given the set of documents and the set of words in the document collection, Slonim and Tishby (2000) first try to find a word clustering such that the mutual information is minimized (for good compression) while maximizing the (for preserving the original information). Then the same procedure is used for clustering documents using the word clusters from the first step. Dhillon et. al. (2003) propose a co-clustering version of this information-theoretic method where they cluster the words and the documents concurrently. Evaluation We evaluated our new vector representation by comparing it against the traditional ¡¢ £ ¤¥¢ vector space representation. We ran k-means, single-link, average-link, and complete-link clustering algorithms on various data sets using both representations. These algorithms are among the most popular ones that are used in document clustering. General Experimental Setting Given a corpus, we stemmed all the documents, removed the stopwords and constructed the ¡¢ £¤¥¢ vector for each document by using the bow toolkit (McCallum, 1996) . We computed the ¤¥¢ of each term using the following formula: idf $ 8 P R df where is the total number of documents and df is the number of documents that the term appears in. We computed flattened generation probabilities (Equation 2) for all ordered pairs of documents in a corpus, and then constructed the corresponding generation graph (Definition 1). We used Dirichlet-smoothed language models with the smoothing parameter B $ 5VVV, which can be considered as a typical value used in information retrieval. While computing the generation link vectors, we did not perform extensive parameter tuning at any stage of our method. However, we observed the following: When W (number of outgoing links per document) was very small (less than 10), our methods performed poorly. This is expected with such a sparse vector representation for documents. However, the performance got rapidly and almost monotonically better as we increased W until around W $ V, where the performance stabilized and dropped after around W $ 5VV. We conclude that using bounded number of outgoing links per document is not only more efficient but also necessary as we motivated in Section 2.2. We got the best results when the random walk parameter ¡ $ . When ¡ s , the random walk goes \"out of the cluster\" and I q vectors become very dense. In other words, almost all of the graph is reachable from a given node with 4-step or longer random walks (assuming W is around 80), which is an indication of a \"small world\" effect in generation graphs (Watts and Strogatz, 1998) . Under these observations, we will only report results using vectors I Q , I R and Id with W $ V regardless of the data set and the clustering algorithm. Experiments with k-means Algorithm k-means is a clustering algorithm popular for its simplicity and efficiency. It requires e, the number of clusters, as input, and partitions the data set into exactly e clusters. We used a version of k-means that uses cosine similarity to compute the distance between the vectors. The algorithm can be summarized as follows: 1. randomly select e document vectors as the initial cluster centroids; 2. assign each document to the cluster whose centroid yields the highest cosine similarity; 3. recompute the centroid of each cluster. (centroid vector of a cluster is the average of the vectors in that cluster); 4. stop if none of the centroid vectors has changed at step 3. otherwise go to step 2. Data k-means is known to work better on data sets in which the documents are nearly evenly distributed among different clusters. For this reason, we tried to pick such corpora for this experiment to be able to get a fair comparison between different document representations. The first corpus we used is classic3, 1 which is a collection of technical paper abstracts in three different areas. We used two corpora, bbc and bbcsport, that are composed 1 ftp://ftp.cs.cornell.edu/pub/smart of BBC news articles in general and sports news, respectively. 2 Both corpora have 5 news classes each. 20news 3 is a corpus of newsgroup articles composed of 20 classes. Table 1 summarizes the corpora we used together with the sizes of the smallest and largest class in each of them. Results We used two different metrics to evaluate the results of the k-means algorithm; accuracy and mutual information. Let © be the label assigned to ¥© by the clustering algorithm, and f © be ¥© 's actual label in the corpus. Then, Accuracy $ ' T ©x Q g map © f © where g h i equals 1 if h $ i and equals zero otherwise. map © is the function that maps the output label set of the k-means algorithm to the actual label set of the corpus. Given the confusion matrix of the output, best such mapping function can be efficiently found by Munkres's algorithm (Munkres, 1957) . Mutual information is a metric that does not require a mapping function. Let j $ f Q R S S S k g be the output label set of the k-means algorithm, and $ f f Q fR S S S f k g be the actual label set of the corpus with the underlying assignments of documents to these sets. Mutual information (MI) of these two labelings is defined as: MIj $ l m ¨0\" no 0p q © f £ log R q © f q © £ q f where q © and q f are the probabilities that a document is labeled as © and f by the algorithm and in the actual corpus, respectively; q © f is the probability that these two events occur at the same time. These values can be derived from the confusion matrix. We map the MI metric to the rV 5s interval by normalizing it with the maximum possible MI that can be achieved with the corpus. Normalized MI is defined as t MI $ MIj MI One disadvantage of k-means is that its performance is very dependent on the initial selection of cluster centroids. Two approaches are usually used when reporting the performance of k-means. The algorithm is run multiple times; then either the average performance of these runs or the best performance achieved is reported. Reporting the best performance is not very realistic since we would not be clustering a corpus if we already knew the class labels. Reporting the average may not be very informative since the variance of multiple runs is usually large. We adopt an approach that is somewhere in between. We use \"true seeds\" to initialize k-means, that is, we randomly select e document vectors that belong to each of the true classes as the initial centroids. This is not an unrealistic assumption since we initially know the number of classes, e, in the corpus, and the cost of finding one example document from each class is not usually high. This way, we also aim to reduce the variance of the performance of different runs for a better analysis. Table 2 shows the results of k-means algorithm using ¡¢ £¤¥¢ vectors versus generation vectors I Q (plain flattened generation probabilities), I R (2-step random walks), I d (3-step random walks). Taking advantage of the relatively larger size and number of classes of 20news corpus, we randomly divided it into disjoint partitions with 4, 5, and 10 classes which provided us with 5, 4, and 2 new corpora, respectively. We named them 4news-1, 4news-2, S S S , 10news-2 for clarity. We ran kmeans with 30 distinct initial seed sets for each corpus. The first observation we draw from Table 2 is that even I Q vectors perform better than the ¡¢£ ¤¥¢ model. This is particularly surprising given that I Q vectors are sparser than the ¡¢ £¤¥¢ representation for most documents. 4 All I q vectors clearly outperform ¡¢ £¤¥¢ model often by a wide margin. The performance also gets better (not always significantly though) in almost all data sets as we increase the random walk length, which indicates that random walks are useful in reinforcing generation links and inducing new relationships. Another interesting observation is that the confidence intervals are also narrower for generation vectors, and tend to get even narrower as we increase ¡ . Experiments with Hierarchical Clustering Algorithms Hierarchical clustering algorithms start with the trivial clustering of the corpus where each document defines a separate cluster by itself. At each iteration, two \"most similar\" separate clusters are merged. The algorithm stops after 6 5 iterations when all the documents are merged into a single cluster. Hierarchical clustering algorithms differ in how they define the similarity between two clusters at each merging step. We experimented with three of the most popular algorithms using cosine as the similarity metric between two vectors. Single-link clustering merges two clusters whose most similar members have the highest similarity. Complete-link clustering merges two clusters whose least similar members have the highest similarity. Average-link clustering merges two clusters that yield the highest average similarity between all pairs of documents.  Although hierarchical algorithms are not very efficient, they are useful when the documents are not evenly distributed among the classes in the corpus and some classes exhibit a \"hierarchical\" nature; that is, some classes in the data might be semantically overlapping or they might be in a subset/superset relation with each other. We picked two corpora that may exhibit such nature to a certain extent. Reuters-21578 5 is a collection of news articles from Reuters. TDT2 6 is a similar corpus of news articles collected from six news agencies in 1998. They contain documents labeled with zero, one or more class labels. For each corpus, we used only the documents with exactly one label. We also eliminated classes with only one document since clustering such classes is trivial. We ended up with two collections summarized in Table 3 . Data Results The output of a hierarchical clustering algorithm is a tree where leaves are the documents and each node in the tree shows a cluster merging operation. Therefore each subtree represents a cluster. We assume that each class of documents in the corpus form a cluster subtree at some point during the construction of the tree. To evaluate the cluster tree, we use F-measure proposed in (Larsen and Accuracy Table 4 : Performances (F-measure ¥¦xx) of different vector representations using hierarchical algorithms on two corpora. ( Qii ) Normalized Mutual Information ( Qii ) Corpus k q © § F q © § F classic3 3 Q R R i i i Q R i Q Q Q i d d i 4news-1 4 R d R R i R Q Q d i d d Q R i 4news-2 4 d R R d dd R Q i Q R d iR R Q i i Q 4news-3 4 R d R Q d d i d dd R Q d d Q d i 4news-4 4 d Q R i Q d Q d Q i R R Q R i i 4news-5 4 d d i R dd i i Q R d i d R Q R 5news-1 5 ii R d d Q R d i d R d d R d Q i R 5news-2 5 R d R R Q R Q d i R ii R Q R Q R 5news-3 5 Q i R d d R Q Q R Q R i R QR Q Q d Q 5news-4 5 i i R i Ri Q R Q Q i i R R d Q d Q d R bbc 5 i d R i R d R d d d R d Q R d Ri R d bbcsport 5 R R R i i R d d R Q d R i Q 10news-1 10 i QQ R d i Ri R QR Q Q d d Q RQ Q Q Q 10news-2 10 QR Q i iQ R ii d Q Q R Q i Q i Ri Q QQ 20news 20 Q Q i d Q R Q R d R i d R i d i Q where W © A and q W © A is the recall and the precision of A considering the class W © . Let C be the set of subtrees in the output cluster tree, and 7 be the set of classes. F-measure of the entire tree is the weighted average of the maximum F-measures of all the classes: } 7 C $ l X 0 § X ¨©ª 0E } W A where X is the number of documents that belong to class W. We ran all three algorithms for both corpora. Unlike kmeans, hierarchical algorithms we used are deterministic. Table 4 summarizes our results. An immediate observation is that average-link clustering performs much better than other two algorithms independent of the data set or the document representation, which is consistent with earlier research (Zhao and Karypis, 2002) . The highest result (shown boldface) for each algorithm and corpus was achieved by using generation vectors. However, unlike in the k-means experiments, ¡¢ £ ¤¥¢ was able to outperform I Q and I R in one or two cases. I R yielded the best result instead of I d in one of the six cases. Conclusion We have presented a language model inspired approach to document clustering. Our results show that even the simplest version of our approach with nearly no parameter tuning can outperform traditional ¡¢ £¤¥¢ models by a wide margin. Random walk iterations on our graph-based model have improved our results even more. Based on the success of our model, we will investigate various graphbased relationships for explaining semantic structure of text collections in the future. Possible applications include information retrieval, text clustering/classification and summarization. Acknowledgments I would like to thank Dragomir Radev for his useful comments. This work was partially supported by the U.S. National Science Foundation under the following two grants: 0329043 \"Probabilistic and link-based Methods for Exploiting Very Large Textual Repositories\" administered through the IDM program and 0308024 \"Collaborative Research: Semantic Entity and Relation Extraction from Web-Scale Text Document Collections\" administered by the HLT program. All opinions, findings, conclusions, and recommendations in this paper are made by the authors and do not necessarily reflect the views of the National Science Foundation.",
    "abstract": "We propose a new document vector representation specifically designed for the document clustering task. Instead of the traditional termbased vectors, a document is represented as an -dimensional vector, where is the number of documents in the cluster. The value at each dimension of the vector is closely related to the generation probability based on the language model of the corresponding document. Inspired by the recent graph-based NLP methods, we reinforce the generation probabilities by iterating random walks on the underlying graph representation. Experiments with k-means and hierarchical clustering algorithms show significant improvements over the alternative ¡¢ £¤¥¢ vector representation.",
    "countries": [
        "United States"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "49",
    "year": "2006",
    "month": "June",
    "title": "Language Model-Based Document Clustering Using Random Walks"
}