{
    "article": "This paper proposes an improved approach to extractive summarization of spoken multi-party interaction, in which integrated random walk is performed on a graph constructed on topical/ lexical relations. Each utterance is represented as a node of the graph, and the edges' weights are computed from the topical similarity between the utterances, evaluated using probabilistic latent semantic analysis (PLSA), and from word overlap. We model intra-speaker topics by partially sharing the topics from the same speaker in the graph. In this paper, we perform experiments on automatically and manually generated transcripts. For automatic transcripts, our results show that intra-speaker topic sharing and integrating topical/ lexical relations can help include the important utterances. Introduction Speech summarization is an active and important topic of research (Lee and Chen, 2005) , because multimedia/ spoken documents are more difficult to browse than text or image content. While earlier work was focused primarily on broadcast news content, recent effort has been increasingly directed to new domains such as lectures (Glass et al., 2007; Chen et al., 2011) and multi-party interaction (Banerjee and Rudnicky, 2008; Liu and Liu, 2010) . We describe experiments on multi-party interaction found in meeting recordings, performing extractive summarization (Liu et al., 2010) on transcripts generated by automatic speech recognition (ASR) and human annotators. Graph-based methods for computing lexical centrality as importance to extract summaries (Erkan and Radev, 2004) have been investigated in the context of text summarization. Some works focus on maximizing coverage of summaries using the objective function (Gillick, 2011) . Speech summarization carries intrinsic difficulties due to the presence of recognition errors, sponta-neous speech effect, and lack of segmentation. A general approach has been found very successful (Furui et al., 2004) , in which each utterance in the document d, U = t 1 t 2 ...t i ...t n , represented as a sequence of terms t i , is given an importance score: I(U, d) = 1 n n i=1 [λ 1 s(t i , d) + λ 2 l(t i ) (1) + λ 3 c(t i ) + λ 4 g(t i )] + λ 5 b(U ), where s(t i , d), l(t i ), c(t i ), g(t i ) are respectively some statistical measure (such as TF-IDF), linguistic measure (e.g., different part-of-speech tags are given different weights), confidence score and N-gram score for the term t i , and b(U ) is calculated from the grammatical structure of the utterance U , and λ 1 , λ 2 , λ 3 , λ 4 and λ 5 are weighting parameters. For each document, the utterances to be used in the summary are then selected based on this score. In recent work, Chen (2011) proposed a graphical structure to rescore I(U, d), which can model the topical coherence between utterances using random walk within documents. Similarly, we now use a graph-based approach to consider the importance of terms and the similarity between utterances, where topical and lexical similarity are integrated in the graph, so that utterances topically or lexically similar to more important utterances are given higher scores. Using topical similarity can compensate the negative effects of recognition errors on similarity evaluated on word overlap to some extent. In addition, this paper proposes an approach of modeling intraspeaker topics in the graph to improve meeting summarization (Garg et al., 2009) using information from multiparty interaction, which is not available in lectures or broadcast news. Proposed Approach We apply word stemming and noise utterance filtering for utterances in all meetings. Then we construct a graph to compute the importance of all utterances.  We formulate the utterance selection problem as random walk on a directed graph, in which each utterance is a node and the edges between them are weighted by topical and lexical similarity. The basic idea is that an utterance similar to more important utterances should be more important (Chen et al., 2011) . We formulate two types of directed edge, topical edges and lexical edges, which are weighted by topical and lexical similarity respectively. We then keep only the top N outgoing edges with the highest weights from each node, while consider incoming edges to each node for importance propagation in the graph. A simplified example for such a graph with topical edges is in Figure 1 , in which A t i and B t i are the sets of neighbors of the node U i connected respectively by outgoing and incoming topical edges. Parameters from PLSA Probabilistic latent semantic analysis (PLSA) (Hofmann, 1999) has been widely used to analyze the semantics of documents based on a set of latent topics. Given a set of documents {d j , j = 1, 2, ..., J} and all terms {t i , i = 1, 2, ..., M } they include, PLSA uses a set of latent topic variables, {T k , k = 1, 2, ..., K}, to characterize the \"term-document\" co-occurrence relationships. The PLSA model can be optimized with EM algorithm by maximizing a likelihood function. We utilize two parameters from PLSA, latent topic significance (LTS) and latent topic entropy (LTE) (Kong and Lee, 2011) in the paper. Latent Topic Significance (LTS) for a given term t i with respect to a topic T k can be defined as LTS ti (T k ) = dj ∈D n(t i , d j )P (T k | d j ) dj ∈D n(t i , d j )[1 − P (T k | d j )] , (2) where n(t i , d j ) is the occurrence count of term t i in a document d j . Thus, a higher LTS ti (T k ) indicates the term t i is more significant for the latent topic T k . Latent Topic Entropy (LTE), for a given term t i can be calculated from the topic distribution P (T k | t i ): LTE(t i ) = − K k=1 P (T k | t i ) log P (T k | t i ), (3) where the topic distribution P (T k | t i ) can be estimated from PLSA. LTE(t i ) is a measure of how the term t i is focused on a few topics, so a lower latent topic entropy implies the term carries more topical information. Statistical Measures of a Term The statistical measure of a term t i , s(t i , d) in (1) can be defined in terms of LTE(t i ) in (3) as s(t i , d) = γ • n(t i , d) LTE(t i ) , ( 4 ) where γ is a scaling factor such that 0 ≤ s(t i , d) ≤ 1; the score s(t i , d) is inversely proportion to the latent topic entropy LTE(t i ). Some works (Kong and Lee, 2011) showed that the use in (1) of s(t i , d) as defined in (4) outperformed the very successful \"significance score\" (Furui et al., 2004) in speech summarization; then, we use it as the baseline. Similarity between Utterances Within a document d, we can first compute the probability that the topic T k is addressed by an utterance U i : P (T k | U i ) = t∈Ui n(t, U i )P (T k | t) t∈Ui n(t, U i ) . (5) Then an asymmetric topical similarity TopicSim(U i , U j ) for utterances U i to U j (with direction U i → U j ) can be defined by accumulating LTS t (T k ) in (2) weighted by P (T k | U i ) for all terms t in U j over all latent topics: TopicSim(U i , U j ) = t∈Uj K k=1 LTS t (T k )P (T k | U i ), (6) where the idea is very similar to the generative probability in IR. We call it generative significance of U i given U j . Within a document d, the lexical similarity is the measure of word overlap between the utterance U i and U j . We compute LexSim(U i , U j ) as the cosine similarity between two TF-IDF vectors from U i and U j like wellknown LexRank (Erkan and Radev, 2004) . Note that LexSim(U i , U j ) = LexSim(U j , U i ) Intra-Speaker Topic Modeling We assume a single speaker usually focuses on similar topics, so if an utterance is important, the scores of the utterances from the same speaker should be increased. Then we increase the similarity between the utterances from the same speaker to share the topics: TopicSim k (U i , U j ) =        TopicSim(U i , U j ) 1+w , if U i ∈ S k and U j ∈ S k TopicSim(U i , U j ) 1−w , otherwise (7) where S k is the set including all utterances from speaker k, and w is a weighting parameter for modeling the speaker relation, which means the level of coherence of topics within a single speaker. Here the topics from the same speaker can partially shared. Integrated Random Walk We modify random walk (Hsu and Kennedy, 2007; Chen et al., 2011) to integrate two types of similarity over the graph obtained above. v(i) is the new score for node U i , which is the interpolation of three scores, the normalized initial importance r(i) for node U i and the score contributed by all neighboring nodes U j of node U i weighted by p t (j, i) and p l (j, i), v(i) = (1 − α − β)r(i) (8) + α Uj ∈B t i p t (j, i)v(j) + β Uj ∈B l i p l (j, i)v(j), where α and β are the interpolation weights, B t i is the set of neighbors connected to node U i via topical incoming edges, B l i is the set of neighbors connected to node U i via lexical incoming edges, and r(i) = I(U i , d) Uj I(U j , d) (9) is normalized importance scores of utterance U i , I(U i , d) in (1). We normalize topical similarity by the total similarity summed over the set of outgoing edges, to produce the weight p t (j, i) for the edge from U j to U i on the graph. Similarly, p l (j, i) is normalized in lexical edges. (8) can be iteratively solved with the approach very similar to that for the PageRank problem (Page et al., 1998) . Let v = [v(i), i = 1, 2, ..., L] T and r = [r(i), i = 1, 2, ..., L] T be the column vectors for v(i) and r(i) for all utterances in the document, where L is the total number of utterances in the document d and T represents transpose. (8) then has a vector form below, v = (1 − α − β)r + αP t v + βP l v (10) = (1 − α − β)re T + αP t + βP l v = P v, where P t and P l are L×L matrices of p t (j, i) and p l (j, i) respectively, and e = [1, 1, ..., 1] T . It has been shown that the solution v of ( 10 ) is the dominant eigenvector of P (Langville and Meyer, 2006) , or the eigenvector corresponding to the largest absolute eigenvalue of P . The solution v(i) can then be obtained. Experiments Corpus The corpus used in this research consists of a sequence of naturally occuring meetings, which featured largely overlapping participant sets and topics of discussion. For each meeting, SmartNotes (Banerjee and Rudnicky, 2008) was used to record both the audio from each participant as well as his notes. The meetings were transcribed both manually and using a speech recognizer; the word error rate is around 44%. In this paper we use 10 meetings held from April to June of 2006. On average each meeting had about 28 minutes of speech. Across these 10 meetings there were 6 unique participants; each meeting featured between 2 and 4 of these participants (average: 3.7). The total number of utterances is 9837 across 10 meetings. In this paper, we separate dev set (2 meetings) and test set (8 meetings). Dev set is used to tune the parameters such as α, β, w. The reference summaries are given by the set of \"noteworthy utterances\": two annotators manually labelled the degree (three levels) of \"noteworthiness\" for each utterance, and we extract the utterances with the top level of \"noteworthiness\" to form the summary of each meeting. In the following experiments, for each meeting, we extract the top 30% number of terms as the summary. Evaluation Metrics Automated evaluation utilizes the standard DUC evaluation metric ROUGE (Lin, 2004) which represents recall over various n-grams statistics from a systemgenerated summary against a set of human generated peer summaries. F-measures for ROUGE-1 (unigram) and ROUGE-L (longest common subsequence) can be evaluated in exactly the same way, which are used in the following results. Results Table 1 shows the performance achieved by all proposed approaches. In these experiments, the damping factor, (1 − α − β) in (8), is empirically set to 0.1. Row (a) is the baseline, which use LTE-based statistical measure to compute the importance of utterances I(U, d). Row (b) is the result only considering lexical similarity; row (c) only uses topical similarity. Row (d) are the results additionally including speaker information such as TopicSim (U i , U j ). Row (e) is the result performed by integrated random walk (with α = 0 and β = 0) using parameters that have been optimized on the dev set. Graph-Based Approach We can see the performance after graph-based recomputation, shown in rows (b) and (c), is significantly better than the baseline, shown in row (a), for both ASR and manual transcripts. For ASR transcripts, topical similarity and lexical similarity give similar results. For manual transcripts, topical similarity performs slightly worse than lexical similarity, because manual transcripts don't contain the recognition errors, and therefore word overlap can accurately measure the similarity between two utter-  ances. However, for ASR transcripts, although topical similarity is not as accurate as lexical similarity, it can compensate for recognition errors, so that the approaches have similar performance. Thus, graph-based approaches can significantly improve the baseline results. Effectiveness of Intra-Speaker Modeling We find that modeling intra-speaker topics can improve the performance (row (c) and row (d)), which means speaker information is useful to model the topical similarity. The experiment shows intra-speaker modeling can help us include the important utterances for both ASR and manual transcripts. Integration of Topical and Lexical Similarity Row (e) shows the result of the proposed approach, which integrates topical and lexical similarity into a single graph, considering two types of relations together. For ASR transcripts, row (e) is better than row (b) and row (d), which means topical similarity and lexical similarity can model different types of relations, because of recognition errors. Figure 2 shows the sensitivity of the combination weights for integrated random walk. We can see topical similarity and lexical similarity are additive, i.e. they can compensate each other, improving the performance by integrating two types of edges in a single graph. Note that the exact values of α and β do not mat-ter so much for the performance. For manual transcripts, row (e) cannot perform better by combing two types of similarity, which means topical similarity can dominate lexical similarity, since without recognition errors topical similarity can model the relations accurately and additionally modeling intra-speaker topics can effectively improve the performance. In addition, Banerjee and Rudnicky (2008) used supervised learning to detect noteworthy utterances on the same corpus, and achieved ROGURE-1 scores of around 43% for ASR, and 47% for manual transcriptions. Our unsupervised approach performs better, especially for ASR transcripts. Note that the performance on ASR is better than on manual transcripts. Because a higher percentage of recognition errors occurs on \"unimportant\" words, these words tend to receive lower scores; we can then exclude the utterances with more errors, and achieve better summarization results. Other recent work has also demonstrated better performance for ASR than manual transcripts (Chen et al., 2011; Kong and Lee, 2011) . Conclusion and Future Work Extensive experiments and evaluation with ROUGE metrics showed that intra-speaker topics can be modeled in topical similarity and that integrated random walk can combine the advantages from two types of edges for imperfect ASR transcripts, where we achieved more than 6% relative improvement. We plan to model interspeaker topics in the graph-based approach in the future. Acknowledgements The first author was supported by the Institute of Education Science, U.S. Department of Education, through Grants R305A080628 to Carnegie Mellon University. Any opinions, findings, and conclusions or recommendations expressed in this publication are those of the authors and do not necessarily reflect the views or official policies, either expressed or implied of the Institute or the U.S. Department of Education.",
    "abstract": "This paper proposes an improved approach to extractive summarization of spoken multi-party interaction, in which integrated random walk is performed on a graph constructed on topical/ lexical relations. Each utterance is represented as a node of the graph, and the edges' weights are computed from the topical similarity between the utterances, evaluated using probabilistic latent semantic analysis (PLSA), and from word overlap. We model intra-speaker topics by partially sharing the topics from the same speaker in the graph. In this paper, we perform experiments on automatically and manually generated transcripts. For automatic transcripts, our results show that intra-speaker topic sharing and integrating topical/ lexical relations can help include the important utterances.",
    "countries": [
        "United States"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "11",
    "year": "2012",
    "month": "June",
    "title": "Intra-Speaker Topic Modeling for Improved Multi-Party Meeting Summarization with Integrated Random Walk"
}