{
    "article": "Description The task of natural language inference (NLI; also known as recognizing textual entailment, or RTE) asks a system to evaluate the relationships between the truth-conditional meanings of two sentences or, in other words, decide whether one sentence follows from another. This task neatly isolates the core NLP problem of sentence understanding as a classification problem, and also offers promise as an intermediate step in the building of complex systems (Dagan et al., 2005; MacCartney, 2009; Bowman et al., 2015) . The last few years have seen fast progress in NLI, with the introduction of a few large training datasets and many popular evaluation sets as well as an explosion of new model architectures and methods for using unlabeled data and outside knowledge. This tutorial will layout the motivations for work on NLI, survey the available resources for the task, and present highlights from recent research showing us what NLI can teach us about the capabilities and limits of deep learning models for language understanding and reasoning. The tutorial will start from a brief discussion on the motivations for NLI, problem definitions, and typical conventional approaches (Dagan et al., 2013; MacCartney, 2009; Iftene and Balahur-Dobrescu, 2007) . Critical to the recent advance on NLI, the creation of larger annotated datasets (Bowman et al., 2015; Williams et al., 2018; Conneau et al., 2018) has made it feasible to train complex models that need to estimate a large number of parameters. The tutorial will present detailed discussion on the available datasets as well as the motivations for and insights from developing these datasets. Then based on more recent research on annotation artifacts, we will extend the discussion to what we should or shouldn't take away from the current datasets. We will then focus on the cutting-edge deep learning models for NLI. We start from two basic setups for NLI modeling: sentence-embeddingbased modeling (Bowman et al., 2015; Chen et al., 2017b Chen et al., , 2018a;; Williams et al., 2018; Yoon et al., 2018; Kiela et al., 2018; Talman et al., 2018) and deep-learning approaches that utilize crosssentence statistics (Bowman et al., 2015; Chen et al., 2017a Chen et al., , 2018b;; Radford et al., 2018; Devlin et al., 2018; Peters et al., 2018) . We will cover typical deep-learning architectures in both paradigms. Based on this we will deepen our discussion from several perspectives. We first describe models that can further consider linguistic structures in the deep-learning NLI architectures (Chen et al., 2017a) . We then advance to discuss models that utilize external knowledge, which include two typical types of approaches: those explicitly incorporating human-authorized knowledge (Chen et al., 2018b) and those based on unsupervised pretraining (Radford et al., 2018; Devlin et al., 2018; Peters et al., 2018) . We will present how NLI models are sensitive or robust to different newly proposed tests (Glockner et al., 2018; Wang et al., 2018; Naik et al., 2018; Poliak et al., 2018) . The tutorial will also cover the recent modeling on crosslingual NLI (Conneau et al., 2018) . Finally we will summarize the tutorial and flesh out some discussions on future directions. Tutorial Outline",
    "abstract": "This tutorial discusses cutting-edge research on NLI, including recent advance on dataset development, cutting-edge deep learning models, and highlights from recent research on using NLI to understand capabilities and limits of deep learning models for language understanding and reasoning.",
    "countries": [
        "United States"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "7",
    "year": "2019",
    "month": "June",
    "title": "Deep Learning for Natural Language Inference"
}