{
    "article": "We introduce deep inside-outside recursive autoencoders (DIORA), a fully-unsupervised method for discovering syntax that simultaneously learns representations for constituents within the induced tree. Our approach predicts each word in an input sentence conditioned on the rest of the sentence and uses inside-outside dynamic programming to consider all possible binary trees over the sentence. At test time the CKY algorithm extracts the highest scoring parse. DIORA achieves a new state-of-the-art F1 in unsupervised binary constituency parsing (unlabeled) in two benchmark datasets, WSJ and MultiNLI. * Equal contribution, randomly ordered. Under the current circumstances he says their scenario no longer seems unrealistic Introduction Syntactic parse trees are useful for downstream tasks such as relation extraction (Gamallo et al., 2012) , semantic role labeling (Sutton and Mc-Callum, 2005; He et al., 2018) , machine translation (Aharoni and Goldberg, 2017; Eriguchi et al., 2017; Zaremoodi and Haffari, 2018) , and text classification (Li and Roth, 2006; Tai et al., 2015) . Traditionally, supervised parsers trained on datasets such as the Penn Treebank (Marcus et al., 1993) are used to obtain syntactic trees. However, the treebanks used to train these supervised parsers are typically small and restricted to the newswire domain. Unfortunately, models trained on newswire treebanks tend to perform considerably worse when applied to new types of data, and creating new domain specific treebanks with syntactic annotations is expensive and timeconsuming. Motivated by the desire to address the limitations of supervised parsing and by the success of large-scale unsupervised modeling such as ELMo and BERT (Peters et al., 2018a; Devlin et al., Figure 1 : An unlabeled binary constituency parse from DIORA matching the ground truth. 2019), we propose a new deep learning method of unsupervised parser training that can extract both shallow parses (i.e., noun phrases or entities) and full syntactic trees from any domain or language automatically without requiring any labeled training data. In addition to producing parses, our model simultaneously builds representations for internal constituents that reflect syntactic and semantic regularities which can be leveraged by downstream tasks. Our model builds on existing work developing latent tree chart parsers (Socher et al., 2011b; Le and Zuidema, 2015; Yogatama et al., 2017; Maillard et al., 2017; Choi et al., 2018) . These methods produce representations for all internal nodes in the tree (cells in the chart), each generated as a soft weighting over all possible sub-trees ( §2). Unfortunately, they still require sentence-level annotations during training, as they are all trained to optimize a downstream task, typically natural language inference. To address these limitations, we present deep inside-outside recursive autoencoders (DIORA) which enable unsupervised discovery and representation of constituents without requiring any supervised training data. DIORA incorporates the inside-outside algorithm (Baker, 1979; Lari and Young, 1990 ) into a latent tree chart parser. The bottom-up inside step calculates a representation for all possible constituents within a binary tree over the input sentence. This step is equivalent to the forward-pass of previous latent tree chart parsers (Maillard et al., 2017) . These inside representations only encode the current subtree, ignor- e(i, j) e(i, j) a (i, j) a(i, j) b(i, j) i 0 j 0 i 1 j 1 i 0 j 0 ā(k) b(k) Figure 2 : The illustrated inside and outside pass of DIORA operating over an input of length three, 'the cat drinks'. a) The inside pass: The inside vector ā(k) for the phrase 'the cat drinks' is a weighted average of the compositions for the two possible segmentations -((the cat), drinks) and (the, (cat drinks)). The scalar weights come from a learned compatibility function. b) The outside pass: The outside vector b(k) for the phrase 'the cat' is a function of the outside vector of its parent 'the cat drinks' and the inside vector of its sibling 'drinks'. ing all outside context. Thus, we perform an additional top-down outside calculation for each node in the tree, providing external context into the subtree representations in each chart cell. The model is then trained with the objective that the outside representations of the leaf cells should reconstruct the corresponding leaf input word, analogous to masked language model (Devlin et al., 2019) pretraining, except by using dynamic programming we predict every word from a completely unmasked context. The single most likely tree can be recovered using the CKY algorithm and compatibility scores between constituents. Previous work either predict trees that are not well aligned with known treebanks (Yogatama et al., 2017; Choi et al., 2018) , or has no mechanism for explicitly modeling phrases, requiring a complex procedure to extract syntactic structures (Shen et al., 2018) . To probe different properties of our model, we run experiments on unsupervised parsing, segment recall, and phrase representations. DIORA achieves multiple new state-of-the-art results for unsupervised constituency parsing (absolute improvements of 13.7%, 11.5%, and 7.8% on WSJ, WSJ-40, and MultiNLI), has a greater recall on more constituent types than a strong baseline, and produces meaningful phrase representations. DIORA: Deep Inside-Outside Recursive Autoencoders Our goal is to design a model and unsupervised training procedure that learns structure from raw text. The design of DIORA is based on our hypothesis is that the most effective compression of a sentence will be derived from following the true syntactic structure of the underlying input. Our approach builds on previous latent tree chart parsers which are augmented with the insideoutside algorithm (Baker, 1979; Lari and Young, 1990) and trained to reproduce each input word from its outside context. Based on our hypothesis, loosely inspired by the linguistic \"substitution principle\" (Frege, 1960) , the model will best reconstruct the input by discovering and exploiting syntactic regularities of the text. The inside pass of our method recursively compresses the input sequence, at each step inputting the vector representations of the two children into a composition function ( §2.1.1) that outputs an inside vector representation of the parent. This process continues up to the root of the tree, eventually yielding a single vector representing the entire sentence (Figure 2a ). This is loosely analogous to the compression step of an autoencoder and equivalent to existing latent tree chart parsers forward pass (Maillard et al., 2017) . Following this, we initiate the outside pass of our algorithm with a generic (root) representation that is learned as a separate parameter. As the outside step of the inside-outside algorithm (Figure 2b ), we unfold until finally producing representations of the leaf nodes. These leaves are then optimized to reconstruct the input sentence as done in an autoencoder-based deep neural network. Filling the Chart with Inside-Outside Each inside representation is the root of a particularly sub-tree, and that representation is generated by considering only the descendant constituents within that sub-tree, ignoring any outside context. After the inside representations are calculated, we perform a top-down outside pass to compute outside representations. The outside representations are encoded by looking at only the context of a given sub-tree. Once the chart is filled, each constituent k (cell in the chart) is associated with an inside vector ā(k), an outside vector b(k), inside compatibility score ē(k) and outside compatibility score f (k). The input to our model is a sentence x made up of T tokens, x 0 , x 1 , ..., x T −1 . Each token x i has a corresponding pre-trained embedded vector v i . Inside Pass For each pair of neighboring constituents i and j 1 , we compute a compatibility score and a composition vector. The score and vector that represent a particular span k are computed using a soft weighting over all possible pairs of constituents, that together fully cover the span (we refer to this set of constituent pairs as {k}). Vectors for spans of length 1 are initialized as a non-linear transformation 2 of the embedded input v i , and the scores associated with these spans are set to 0:   x o u   =   σ σ tanh   (U ψ v k + b) ā(k) = o + tanh(x ⊙ u) ē(k) = 0 Higher levels of the chart are computed as a weighted summation of constituent pairs: ā(k) = i,j∈{k} e(i, j) a(i, j) ē(k) = i,j∈{k} e(i, j) ê(i, j) The compatibility function ê is meant to produce a score for how likely a pair of neighboring cells are to be merged. We implement this as a bilinear function of the vectors from neighboring spans, using a learned parameter matrix S. We additionally add the individual scores from each two merging cells. Intuitively, these individual scores correspond to how likely each of the cells would exist in the final binary tree independently. The formula for the compatibility function (and its normalized form e) is defined as follows: e(i, j) = exp(ê(i, j)) î, ĵ∈{k} exp(ê( î, ĵ)) ê(i, j) = φ(ā(i), ā(j); S α ) + ē(i) + ē(j) Where the bilinear projection φ is defined as: φ(u, v; W ) = u ⊤ W v For the composition function a we used either a TreeLSTM (Tai et al., 2015) or a 2-layer MLP (see Appendix A.2 for more precise definitions on both methods). In order for the remainder of equations to remain agnostic to the choice of composition function, we refer to the function as Compose, which produces a hidden state vector h and, in the case of TreeLSTM, a cell state vector c, resulting in: a(i, j) = Compose α (ā(i), ā(j)) Outside Pass The outside computation is similar to the inside pass (depicted in Figure 2b ). The root node of the outside chart is learned as a bias. Descendant cells are predicted using a disambiguation over the possible outside contexts. Each component of the context consists of a sibling cell from the inside chart and a parent cell from the outside chart. The function f is analogous to the function e. It is normalized over constituent pairs i, j for the span k, and is used to disambiguate among the many outside contexts. The function b generates a phrase representation for the missing sibling cell. Equations for the outside computation follow: b(k) = i,j∈{k} f (i, j) b(i, j) f (k) = i,j∈{k} f (i, j) f (i, j) b(i, j) = Compose β (ā(i), b(j)) f (i, j) = φ(ā(i), b(j); S β ) + ē(i) + f (j) In the majority of our experiments, the Compose used in b shares parameters with a used in the inside pass, as do the compatibility functions ê and f (see §3.4 for results on the effects of parameter sharing). Training Objective To train our model we use an autoencoder-like language modeling objective. In a standard autoencoder, the entire input x is compressed into a single lower dimensional representation. This representation, z, is then decompressed and trained to reconstruct x. In our model, we never condition the reconstruction of x on a single z because the root's outside representation is initialized with a bias rather than the root's own inside vector. Instead, we reconstruct x conditioned on the many sub-tree roots, each of which is only a compression of a subset of the input. To approximate this reconstruction we use a max-margin loss considering a set {x * } of N negative examples that are sampled according to their frequency from the vocabulary (further details in Appendix A.1). The terminal outside vector b(i) is trained to predict its original input v i . The per-instance loss function is described in Equation 1 : L x = T −1 i=0 N −1 i * =0 max(0, 1 − b(i) • ā(i) + b(i) • ā(i * )) (1) The max-margin loss does not provide a gradient if the predicted vector is closer to its ground truth than the negative example by a margin greater than 1. For that reason, we also experimented with an objective based on cross-entropy, described in Equation 2 : Z * = N −1 i * =0 exp( b(i) • ā(i * )) L x = − T −1 i=0 log exp( b(i) • ā(i)) exp( b(i) • ā(i)) + Z * (2) DIORA CKY Parsing To obtain a parse with DIORA, we populate an inside and outside chart using the input sentence. We can extract the maximum scoring parse based on our single grammar rule using the CKY procedure (Kasami, 1966; Younger, 1967) . The steps for this procedure are described in Algorithm 1 and its runtime complexity in Appendix A.4. Experiments To evaluate the effectiveness of DIORA, we run experiments on unsupervised parsing, unsuper-Algorithm 1 Parsing with DIORA 1: procedure CKY(chart) Initialize terminal values. 2: for each k ∈ chart | SIZE(k) = 1 do 3: x k ← 0 Calculate a maximum score for each span, and record a backpointer. 4: for each k ∈ chart do 5: x k ← max i,j∈{k} [x i + x j + e(i, j)] 6: π i k , π j k ← arg max i,j∈{k} [x i + x j + e(i, j)] Backtrack to get the maximal tree. 7: procedure BACKTRACK(k) 8: if SIZE(k) = 1 then 9: return k 10: i ← BACKTRACK(π i k ) 11: j ← BACKTRACK(π j k ) 12: return (i, j) 13: return BACKTRACK(k ← root) vised segment recall, and phrase similarity. The model has been implemented in PyTorch (Team, 2018) and the code is published online. 3 For training details, see Appendix A.1. Unsupervised Parsing We first evaluate how well our model predicts a full unlabeled constituency parse. We look at two data sets used in prior work (Htut et al., 2018) , The Wall Street Journal (WSJ) section of Penn Treebank (Marcus et al., 1993) , and the automatic parses from MultiNLI (Williams et al., 2018b) . WSJ has gold human-annotated parses and MultiNLI contains automatic parses derived from a supervised parser (Manning et al., 2014) . In addition to PRPN (Shen et al., 2018 ), 4 we compare our model to deterministically constructed left branching, right branching, balanced, and random trees. We also compare to ON-LSTM (Shen et al., 2019) , an extension of the PRPN model, RL-SPINN (Yogatama et al., 2017) , an unsupervised shift-reduce parser, and ST-Gumbel (Choi et al., 2018) , an unsupervised chart parser. The latter two of these models are trained to predict the downstream task of natural language inference (NLI). Binarized WSJ and MultiNLI results For the full WSJ test set and MultiNLI datasets we follow the experimental setup of previous work (Williams et al., 2018a) . We binarize target trees using Stanford CoreNLP (Manning et al., 2014) and do not remove punctuation (experiments in §3.1.2 do remove punctuation). Latent tree models have been shown to perform particularly poorly on attachments at the beginning and end of the sequence (Williams et al., 2018a) . To address this, we incorporate a postprocessing heuristic (denoted as +PP in result tables) 5 . This heuristic simply attaches trailing punctuation to the root of the tree, regardless of its predicted attachment. In Table 1 , we see that DIORA +PP achieves the highest average and maximum F1 from five random restarts. This model achieves a mean F1 7 points higher than ON-LSTM and an increase of over 6.5 max F1 points. We also see that DIORA exhibits much less variance between random seeds than ON-LSTM. Additionally, we find that PRPN-UP and DIORA benefit much more from the +PP heuristic than PRPN-LM. This is consistent with qualitative analysis showing that DIORA and PRPN-UP incorrectly attach trailing punctuation much more often than PRPN-LM. On the MultiNLI dataset, PRPN-LM is the top performing model without using the +PP heuristic while DIORA matches PRPN-UP (Table 2 . Using the heuristic, DIORA greatly surpasses both variants of PRPN. However, it is worth noting that this is not a gold standard evaluation and instead evaluates a model's ability to replicate the output of a trained parser (Manning et al., 2014) . A second caveat is that SNLI (Bowman et al., 2015) and MultiNLI contain several non-newswire domains. Syntactic parsers often suffer significant performance drops when predicting outside of the newswire domain that the models were trained on. WSJ-10 and WSJ-40 results We also compare our models to two subsets of the WSJ dataset that were used in previous unsupervised parsing evaluations. WSJ-10 and WSJ-40 contain sentences up to length 10 and 40 respectively after punctuation removal. We do not binarize either of these two splits in order to compare to previous work (see Appendix A.3 details on WSJ split differences). Not binarizing the target trees sets an upper-bound on the performance of our models, denoted as UB in Table 3 . We compare against previous notable models for this task: CCM (Klein and Manning, 2002) uses the EM algorithm to learn probable nested bracketings over a sentence using gold or induced part-of-speech tags, and PRLG (Ponvert et al., 2011) performs constituent parsing through consecutive rounds of sentence chunking. In Table 3 , we see that DIORA outperforms the previous state of the art for WSJ-40, PRLG, in max F1. The WSJ-10 split has been difficult for latent tree parsers such as DIORA, PRPN, and ON-LSTM, none of which (including our model) are able to improve upon previous non-neural methods. However, when we compare trends between WSJ-10 and WSJ-40, we see that DIORA does a better job at extending to longer sequences. Unsupervised Phrase Segmentation In many scenarios, one is only concerned with extracting particular constituent phrases rather than a full parse. Common use cases would be identifying entities, noun phrases, or verb phrases for downstream analysis. To get an idea of how well our model can perform on phrase segmentation, we consider the maximum recall of spans in our predicted parse tree. We leave methods for cutting the tree to future work and instead consider the maximum recall of our model which serves as an upper bound on its performance. Recall here is the percentage of labeled constituents that appear in our predicted tree relative to the total number of constituents in the gold tree. These scores are separated by type and presented in Table 4 . In Table 4 we see the breakdown of constituent recall across the 10 most common types. DIORA achieves the highest recall across the most types and is the only model to perform effectively on verb-phrases. Interestingly, DIORA performs worse than PRPN-LM at prepositional phrases. Phrase Similarity One of the goals of DIORA is to learn meaningful representations for spans of text. Most language modeling methods focus only on explicitly modeling token representations and rely on ad-hoc postprocessing to generate representations for longer spans, typically relying on simple arithmetic functions of the individual tokens. To evaluate our model's learned phrase representations, we look at the similarity between spans of the same type within labeled phrase datasets. We look at two datasets. CoNLL 2000 (Tjong Kim Sang and Buchholz, 2000) For each of the labeled spans with length greater than one, we first generate its phrase representation. We then calculate its cosine similarity to all other labeled spans. We then calculate if the label for that query span matches the labels for each of the K most similar other spans in the dataset. In Table 5 we report precision@K for both datasets and various values of K. The first baseline we compare against produces phrase representations from averaging contextinsensitive (CI) ELMo vectors of individual tokens with the span. The second uses sentenceinsensitive (SI) ELMo vectors, running the full ELMo over only the relevant tokens and ignoring the rest of the sentence. We also look at ELMo's output when given the entire sentence. When analyzing our baselines that run the full ELMo, we follow the procedure described in (Peters et al., 2018b) and represent phrases as a function of its first and last hidden state. We extract these states from the final ELMo layer (3rd BiL-STM) as these consistently gave the best performance among other options. For DIORA, we use the concatenation of the inside and outside representations ([ā; b]). Label Count For CoNLL 2000, we find that our model outperforms all baselines for all values of K. This demonstrates DIORA's ability to capture and represent syntactic information within phrases. For CoNLL 2012, we find that DIORA outperforms both ELMo CI and ELMo SI while ELMo performs best overall. ELMo CI is surprisingly effective on this dataset even though it performed more poorly on CoNLL 2000. These results indicate that DIORA is capturing syntax quite well, but still has room to improve on more fine-grained semantic representations. Impact of Modeling Choices To test the impact of our modeling choices, we compared the performance of two different losses and four different composition functions on the full WSJ validation set. The losses were covered in Equations 1 (Margin) 2 (Softmax). The two primary methods of composition we considered were TreeLSTM (Tai et al., 2015) and MLP (a 2-hidden layer neural network). In addition, we experimented with a simple kernel of the MLP input [x; y; x ⊙ y; x − y] and with a setting where both the inside and outside parameters are shared. The results are shown in Table 6 . We see that MLP composition consistently performs better than with TreeLSTM, that MLP benefits from the Softmax loss, and that the best performance comes from sharing parameters. All other experimental results use this highly performant setting unless otherwise specified. The convoy of about 100 vehicles was the first to make deliveries to the capital in about 10 days The court ruled that the news media did n't reveal Twiggy 's problems at the time  The following month the company put itself up for sale The following month the company put itself up for sale He added that the U.S. has cut off aid to some rebel units when it was determined that those units broke the cease-fire He added that the U.S. has cut off aid to some rebel units when it was determined that those units broke the cease-fire We simply do n't agree with that or the findings of their investigation We simply do n't agree with that or the findings of their investigation CoNLL 2000 CoNLL 2012 Model Dim P@1 P@10 P@100 P@1 P@10 P@100 Table 5 : P@1, P@10, and P@100 for labeled chunks from CoNLL-2000 and CoNLL 2012 datasets. For all metrics, higher is better. The top value in each column is bolded. Diora uses the concatenation of the inside and outside vector at each cell which performed better than either in isolation. Qualitative Results Looking at our model's output, we see that some trees are an exact replication of the binarized ground truth (Fig. 3 ), or very close (Fig. 4 ). For future work we intend to explore common patterns in DIORA's learned structure, although some patterns are already recognizable, such as the affinity to group particles and verbs (Fig. 5 ). Related Work Latent Tree Learning A brief survey of neural latent tree learning models was covered in (Williams et al., 2018a) . The first positive result for neural latent tree parsing was shown in (Htut et al., 2018) , which used a language modeling objective. The model in (Liu et al., 2018) Neural Inside-Outside Parsers The Inside-Outside Recursive Neural Network (IORNN) (Le and Zuidema, 2014) is closest to ours. It is a graph-based dependency parser that uses beam search and can reliably find accurate parses when retaining a k-best list. In contrast, our model produces the most likely parse given the learned compatibility of the constituents. The Neural CRF Parser (Durrett and Klein, 2015) , similar to DIORA, performs exact inference on the structure of a sentence, although requires a set of grammar rules and labeled parse trees during training. DIORA, like Liu et al. (2018) , has a single grammar rule that applies to any pair of constituents and does not use structural supervision. Learning from Raw Text Unsupervised learning of syntactic structure has been an active research area (Brill et al., 1990) , including for unsupervised segmentation (Ando and Lee, 2000; Goldwater et al., 2009; Ponvert et al., 2011) and unsupervised dependency parsing (Spitkovsky et al., 2013) . Some models exploit the availability of parallel corpora in multiple languages (Das and Petrov, 2011; Cohen et al., 2011) . Others have shown that dependency parsing can be used for unsupervised constituency parsing (Spitkovsky et al., 2013; Klein and Manning, 2004) , or that it's effective to prune a random subset of possible trees (Bod, 2006) . These approaches aren't necessarily orthogonal to DIORA. For instance, our model may benefit when combined with an unsupervised dependency parser. Conclusion In this work we presented DIORA, an unsupervised method for inducing syntactic trees and representations of constituent spans. We showed inside-outside representations constructed with a latent tree chart parser and trained with an autoencoder language modeling objective learns syntactic structure of language effectively. In experiments on unsupervised parsing, chunking, and phrase representations we show our model is comparable to or outperforms previous methods, achieving the state-of-the-art performance on unsupervised unlabeled constituency parsing for the full WSJ (with punctuation), WSJ-40, and NLI datasets. We also show our model obtains higher segment recall than a comparable model and outperforms strong baselines on phrase representations on a chunking dataset. While the current model seems to focus primarily on syntax, future work can improve the model's ability to capture fine-grained semantics. Potential avenues include training larger models over much larger corpora, extra unsupervised or weakly-supervised phrase classification objectives, and other modeling enhancements. We are also eager to apply DIORA to other domains and languages which do not have rich linguistically annotated training sets. A.2 Composition and Input Transform TreeLSTM. The TreeLSTM (Tai et al., 2015) function produces a hidden state vector h and cell state vector c given two input vectors h i and h j .       x f i f j o u       =       σ σ σ σ tanh       U h i h j + b +       0 ω ω 0 0       c = c i ⊙ f i + c j ⊙ f j + x ⊙ u h = o + tanh(c) The constant ω is set to 1 for the inside, 0 for the outside. U and b are learned. MLP. MLP (Multi-Layer Perceptron) is a deep non-linear composition with the following form: h = W 1 (W 0 h i , h j + b) + b 1 The operator h i , h j is a concatenation [h i ; h j ]. For the MLP Kernel h i , h j is more involved to support further interaction between the two input vectors [h i ; h j ; h i ⊙ h j ; h i − h j ]. The variables W 0 , W 1 , b, b 1 are learned and c is unused. A.3 Reproducing Parsing Results In Table 7 , we've organized a reference for creating various splits of the WSJ for the purpose of evaluating unsupervised parsing. Some splits use only the test set (section 23), others use all of the training, validation, and test data. Optionally, punctuation is stripped and sentences greater than a specified length are ignored. Predictions can be compared to the full parse trees in the annotated data, or to a binarized version. The PARSEVAL specification calculated bracketing F1 considering all spans, although some previous work diverts from PARSEVAL and ignores spans that are trivially correct (ones over the entire sentence). A.4 Runtime Complexity The runtime complexities for DIORA's methods are shown in Table 8 . The parallel column represents the complexity when the values for all constituent pairs are computed simultaneously, assuming that these computations are independent and do not depend on values that have yet to be computed. Linear complexity is theoretically feasible depending on batch size, input length, and number of computational cores. In practice, one might experience super-linear performance. Although both the inside pass and outside pass have an upper bound of n 3 operations, the outside pass will have more operations than the inside pass for sentences of length > 1. As a point of reference, our implementation computes the loss over the entire WSJ corpus in 5 minutes 30 seconds at a rate of 3,500 words per second using a single GPU. Method Serial Parallel Inside Pass O(n 3 ) O(n) Outside Pass O(n 3 ) O(n) Training Objective O(n • N ) O(n) CKY O(n 3 ) O(n) A.5 Parse Trees Examples of parse trees derived from the compatibility scores are shown in Figures 6 and 7 . Some punctuation has been removed for readability. In addition a big loan that First Boston made to Ohio Mattress Co was n't repaid on time when its 450 million junk financing for a buy-out of the bedding company was withdrawn In addition a big loan that First Boston made to Ohio Mattress Co was n't repaid on time when its 450 million junk financing for a buy-out of the bedding company was withdrawn In its latest compilation of performance statistics Moody 's Investors Service found that investment-grade bonds posted a total return of 2.7 % in October while junk bonds showed a negative return of 1.5 % In its latest compilation of performance statistics Moody 's Investors Service found that investment-grade bonds posted a total return of 2.7 % in October while junk bonds showed a negative return of 1.5 % Within a year Kao Corp. a major cosmetics company plans to eliminate 1,000 clerical jobs by putting on a central computer network some work such as credit reports currently performed in 22 separate offices Within a year Kao Corp. a major cosmetics company plans to eliminate 1,000 clerical jobs by putting on a central computer network some work such as credit reports currently performed in 22 separate offices Authorities at London 's Heathrow Airport are investigating the disappearance of a Paul Gauguin watercolor Young Tahitian Woman in a Red Pareo that has two sketches on its verso -LRB-opposite -RRB-side Authorities at London 's Heathrow Airport are investigating the disappearance of a Paul Gauguin watercolor Young Tahitian Woman in a Red Pareo that has two sketches on its verso -LRB-opposite -RRB-side But in its ruling last April the New York court said that all producers of the anti-miscarriage drug should share liability when the manufacturer of a specific dose ca n't be determined But in its ruling last April the New York court said that all producers of the anti-miscarriage drug should share liability when the manufacturer of a specific dose ca n't be determined The Fed said the Comptroller of the Currency is expected to begin a Community Reinvestment Act examination of First Union 's Florida and North Carolina banking units in the next two weeks The Fed said the Comptroller of the Currency is expected to begin a Community Reinvestment Act examination of First Union 's Florida and North Carolina banking units in the next two weeks The appeals-court decision last year was particularly surprising because the same court had dismissed a similar case in 1970 involving singer Nancy Sinatra and a tire ad also a Young & Rubicam product The appeals-court decision last year was particularly surprising because the same court had dismissed a similar case in 1970 involving singer Nancy Sinatra and a tire ad also a Young & Rubicam product The resulting # 1.9 billion merchandise trade deficit was partly offset by an assumed surplus of # 300 million in so-called invisible items which include income from investments services and official transfers The resulting # 1.9 billion merchandise trade deficit was partly offset by an assumed surplus of # 300 million in so-called invisible items which include income from investments services and official transfers For the third quarter net premiums were 742 million up 9.6 % from 677 million in last year 's quarter because of the expiration of the National Indemnity quota share reinsurance agreement For the third quarter net premiums were 742 million up 9.6 % from 677 million in last year 's quarter because of the expiration of the National Indemnity quota share reinsurance agreement  The three units are a nationwide pharmaceutical and health-products distributor a small sporting-goods chain and a combination catalog showroom and toy-store chain The three units are a nationwide pharmaceutical and health-products distributor a small sporting-goods chain and a combination catalog showroom and toy-store chain Acknowledgements We are grateful to Carolyn Anderson, Adina Williams, Phu Mon Htut, and our colleagues at UMass for help and advice, and to the UMass NLP reading group and the anonymous reviewers for feedback on drafts of this work. This work was supported in part by the Center for Intelligent Information Retrieval, in part by the National Science Foundation (NSF) grant numbers DMR-1534431, IIS-1514053 and CNS-0958392. Any opinions, findings and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect those of the sponsor. On Tuesday the House approved a labor-backed amendment that would require the Transportation Department to reject airline acquisitions if the person seeking to purchase a carrier had run two or more airlines previously that have filed for protection from creditors under Chapter 11 of the federal Bankruptcy Code On Tuesday the House approved a labor-backed amendment that would require the Transportation Department to reject airline acquisitions if the person seeking to purchase a carrier had run two or more airlines previously that have filed for protection from creditors under Chapter 11 of the federal Bankruptcy Code There is also speculation that Mr. Newhouse could bring in a powerhouse businessman or another Newhouse family member to run the business side in combination with a publishing executive like Robert Gottlieb who left Random House 's Alfred A. Knopf to run the New Yorker also owned by the Newhouse family There is also speculation that Mr. Newhouse could bring in a powerhouse businessman or another Newhouse family member to run the business side in combination with a publishing executive like Robert Gottlieb who left Random House 's Alfred A. Knopf to run the New Yorker also owned by the Newhouse family The Warner Bros. studio and Sony signaled they are close to a settlement yesterday asking a Los Angeles Superior Court to postpone a hearing scheduled for tomorrow on Warner 's request for a preliminary injunction blocking Mr. Guber and Mr. Peters from taking the top posts at Columbia Pictures Entertainment Inc The Warner Bros. studio and Sony signaled they are close to a settlement yesterday asking a Los Angeles Superior Court to postpone a hearing scheduled for tomorrow on Warner 's request for a preliminary injunction blocking Mr. Guber and Mr. Peters from taking the top posts at Columbia Pictures Entertainment Inc Rep. Edwards the California Democrat is one who pledges that he would immediately challenge Mr. Bush in the courts arguing a line-item veto would expand a president 's powers far beyond anything the framers of the Constitution had in mind Rep. Edwards the California Democrat is one who pledges that he would immediately challenge Mr. Bush in the courts arguing a line-item veto would expand a president 's powers far beyond anything the framers of the Constitution had in mind The Merc received considerable criticism in 1987 when it was discovered that its compliance director Kevin P. Conway who then was responsible for policing the exchange 's busy oil and metal pits was engaged in other personal business activities on Exchange time including out-of-state trips according to a New York Merc report prepared last year The Merc received considerable criticism in 1987 when it was discovered that its compliance director Kevin P. Conway who then was responsible for policing the exchange 's busy oil and metal pits was engaged in other personal business activities on Exchange time including out-of-state trips according to a New York Merc report prepared last year For example one of my favorite movies is the 1949 British comedy Kind Hearts and Coronets in which the entire comedy is based on actor Dennis Price 's murdering eight titled relatives -LRB-all played by Alec Guinness -RRB-because they snubbed his mother and stand in the way of his acquiring the family title For example one of my favorite movies is the 1949 British comedy Kind Hearts and Coronets in which the entire comedy is based on actor Dennis Price 's murdering eight titled relatives -LRB-all played by Alec Guinness -RRB-because they snubbed his mother and stand in the way of his acquiring the family title The leveraged buy-out firm of Kohlberg Kravis Roberts & Co. which owns 46 % of the common equity of SCI TV indicated in the debt plan that it would reduce its equity stake to 15 % giving the rest of its stake to bondholders in the restructuring The leveraged buy-out firm of Kohlberg Kravis Roberts & Co. which owns 46 % of the common equity of SCI TV indicated in the debt plan that it would reduce its equity stake to 15 % giving the rest of its stake to bondholders in the restructuring Recognition also said it obtained a commitment from Chemical Bank and Bank of Boston to convert an estimated 18 million in bank debt to a new 24-month secured term loan to be repaid through the sale of certain assets Recognition also said it obtained a commitment from Chemical Bank and Bank of Boston to convert an estimated 18 million in bank debt to a new 24-month secured term loan to be repaid through the sale of certain assets The prices of cattle and hog futures contracts dropped sharply because traders speculated that the stock market plunge Friday will linger in the minds of U.S. consumers long enough to prompt them to rein in their spending at the supermarket which would hurt demand for beef and pork The prices of cattle and hog futures contracts dropped sharply because traders speculated that the stock market plunge Friday will linger in the minds of U.S. consumers long enough to prompt them to rein in their spending at the supermarket which would hurt demand for beef and pork",
    "abstract": "We introduce deep inside-outside recursive autoencoders (DIORA), a fully-unsupervised method for discovering syntax that simultaneously learns representations for constituents within the induced tree. Our approach predicts each word in an input sentence conditioned on the rest of the sentence and uses inside-outside dynamic programming to consider all possible binary trees over the sentence. At test time the CKY algorithm extracts the highest scoring parse. DIORA achieves a new state-of-the-art F1 in unsupervised binary constituency parsing (unlabeled) in two benchmark datasets, WSJ and MultiNLI. * Equal contribution, randomly ordered. Under the current circumstances he says their scenario no longer seems unrealistic",
    "countries": [
        "United States"
    ],
    "languages": [],
    "numcitedby": "74",
    "year": "2019",
    "month": "June",
    "title": "Unsupervised Latent Tree Induction with Deep Inside-Outside Recursive Auto-Encoders"
}