{
    "article": "This paper investigates the influences of three different reading styles (Lyric,   Critical and Explanatory)  to the distribution tendency of sentential accents (classified as rhythmic accent and semantic accent). The comparison among multiple styles is performed in three research domains: high-level constructions, low-level phrases and disyllabic prosodic words. One finds that the assignment of semantic accents shows some differences across reading styles, while the assignment of rhythmic accents does not. Furthermore, the larger the speech unit studied, the stronger the influence is observed, i.e. most differences in the assignment of semantic accents are shown in high-level constructions, some are shown in low-level phrases, and none are shown in prosodic words across the three reading styles. Compared with previous studies, the allocation scheme of semantic accents in the Explanatory style is close to that in the neutral style, i.e. in high-level constructions, it has a final-accented tendency in theme + rheme (TR), predicate + object(PO) and subject + predicate(SP) constructions, and uniform distribution in adjunct + head constructions. In low-level phrases, the Explanatory style exhibits an initial-accented tendency in adjunct + head phrases, but a final-accented tendency in subject + predicate (SP) phrases and predicate + object (PO) phrase. The Critical style is adopted to make comments, where semantic focal points are normally on the core subjects and their actions. As a result, more accents are allocated to the subject part in the AS constructions and to the predicate part in the PO constructions. Accordingly, in low-level phrases, more accents go to the heads 1 The work was carried out as an intern in Microsoft Research Asia. Introduction Stress has been defined as \"the degree of force\" in terms of speech production [Jones 1976 ] or as \"the degree of loudness\" from the viewpoint of speech perception [Trager and Smith 1951] . It has been ranked into different levels of hierarchy, on the top of which is the most salient one, the sentential accent [Zhong and Yang 1999] . In natural speech, sentential accent is distributed to a part of a sentence which is perceived to be more salient than the rest of the sentence. Within the salient part, the sentential accent is assigned to smaller units, first to phrases and words and then to specific syllables. In stress languages, such as English, each word has a primary stress. When the sentence accent is assigned to a polysyllabic word, it is usually obtained by the syllable that holds the primary stress. In tonal languages, such as Mandarin, word stress is usually said to be less salient. According to Chinese phonologists, syllables with four normal tones are all stressed, compared to neutralized syllables. However, from the viewpoint of phonetics, the prominent degree of the \"phonologically stressed\" syllables varies in polysyllabic words, phrases or sentences. Chao [1979] argued that, in a prosodic unit (a word or a phrase) followed by a pause, the final syllable was primarily accented, the initial one was secondly accented and others in between were weaker than these two. Lin et al.'s [1984] experimental study indicated that in most isolated disyllabic words, the final syllables were stressed more heavily than the initial ones. Sentence accent has been described differently in previous works due to the definition used in the given work. All of these definitions can be classified into two groups if the function of the accent in delivering messages is considered the main factor. Generally speaking, normal accent defined by Newman [1946] and Zhao [1933] , or grammar accent defined by Bolinger [1972] and Chomsky [1968] , reflecting syntactic or prosodic structures, is predictable with grammatical [Ye 2001 ] or phonological rules [Luo and Wang 1981] . Contrastive accent, emphatic accent [Lehiste 1970 ] and logical accent, expressing speaker 's special intentions, are hard to be predicted without a deep understanding of the context. Recently, Chu, Wang, and He studied the accent assignment in Mandarin experimentally. First, they proposed to classify the accents in Mandarin into rhythmic accent (RA) and semantic accent (SA) [Chu et al. 2003 ]. The former serves the function of illustrating the rhythmic structure of an utterance and the later of making the speaker 's opinion or intention prominent. In their works, two experiments were conducted in a speech corpus that contained 300 isolated sentences. In the first experiment, three experts went through the 300 sentences together to identify all accented syllables in the corpus and tagged them as either semantically or rhythmically accented. In order to validate such a classification, they conducted a second experiment. Sixty Mandarin native speakers participated in the experiment. In the results, a relative prominent-level was obtained for each syllable in each sentence. When the results from the two experiments were compared, they found that the syllables tagged as the semantically accented had significantly higher prominent-level than those tagged as rhythmically accented. Both types of accented syllables had much higher prominent-level than the unaccented syllables. Furthermore, some syllables judged as to have both the semantic and the rhythmic accents in the first experiment achieved the highest prominent-level in the second experiment. All these results supported the separation of semantic accent from rhythmic accent. In the follow-up studies [Wang et al. 2003a, b] , they found that the rhythmic accent tended to be assigned to the final syllable within a prosodic word and a prosodic phrase , while no patterns were found for the distribution of semantic accent. Later, in a study of semantic accents alone, Wang et al. [2003c] found that the distribution tendency of semantic accent changed with the speech unit studied. For example, in a low-level phrase or a prosodic word, semantic accent was often found in the modifiers when it had a modifier-head structure. However, such a tendency did not show up in high-level constructions. Conclusions in [Chu et al. 2003; Wang et al. 2003a, b, c] were drawn from the observation of independent sentences read with a neutral intonation. In this paper, the authors extend the study into affective speech. The accent assignment tendency is compared among three reading styles to find out whether reading styles have any influence on accent assignment in the research domains of prosodic words, low-level phrases and high-level constructions. Data Preparing and Processing The Speech Corpus Seven articles were selected for this study, in which, two were lyric essays by famous Chinese writers, two were remarks on a newly-published novel and a newly-drawn policy, and three were objective illustrations about the weather, the stock market and a new law, respectively. These articles were read by the same voice talent who also read the independent sentences studied in Wang, Chu, and He's works. Unlike previous recording sessions where the voice talent was asked to read sentences with a neutral intonation, this time, she was requested to choose a proper reading style for each type of article according to her understanding of these articles. According to the voice talent, she used different reading styles for the three groups of articles. These styles could be discriminated by listeners in an informal listening test though they could not give a clear linguistic term for each type. In this paper, the authors name the three reading styles as Lyric, Critical and Explanatory, respectively. The difference in speech rate shown in Table 1 is an acoustic support for the division of the reading styles [Fackrell et al. 2000 ]. The Lyric style was presented the slowest, the Critical style the fastest, and the Explanatory style in the middle. Annotation of Accents The locations and types of accents within the seven articles were annotated by two graduate students majoring in linguistics, who were interested in phonetics. After listening to the recordings, they were asked to identify all accents in the speech corpus and assign a type (rhythmic, semantic or both) to each with the same guidelines (listed in Table 2 ) that were used in Wang, Chu, and He's studies on accent assignment in neutral sentences [Chu et al. 2003; Wang et al. 2003a, b, c] . Table 2. Guidelines for identifying accents and their types 1. Annotators can listen to a sentence as many times as they want; 2. At least one accent should be labeled in each sentence, and it can be semantically accented, rhythmically accented or both; 3. Multiple accents are allowed in one utterance and there is no hard threshold for the maximum number per utterance. Before the formal annotation, the two annotators were trained with a subset of materials annotated in previous studies [Chu et al. 2003; Wang et al. 2003a, b, c] . The training took two steps, annotation and discussion to improve the across-person agreement. First, they annotated accents independently according to the definitions and guidelines given in [Chu et al. 2003 ]. The initial agreement-ratio on both the location and the type of accents was only 56.4%. Then, they discussed all of the differences and got access to the annotation obtained in the previous works. After the discussion, they achieved agreement on most of the different cases. Finally, they labeled another subset of the isolated sentences independently. This time, the agreement-ratio increased to 67.6%. Such a training cycle was repeated three times. The first training session brought about an 11% increase in agreement. However, the second and the third sessions did not bring much improvement. The highest agreement-ratio achieved was about 70%. Since the agreement-ratio was not as high as expected, the authors will keep the discussion part for the annotation of the new corpus. The two annotators labeled accents in the seven articles independently first and discussed cases where different opinions appeared. For a few cases where they could not agree with each other, a third person was invited to make the final decision. As a result, each syllable in the seven articles obtained one of the four accent labels, UAunaccented, SAsemantic accented, RArhythmic accented, SRAsemantic and rhythmic accented. Annotation of Syntactic Structure In Chinese, many syntactic structures in the sentences level can be used recursively to construct phrases and words. In previous works, it was found that the accent assignment has different tendencies in different levels of constituents in the neutral reading style. In this work, the accent assignment under different reading styles is studied in the same three levels, including the high-level construction, the low-level phrase and the prosodic word. The anchors for the three constituents are the top chunks, the prosodic words, and the syllables in a sentence. High Level Construction The largest speech unit the authors are interested in is the high-level construction, and the anchor for identifying a high-level phrase is the top chunk of the sentence. First, a sentence is chunked into several linearly succeeding components, including ① sentence adjunct ； ②subject adjunct; ③ subject; ④predicate adjunct; ⑤predicate; ⑥ object adjunct; and ⑦object. Then, immediate constructions that are formed by these chunks are identified and labeled as one of the following structures: ①TRtheme + rheme; ②POpredicate + object; ③SPsubject + predicate; ④AOadjunct + object; ⑤ASadjunct + subject; ⑥APadjunct + predicate. The authors will discuss which parts of certain types of construction tend to be accented in different reading styles. An example of the top chunk level annotation is shown in Figure 1 (a) . Low Level Phrase The second speech unit investigated was the low-level phrase, the anchor of which is prosodic words in a sentence. The authors wanted to find out whether the rules for accent assignments in low-level phrases are the same as those used in high-level constructions, and whether speaking styles exert the same effect on them. First, the authors scanned each prosodic word in a sentence from left to right and identified the immediate carrying phrase of the target word. Then, the structure of this phrase was analyzed, and the target word was labeled with its role in the carrying phrase. Seven types of structures were annotated for the low-level phrases, which are ①SPsubject + predicate；②ANattribute + noun head; ③ PCpredicate + complement; ④AVadverbial + verb head; ⑤POpredicate + object; ⑥COcoordinative construction; ⑦ PPpreposition phrase. The role of each word in its immediate carrying phrase was labeled as the \"attribute in AN\" or the \"verb in AV\", etc. An example is given in Figure 1 (b) where the prosodic word \"高处\" is an \"attribute in AN\" in its carrying phrase \"高处丛生的灌木\" and the prosodic word \"丛生的\" is the \"attribute in AN\" in its carrying phrase \"丛生的灌木\". By comparing the frequency of how often the \"attribute in AN\" receives accents with that of the \"head in AN\", one can figure out the accent assignment tendency in AN phrases. ( Prosodic Word The third level of speech unit studied was the prosodic word. In this paper, the authors only focus on disyllabic words since they are the most common Chinese words. The same seven types of syntactic structure used in Section 2.3.2 are annotated for words and an example is shown in Figure 1 (c ). In the next section, the authors compare accent assignment tendency in the three level units among the three reading styles respectively. Indicators for Accent Assignment Since no limitation has been put on the total number of accents per sentence, it is possible that more than one word in a top chunk is accented. Therefore, the comparison between the numbers of accented words in the two immediate chunks of a high-level construction does not tell the accent tendency directly (i.e. which part of the construction tends to receive accents). Similarly, in low-level phrases, the total number of words in one type of constituents is often different from that of the other type of constituents. For example, in Figure 1 (b), there are 4 \"attri. in AN\" while only two \"head in AN\" in low level phrases. Thus, the ratio of the number of accented words in \"attri. in AN\" class to that in the \"head in AN\" class does not directly reflect the accent tendency either (e.g., the ratio is 2:1, if accents are distributed normally among all words). To describe the accent tendency in a better way, an accent indicator (AI) is defined as the ratio of the number of obtained accents to the expected number of accents in a certain class of words as in (1). It shows the possibility for a class of chunks or words to obtain sentential accents. AI=N r / N p (1) N r is the number of accents obtained by a class of words and N p is the expected number of accents for the class under the assumption that all accents are distributed normally among all syllables in the corpus. N p is calculated by ( 2 ) and (3). N p = N w × P (2) P= N s / N a ( 3 ) N a is the number of syllables in the corpus, while N s is the number of accented syllables in it. P indicates the possibility of a syllable to obtain a sentential accent under the assumption of normal distribution. N w is the number of syllables in a class studied. AI>1 means that the possibility for the corresponding class to obtain accents is above the average, i.e. it tends to obtain more sentential accents. AI < 1 means the opposite and AI = 1 means it has the average possibility of being accented. To illustrate the accent tendency within a certain construction, i.e. to answer the question of which part between the two immediate constituents of a construction is more often to be accented, an accent indicator ratio (AIR) is defined as the ratio of the AI of the initial component to that of the final. AIR>1 describes an initial-accented tendency, while AIR<1 argues for a final-accent tendency. AIR=1 means the two components within the construction have equal chance to be accented. Since the initial parts of disyllabic words always share the same number of syllables as the final parts, AI is not needed in studying disyllabic words. AIR is defined as the ratio of the number of accented syllables in the two parts for a given word category. Results and Analyses The AI and AIR described in subsection 2.4 are calculated for the three prosodic units and the results for the three reading styles are compared in subsection 3.1, 3.2 and 3.3, respectively. Accent Assignment in High Level Constructions AIs of semantic accents (SA) in the six types of sentence constructions are calculated for the three reading styles in Table 3 (a). The corresponding AIRs in each type of construction are given in Table 3 (b). From the two tables, a weak final-accented tendency ( AIR<1) is observed in TR, PO and SP constructions in most reading styles, i.e., when semantic accents are assigned to these constructions, it often goes to the rhemes, objects, or predicates. This observation tallies with the previous findings in neutral speech. Some exceptions lie in the TR, SP constructions under the Lyric style and the PO construction under the Critical style, where semantic accents are uniformly distributed. When looking into the constructions with adjunct + head structures (AO, AS and AP), one finds that semantic accents have different tendencies under different reading styles. For example, adjuncts in noun-head phrases (AO and AS) tend to be accented in the Critical style, while, in the Lyric style, all heads tend to be accented. The Explanatory style shows no strong tendency in both AO and AP phrases and has initial-accented tendency in AS phrases. Compared with the results in the previous study of neutral speech, The Explanatory style shows most similarity tendency to the neutral style. AIs and AIRs of rhythmic accents (RA) in the six constructions are calculated for the three reading styles in    For rhythmic accent, a final-accented tendency is observed unanimously in Table 4 (d), regardless of reading styles. This is consistent with the conclusions drawn from independent neutral sentences [Chu et al. 2003 ] [Wang et al. 2003b] , and it further demonstrates that the final-accented tendency of rhythmic accent is not influenced by reading styles. An interesting phenomenon is presented in that SP phrases in all reading styles always have the largest AIRs among all types of phrases, i.e., the final-accented tendency is comparatively weak in SP phrases. A possible reason is that, when words are grouped into prosodic phrases, the relationship between the subjects and the predicates in SP phrases is not as close as in other phrases so the two components are often grouped into different prosodic phrases [Wang et al. 2003c ]. Accent Assignment in Disyllabic Prosodic Words Since initial parts of disyllabic words share the same number of syllables as final parts, no AI is adopted. AIRs are calculated for word types with more than 10 observations in the speech corpus. The results are listed in Table 5 , in which, (a) is for semantic accent and (b) is for rhythmic accent. Conclusions and Discussions This paper investigates the influence of reading styles on the accent assignment within high-level constructions, low-level phrases and prosodic words. The results show that (1) semantic accents are more affected by reading styles than rhythmic accents and (2) more significant influences are observed in larger speech units (such as the high-level constructions and the low-level phrases) than in smaller units (such as prosodic words). In detail, These results are consistent with the theory of ornate form [Milic 1965 ]: to deliver the attitude of a speaker through speaking styles. Listeners and speakers share an accent system as a convention in which listeners know to go to accented items to find information which the speaker is particularly attentive to produce. Therefore, semantic accent is more closely related to reading styles and easier to be influenced. In the Explanatory style, the speaker's task is to present messages clearly and concisely with an objective tone. This is also a regular way to deliver independent neutral sentences where syntactic constraints work actively. Therefore, the overall tendency for semantic accent assignment in this style is rather close to that in neutral style and is mainly constrained by the syntactic and the prosodic structures of a sentence. The Critical style is adopted to make comments, where semantic focuses are normally on the core subjects and their actions. As a result, more accents are allocated to the subject part in the AS constructions and to the predicate part in the PO constructions. Accordingly, in low-level phrases, more accents go to the heads in AN phrases and the predicates in the SP phrase. However, in AV phrases, both the adjuncts and the verbs have equal chance to be accented. A possible reason for this is that the manners for actions to take place sometimes also play an important role in the discourse. The authors do not have a good explanation for why accents tend to be allocated to the objects in PO phrases. The Lyric style helps to express personal emotions in a rhythmic way [Wang 2000 ]. Such poetry-like rhythm weakens the effect of syntactic constrains and, in many cases, leads to an even distribution of semantic accents in high-level constructions. For low-level phrases, more semantic accents are observed near prosodic boundaries to meet the requirement of rhyme-scheme, and accordingly final-accented tendencies are presented in AN and AV phrases.",
    "abstract": "This paper investigates the influences of three different reading styles (Lyric,   Critical and Explanatory)  to the distribution tendency of sentential accents (classified as rhythmic accent and semantic accent). The comparison among multiple styles is performed in three research domains: high-level constructions, low-level phrases and disyllabic prosodic words. One finds that the assignment of semantic accents shows some differences across reading styles, while the assignment of rhythmic accents does not. Furthermore, the larger the speech unit studied, the stronger the influence is observed, i.e. most differences in the assignment of semantic accents are shown in high-level constructions, some are shown in low-level phrases, and none are shown in prosodic words across the three reading styles. Compared with previous studies, the allocation scheme of semantic accents in the Explanatory style is close to that in the neutral style, i.e. in high-level constructions, it has a final-accented tendency in theme + rheme (TR), predicate + object(PO) and subject + predicate(SP) constructions, and uniform distribution in adjunct + head constructions. In low-level phrases, the Explanatory style exhibits an initial-accented tendency in adjunct + head phrases, but a final-accented tendency in subject + predicate (SP) phrases and predicate + object (PO) phrase. The Critical style is adopted to make comments, where semantic focal points are normally on the core subjects and their actions. As a result, more accents are allocated to the subject part in the AS constructions and to the predicate part in the PO constructions. Accordingly, in low-level phrases, more accents go to the heads 1 The work was carried out as an intern in Microsoft Research Asia.",
    "countries": [
        "United States"
    ],
    "languages": [
        "Mandarin",
        "Mandarin",
        "Chinese"
    ],
    "numcitedby": "1",
    "year": "2007",
    "month": "March",
    "title": "The Influence of Reading Styles on Accent Assignment in {M}andarin"
}