{
    "article": "The paper develops a constraint-based theory of prosodic phrasing and prominence, based on an HPSG framework, with an implementation in ALE. Prominence and juncture are represented by n-ary branching metrical trees. The general aim is to define prosodic structures recursively, in parallel with the definition of syntactic structures. We address a number of prima facie problems arising from the discrepancy between syntactic and prosodic structure Introduction This paper develops a declarative treatment of prosodic constituents within the framework of constraintbased phonology, as developed for example in (Bird, 1995; Mastroianni and Carpenter, 1994) . On such an approach, phonological representations are encoded with typed feature terms. In addition to the representational power of complex feature values, the inheritance hierarchy of types provides a flexible mechanism for classifying linguistic structures, and for expressing generalizations by means of type inference. To date, little work within constraint-based phonology has addressed prosodic structure above the level of the foot. In my treatment, I will adopt the following assumptions: 1. Phonology is induced in parallel with syntactic structure, rather than being mapped from prebuilt parse trees. 2. Individual lexical items do not impose constraints on their neighbour's phonology. The first of these assumptions ensures that phonology is compositional, in the sense that the only information available when assembling the phonology of a complex constituent is the phonology of that constituents daughters. The second assumption is one that is standardly adopted in HPSG (Pollard and Sag, 1994) , in the sense that heads can be subcategorized with respect to the syntactic and semantic properties of their arguments (i.e., their arguments' synsem values), but not with respect to their arguments' phonological properties. Although I am not convinced that this restriction is correct, it is worthwhile to explore what kinds of phonological analyses are compatible with it. Most of the data used in this paper was drawn from the SOLE spoken corpus (Hitzeman et al., 1998) . 1 The corpus was based on recordings of one speaker reading approximately 40 short descriptive texts concerning jewelry. Syntactic and Prosodic Structure Metrical Trees Metrical trees were introduced by Liberman (1977) as a basis for formulating stress-assignment rules in both words and phrases. Syntactic constituents are assigned relative prosodic weight according to the following rule: (1) NSR: In a configuration [ C A B], if C is a phrasal category, B is strong. Prominence is taken to be a relational notion: a constituent labelled 's' is stronger than its sister. Consequently, if B in (1) is strong, then A must be weak. In the case of a tree like (2), Liberman and Prince's (1) yields a binary-branching structure of the kind illustrated in (3) (where the root of the tree is unlabeled): (2 1 The task of recovering relevant examples from the SOLE corpus was considerably aided by the Gsearch corpus query system (Corley et al., 1999) . For any given constituent analysed by a metrical tree t, the location of its main stress can be found by tracing a path from the root of t to a terminal element α such that all nodes on that path are labelled 's'. Thus the main stress in (3) is located on the element cloak. In general, the most prominent element, defined in this way, is called the Designated Terminal Element (DTE) (Liberman and Prince, 1977) . ) VP V fasten NP Det a N cloak Note that (1) is the metrical version of Chomsky and Halle's (1968) Nuclear Stress Rule (NSR), and encodes the same claim, namely that in the default case, main stress falls on the last constituent in a given phrase. Of course, it has often been argued that the notion of 'default prominence' is flawed, since it supposes that the acceptability of utterances can be judged in a null context. Nevertheless, there is an alternative conception: the predictions of the NSR correctly describe the prominence patterns when the whole proposition expressed by the clause in question receives broad focus (Ladd, 1996) . This is the view that I will adopt. Although I will concentrate in the rest of the paper on the broad focus pattern of intonation, the approach I develop is intended to link up eventually with pragmatic information about the location of narrow focus. In the formulation above, (1) only applies to binary-branching constituents, and the question arises how non-binary branching constituent structures (e.g., for VPs headed by ditranstive verbs) should be treated. One option (Beckman, 1986; Pierrehumbert and Beckman, 1988; Nespor and Vogel, 1986 ) would be to drop the restriction that metrical trees are binary, allowing structures such as Fig 1 . Since the nested structure which results from binary branching appears to be irrelevant to phonetic interpretation, I will use n-ary metrical trees in the following analysis. In this paper, I will not make use of the Prosodic Hierarchy (Beckman and Pierrehumbert, 1986; Nespor and Vogel, 1986; Selkirk, 1981; Selkirk, 1984) . Most of the phenomena that I wish to deal with lie in the blurry region (Shattuck-Hufnagel and Turk, 1996) between the Phonological Word and the Intonational Phrase (IP), and I will just refer to 'prosodic constituents' without committing myself to a specific set of labels. I will also not adopt the Strict Layer Hypothesis (Selkirk, 1984) which holds that elements of a given prosodic category (such as Intonational Phrase) must be exhaustively analysed into a sequence of elements of the next lower category (such as Phonological Phrase). However, it is important to note that every IP will be a prosodic constituent, in my sense. Moreover, my lower-level prosodic constituents could be identified with the ϕ-phrases of (Selkirk, 1981; Gee and Grosjean, 1983; Nespor and Vogel, 1986; Bachenko and Fitzpatrick, 1990) , which are grouped together to make IPs. Representing Prosodic Structure I shall follow standard assumptions in HPSG by separating the phonology attribute out from syntaxsemantics (SYNSEM): (4) feat-struc PHON pros SYNSEM synsem The type of value of PHON is pros (i.e., prosody). In this paper, I am going to take word forms as phonologically simple. This means that the prosodic type of word forms will be maximal in the hierarchy. The only complex prosodic objects will be metrical trees. The minimum requirements for these are that we have, first, a way of representing nested prosodic domains, and second, a way of marking the strong element (Designated Terminal Element; DTE) in a given domain. Before elaborating the prosodic signature further, I need to briefly address the prosodic status of monosyllabic function words in English. Although these are sometimes classified as clitics, Zwicky (1982) proposes the term Leaners. These \"form a rhythmic unit with the neighbouring material, are normally unstressed with respect to this material, and do not bear the intonational peak of the unit. English articles, coordinating conjunctions, complementizers, relative markers, and subject and object pronouns are all leaners in this sense\" (Zwicky, 1982, p5) . Zwicky takes pains to differentiate between Leaners and clitics; the former combine with neighbours to form Phonological Phrases (with juncture characterized by external sandhi), whereas clitics combine with their hosts to form Phonological Words (where juncture is characterized by internal sandhi). Since Leaners cannot bear intonational peaks, they cannot act as the DTE of a metrical tree. Consequently, the value of the attribute DTE in a metrical tree must be the type of all prosodic objects which are not Leaners. I call this type full, and it subsumes both Prosodic Words (of type p-wrd) and metrical trees (of type mtr). Moreover, since Leaners form a closer juncture with their neighbours than Prosodic Words do, we distinguish two kinds of metrical tree. In a tree of type full-mtr, all the daughters are of type full, whereas in a tree of type lnr-mtr, only the DTE is of type full. In terms of the attribute-value logic, we therefore postulate a type mtr of metrical tree which introduces the feature DOM (prosodic domain) whose value is a list of prosodic elements, and a feature DTE whose value is a full prosodic object: Notice that in the constraint for objects of type lnr-mtr, ¨is the operation of appending two lists. Since elements of type pros can be word-forms or metrical trees, the DOM value in a mtr can, in principle, be a list whose elements range from simple word-forms to lists of any level of embedding. One way of interpreting this is to say that DOM values need not obey the Strict Layer Hypothesis (briefly mentioned in Section 2.1 above). To illustrate, a sign whose phonology value corresponded to the metrical tree (6) (where the word this receives narrow focus) would receive the representation in Fig 3. Associating Prosody with Syntax In this section, I will address the way in which prosodic constituents can be constructed in parallel with syntactic ones. There are two, orthogonal, dimensions to the discussion. The first is whether the syntactic construction in question is head-initial or head-final. The second is whether any of the constituents involved in the construction is a Leaner or not. I will take the first dimension as primary, and introduce issues about Leaners as appropriate. The approach which I will present has been implemented in ALE (Carpenter and Penn, 1999) , and although I will largely avoid presenting the rules in ALE notation, I have expressed the operations for building prosodic structures so as to closely reflect the relational constraints encoded in the ALE grammar. Head-Initial Constructions As far as head-initial constructions are concerned, I will confine my attention to syntactic constituents which are assembled by means of HPSG's Head- The function mkMtr (make metrical tree) (encoded as a relational constraint in ( 7 )) takes a list consisting of all the daughters' phonologies and builds an appropriate prosodic object ϕ. As the name of the function suggests, this prosodic object is, in the general case, a metrical tree. However, since metrical trees are relational (i.e., one node is stronger than the others), it makes no sense to construct a metrical tree if there is only a single daughter. In other words, if the head's COMPS list is empty, then the argument mkMtr is a singleton list containing only the head's PHON value, and this is returned unaltered as the function value. ¾ phrase PHON mkMtr´ ϕ 0 ϕ 1 ϕ n µ SYNSEM COMPS ¿ ¾ word PHON ϕ 0 COMPS 1 PHON ϕ 1 , , n PHON ϕ 1 ¿ 1 , , n (8) mkMtr( 1 [pros] ) = 1 The general case requires at least the first two elements on the list of prosodies to be of type full, and builds a tree of type full mtr.  Pronominal NPs can only form prosodic phrases in their own right if they bear accent; unaccented pronominals must combine with a host to be admissible. Zwicky's constraints on when this combination can occur are as follows: (15) A personal pronoun NP can form a prosodic phrase with a preceding prosodic host only if the following conditions are satisfied: a. the prosodic host and the pronominal NP are sisters; b. the prosodic host is a lexical category; c. the prosodic host is a category that governs case marking. These considerations motivate a third clause to the definition of mkMtr: (16) mkMtr( 1 [p-wrd], 2 [lnr] ¨3 ) = mkMtr( ¾ lnr-mtr DOM 1 , 2 DTE 1 ¿ ¨3 ) That is, if the first two elements of the list are a Prosodic Word and a Leaner, then the two of them combine to form a lnr-mtr, followed by any other material on the input list. Because of the way in which this prosodic constraint is associated with the Head-Complement Rule, the prosodic host in ( 16 ), namely the p-wrd tagged 1 , is automatically the syntactic head of the construction. As a result, Zwicky's conditions in (15) fall out directly. ( 17 )-( 18 ) illustrate the effects of the new clause. In the first case, the lnr-mtr consisting of told and it is the only item on the list in the recursive call to mkMtr in ( 16 ), and hence the base clause (8) in the definition of mkMtr applies. In the second case, there is more than one item on the list, and the lnr-mtr becomes a subtree in a larger metrical domain. (17) mkMtr ([told, it] ) = ¾ lnr-mtr DOM 1 told, it DTE 1 ¿ (18) mkMtr([told, it, [to Noel]]) = ¾ full-mtr DOM ¶ ¾ lnr-mtr DOM 1 told, it DTE 1 ¿ 2 [to Noel] • DTE 2 ¿ By contrast, examples of the form told Noel ǐt fail to parse, since ( 16 ) only licenses a head-initial lnr-mtr when the Leaner immediately follows the head. We could however admit told Noel ít, if the lexicon contained a suitable entry for accent-bearing ít with prosody of type p wrd, since this would satisfy the requirement that only prosodies of type full can be the value of a metrical tree's DTE. Head-Final Constructions To illustrate head-final constructions, I will focus on NP structures, considering the combination of determiners and prenominal adjectives with N-bar phrases. I take the general case to be illustrated by combining a determiner like this with a phrase like treasured possession to form one metrical tree. Since treasured possession will itself be a metrical tree, I introduce a new, binary, function for this purpose, namely extMtr (extend metrical tree) which adds a new prosodic element to the left boundary of an existing tree. For convenience, I will call the leftmost argument of extMtr the extender.  ¿ However, there are now a number of special cases to be considered. First, we have to allow that the head phrase is a single Prosodic Word such as possession, rather than a metrical tree. Second, the prosodic structure to be built will be more complex if the head phrase itself contains a post-head complement, as in treasured possession of the samurai. Crosscutting this dimension is the question of whether the extender is a Leaner, in which case it will form a lnr-mtr with the immediately following element. We will look at these cases in turn. (i) The head is a single Prosodic Word When the second prosodic argument of extMtr is not in fact a metrical tree, it calls mkMtr to build a new metrical tree. Definition ( 21 ) is illustrated in (22) . ¿ (ii) The head contains post-head material Perhaps the most awkward kind of mismatch between syntactic and prosodic structure arises when when the complement or postmodifier of a syntactic head is 'promoted' to the level of sister of the constituent in which the head occurs; this creates a disjuncture between the lexical head and whatever follows. ¨3 DTE 4 ) = 2 The special prosodic status of lexical heads is incorporated in Selkirk's (1981) notion of ϕ-phrase, and subsequent developments thereof, such as (Selkirk, 1986; Nespor and Vogel, 1986) . we can now see that if ϕ 0 is a metrical tree M, then the value of extMtr(ϕ 1 ϕ 0 ) depends on the syntactic information associated with the leftmost element P of that tree. That is, if P is the phonology of the lexical head of the phrase, then it can be prosodically disjoined from the following material, otherwise the metrical tree M is extended in the standard way. There are various ways that this sensitivity to syntactic role might be accommodated. One option would to inspect the DTRS (daughters) attribute of a sign. However, I will briefly sketch the treatment implemented in the ALE grammar, which does not build a representation of daughters. Instead, I have introduced an attribute LEX inside the value of HEAD which is constrained in the case of lexical items to be token-identical to the PHON value. For example, the type for possession is approximately as follows: (25) ¾ word PHON 1 possession SYNSEM ¾ SYN HEAD noun LEX 1 ARG-ST PP ¿ ¿ Since LEX is a head feature, it percolates up to any phrase projected from that head, and allows the PHON value of the lexical head to be accessed at that projection; i.e., headed phrases will also bear a specification [LEX phon], which can be interpreted as saying \"my lexical head's phonology value is phon\". In addition, we let the function extMtr in Fig 5 take as an extra argument the HEAD value of the mother, and then test whether the leftmost Prosodic Word in the metrical tree being extended is the same as the LEX value of the mother's HEAD value. (iii) Extending the head with a Leaner Finally, there is an additional clause to accommodate the case where the extending element is a Leaner. This triggers a kind of left association, in that the result of Concluding Remarks I believe that the preceding analysis demonstrates that despite the well-known mismatches between syntactic and prosodic structure, it is possible to induce the required prosodic structures in tandem with syntax. Moreover, the analysis retains rather conventional notions of syntactic constituency, eschewing the nonstandard syntactic constituents advocated by Prevost and Steedman (1993) , Steedman (1990; 1991) . Although I have only mentioned two syntactic rules in HPSG, the radically underspecified nature of these rules, coupled with rich lexical entries, means that the approach I have sketched has more generality than might appear at first. With the addition of a rule for prenominal adjectives, prosodically interpreted like the Head-Specifier Rule, we can derive a range of analyses as summarised in (27). Here, I use square brackets to demarcate trees of type full-mtr and parentheses for trees of type lnr-mtr. It would be straightforward to augment the grammar to accommodate post-modifiers of various kinds, which would behave prosodically like post-head complements. By contrast, auxiliaries do not conform to the association between headed structures and prosodic structures that we have seen so far. That is, if auxiliaries are a subtype of complement-taking verbs, as assumed within HPSG, then they depart from the usual pattern in behaving prosodically like specifiers rather than heads. There are numerous directions in which the current work can be extended. In terms of empirical coverage, a more detailed account of weak function words seems highly desirable. The approach can also be tested within the context of speech synthesis, and preliminary work is underway on extending the Festival system (Black and Taylor, 1997) to accept input text marked up with metrical trees of the kind presented here. In the longer term, the intention is to integrate prosodic realisation within the framework of an HPSG-based concept-to-speech system. Acknowledgements I am grateful to Philip Miller, Mike Reape, Ivan Sag and Paul Taylor for their helpful comments on various incarnations of the work reported here.",
    "abstract": "The paper develops a constraint-based theory of prosodic phrasing and prominence, based on an HPSG framework, with an implementation in ALE. Prominence and juncture are represented by n-ary branching metrical trees. The general aim is to define prosodic structures recursively, in parallel with the definition of syntactic structures. We address a number of prima facie problems arising from the discrepancy between syntactic and prosodic structure",
    "countries": [
        "United Kingdom"
    ],
    "languages": [
        "English"
    ],
    "numcitedby": "3",
    "year": "2000",
    "month": "October",
    "title": "A Constraint-based Approach to {E}nglish Prosodic Constituents"
}