{
    "article": "This paper presents methods for a qualitative, unbiased comparison of lexical association measures and the results we have obtained for adjective-noun pairs and preposition-noun-verb triples extracted from German corpora. In our approach, we compare the entire list of candidates, sorted according to the particular measures, to a reference set of manually identified \"true positives\". We also show how estimates for the very large number of hapaxlegomena and double occurrences can be inferred from random samples. Introduction In computational linguistics, a variety of (statistical) measures have been proposed for identifying lexical associations between words in lexical tuples extracted from text corpora. Methods used range from pure frequency counts to information theoretic measures and statistical significance tests. While the mathematical properties of those measures have been extensively discussed, 1 the strategies employed for evaluating the identification results are far from adequate. Another crucial but still unsolved issue in statistical collocation identification is the treatment of lowfrequency data. In this paper, we first specify requirements for a qualitative evaluation of lexical association mea-sures (AMs). Based on these requirements, we introduce an experimentation procedure, and discuss the evaluation results for a number of widely used AMs. Finally, methods and strategies for handling low-frequency data are suggested. The measures 2 -Mutual Information ( ¢¡ ) (Church and Hanks, 1989), the log-likelihood ratio test (Dunning, 1993), two statistical tests: t-test and £ ¥¤ -test, and co-occurrence frequencyare applied to two sets of data: adjective-noun (AdjN) pairs and preposition-noun-verb (PNV) triples, where the AMs are applied to (PN,V) pairs. See section 3 for a description of the base data. For evaluation of the association measures, ¦ -best strategies (section 4.1) are supplemented with precision and recall graphs (section 4.2) over the complete data sets. Samples comprising particular frequency strata (high versus low frequencies) are examined (section 4.3). In section 5, methods for the treatment of low-frequency data, single (hapaxlegomena) and double occurrences are discussed. The significance of differences between the AMs is addressed in section 6. The Qualitative Evaluation of Association Measures State-of-the-art A standard procedure for the evaluation of AMs is manual judgment of the ¦ -best candidates identified in a particular corpus by the measure in question. Typically, the number of true positives (TPs) among the 50 or 100 (or slightly more) highest ranked word combinations is manually identified by a human evaluator, in most cases the author of the paper in which the evaluation is presented. This method leads to a very superficial judgment of AMs for the following reasons: (1) The identification results are based on small subsets of the candidates extracted from the corpus. Consequently, results achieved by individual measures may very well be due to chance (cf. sections 4.1 and 4.2), and evaluation with respect to frequency strata is not possible (cf. section 4.3). ( 2 ) For the same reason, it is impossible to determine recall values, which are important for many practical applications. (3) The introduction of new measures or changes to the calculation methods require additional manual evaluation, as new ¦ -best lists are generated. Requirements To improve the reliability of the evaluation results, a number of properties need to be controlled. We distinguish between two classes: (1) Characteristics of the set of candidate data employed for collocation identification: (i) the syntactic homogeneity of the base data, i.e., whether the set of candidate data consists only of adjective-noun, noun-verb, etc. pairs or whether different types of word combinations are mixed; (ii) the grammatical status of the individual word combinations in the base set, i.e., whether they are part of or constitute a phrase or simply cooccur within a given text window; (iii) the percentage of TPs in the base set, which is typically higher among high-frequency data than among low-frequency data. (2) The evaluation strategies applied: Instead of examining only a small sample of ¦ -best candidates for each measure as it is common practice, we make use of recall and precision values for ¦best samples of arbitrary size, which allows us to plot recall and precision curves for the whole set of candidate data. In addition, we compare precision curves for different frequency strata. The Base Data The base data for our experiments are extracted from two corpora which differ with respect to size and text type. The base sets also differ with re-spect to syntactic homogeneity and grammatical correctness. Both candidate sets have been manually inspected for TPs. The first set comprises bigrams of adjacent, lemmatized AdjN pairs extracted from a small ( ¢¡ ¤£ ¦¥ ¨ § © word) corpus of freely available German law texts. 3 Due to the extraction strategy, the data are homogeneous and grammatically correct, i.e., there is (almost) always a grammatical dependency between adjacent adjectives and nouns in running text. Two human annotators independently marked candidate pairs perceived as \"typical\" combinations, including idioms ((die) hohe See, 'the high seas'), legal terms (üble Nachrede, 'slander'), and proper names (Rotes Kreuz, 'Red Cross'). Candidates accepted by either one of the annotators were considered TPs. The second set consists of PNV triples extracted from an 8 million word portion of the Frankfurter Rundschau Corpus 4 , in which partof-speech tags and minimal PPs were identified. 5 The PNV triples were selected automatically such that the preposition and the noun are constituents of the same PP, and the PP and the verb co-occur within a sentence. Only main verbs were considered and full forms were reduced to bases. 6 The PNV data are partially inhomogeneous and not fully grammatically correct, because they include combinations with no grammatical relation between PN and V. PNV collocations were manually annotated. The criteria used for the distinction between collocations and arbitrary word combinations are: There is a grammatical relation between the verb and the PP, and the triple can be interpreted as support verb construction and/or a metaphoric or idiomatic reading is available, e.g.: zur Verfügung stellen (at_the availability put, 'make available'), am Herzen liegen (at the heart lie, 'have at heart'). Experimental Setup After extraction of the base data and manual identification of TPs, the AMs are applied, resulting in an ordered candidate list for each measure (henceforth significance list, SL). The order indicates the degree of collocativity. Multiple candidates with identical scores are listed in random order. This is necessary, in particular, when co-occurrence frequency is used as an association measure. ¨-Best Lists In this approach, the set of the ¦ highest ranked word combinations is evaluated for each measure, and the proportion of TPs among this ¦ -best list (the precision) is computed. Another measure of goodness is the proportion of TPs in the base data that are also contained in the ¦ -best list (the recall). While precision measures the quality of the ¦ -best lists produced, recall measures their coverage, i.e., how many of all true collocations in the corpus were identified. The most problematic aspect here is that conclusions drawn from ¦ -best lists for a single (and often small) value of ¦ are only snapshots and likely to be misleading. For instance, considering the set of AdjN base data with ©¡ ¥ we might arrive at the following results ( Precision and Recall Graphs For a clearer picture, however, larger portions of the SLs need to be examined. A well suited means for comparing the goodness of different AMs are the precision and recall graphs obtained by stepwise processing of the complete SLs (Figures 1 to 10 below). 9 The -axis represents the percentage of data processed in the respective SL, while the !axis represents the precision (or recall) values achieved. For instance, the precision values for ¦ \" ¡ § § and ¦ \" ¨ § § for the AdjN data can be read from the ! -axis in Figure 1 at positions where ¥ $# ¡ % ¥& and ¡ § # (' ) ¥& (marked by vertical lines). The dotted horizontal line represents the percentage of true collocations in the base set. This value corresponds to the expected precision value for random selection, and provides a baseline for the interpretation of the precision curves. General findings from the precision graphs are: (i) It is only useful to consider the first halves of the SLs, as the measures approximate afterwards. (ii) Precision of log-likelihood, £ ¤ , t-test and frequency strongly decreases in the first part of the SLs, whereas precision of ¢¡ remains almost constant (cf. Figure 1 ) or even increases slightly (cf. Figure 2 ). (iii) The identification results are instable for the first few percent of the data, with log-likelihood, t-test and frequency stabilizing earlier than ¢¡ and £ ¤ , and the PNV data Examining the precision and recall graphs in more detail, we find that for the AdjN data (Figure 1 ), log-likelihood and t-test lead to the best results, with log-likelihood giving an overall better result than the t-test. The picture differs slightly for the PNV data (Figure 2 ). Here t-test outperforms log-likelihood, and even precision gained by frequency is better than or at least comparable to log-likelihood. These pairings -log-likelihood and t-test for AdjN, and t-test and frequency for PNV -are also visible in the recall curves (Figures 3 and 4). Moreover, for the PNV data the t-test leads to a recall of over 60% when approx. 20% of the SL has been considered. In the Figures above, there are a number of positions on the -axis where the precision and recall values of different measures are almost identical. This shows that a simple ¦ -best approach will often produce misleading results. For instance, if we just look at the first © ¨ § & of the SLs for the PNV data, we might conclude that the t-test and frequency measures are equally well suited for the extraction of PNV collocations. However, the full curves in Figures 2 and 4 show that t-test is consistently better than frequency. Frequency Strata While we have previously considered data from a broad frequency range (i.e., frequencies ¡ ¥ for AdjN and ¡ © for PNV), we will now split up the candidate sets into high-frequency and low-frequency occurrences. This procedure allows us to assess the performance of AMs within different frequency strata. For instance, there is a widely held belief that ¢¡ and £ ¤ are inferior to other measures because they overestimate the collocativity of low-frequency candidates (cf. the remarks on the £ ¤ measure in (Dunning, 1993) ). One might thus expect ¢¡ and £ ¤ to yield much better results for higher frequencies. We have divided the AdjN data into two samples with ¢¡ (high frequencies) and ¥ ¢¡ ¤£ (low frequencies), because the number of data in the base sample is quite small. As there are enough PNV data, we used a higher threshold and selected samples with ¡ ¡ § (high frequencies) and © $ ¦¥ (low frequencies). High Frequencies Considering our high-frequency AdjN data (Figure 5 ), we find that all precision curves decline as more of the data in the SLs is examined. Especially for ¡ , this is markedly different from the results obtained before. As the full curves show, log-likelihood is obviously the best measure. It is followed by t-test, £ ¤ , frequency and ¢¡ in this order. Frequency and ¢¡ approximate when 50% of the data in the SLs are examined. In the remaining part of the lists, ¢¡ yields better results than frequency and is practically identical to the best-performing measures. Surprisingly, the precision curves of £ ¤ and in particular ¡ increase over the first 60% of the SLs for high-frequency PNV data, whereas the curves for t-test, log-likelihood, and frequency have the usual downward slope (see Figure 6 ). Log-likelihood achieves precision values above 50% for the first 10% of the list, but is outperformed by the t-test afterwards. Looking at the first 40% of the data, there is a big gap between the good measures (t-test, log-likelihood, and frequency) and the weak measures (£ ¤ and ¢¡ ). In the second half of the data in the SLs, however, there is virtually no difference between ¢¡ , £ ¥¤ , and the other measures, with the exception of mere co-occurrence frequency. Summing up, t-test -with a few exceptions around the first 5% of the data in the SLsleads to the overall best precision results for high-frequency PNV data. Log-likelihood is second best but achieves the best results for highfrequency AdjN data. Figures 7 and 8 show that there is little difference between the AMs for low-frequency data, except for co-occurrence frequency, which leads to worse results than all other measures. Low Frequencies For AdjN data, the AMs at best lead to an improvement of factor 3 compared to random selection (when up to ¥ & of the SL is examined, log-likelihood achieves precision values above 30%). Log-likelihood is the overall best measure for identifying AdjN collocations, except forcoordinates between 15% and 20% where t-test outperforms log-likelihood. For PNV data, the curves of all measures (except for frequency) are nearly identical. Their precision values are not significantly 10 different from the baseline obtained by random selection. In contrast to our expectation stated at the beginning of this section, the performance of ¢¡ and £ ¥¤ relative to the other AMs is not better for high-frequency data than for low-frequency data. Instead, the poor performance observed in section 4.2 is explained by the considerably higher baseline precision of the high-frequency data (cf. Hapaxlegomena and Double Occurrences As the frequency distribution of word combinations in texts is characterised by a large number of rare events, low-frequency data are a serious challenge for AMs. One way to deal with lowfrequency candidates is the introduction of cutoff thresholds. This is a widely used strategy, and it is motivated by the fact that it is in general highly problematic to draw conclusions from low-frequency data with statistical methods (cf. Weeber et al. (2000) and Figure 8 ). A practical reason for cutting off low-frequency data is the need to reduce the amount of manual work when the complete data set has to be evaluated, which is a precondition for the exact calculation of recall and for plotting precision curves. The major drawback of an approach where all low-frequency candidates are excluded is that a large part of the data is lost for collocation extraction. In our data, for instance, 80% of the full set of PNV data and 58% of the AdjN data are hapaxes. Thus it is important to know how many (and which) true collocations there are among the excluded low-frequency candidates. Statistical Estimation of TPs among Low-Frequency Data In this section, we estimate the number of collocations in the data excluded from our experiments (i.e., AdjN pairs with ¡ and PNV triples with ¡ ) ¥ ). Because of the large number of candidates in those sets (6 435 for AdjN, 279 880 for PNV), manual inspection of the entire data is impractical. Therefore, we use random samples from the candidate sets to obtain estimates for the proportion of true collocations among the low-frequency data. We randomly selected 965 items (15%) from the AdjN hapaxes, and 983 items ( 0.35%) from the low-frequency PNV triples. Manual examination of the samples yielded 31 TPs for AdjN (a proportion of 3.2%) and 6 TPs for PNV (0.6%). Considering the low proportion of collocations in the samples, we must expect highly skewed frequency distributions (where is very small), which are problematic for standard statistical tests. In order to obtain reliable estimates, we have used an exact test based on the following model: Assuming a proportion of TPs in the full low-frequency data (AdjN or PNV), the number of TPs in a random sample of size ¨is described by a binomially distributed random variable ¡ with parameter . 11 Consequently, the probability of finding ¢ or less TPs in the sample is £ ¥¤ £ ¡ ¡ ¢ ¤ §¦ ©¨ £ ¡ ! ¤ #\" . We apply a one-tailed statistical test based on the probabilities £ ¤ £ ¡ ¡ ¢ ¤ to our samples in order to obtain an upper estimate for the actual proportion of collocations among the low-frequency data: the estimate ¡ $ is accepted at a given signifi- cance level % if £ ¤ '& £ ¡ ¡ ¢ ¤ £ % . In the case of the AdjN data (¢ © ¢¡ , ¨ ( £ ), we find that ¡ ¦ ¥& at a confidence level of 99% (% § # § ¡ ). Thus, there should be at most 320 TPs among the AdjN candidates with ¡ . Compared to the 737 TPs identified in the AdjN data with \"¡ ¥ , our decision to exclude the hapaxlegomena was well justified. The proportion of TPs in the PNV sample (¢ £ , ¨ ( © ) was much lower and we find that ¡ ¡ )# ¥& at the same confidence level of 99%. However, due to the very large number of low-frequency candidates, there may be as many as 4200 collocations in the PNV data with ¡ ) ¥ , more than 4 times the number identified in our experiment. It is imaginable, then, that one of the AMs 11 To be precise, the binomial distribution is itself an approximation of the exact hypergeometric probabilities (cf. Pedersen (1996)). This approximation is sufficiently accurate as long as the sample size ) is small compared to the size of the base set (i.e., the number of low-frequency candidates). might succeed in extracting a substantial number of collocations from the low-frequency PNV data. Figure 9 shows precision curves for the 10 000 highest ranked word combinations from each SL for PNV combinations with ¡ ) ¥ (the vertical lines correspond to ¦ -best lists for ¦ ¡ § § § ¥ ¨ § § § ¨ § § § ). In order to reduce the amount of manual work, the precision values for each AM are based on a 10% random sample from the 10 000 highest ranked candidates. We have applied the statistical test described above to obtain confidence intervals for the true precision values of the bestperforming AM (frequency), given our 10% sample. The upper and lower bounds of the 95% confidence intervals are shown as thin lines. Even the highest precision estimates fall well below the 6.41% precision baseline of the PNV data with ¡ © . Again, we conclude that the exclusion of low-frequency candidates was well justified. Significance Testing We have assessed the significance of differences between AMs using the well-known £ ¤ test as described in (Krenn, 2000). 12 The thin lines in Figure 10 delimit 95% confidence intervals around the best-performing measure for the AdjN data with ¢¡ ¥ (log-likelihood). There is no significant difference between loglikelihood and t-test. And only for ¦ -best lists with ¦ ¡ § § § , frequency performs marginally significantly worse than log-likelihood. For the PNV data (not shown), the t-test is significantly better than log-likelihood, but the difference between frequency and the t-test is at best marginally significant. Conclusion We have shown that simple ¦ -best approaches are not suitable for a qualitative evaluation of lexical association measures, mainly for the following reasons: the instability of precision values obtained from the first few percent of the data in the SLs; the lack of significant differences between the AMs after approx. 50% of the data in the SLs have been examined; and the lack of significant differences between the measures except for certain specific values of ¦ . We have also shown that the evaluation results and the ranking of AMs differ depending on the kind of collocations to be identified, and the proportion of hapaxes in the candidate sets. Finally, our results question the widely accepted argument that the strength of loglikelihood lies in handling low-frequency data. In our experiments, none of the AMs was able to extract a substantial number of collocations from the set of hapaxlegomena. Acknowledgement The work of B. Krenn has been sponsored by the Fonds zur Förderung der wissenschaftlichen Forschung (FWF), Grant No. P12920. Financial support for ÖFAI is provided by the Austrian Federal Ministry of Education, Science and Culture. The AdjN data is the result of joint research with Ulrich Heid and Wolfgang Lezius. The authors would like to thank the anonymous reviewers for many helpful comments and interesting references.",
    "abstract": "This paper presents methods for a qualitative, unbiased comparison of lexical association measures and the results we have obtained for adjective-noun pairs and preposition-noun-verb triples extracted from German corpora. In our approach, we compare the entire list of candidates, sorted according to the particular measures, to a reference set of manually identified \"true positives\". We also show how estimates for the very large number of hapaxlegomena and double occurrences can be inferred from random samples.",
    "countries": [
        "Germany",
        "Austria"
    ],
    "languages": [
        "German"
    ],
    "numcitedby": "216",
    "year": "2001",
    "month": "July",
    "title": "Methods for the Qualitative Evaluation of Lexical Association Measures"
}