{
    "article": "We present a learning framework for structured support vector models in which boosting and bagging methods are used to construct ensemble models. We also propose a selection method which is based on a switching model among a set of outputs of individual classifiers when dealing with natural language parsing problems. The switching model uses subtrees mined from the corpus and a boosting-based algorithm to select the most appropriate output. The application of the proposed framework on the domain of semantic parsing shows advantages in comparison with the original large margin methods. Introduction Natural language semantic parsing is an interesting problem in NLP (Manning and Schutze, 1999) as it would very likely be part of any interesting NLP applications (Allen, 1995) . For example, the necessary of semantic parsing for most of NLP application and the ability to map natural language to a formal query or command language is critical for developing more user-friendly interfaces. Recent approaches have focused on using structured prediction for dealing with syntactic parsing (B. Taskar et. al., 2004 ) and text chunking problems (Lafferty et al, 2001) . For semantic parsing, Zettlemoyer and Collins (2005) proposed a method for mapping a NL sentence to its logical form by structured classification using a log-linear model that represents a distribution over syntactic and semantic analyses conditioned on the input sentence. Taskar et al (B. Taskar et. al., 2004) present a discriminative approach to pars-ing inspired by the large-margin criterion underlying support vector machines in which the loss function is factorized analogous to the decoding process. Tsochantaridis et al (Tsochantaridis et al., 2004) propose a large-margin models based on SVMs for structured prediction (SSVM) in general and apply it for syntactic parsing problem so that the models can adapt to overlap features, kernels, and any loss functions. Following the successes of the SSVM algorithm to structured prediction, in this paper we exploit the use of SSVM to the semantic parsing problem by modifying the loss function, feature representation, maximization algorithm in the original algorithm for structured outputs (Tsochantaridis et al., 2004) . Beside that, forming committees or ensembles of learned systems is known to improve accuracy and bagging and boosting are two popular ensemble methods that typically achieve better accuracy than a single classifier (Dietterich, 2000) . This leads to employing ensemble learning models for SSVM is worth to investigate. The first problem of forming an ensemble learning for semantic parsing is how to obtain individual parsers with respect to the fact that each individual parser performs well enough as well as they make different types of errors. The second one is that of combining outputs from individual semantic parsers. The natural way is to use the majority voting strategy that the semantic tree with highest frequency among the outputs obtained by individual parsers is selected. However, it is not sure that the majority voting technique is effective for combining complex outputs such as a logical form structure. Thus, a better combination method for semantic tree output should be investigated. To deal with these problems, we proposed an ensemble method which consists of learning and averaging phases in which the learning phases are either a boosting or a bagging model, and the averaging phase is based on a switching method on outputs obtained from all individual SSVMs. For the averaging phase, the switching model is used subtrees mined from the corpus and a boostingbased algorithm to select the most appropriate output. Applications of SSVM ensemble in the semantic parsing problem show that the proposed SSVM ensemble is better than the SSVM in term of the Fmeasure score and accuracy measurements. The rest of this paper are organized as follows: Section 2 gives some background about the structured support vector machine model for structured predictions and related works. Section 3 proposes our ensemble method for structured SVMs on the semantic parsing problem. Section 4 shows experimental results and Section 5 discusses the advantage of our methods and describes future works. Backgrounds Related Works Zelle and Mooney initially proposed the empirically based method using a corpus of NL sentences and their formal representation for learning by inductive logic programming (Zelle, 1996) . Several extensions for mapping a NL sentence to its logical form have been addressed by (Tang, 2003) . Transforming a natural language sentence to a logical form was formulated as the task of determining a sequence of actions that would transform the given input sentence to a logical form (Tang, 2003) . The main problem is how to learn a set of rules from the corpus using the ILP method. The advantage of the ILP method is that we do not need to design features for learning a set of rules from corpus. The disadvantage is that it is quite complex and slow to acquire parsers for mapping sentences to logical forms. Kate et al presented a method (Kate et al., 2005) that used transformation rules to transform NL sentences to logical forms. Those transformation rules are learnt using the corpus of sentences and their logical forms. This method is much simpler than the ILP method, while it can achieve comparable result on the CLANG (Coach Language) and Query corpus. The transformation based method has the condition that the formal language should be in the form of LR grammar. Ge and Mooney also presented a statistical method (Ge and Mooney, 2005) by merging syntactic and semantic information. Their method relaxed the condition in (Kate et al., 2005) and achieved a state-of the art performance on the CLANG and query database corpus. However the distinction of this method in comparison with the method presented in (Kate et al., 2005) is that Ge and Mooney require training data to have SAPTs, while the transforation based method only needs the LR grammar for the formal language. The work proposed by (Zettlemoyer and Collins, 2005) that maps a NL sentence to its logical form by structured classification, using a loglinear model that represents a distribution over syntactic and semantic analyses conditioned on the input sentence. This work is quite similar to our work in considering the structured classification problem. The difference is that we used the kernel based method instead of a log-linear model in order to utilize the advantage of handling a very large number of features by maximizing the margin in the learning process. Structured Support Vector Models Structured classification is the problem of predicting y from x in the case where y has a meaningful internal structure. Elements y ∈ Y may be, for instance, sequences, strings, labelled trees, lattices, or graphs. The approach we pursue is to learn a discriminant function F : X × Y → R over < input, output > pairs from which we can derive a prediction by maximizing F over the response variable for a specific given input x. Hence, the general form of our hypotheses f is f (x; w) = arg max y∈Y F (x; y; w) where w denotes a parameter vector. As the principle of the maximum-margin presented in (Vapnik, 1998) , in the structured classification problem, (Tsochantaridis et al., 2004) proposed several maximum-margin optimization problems. For convenience, we define δψ i (y) ≡ ψ(x i , y i ) − ψ(x i , y) where (x i ,y i ) is the training data. The hard-margin optimization problem is: SVM 0 : min w 1 2 w 2 (1) ∀i, ∀y ∈ Y \\y i : w, δψ i (y) > 0 (2) where w, δψ i (y) is the linear combination of feature representation for input and output. The soft-margin criterion was proposed (Tsochantaridis et al., 2004) in order to allow errors in the training set, by introducing slack variables. SVM 1 : min 1 2 w 2 + C n n i=1 ξ i ,s.t.∀i, ξ i ≥ 0 (3) ∀i, ∀y ∈ Y \\y i : w, δψ i (y) ≥ 1 − ξ i (4) Alternatively, using a quadratic term C 2n i ξ 2 i to penalize margin violations, we obtained SVM 2 . Here C > 0 is a constant that control the tradeoff between training error minimization and margin maximization. To deal with problems in which |Y | is very large, such as semantic parsing, (Tsochantaridis et al., 2004) proposed two approaches that generalize the formulation SVM 0 and SVM 1 to the cases of arbitrary loss function. The first approach is to re-scale the slack variables according to the loss incurred in each of the linear constraints. SVM ∆s : min w,ξ 1 2 w 2 + C n n i=1 ξ i ,s.t.∀i, ξ i ≥ 0 (5) ∀i, ∀y ∈ Y \\y i : w, δψ i (y) ≥ 1 − ξ i ∆(y i , y) (6) The second approach to include loss function is to re-scale the margin as a special case of the Hamming loss. The margin constraints in this setting take the following form: ∀i, ∀y ∈ Y \\y i : w, δψ i (y) ≥ ∆(y i , y) − ξ i (7) This set of constraints yields an optimization problem, namely SVM ∆m 1 . Support Vector Machine Learning The support vector learning algorithm aims to find a small set of active constraints that ensures a sufficiently accurate solution. The detailed algorithm, as presented in (Tsochantaridis et al., 2004 ) can be applied to all SVM formulations mentioned above. The only difference between them is the cost function in the following optimization problems: SVM ∆s 1 : H(y) ≡ (1 − δψ i (y), w )∆(y i , y) SVM ∆s 2 : H(y) ≡ (1 − δψ i (y), w ) ∆(y i , y) SVM ∆m 1 : H(y) ≡ (∆(y i , y) − δψ i (y), w ) SVM ∆m 2 : H(y) ≡ ( ∆(y i , y) − δψ i (y), w ) Typically, the way to apply structured SVM is to implement feature mapping ψ(x, y), the loss function ∆(y i , y), as well as the maximization algorithm. In the following section, we apply a structured support vector machine to the problem of semantic parsing in which the mapping function, the maximization algorithm, and the loss function are introduced. SSVM Ensemble for Semantic Parsing Although the bagging and boosting techniques have known to be effective for improving the performance of syntactic parsing (Henderson and Brill, 2000) , in this section we focus on our ensemble learning of SSVM for semantic parsing and propose a new effective switching model for either bagging or boosting model. SSVM for Semantic Parsing As discussed in (Tsochantaridis et al., 2004) , the major problem for using the SSVM is to implement the feature mapping ψ(x, y), the loss function ∆(y i , y), as well as the maximization algorithm. For semantic parsing, we describe here the method of structure representation, the feature mapping, the loss function, and the maximization algorithm. Structure representation A tree structure representation incorporated with semantic and syntactic information is named semantically augmented parse tree (SAPT) (Ge and Mooney, 2005) . As defined in (Ge and Mooney, 2005) , in an SAPT, each internal node in the parse tree is annotated with a semantic label. Figure 1 shows the SAPT for a simple sentence in the CLANG domain. The semantic labels which are shown after dashes are concepts in the domain. Some concepts refer to predicates and take an ordered list of arguments. Concepts such as \"team\" and \"unum\" might not have arguments. A special semantic label, \"null\", is used for a node that does not correspond to any concept in the domain. Feature mapping For semantic parsing, we can choose a mapping function to get a model that is isomorphic to a probabilistic grammar in which each rule within the grammar consists of both a syntactic rule and a semantic rule. Each node in a parse tree y for a sentence x corresponds to a grammar rule g j with a score w j . All valid parse trees y for a sentence x are scored by the sum of the w j of their nodes, and the feature mapping ψ(x, y) is a history gram vector counting how often each grammar rule g j occurs in the tree y. Note that the grammar rules are lexicalized. The example shown in Figure 2 clearly explains the way features are mapped from an input sentence and a tree structure. Loss function Let z and z i be two semantic tree outputs and |z i | and |z i | be the number of brackets in z and z i , respectively. Let n be the number of common brackets in the two trees. The loss function between z i and z is computed as bellow. F − loss(z i , z) = 1 − 2 × n |z i | + |z| (8) zero − one(z i , z) = 1 if z i = z 0 otherwise (9) Maximization algorithm Note that the learning function can be efficiently computed by finding a structure y ∈ Y that maximizes F (x, y; w)= w, δψ i (y) via a maximization algorithm. Typically we used a variant of Figure 2 : Example of feature mapping using tree representation CYK maximization algorithm which is similar to the one for the syntactic parsing problem (Johnson,1999). There are two phases in our maximization algorithm for semantic parsing. The first is to use a variant of CYK algorithm to generate a SAPT tree. The second phase then applies a deterministic algorithm to output a logical form. The score of the maximization algorithm is the same with the obtained value of the CYK algorithm. The procedure of generating a logical form using a SAPT structure originally proposed by (Ge and Mooney, 2005) and it is expressed as Algorithm 1. It generates a logical form based on a knowledge database K for given input node N . The predicate argument knowledge, K, specifies, for each predicate, the semantic constraints on its arguments. Constraints are specified in terms of the concepts that can fill each argument, such as player(team, unum) and bowner(player). The GETsemanticHEAD determines which of node's children is its semantic head based on they having matching semantic labels. For example, in Figure 1 N 3 is determined to be the semantic head of the sentence since it matches N8's semantic label. ComposeMR assigns their meaning representation (MR) to fill the arguments in the head's MR to construct the complete MR for the node. Figure 1 shows an example of using BuildMR to generate a semantic tree to a logical form. Input: The root node N of a SAPT Predicate knowledge K Notation: XMR is the M R of node X Output: NMR Begin Ci= the ith child node of N C h = GETsemanticHEAD(N ) C h M R =BuildMR(C h , K) for each other child Ci where i = h do Ci M R =BuildMR(Ci, K) ComposeMR(C h M R ,Ci M R , K) end NMR=C h M R End Algorithm 1: BuildMR(N, K): Computing a logical form form an SAPT (Ge and Mooney, 2005) Input: S = (xi; yi; zi), i = 1, 2, ..., l in which xi is 1 the sentence and yi, zi is the pair of tree structure and its logical form Output: SSVM model (Tsochantaridis et al., 2004) SSVM learning for semantic parsing As mentioned above, the proposed maximization algorithm includes two parts: the first is to parse the given input sentence to the SAPT tree and the second part (BuildMR) is to convert the SAPT tree to a logical form. Here, the score of maximization algorithm is the same with the score to generate a SAPT tree and the loss function should be the measurement based on two logical form outputs. Algorithm 2 shows our generation of SSVM learning for the semantic parsing problem which the loss function is based on the score of two logical form outputs. SSVM Ensemble for semantic parsing The structured SVM ensemble consists of a training and a testing phase. In the training phase, each individual SSVM is trained independently by its own replicated training data set via a bootstrap method. In the testing phase, a test example is applied to all SSVMs simultaneously and a collective decision is obtained based on an aggregation strategy. Bagging for semantic parsing The bagging method (Breiman, 1996) is simply created K bootstrap with sampling m items from the training data of sentences and their logical forms with replacement. We then applied the SSVM learning in the K generated training data to create K semantic parser. In the testing phase, a given input sentence is parsed by K semantic parsers and their outputs are applied a switching model to obtain an output for the SSVM ensemble parser. Boosting for semantic parsing The representative boosting algorithm is the AdaBoost algorithm (Schapire, 1999) . Each SSVM is trained using a different training set. Assuming that we have a training set T R = (x i ; y i )|i = 1, 2, ..., l consisting of l samples and each sample in the T R is assigned to have the same value of weight p 0 (x i ) = 1/l. For training the kth SSVM classifier, we build a set of training samples T R boost k = (x i ; y i )|i = 1, 2, .., l that is obtained by selecting l (< l) samples among the whole data set T R according to the weight value p k−1 (x i ) at the (k-1)th iteration. This training samples is used for training the kth SSVM classifier. Then, we obtained the updated weight values p k (x i ) of the training samples as follows. The weight values of the incorrectly classified samples are increased but the weight values of the correctly classified samples are decreased. This shows that the samples which are hard to classify are selected more frequently. These updated weight values will be used for building the training samples T R boost k+1 = (x i ; y i )|i = 1, 2, ..., l of the (k+1)th SSVM classifier. The sampling procedure will be repeated until K training samples set has been built for the Kth SSVM classifier. The proposed SSVM ensemble model We construct a SSVM ensemble model by using different parameters for each individual SSVM together with bagging and boosting models. The parameters we used here including the kernel function and the loss function as well as features used in a SSVM. Let N and K be the number of different parameters and individual semantic parsers in a SSVM ensemble, respectively. The motivation is to create individual parsers with respect to the fact that each individual parser performs well enough as well as they make different types of errors. We firstly create N ensemble models using either boosting or bagging models to obtain N ×K individual parsers. We then select the top T parsers so that their errors on the training data are minimized and in different types. After forming an ensemble model of SSVMs, we need a process for aggregating outputs of individual SSVM classifiers. Intuitively, a simplest way is to use a voting method to select the output of a ensemble. Instead, we propose a switching method using subtrees mining from the set of trees as follows. Let t 1 , t 2 , ..., t K be a set of candidate parse trees produced by an ensemble of K parsers. From the set of tree t 1 , t 2 , ..., t K we generated a set of training data that maps a tree to a label +1 or -1, where the tree t j received the label +1 if it is an corrected output. Otherwise t j received the label -1. We need to define a learning function for classifying a tree structure to two labels +1 and -1. For this problem, we can apply a boosting technique presented in (Kudo and Matsumoto, 2004) . The method is based on a generation of Adaboost (Schapire, 1999) in which subtrees mined from the training data are severed as weak decision stump functions. The technique for mining these subtrees is presented in (Zaki, 2002) which is an efficient method for mining a large corpus of trees. Table 1 shows an example of mining subtrees on our corpus. One problem for using the boosting subtrees algorithm (BT) in our switching models is that we might ob-tain several outputs with label +1. To solve this, we evaluate a score for each value +1 obtained by the BT and select the output with the highest score. In the case of there is no tree output received the value +1, the output of the first individual semantic parser will be the value of our switching model. Experimental Results For the purpose of testing our SSVM ensembles on semantic parsing, we used the CLANG corpus which is the RoboCup Coach Language (www.robocup.org). In the Coach Competition, teams of agents compete on a simulated soccer field and receive advice from a team coach in a formal language. The CLANG consists of 37 non-terminal and 133 productions; the corpus for CLANG includes 300 sentences and their structured representation in SAPT (Kate et al., 2005) , then the logical form representations were built from the trees. Table 2 shows the statistic on the CLANG corpus. To create an ensemble learning with SSVM, we used the following parameters with the linear kernel, the polynomial kernel, and RBF kernel, respectively. Table 3 shows that they obtained different accuracies on the training corpus, and their accuracies are good enough to form a SSVM ensemble. The parameters in Table 3 is used to form our proposed SSVM model. The following is the performance of the SSVM 1 , the boosting model, the bagging model, and the models with different parameters on the CLANG corpus 2 . Note that the numbers of individual SSVMs in our ensemble models are set to 10 for boosting and bagging, and each individual SSVM can be used the zero-one and F1 loss function. In addition, we also compare the performance of the proposed ensemble SSVM models and the conventional ensemble models to assert that our models are more effective in forming SSVM ensemble learning. We used the standard 10-fold cross validation test for evaluating the methods. To train a BT model for the switching phase in each fold test, we separated the training data into 10-folds. We keep 9/10 for forming a SSVM ensemble, and 1/10 for producing training data for the switching model. In addition, we mined a subset of subtrees in which a frequency of each subtree is greater than 2, and used them as weak functions for the boosting tree model. Note that in testing the whole training data in each fold is formed a SSVM ensemble model to use the BT model estimated above for selecting obtained by the SSVM ensemble. To evaluate the proposed methods in parsing NL sentences to logical form, we measured the number of test sentences that produced complete logical forms, and the number of those logical forms that were correct. For CLANG, a logical form is correct if it exactly matches the correct representation, up to reordering of the arguments of commutative operators. We used the evaluation method presented in (Kate et al., 2005) as the formula below. precision = #correct−representation #completed−representation recall = #correct−representation #sentences Table 4 shows the results of SSVM, the SCSIS-SOR system (Ge and Mooney, 2005) , and the SILT system (Kate et al., 2005) on the CLANG corpus, respectively. It shows that SCSISSOR obtained approximately 89% precision and 72.3% recall while on the same corpus our best single SSVM method 3 achieved a recall (74.3%) and lower precision (84.2%). The SILT system achieved approximately 83.9% precision and 51.3% recall 4 which is lower than the best single SSVM. Table 4 also shows the performance of Bagging, Boosting, and the proposed SSVM ensemble models with bagging and boosting models. It is important to note that the switching model using a boosting tree method (BT) to learn the outputs of individual SSVMs within the SSVM ensemble model. It clearly indicates that our proposed ensemble method can enhance the performance of the SSVM model and the proposed methods are more effective than the conventional ensemble method for SSVM. This was because the output of each SSVM is complex (i.e a logical form) so it is not sure that the voting method can select a corrected output. In other words, the boosting tree algorithms can utilize subtrees mined from the corpus to estimate the good weight values for subtrees, and then combines them to determine whether or not a tree is selected. In our opinion, with the boosting tree algorithm we can have a chance to obtain more accurate outputs. These results in Table 4 effectively support for this evidence. Moreover, Table 4 depicts that the proposed ensemble method using different parameters for either bagging and boosting models can effectively improve the performance of bagging and boosting in term of precision and recall. This was because the accuracy of each individual parser in the model with different parameters is better than each one in either the boosting or the bagging model. In addition, when performing SSVM on the test set, we might obtain some 'NULL' outputs since the grammar generated by SSVM could not derive this sentence. Forming a number of individual SSVMs to an ensemble model is the way to handle this case, but it could make the numbers of completed outputs and corrected outputs increase. Ta-ble 4 indicates that the proposed SSVM ensemble model obtained 88.4% precision and 79.3% recall. Therefore it shows substantially a better F1 score in comparison with previous work on the CLANG corpus. Summarily, our method achieved the best recall result and a high precision on CLANG corpus. The proposed ensemble models outperformed the original SSVM on CLANG corpus and its performances also is better than that of the best published result. Conclusions This paper presents a structured support vector machine ensemble model for semantic parsing problem by employing it on the corpus of sentences and their representation in logical form. We also draw a novel SSVM ensemble model in which the forming ensemble strategy is based on a selection method on various parameters of SSVM, and the aggregation method is based on a switching model using subtrees mined from the outputs of a SSVM ensemble model. Experimental results show substantially that the proposed ensemble model is better than the conventional ensemble models for SSVM. It can also effectively improve the performance in term of precision and recall in comparison with previous works. Acknowledgments The work on this paper was supported by a Monbukagakusho 21st COE Program.",
    "abstract": "We present a learning framework for structured support vector models in which boosting and bagging methods are used to construct ensemble models. We also propose a selection method which is based on a switching model among a set of outputs of individual classifiers when dealing with natural language parsing problems. The switching model uses subtrees mined from the corpus and a boosting-based algorithm to select the most appropriate output. The application of the proposed framework on the domain of semantic parsing shows advantages in comparison with the original large margin methods.",
    "countries": [
        "Japan"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "21",
    "year": "2006",
    "month": "July",
    "title": "Semantic Parsing with Structured {SVM} Ensemble Classification Models"
}