{
    "article": "Extracting tree transducer rules for syntactic MT systems can be hindered by word alignment errors that violate syntactic correspondences. We propose a novel model for unsupervised word alignment which explicitly takes into account target language constituent structure, while retaining the robustness and efficiency of the HMM alignment model. Our model's predictions improve the yield of a tree transducer extraction system, without sacrificing alignment quality. We also discuss the impact of various posteriorbased methods of reconciling bidirectional alignments. Introduction Syntactic methods are an increasingly promising approach to statistical machine translation, being both algorithmically appealing (Melamed, 2004; Wu, 1997) and empirically successful (Chiang, 2005; Galley et al., 2006) . However, despite recent progress, almost all syntactic MT systems, indeed statistical MT systems in general, build upon crude legacy models of word alignment. This dependence runs deep; for example, Galley et al. (2006) requires word alignments to project trees from the target language to the source, while Chiang (2005) requires alignments to induce grammar rules. Word alignment models have not stood still in recent years. Unsupervised methods have seen substantial reductions in alignment error (Liang et al., 2006) as measured by the now much-maligned AER metric. A host of discriminative methods have been introduced (Taskar et al., 2005; Moore, 2005; Ayan and Dorr, 2006) . However, few of these methods have explicitly addressed the tension between word alignments and the syntactic processes that employ them (Cherry and Lin, 2006; Daumé III and Marcu, 2005; Lopez and Resnik, 2005) . We are particularly motivated by systems like the one described in Galley et al. (2006) , which constructs translations using tree-to-string transducer rules. These rules are extracted from a bitext annotated with both English (target side) parses and word alignments. Rules are extracted from target side constituents that can be projected onto contiguous spans of the source sentence via the word alignment. Constituents that project onto non-contiguous spans of the source sentence do not yield transducer rules themselves, and can only be incorporated into larger transducer rules. Thus, if the word alignment of a sentence pair does not respect the constituent structure of the target sentence, then the minimal translation units must span large tree fragments, which do not generalize well. We present and evaluate an unsupervised word alignment model similar in character and computation to the HMM model (Ney and Vogel, 1996) , but which incorporates a novel, syntax-aware distortion component which conditions on target language parse trees. These trees, while automatically generated and therefore imperfect, are nonetheless (1) a useful source of structural bias and (2) the same trees which constrain future stages of processing anyway. In our model, the trees do not rule out any alignments, but rather softly influence the probability of transitioning between alignment positions. In particular, transition probabilities condition upon paths through the target parse tree, allowing the model to prefer distortions which respect the tree structure. Our model generates word alignments that better respect the parse trees upon which they are conditioned, without sacrificing alignment quality. Using the joint training technique of Liang et al. (2006) to initialize the model parameters, we achieve an AER superior to the GIZA++ implementation of IBM model 4 (Och and Ney, 2003) and a reduction of 56.3% in aligned interior nodes, a measure of agreement between alignments and parses. As a result, our alignments yield more rules, which better match those we would extract had we used manual alignments. Translation with Tree Transducers In a tree transducer system, as in phrase-based systems, the coverage and generality of the transducer inventory is strongly related to the effectiveness of the translation model (Galley et al., 2006) . We will demonstrate that this coverage, in turn, is related to the degree to which initial word alignments respect syntactic correspondences. et al. (2004) proposes a method for extracting tree transducer rules from a parallel corpus. Given a source language sentence s, a target language parse tree t of its translation, and a word-level alignment, their algorithm identifies the constituents in t which map onto contiguous substrings of s via the alignment. The root nodes of such constituents -denoted frontier nodes -serve as the roots and leaves of tree fragments that form minimal transducer rules. Rule Extraction Galley Frontier nodes are distinguished by their compatibility with the word alignment. For a constituent c of t, we consider the set of source words s c that are aligned to c. If none of the source words in the linear closure s * c (the words between the leftmost and rightmost members of s c ) aligns to a target word outside of c, then the root of c is a frontier node. The remaining interior nodes do not generate rules, but can play a secondary role in a translation system. 1  The roots of null-aligned constituents are not frontier nodes, but can attach productively to multiple minimal rules. Two transducer rules, t 1 → s 1 and t 2 → s 2 , can be combined to form larger translation units by composing t 1 and t 2 at a shared frontier node and appropriately concatenating s 1 and s 2 . However, no technique has yet been shown to robustly extract smaller component rules from a large transducer rule. Thus, for the purpose of maximizing the coverage of the extracted translation model, we prefer to extract many small, minimal rules and generate larger rules via composition. Maximizing the number of frontier nodes supports this goal, while inducing many aligned interior nodes hinders it. Word Alignment Interactions We now turn to the interaction between word alignments and the transducer extraction algorithm. Consider the example sentence in figure 1A , which demonstrates how a particular type of alignment error prevents the extraction of many useful transducer rules. The mistaken link [la ⇒ the] intervenes between axés and carrièr, which both align within an English adjective phrase, while la aligns to a distant subspan of the English parse tree. In this way, the alignment violates the constituent structure of the English parse. While alignment errors are undesirable in general, this error is particularly problematic for a syntax-based translation system. In a phrase-based system, this link would block extraction of the phrases [axés sur la carrièr ⇒ career oriented] and [les emplois ⇒ the jobs] because the error overlaps with both. However, the intervening phrase [emplois sont ⇒ jobs are] would still be extracted, at least capturing the transfer of subject-verb agreement. By contrast, the tree transducer extraction method fails to extract any of these fragments: the alignment error causes all non-terminal nodes in the parse tree to be interior nodes, excluding preterminals and the root. Figure 1B exposes the consequences: a wide array of desired rules are lost during extraction. The degree to which a word alignment respects the constituent structure of a parse tree can be quantified by the frequency of interior nodes, which indicate alignment patterns that cross constituent boundaries. To achieve maximum coverage of the translation model, we hope to infer tree-violating alignments only when syntactic structures truly diverge. . Legend Correct proposed word alignment consistent with human annotation. Proposed word alignment error inconsistent with human annotation. Word alignment constellation that renders the root of the relevant constituent to be an interior node. Word alignment constellation that would allow a phrase extraction in a phrase-based translation system, but which does not correspond to an English constituent. Bold Italic Frontier node (agrees with alignment) Interior node (inconsistent with alignment) (S (NP (DT[0] NNS[1]) (VP AUX[2] (ADJV NN[3] VBN[4]) .[5]) → [0] [1] [2] [3] [4] [5] (S (NP (DT[0] (NNS jobs)) (VP AUX[1] (ADJV NN[2] VBN[3]) .[4]) → [0] sont [1] [2] [3] [4] (S (NP (DT[0] (NNS jobs)) (VP (AUX are) (ADJV NN[1] VBN[2]) .[3]) → [0] emplois sont [1] [2] [3] (S NP[0] VP[1] .[2]) → [0] [1] [2] (S (NP (DT[0] NNS[1]) VP[2] .[3]) → [0] [1] [2] [3] (S (NP (DT[0] (NNS jobs)) VP[2] .[3]) → [0] emplois [2] [3] (S (NP (DT[0] (NNS jobs)) (VP AUX[1] ADJV[2]) .[3]) → [0] emplois [1] [2] [3] (S (NP (DT[0] (NNS jobs)) (VP (AUX are) ADJV[1]) .[2]) → [0] emplois sont [1] [2] Figure 1 : In this transducer extraction example, (A) shows a proposed alignment from our test set with an alignment error that violates the constituent structure of the English sentence. The resulting frontier nodes are printed in bold; all nodes would be frontier nodes under a correct alignment. (B) shows a small sample of the rules extracted under the proposed alignment, (ii), and the correct alignment, (i) and (ii). The single alignment error prevents the extraction of all rules in (i) and many more. This alignment pattern was observed in our test set and corrected by our model. Unsupervised Word Alignment To allow for this preference, we present a novel conditional alignment model of a foreign (source) sentence f = {f 1 , ..., f J } given an English (target) sentence e = {e 1 , ..., e I } and a target tree structure t. Like the classic IBM models (Brown et al., 1994) , our model will introduce a latent alignment vector a = {a 1 , ..., a J } that specifies the position of an aligned target word for each source word. Formally, our model describes p(a, f|e, t), but otherwise borrows heavily from the HMM alignment model of Ney and Vogel (1996) . The HMM model captures the intuition that the alignment vector a will in general progress across the sentence e in a pattern which is mostly local, perhaps with a few large jumps. That is, alignments are locally monotonic more often than not. Formally, the HMM model factors as: p(a, f|e) = J j=1 p d (a j |a j − , j)p (f j |e a j ) where j − is the position of the last non-null-aligned source word before position j, p is a lexical transfer model, and p d is a local distortion model. As in all such models, the lexical component p is a collection of unsmoothed multinomial distributions over foreign words. The distortion model p d (a j |a j − , j) is a distribution over the signed distance a j − a j − , typically parameterized as a multinomial, Gaussian or exponential distribution. The implementation that serves as our baseline uses a multinomial distribution with separate parameters for j = 1, j = J and shared parameters for all 1 < j < J. Null alignments have fixed probability at any position. Inference over a requires only the standard forward-backward algorithm. Syntax-Sensitive Distortion The broad and robust success of the HMM alignment model underscores the utility of its assumptions: that word-level translations can be usefully modeled via first-degree Markov transitions and independent lexical productions. However, its distortion model considers only string distance, disregarding the constituent structure of the English sentence. To allow syntax-sensitive distortion, we consider a new distortion model of the form p d (a j |a j − , j, t). We condition on t via a generative process that transitions between two English positions by traversing the unique shortest path ρ (a j − ,a j ,t) through t from a j − to a j . We constrain ourselves to this shortest path using a staged generative process. This process is a first-degree Markov walk through the tree, conditioning on the current node The jobs are career oriented . . Figure 2 : An example sequence of staged tree transitions implied by the unique shortest path from the word oriented (a j − = 5) to the word the (a j = 1). and its immediate surroundings at each step. We enforce the property that ρ (a j − ,a j ,t) be unique by staging the process and disallowing zero distance moves in stage 2. Figure 2 gives an example sequence of tree transitions for a small parse tree. The parameterization of this distortion model follows directly from its generative process. Given a path ρ (a j − ,a j ,t) with r = k + m + 3 nodes including the two leaves, the nearest common ancestor, k intervening nodes on the ascent and m on the descent, we express it as a triple of staged tree transitions that include k POPs, a STOP, a MOVE, and m PUSHes:   {POP(n 2 ), ..., POP(n k+1 ), STOP(n k+2 )} {MOVE (n k+2 , φ(n k+3 ) − φ(n k+1 ))} {PUSH (n k+3 , φ(n k+4 )) , ..., PUSH (n r−1 , φ(n r ))}   Next, we assign probabilities to each tree transition in each stage. In selecting these distributions, we aim to maintain the original HMM's sensitivity to target word order: • Selecting POP or STOP is a simple Bernoulli distribution conditioned upon a node type. • We model both MOVE and PUSH as multinomial distributions over the signed distance in positions (assuming a starting position of 0 for PUSH), echoing the parameterization popular in implementations of the HMM model. This model reduces to the classic HMM distortion model given minimal English trees of only uniformly labeled pre-terminals and a root node. The classic 0-distance distortion would correspond to the 20 For instance, the short path from relieve to on gives a high transition likelihood. STOP probability of the pre-terminal label; all other distances would correspond to MOVE probabilities conditioned on the root label, and the probability of transitioning to the terminal state would correspond to the POP probability of the root label. As in a multinomial-distortion implementation of the classic HMM model, we must sometimes artificially normalize these distributions in the deficient case that certain jumps extend beyond the ends of the local rules. For this reason, MOVE and PUSH are actually parameterized by three values: a node type, a signed distance, and a range of options that dictates a normalization adjustment. Once each tree transition generates a score, their product gives the probability of the entire path, and thereby the cost of the transition between string positions. Figure 3 shows an example learned distribution that reflects the structure of the given parse. With these derivation steps in place, we must address a handful of special cases to complete the generative model. We require that the Markov walk from leaf to leaf of the English tree must start and end at the root, using the following assumptions. 1. Given no previous alignment, we forego stages 1 and 2 and begin with a series of PUSHes from the root of the tree to the desired leaf. 2. Given no subsequent alignments, we skip stages 2 and 3 after a series of POPs including a pop conditioned on the root node. 3. If the first choice in stage 1 is to STOP at the current leaf, then stage 2 and 3 are unnecessary. Hence, a choice to STOP immediately is a choice to emit another foreign word from the current English word. 4. We flatten unary transitions from the tree when computing distortion probabilities. 5. Null alignments are treated just as in the HMM model, incurring a fixed cost from any position. This model can be simplified by removing all conditioning on node types. However, we found this variant to slightly underperform the full model described above. Intuitively, types carry information about cross-linguistic ordering preferences. Training Approach Because our model largely mirrors the generative process and structure of the original HMM model, we apply a nearly identical training procedure to fit the parameters to the training data via the Expectation-Maximization algorithm. Och and Ney (2003) gives a detailed exposition of the technique. In the E-step, we employ the forward-backward algorithm and current parameters to find expected counts for each potential pair of links in each training pair. In this familiar dynamic programming approach, we must compute the distortion probabilities for each pair of English positions. The minimal path between two leaves in a tree can be computed efficiently by first finding the path from the root to each leaf, then comparing those paths to find the nearest common ancestor and a path through it -requiring time linear in the height of the tree. Computing distortion costs independently for each pair of words in the sentence imposed a computational overhead of roughly 50% over the original HMM model. The bulk of this increase arises from the fact that distortion probabilities in this model must be computed for each unique tree, in contrast to the original HMM which has the same distortion probabilities for all sentences of a given length. In the M-step, we re-estimate the parameters of the model using the expected counts collected during the E-step. All of the component distributions of our lexical and distortion models are multinomials. Thus, upon assuming these expectations as values for the hidden alignment vectors, we maximize likelihood of the training data simply by computing relative frequencies for each component multinomial. For the distortion model, an expected count c(a j , a j − ) is allocated to all tree transitions along the path ρ (a j − ,a j ,t) . These allocations are summed and normalized for each tree transition type to complete re-estimation. The method of re-estimating the lexical model remains unchanged. Initialization of the lexical model affects performance dramatically. Using the simple but effective joint training technique of Liang et al. (2006) , we initialized the model with lexical parameters from a jointly trained implementation of IBM Model 1. Liang et al. (2006) shows that thresholding the posterior probabilities of alignments improves AER relative to computing Viterbi alignments. That is, we choose a threshold τ (typically τ = 0.5), and take a = {(i, j) : p(a j = i|f, e) > τ }. Improved Posterior Inference Posterior thresholding provides computationally convenient ways to combine multiple alignments, and bidirectional combination often corrects for errors in individual directional alignment models. Liang et al. (2006) suggests a soft intersection of a model m with a reverse model r (foreign to English) that thresholds the product of their posteriors at each position: a = {(i, j) : p m (a j = i|f, e) • p r (a i = j|f, e) > τ } . These intersected alignments can be quite sparse, boosting precision at the expense of recall. We explore a generalized version to this approach by varying the function c that combines p m and p r : a = {(i, j) : c(p m , p r ) > τ }. If c is the max function, we recover the (hard) union of the forward and reverse posterior alignments. If c is the min function, we recover the (hard) intersection. A novel, high performing alternative is the soft union, which we evaluate in the next section: c(p m , p r ) = p m (a j = i|f, e) + p r (a i = j|f, e) 2 . Syntax-alignment compatibility can be further promoted with a simple posterior decoding heuristic we call competitive thresholding. Given a threshold and a matrix c of combined weights for each possible link in an alignment, we include a link (i, j) only if its weight c ij is above-threshold and it is connected to the maximum weighted link in both row i and column j. That is, only the maximum in each column and row and a contiguous enclosing span of above-threshold links are included in the alignment. Related Work This proposed model is not the first variant of the HMM model that incorporates syntax-based distortion. Lopez and Resnik (2005) considers a simpler tree distance distortion model. Daumé III and Marcu (2005) employs a syntax-aware distortion model for aligning summaries to documents, but condition upon the roots of the constituents that are jumped over during a transition, instead of those that are visited during a walk through the tree. In the case of syntactic machine translation, we want to condition on crossing constituent boundaries, even if no constituents are skipped in the process. Experimental Results To understand the behavior of this model, we computed the standard alignment error rate (AER) performance metric. 2 We also investigated extractionspecific metrics: the frequency of interior nodes -a measure of how often the alignments violate the constituent structure of English parses -and a variant of the CPER metric of Ayan and Dorr (2006) . We evaluated the performance of our model on both French-English and Chinese-English manually aligned data sets. For Chinese, we trained on the FBIS corpus and the LDC bilingual dictionary, then tested on 491 hand-aligned sentences from the 2002 2 The hand-aligned test data has been annotated with both sure alignments S and possible alignments P , with S ⊆ P , according to the specifications described in Och and Ney (2003) . With these alignments, we compute AER for a proposed alignment A as: the syntactic HMM model and competitive thresholding together. Individually, each of these changes contributes substantially to this increase. Together, their benefits are partially, but not fully, additive. \" 1 − |A∩S|+|A∩P | |A|+|S| \" × 100%. Conclusion In light of the need to reconcile word alignments with phrase structure trees for syntactic MT, we have proposed an HMM-like model whose distortion is sensitive to such trees. Our model substantially reduces the number of interior nodes in the aligned corpus and improves rule extraction while nearly retaining the speed and alignment accuracy of the HMM model. While it remains to be seen whether these improvements impact final translation accuracy, it is reasonable to hope that, all else equal, alignments which better respect syntactic correspondences will be superior for syntactic MT. NIST MT evaluation set. For French, we used the Hansards data from the NAACL 2003 Shared Task. 3  We trained on 100k sentences for each language. Alignment Error Rate We compared our model to the original HMM model, identical in implementation to our syntactic HMM model save the distortion component. Both models were initialized using the same jointly trained Model 1 parameters (5 iterations), then trained independently for 5 iterations. Both models were then combined with an independently trained HMM model in the opposite direction: f → e. 4 Table 1 summarizes the results; the two models perform similarly. The main benefit of our model is the effect on rule extraction, discussed below. We also compared our French results to the public baseline GIZA++ using the script published for the NAACL 2006 Machine Translation Workshop Shared Task. 5 Similarly, we compared our Chinese results to the GIZA++ results in Ayan and Dorr (2006) . Our models substantially outperform GIZA++, confirming results in Liang et al. (2006) . Table 2 shows the effect on AER of competitive thresholding and different combination functions. 3 Following previous work, we developed our system on the 37 provided validation sentences and the first 100 sentences of the corpus test set. We used the remainder as a test set. 4 Null emission probabilities were fixed to 1 |e| , inversely proportional to the length of the English sentence. The decoding threshold was held fixed at τ = 0.5. 5 Training includes 16 iterations of various IBM models and a fixed null emission probability of .01. The output of running GIZA++ in both directions was combined via intersection. The most dramatic effect of competitive thresholding is to improve alignment quality for hard unions. It also impacts rule extraction substantially. Rule Extraction Results While its competitive AER certainly speaks to the potential utility of our syntactic distortion model, we proposed the model for a different purpose: to minimize the particularly troubling alignment errors that cross constituent boundaries and violate the structure of English parse trees. We found that while the HMM and Syntactic models have very similar AER, they make substantially different errors. To investigate the differences, we measured the degree to which each set of alignments violated the supplied parse trees, by counting the frequency of interior nodes that are not null aligned. Figure 4 summarizes the results of the experiment for French: the Syntactic distortion with competitive thresholding reduces tree violations substantially. Interior node frequency is reduced by 56% overall, with the most dramatic improvement observed for clausal constituents. We observed a similar 50% reduction for the Chinese data. Additionally, we evaluated our model with the transducer analog to the consistent phrase error rate (CPER) metric of Ayan and Dorr (2006) . This evaluation computes precision, recall, and F1 of the rules extracted under a proposed alignment, relative to the rules extracted under the gold-standard sure alignments. Table 3 shows improvements in F1 by using",
    "abstract": "Extracting tree transducer rules for syntactic MT systems can be hindered by word alignment errors that violate syntactic correspondences. We propose a novel model for unsupervised word alignment which explicitly takes into account target language constituent structure, while retaining the robustness and efficiency of the HMM alignment model. Our model's predictions improve the yield of a tree transducer extraction system, without sacrificing alignment quality. We also discuss the impact of various posteriorbased methods of reconciling bidirectional alignments.",
    "countries": [
        "United States"
    ],
    "languages": [
        "English"
    ],
    "numcitedby": "131",
    "year": "2007",
    "month": "June",
    "title": "Tailoring Word Alignments to Syntactic Machine Translation"
}