{
    "article": "Non-verbal modalities such as gesture can improve processing of spontaneous spoken language. For example, similar hand gestures tend to predict semantic similarity, so features that quantify gestural similarity can improve semantic tasks such as coreference resolution. However, not all hand movements are informative gestures; psychological research has shown that speakers are more likely to gesture meaningfully when their speech is ambiguous. Ideally, one would attend to gesture only in such circumstances, and ignore other hand movements. We present conditional modality fusion, which formalizes this intuition by treating the informativeness of gesture as a hidden variable to be learned jointly with the class label. Applied to coreference resolution, conditional modality fusion significantly outperforms both early and late modality fusion, which are current techniques for modality combination. Introduction Non-verbal modalities such as gesture and prosody can increase the robustness of NLP systems to the inevitable disfluency of spontaneous speech. For example, consider the following excerpt from a dialogue in which the speaker describes a mechanical device: \"So this moves up, and it -everything moves up. And this top one clears this area here, and goes all the way up to the top.\" The references in this passage are difficult to disambiguate, but the gestures shown in Figure 1 make the meaning more clear. However, non-verbal modalities are often noisy, and their interactions with speech are complex (McNeill, 1992) . Gesture, for example, is sometimes communicative, but other times merely distracting. While people have little difficulty distinguishing between meaningful gestures and irrelevant hand motions (e.g., selftouching, adjusting glasses) (Goodwin and Goodwin, 1986) , NLP systems may be confused by such seemingly random movements. Our goal is to include non-verbal features only in the specific cases when they are helpful and necessary. We present a model that learns in an unsupervised fashion when non-verbal features are useful, allowing it to gate the contribution of those features. The relevance of the non-verbal features is treated as a hidden variable, which is learned jointly with the class label in a conditional model. We demonstrate that this improves performance on binary coreference resolution, the task of determining whether a noun phrases refers to a single semantic entity. Conditional modality fusion yields a relative increase of 73% in the contribution of hand-gesture features. The model is not specifically tailored to gesturespeech integration, and may also be applicable to other non-verbal modalities. Related work Most of the existing work on integrating non-verbal features relates to prosody. For example, Shriberg et al. (2000) explore the use of prosodic features for sentence and topic segmentation. The first modal-Figure 1 : An example where gesture helps to disambiguate meaning. ity combination technique that they consider trains a single classifier with all modalities combined into a single feature vector; this is sometimes called \"early fusion.\" Shriberg et al. also consider training separate classifiers and combining their posteriors, either through weighted addition or multiplication; this is sometimes called \"late fusion.\" Late fusion is also employed for gesture-speech combination in (Chen et al., 2004) . Experiments in both (Shriberg et al., 2000) and (Kim et al., 2004) find no conclusive winner among early fusion, additive late fusion, and multiplicative late fusion. Toyama and Horvitz (2000) introduce a Bayesian network approach to modality combination for speaker identification. As in late fusion, modalityspecific classifiers are trained independently. However, the Bayesian approach also learns to predict the reliability of each modality on a given instance, and incorporates this information into the Bayes net. While more flexible than the interpolation techniques described in (Shriberg et al., 2000) , training modality-specific classifiers separately is still suboptimal compared to training them jointly, because independent training of the modality-specific classifiers forces them to account for data that they cannot possibly explain. For example, if the speaker is not gesturing meaningfully, it is counterproductive to train a gesture-modality classifier on the features at this instant; doing so can lead to overfitting and poor generalization. Our approach combines aspects of both early and late fusion. As in early fusion, classifiers for all modalities are trained jointly. But as in Toyama and Horvitz's Bayesian late fusion model, modalities can be weighted based on their predictive power for specific instances. In addition, our model is trained to maximize conditional likelihood, rather than joint likelihood. Conditional modality fusion The goal of our approach is to learn to weight the non-verbal features x nv only when they are relevant. To do this, we introduce a hidden variable m ∈ {−1, 1}, which governs whether the nonverbal features are included. p(m) is conditioned on a subset of features x m , which may belong to any modality; p(m|x m ) is learned jointly with the class label p(y|x), with y ∈ {−1, 1}. For our coreference resolution model, y corresponds to whether a given pair of noun phrases refers to the same entity. In a log-linear model, parameterized by weights w, we have: p(y|x; w) = m p(y, m|x; w) = m exp(ψ(y, m, x; w)) y ,m exp(ψ(y , m, x; w)) . Here, ψ is a potential function representing the compatibility between the label y, the hidden variable m, and the observations x; this potential is parameterized by a vector of weights, w. The numerator expresses the compatibility of the label y and observations x, summed over all possible values of the hidden variable m. The denominator sums over both m and all possible labels y , yielding the conditional probability p(y|x; w). The use of hidden variables 353 in a conditionally-trained model follows (Quattoni et al., 2004) . This model can be trained by a gradient-based optimization to maximize the conditional loglikelihood of the observations. The unregularized log-likelihood and gradient are given by: The form of the potential function ψ is where our intuitions about the role of the hidden variable are formalized. Our goal is to include the non-verbal features x nv only when they are relevant; consequently, the weight for these features should go to zero for some settings of the hidden variable m. In addition, verbal language is different when used in combination with meaningful non-verbal communication than when it is used unimodally (Kehler, 2000; Melinger and Levelt, 2004) . Thus, we learn a different set of feature weights for each case: w v,1 when the non-verbal features are included, and w v,2 otherwise. The formal definition of the potential function for conditional modality fusion is: l(w) = X i ln(p(yi|xi; w)) (1) ψ(y, m, x; w) ≡ y(w T v,1 x v + w T nv x nv ) + w T m x m m = 1 yw T v,2 x v − w T m x m m = −1. (3) Application to coreference resolution We apply conditional modality fusion to coreference resolution -the problem of partitioning the noun phrases in a document into clusters, where all members of a cluster refer to the same semantic entity. Coreference resolution on text datasets is wellstudied (e.g., (Cardie and Wagstaff, 1999) ). This prior work provides the departure point for our investigation of coreference resolution on spontaneous and unconstrained speech and gesture. Form of the model The form of the model used in this application is slightly different from that shown in Equation 3 . When determining whether two noun phrases corefer, the features at each utterance must be considered. For example, if we are to compare the similarity of the gestures that accompany the two noun phrases, it should be the case that gesture is relevant during both time periods. For this reason, we create two hidden variables, m 1 and m 2 ; they indicate the relevance of gesture over the first (antecedent) and second (anaphor) noun phrases, respectively. Since gesture similarity is only meaningful if the gesture is relevant during both NPs, the gesture features are included only if m 1 = m 2 = 1. Similarly, the linguistic feature weights w v,1 are used when m 1 = m 2 = 1; otherwise the weights w v,2 are used. This yields the model shown in Equation 4 . The vector of meta features x m 1 includes all single-phrase verbal and gesture features from Table 1, computed at the antecedent noun phrase; x m 2 includes the single-phrase verbal and gesture features, computed at the anaphoric noun phrase. The label-dependent verbal features x v include both pairwise and single phrase verbal features from the table, while the label-dependent non-verbal features x nv include only the pairwise gesture features. The single-phrase non-verbal features were not included because they were not thought to be informative as to whether the associated noun-phrase would participate in coreference relations. Verbal features We employ a set of verbal features that is similar to the features used by state-of-the-art coreference resolution systems that operate on text (e.g., (Cardie and Wagstaff, 1999) ). Pairwise verbal features include: several string-match variants; distance features, measured in terms of the number of intervening noun phrases and sentences between the candidate NPs; and some syntactic features that can be computed from part of speech tags. Single-phrase verbal features describe the type of the noun phrase (definite, indefinite, demonstrative (e.g., this ball), or pronoun), the number of times it appeared in the document, and whether there were any adjecti-354 ψ(y, m 1 , m 2 , x; w) ≡ y(w T v,1 x v + w T nv x nv ) + m 1 w T m x m 1 + m 2 w T m x m 2 , m 1 = m 2 = 1 yw T v,2 x v + m 1 w T m x m 1 + m 2 w T m x m 2 , otherwise. (4) val modifiers. The continuous-valued features were binned using a supervised technique (Fayyad and Irani, 1993) . Note that some features commonly used for coreference on the MUC and ACE corpora are not applicable here. For example, gazetteers listing names of nations or corporations are not relevant to our corpus, which focuses on discussions of mechanical devices (see section 5). Because we are working from transcripts rather than text, features dependent on punctuation and capitalization, such as apposition, are also not applicable. Non-verbal features Our non-verbal features attempt to capture similarity between the speaker's hand gestures; similar gestures are thought to suggest semantic similarity (Mc-Neill, 1992) . For example, two noun phrases may be more likely to corefer if they are accompanied by identically-located pointing gestures. In this section, we describe features that quantify various aspects of gestural similarity. The most straightforward measure of similarity is the Euclidean distance between the average hand position during each noun phrase -we call this the FOCUS-DISTANCE feature. Euclidean distance captures cases in which the speaker is performing a gestural \"hold\" in roughly the same location (McNeill, 1992) . However, Euclidean distance may not correlate directly with semantic similarity. For example, when gesturing at a detailed part of a diagram, very small changes in hand position may be semantically meaningful, while in other regions positional similarity may be defined more loosely. Ideally, we would compute a semantic feature capturing the object of the speaker's reference (e.g., \"the red block\"), but this is not possible in general, since a complete taxonomy of all possible objects of reference is usually unknown. Instead, we use a hidden Markov model (HMM) to perform a spatio-temporal clustering on hand position and velocity. The SAME-CLUSTER feature reports whether the hand positions during two noun phrases were usually grouped in the same cluster by the HMM. JS-DIV reports the Jensen-Shannon divergence, a continuous-valued feature used to measure the similarity in cluster assignment probabilities between the two gestures (Lin, 1991) . The gesture features described thus far capture the similarity between static gestures; that is, gestures in which the hand position is nearly constant. However, these features do not capture the similarity between gesture trajectories, which may also be used to communicate meaning. For example, a description of two identical motions might be expressed by very similar gesture trajectories. To measure the similarity between gesture trajectories, we use dynamic time warping (Huang et al., 2001) , which gives a similarity metric for temporal data that is invariant to speed. This is reported in the DTW-DISTANCE feature. All features are computed from hand and body pixel coordinates, which are obtained via computer vision; our vision system is similar to (Deutscher et al., 2000) . The feature set currently supports only single-hand gestures, using the hand that is farthest from the body center. As with the verbal feature set, supervised binning was applied to the continuousvalued features. Meta features The role of the meta features is to determine whether the gesture features are relevant at a given point in time. To make this determination, both verbal and non-verbal features are applied; the only requirement is that they be computable at a single instant in time (unlike features that measure the similarity between two NPs or gestures). Verbal meta features Meaningful gesture has been shown to be more frequent when the associated speech is ambiguous (Melinger and Levelt, 2004) . Kehler finds that fully-specified noun phrases are less likely to receive multimodal support (Kehler, 2000) . These findings lead us to expect that pro- nouns should be likely to co-occur with meaningful gestures, while definite NPs and noun phrases that include adjectival modifiers should be unlikely to do so. To capture these intuitions, all single-phrase verbal features are included as meta features. Non-verbal meta features Research on gesture has shown that semantically meaningful hand motions usually take place away from \"rest position,\" which is located at the speaker's lap or sides (Mc-Neill, 1992) . Effortful movements away from these default positions can thus be expected to predict that gesture is being used to communicate. We identify rest position as the center of the body on the x-axis, and at a fixed, predefined location on the yaxis. The DIST-TO-REST feature computes the average Euclidean distance of the hands from the rest position, over the duration of the NP. As noted in the previous section, a spatiotemporal clustering was performed on the hand positions and velocities, using an HMM. The REST-CLUSTER feature takes the value \"true\" iff the most frequently occupied cluster during the NP is the cluster closest to rest position. In addition, parameter tying in the HMM forces all clusters but one to represent static hold, with the remaining cluster accounting for the transition movements between holds. Only this last cluster is permitted to have an expected non-zero speed; if the hand is most frequently in this cluster during the NP, then the MOVEMENT-CLUSTER feature takes the value \"true.\" Implementation The objective function (Equation 1 ) is optimized using a Java implementation of L-BFGS, a quasi-Newton numerical optimization technique (Liu and Nocedal, 1989) . Standard L2-norm regularization is employed to prevent overfitting, with crossvalidation to select the regularization constant. Although standard logistic regression optimizes a convex objective, the inclusion of the hidden variable renders our objective non-convex. Thus, convergence to a global minimum is not guaranteed. of mechanical devices to a friend. There are nine different pairs of participants; each contributed two dialogues, with two thrown out due to recording errors. One participant, the \"speaker,\" saw a short video describing the function of the device prior to the dialogue; the other participant was tested on comprehension of the device's behavior after the dialogue. The speaker was given a pre-printed diagram to aid in the discussion. For simplicity, only the speaker's utterances were included in these experiments. The dialogues were limited to three minutes in duration, and most of the participants used the entire allotted time. \"Markable\" noun phrases -those that are permitted to participate in coreference relations -were annotated by the first author, in accordance with the MUC task definition (Hirschman and Chinchor, 1997) . A total of 1141 \"markable\" NPs were transcribed, roughly half the size of the MUC6 development set, which includes 2072 markable NPs over 30 documents. Evaluation metric Coreference resolution is often performed in two phases: a binary classification phase, in which the likelihood of coreference for each pair of noun phrases is assessed; and a partitioning phase, in which the clusters of mutually-coreferring NPs are formed, maximizing some global criterion (Cardie and Wagstaff, 1999) . Our model does not address the formation of nounphrase clusters, but only the question of whether each pair of noun phrases in the document corefer. Consequently, we evaluate only the binary classification phase, and report results in terms of the area under the ROC curve (AUC). As the small size of the corpus did not permit dedicated test and development sets, results are computed using leave-oneout cross-validation, with one fold for each of the sixteen documents in the corpus. Baselines Three types of baselines were compared to our conditional modality fusion (CMF) technique: • Early fusion. The early fusion baseline includes all features in a single vector, ignoring modality. This is equivalent to standard maximum-entropy classification. Early fusion is implemented with a conditionally-trained linear classifier; it uses the same code as the CMF model, but always includes all features. • Late fusion. The late fusion baselines train separate classifiers for gesture and speech, and then combine their posteriors. The modalityspecific classifiers are conditionally-trained linear models, and again use the same code as the CMF model. For simplicity, a parameter sweep identifies the interpolation weights that maximize performance on the test set. Thus, it is likely that these results somewhat overestimate the performance of these baseline models. We report results for both additive and multiplicative combination of posteriors. • No fusion. These baselines include the features from only a single modality, and again build a conditionally-trained linear classifier. Implementation uses the same code as the CMF model, but weights on features outside the target modality are forced to zero. Although a comparison with existing state-of-theart coreference systems would be ideal, all such available systems use verbal features that are inapplicable to our dataset, such as punctuation, capitalization, and gazetteers. The verbal features that we have included are a representative sample from the literature (e.g., (Cardie and Wagstaff, 1999) ). The \"no fusion, verbal features only\" baseline thus provides a reasonable representation of prior work on coreference, by applying a maximum-entropy classifier to this set of typical verbal features. Parameter tuning Continuous features are binned separately for each cross-validation fold, using only the training data. The regularization constant is selected by cross-validation within each training subset. Results Conditional modality fusion outperforms all other approaches by a statistically significant margin (Table 2). Compared with early fusion, CMF offers an absolute improvement of 1.20% in area under the ROC curve (AUC).  result is statistically significant (p < .002, t(15) = 3.73). CMF obtains higher performance on fourteen of the sixteen test folds. Both additive and multiplicative late fusion perform on par with early fusion. Early fusion with gesture features is superior to unimodal verbal classification by an absolute improvement of 1.64% AUC (p < 4 * 10 −4 , t(15) = 4.45). Thus, while gesture features improve coreference resolution on this dataset, their effectiveness is increased by a relative 73% when conditional modality fusion is applied. Figure 2 shows how performance varies with the regularization constant. Discussion The feature weights learned by the system to determine coreference largely confirm our linguistic intuitions. Among the textual features, a large positive weight was assigned to the string match features, while a large negative weight was assigned to features such as number incompatibility (i.e., sin-pronoun def dem indef \"this\" \"it\" \"that\" \"they\" modifiers −0.6 gular versus plural). The system also learned that gestures with similar hand positions and trajectories were likely to indicate coreferring noun phrases; all of our similarity metrics were correlated positively with coreference. A chi-squared analysis found that the EDIT DISTANCE was the most informative verbal feature. The most informative gesture feature was DTW-AGREEMENT feature, which measures the similarity between gesture trajectories. As described in section 4, both textual and gestural features are used to determine whether the gesture is relevant. Among textual features, definite and indefinite noun phrases were assigned negative weights, suggesting gesture would not be useful to disambiguate coreference for such NPs. Pronouns were assigned positive weights, with \"this\" and the much less frequently used \"they\" receiving the strongest weights. \"It\" and \"that\" received lower weights; we observed that these pronouns were frequently used to refer to the immediately preceding noun phrase, so multimodal support was often unnecessary. Last, we note that NPs with adjectival modifiers were assigned negative weights, supporting the finding of (Kehler, 2000) that fully-specified NPs are less likely to receive multimodal support. A summary of the weights assigned to the verbal meta features is shown in Figure 3 . Among gesture meta features, the weights learned by the system indicate that non-moving hand gestures away from the body are most likely to be informative in this dataset. 358 Future work We have assumed that the relevance of gesture to semantics is dependent only on the currently available features, and not conditioned on prior history. In reality, meaningful gestures occur over contiguous blocks of time, rather than at randomly distributed instances. Indeed, the psychology literature describes a finite-state model of gesture, proceeding from \"preparation,\" to \"stroke,\" \"hold,\" and then \"retraction\" (McNeill, 1992) . These units are called movement phases. The relevance of various gesture features may be expected to depend on the movement phase. During strokes, the trajectory of the gesture may be the most relevant feature, while during holds, static features such as hand position and hand shape may dominate; during preparation and retraction, gesture features are likely to be irrelevant. The identification of these movement phases should be independent of the specific problem of coreference resolution. Thus, additional labels for other linguistic phenomena (e.g., topic segmentation, disfluency) could be combined into the model. Ideally, each additional set of labels would transfer performance gains to the other labeling problems. Conclusions We have presented a new method for combining multiple modalities, which we feel is especially relevant to non-verbal modalities that are used to communicate only intermittently. Our model treats the relevance of the non-verbal modality as a hidden variable, learned jointly with the class labels. Applied to coreference resolution, this model yields a relative increase of 73% in the contribution of the gesture features. This gain is attained by identifying instances in which gesture features are especially relevant, and weighing their contribution more heavily. We next plan to investigate models with a temporal component, so that the behavior of the hidden variable is governed by a finite-state transducer. Acknowledgments We thank Aaron Adler, Regina Barzilay, S. R. K. Branavan, Sonya Cates, Erdong Chen, Michael Collins, Lisa Guttentag, Michael Oltmans, and Tom Ouyang. This research is supported in part by MIT Project Oxygen.",
    "abstract": "Non-verbal modalities such as gesture can improve processing of spontaneous spoken language. For example, similar hand gestures tend to predict semantic similarity, so features that quantify gestural similarity can improve semantic tasks such as coreference resolution. However, not all hand movements are informative gestures; psychological research has shown that speakers are more likely to gesture meaningfully when their speech is ambiguous. Ideally, one would attend to gesture only in such circumstances, and ignore other hand movements. We present conditional modality fusion, which formalizes this intuition by treating the informativeness of gesture as a hidden variable to be learned jointly with the class label. Applied to coreference resolution, conditional modality fusion significantly outperforms both early and late modality fusion, which are current techniques for modality combination.",
    "countries": [
        "United States"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "11",
    "year": "2007",
    "month": "June",
    "title": "Conditional Modality Fusion for Coreference Resolution"
}