{
    "article": "Distributional models of semantics capture word meaning very effectively, and they have been recently extended to account for compositionally-obtained representations of phrases made of content words. We explore whether compositional distributional semantic models can also handle a construction in which grammatical terms play a crucial role, namely determiner phrases (DPs). We introduce a new publicly available dataset to test distributional representations of DPs, and we evaluate state-of-the-art models on this set. Introduction Distributional semantics models (DSMs) approximate meaning with vectors that record the distributional occurrence patterns of words in corpora. DSMs have been effectively applied to increasingly more sophisticated semantic tasks in linguistics, artificial intelligence and cognitive science, and they have been recently extended to capture the meaning of phrases and sentences via compositional mechanisms. However, scaling up to larger constituents poses the issue of how to handle grammatical words, such as determiners, prepositions, or auxiliaries, that lack rich conceptual content, and operate instead as the logical \"glue\" holding sentences together. In typical DSMs, grammatical words are treated as \"stop words\" to be discarded, or at best used as context features in the representation of content words. Similarly, current compositional DSMs (cDSMs) focus almost entirely on phrases made of two or more content words (e.g., adjective-noun or verb-noun combinations) and completely ignore grammatical words, to the point that even the test set of transitive sentences proposed by Grefenstette and Sadrzadeh (2011) contains only Tarzan-style statements with determiner-less subjects and objects: \"table show result\", \"priest say mass\", etc. As these examples suggest, however, as soon as we set our sight on modeling phrases and sentences, grammatical words are hard to avoid. Stripping off grammatical words has more serious consequences than making you sound like the Lord of the Jungle. Even if we accept the view of, e.g., Garrette et al. (2013) , that the logical framework of language should be left to other devices than distributional semantics, and the latter should be limited to similarity scoring, still ignoring grammatical elements is going to dramatically distort the very similarity scores (c)DSMs should provide. If we want to use a cDSM for the classic similarity-based paraphrasing task, the model shouldn't conclude that \"The table shows many results\" is identical to \"the table shows no results\" since the two sentences contain the same content words, or that \"to kill many rats\" and \"to kill few rats\" are equally good paraphrases of \"to exterminate rats\". We focus here on how cDSMs handle determiners and the phrases they form with nouns (determiner phrases, or DPs). 1 While determiners are only a subset of grammatical words, they are a large and important subset, constituting the natural stepping stone towards sentential distributional semantics: Compositional methods have already been successfully applied to simple noun-verb and noun-verb-noun structures (Mitchell and Lapata, 2008; Grefenstette and Sadrzadeh, 2011) , and determiners are just what is missing to turn these skeletal constructions into full-fledged sentences. Moreover, determiner-noun phrases are, in superficial syntactic terms, similar to the adjective-noun phrases that have already been extensively studied from a cDSM perspective by Baroni and Zampar-elli (2010) , Guevara (2010) and Mitchell and Lapata (2010) . Thus, we can straightforwardly extend the methods already proposed for adjective-noun phrases to DPs. We introduce a new task, a similarity-based challenge, where we consider nouns that are strongly conceptually related to certain DPs and test whether cDSMs can pick the most appropriate related DP (e.g., monarchy is more related to one ruler than many rulers). 2 We make our new dataset publicly available, and we hope that it will stimulate further work on the distributional semantics of grammatical elements. 3 Composition models Interest in compositional DSMs has skyrocketed in the last few years, particularly since the influential work of Mitchell and Lapata (2008; 2009; 2010) , who proposed three simple but effective composition models. In these models, the composed vectors are obtained through componentwise operations on the constituent vectors. Given input vectors u and v, the multiplicative model (mult) returns a composed vector p with: p i = u i v i . In the weighted additive model (wadd), the composed vector is a weighted sum of the two input vectors: p = αu + βv, where α and β are two scalars. Finally, in the dilation model, the output vector is obtained by first decomposing one of the input vectors, say v, into a vector parallel to u and an orthogonal vector. Following this, the parallel vector is dilated by a factor λ before re-combining. This results in: p = (λ − 1) u, v u + u, u v. A more general form of the additive model (fulladd) has been proposed by Guevara (2010) (see also Zanzotto et al. (2010) ). In this approach, the two vectors to be added are pre-multiplied by weight matrices estimated from corpus-extracted examples: p = Au + Bv. Baroni and Zamparelli (2010) and Coecke et al. (2010) take inspiration from formal semantics to characterize composition in terms of function application. The former model adjective-noun phrases by treating the adjective as a function from nouns onto modified nouns. Given that linear functions can be expressed by matrices and their application by matrix-by-vector multiplication, a functor (such as the adjective) is represented by a matrix U to be multiplied with the argument vector v (e.g., the noun vector): p = Uv. Adjective matrices are estimated from corpus-extracted examples of noun vectors and corresponding output adjective-noun phrase vectors, similarly to Guevara's approach. 4   3 The noun-DP relatedness benchmark Paraphrasing a single word with a phrase is a natural task for models of compositionality (Turney, 2012; Zanzotto et al., 2010) and determiners sometimes play a crucial role in defining the meaning of a noun. For example a trilogy is composed of three works, an assemblage includes several things and an orchestra is made of many musicians. These examples are particularly interesting, since they point to a \"conceptual\" use of determiners, as components of the stable and generic meaning of a content word (as opposed to situation-dependent deictic and anaphoric usages): for these determiners the boundary between content and grammatical word is somewhat blurred, and they thus provide a good entry point for testing DSM representations of DPs on a classic similarity task. In other words, we can set up an experiment in which having an effective representation of the determiner is crucial in order to obtain the correct result. Using regular expressions over WordNet glosses (Fellbaum, 1998) and complementing them with definitions from various online dictionaries, we constructed a list of more than 200 nouns that are strongly conceptually related to a specific DP. We created a multiple-choice test set by matching each noun with its associated DP (target DP), two \"foil\" DPs sharing the same noun as the target but combined with other determiners (same-N foils), one DP made of the target determiner combined with a random noun (same-D foil), the target determiner (D foil), and the target noun (N foil). A few examples are shown in Table 1 . After the materials were checked by all authors, two native speakers took the multiple-choice test. We removed the cases (32) where these subjects provided an unexpected answer. Setup Our semantic space provides distributional representations of determiners, nouns and DPs. We considered a set of 50 determiners that include all those in our benchmark and range from quantifying determiners (every, some. . . ) and low numerals (one to four), to multi-word units analyzed as single determiners in the literature, such as a few, all that, too much. We picked the 20K most frequent nouns in our source corpus considering singular and plural forms as separate words, since number clearly plays an important role in DP semantics. Finally, for each of the target determiners we added to the space the 2K most frequent DPs containing that determiner and a target noun. Co-occurrence statistics were collected from the concatenation of ukWaC, a mid-2009 dump of the English Wikipedia and the British National Corpus, 5 with a total of 2.8 billion tokens. We use a bag-of-words approach, counting co-occurrence with all context words in the same sentence with a target item. We tuned a number of parameters on the independent MEN word-relatedness benchmark (Bruni et al., 2012) . This led us to pick the top 20K most frequent content word lemmas as context items, Pointwise Mutual Information as weighting scheme, and dimensionality reduction by Non-negative Matrix Factorization. Except for the parameter-free mult method, parameters of the composition methods are estimated by minimizing the average Euclidean distance between the model-generated and corpusextracted vectors of the 20K DPs we consider. 6  For the lexfunc model, we assume that the determiner is the functor and the noun is the argument, Similarly to the classic TOEFL synonym detection challenge (Landauer and Dumais, 1997) , our models tackle the relatedness task by measuring cosines between each target noun and the candidate answers and returning the item with the highest cosine. Results Table 2 reports the accuracy results (mean ranks of correct answers confirm the same trend). All models except mult and determiner outperform the trivial random guessing baseline, although they are all well below the 100% accuracy of the humans who took our test. For the mult method we observe a very strong bias for choosing a single word as answer (>60% of the times), which in the test set is always incorrect. This leads to its accuracy being below the chance level. We suspect that the highly \"intersective\" nature of this model (we obtain very sparse composed DP vectors, only ≈4% dense) leads to it not being a reliable method for comparing sequences of words of different length: Shorter sequences will be considered more similar due to their higher density. The determiner-only baseline (using the vector of the component determiner as surrogate for the DP) fails because D vectors tend to be far from N vectors, thus the N foil is often preferred to the correct response (that is represented, for this baseline, by its D). In the noun-only baseline (use the vector of the component noun as surrogate for the DP), the correct response is identical to the same-N and N foils, thus forcing a random choice between these. Not surprisingly, this approach performs quite badly. The observed DP vectors extracted directly from the corpus compete with the top compositional methods, but do not surpass them. 7  The lexfunc method is the best compositional model, indicating that its added flexibility in modeling composition pays off empirically. The fulladd model is not as good, but also performs well. The wadd and especially dilation models perform relatively well, but they are penalized by the fact that they assign more weight to the noun vectors, making the right answer dangerously similar to the same-N and N foils. Taking a closer look at the performance of the best model (lexfunc), we observe that it is not equally distributed across determiners. Focusing on those determiners appearing in at least 4 correct answers, they range from those where lexfunc performance was very significantly above chance (p<0.001 of equal or higher chance performance): too few, all, four, too much, less, several; to those on which performance was still significant but less impressively so (0.001 < p < 0.05): several, no, various, most, two, too many, many, one; to those where performance was not significantly better than chance at the 0.05 level: much, more, three, another. Given that, on the one hand, performance is not constant across determiners, and on the other no obvious groupings can account for their performance difference (compare the excellent lexfunc performance on four to the lousy one on three!), future research should explore the contextual properties of specific determiners that make them more or less amenable to be captured by compositional DSMs. Conclusion DSMs, even when applied to phrases, are typically seen as models of content word meaning. However, to scale up compositionally beyond the simplest constructions, cDSMs must deal with grammatical terms such as determiners. This paper started exploring this issue by introducing a new and publicly available set testing DP semantics in a similarity-based task and using it to systematically evaluate, for the first time, cDSMs on a con-struction involving grammatical words. The most important take-home message is that distributional representations are rich enough to encode information about determiners, achieving performance well above chance on the new benchmark. Theoretical considerations would lead one to expect a \"functional\" approach to determiner representations along the lines of Baroni and Zamparelli (2010) and Coecke et al. (2010) to outperform those approaches that combine vectors separately representing determiners and nouns. This prediction was largely borne out in the results, although the additive models, and particularly fulladd, were competitive rivals. We attempted to capture the distributional semantics of DPs using a fairly standard, \"vanilla\" semantic space characterized by latent dimensions that summarize patterns of co-occurrence with content word contexts. By inspecting the context words that are most associated with the various latent dimensions we obtained through Nonnegative Matrix Factorization, we notice how they are capturing broad, \"topical\" aspects of meaning (the first dimension is represented by scripture, believer, resurrection, the fourth by fever, infection, infected, and so on). Considering the sort of semantic space we used (which we took to be a reasonable starting point because of its effectiveness in a standard lexical task), it is actually surprising that we obtained the significant results we obtained. Thus, a top priority in future work is to explore different contextual features, such as adverbs and grammatical terms, that might carry information that is more directly relevant to the semantics of determiners. Another important line of research pertains to improving composition methods: Although the best model, at 40% accuracy, is well above chance, we are still far from the 100% performance of humans. We will try, in particular, to include nonlinear transformations in the spirit of Socher et al. (2012) , and look for better ways to automatically select training data. Last but not least, in the near future we would like to test if cDSMs, besides dealing with similarity-based aspects of determiner meaning, can also help in capturing those formal properties of determiners, such as monotonicity or definiteness, that theoretical semanticists have been traditionally interested in. Acknowledgments This research was supported by the ERC 2011 Starting Independent Research Grant n. 283554 (COMPOSES).",
    "abstract": "Distributional models of semantics capture word meaning very effectively, and they have been recently extended to account for compositionally-obtained representations of phrases made of content words. We explore whether compositional distributional semantic models can also handle a construction in which grammatical terms play a crucial role, namely determiner phrases (DPs). We introduce a new publicly available dataset to test distributional representations of DPs, and we evaluate state-of-the-art models on this set.",
    "countries": [
        "Italy"
    ],
    "languages": [
        "English"
    ],
    "numcitedby": "21",
    "year": "2013",
    "month": "August",
    "title": "A relatedness benchmark to test the role of determiners in compositional distributional semantics"
}