{
    "article": "We introduce the Hierarchical Ideal Point Topic Model, which provides a rich picture of policy issues, framing, and voting behavior using a joint model of votes, bill text, and the language that legislators use when debating bills. We use this model to look at the relationship between Tea Party Republicans and \"establishment\" Republicans in the U.S. House of Representatives during the 112 th Congress. Capturing Political Polarization Ideal-point models are one of the most widely used tools in contemporary political science research (Poole and Rosenthal, 2007) . These models estimate political preferences for legislators, known as their ideal points, from binary data such as legislative votes. Popular formulations analyze legislators' votes and place them on a one-dimensional scale, most often interpreted as an ideological spectrum from liberal to conservative. Moving beyond a single dimension is attractive, however, since people may lean differently based on policy issues; for example, the conservative movement in the U.S. includes fiscal conservatives who are relatively liberal on social issues, and vice versa. In multi-dimensional ideal point models, therefore, the ideal point of each legislator is no longer characterized by a single number, but by a multi-dimensional vector. With that move comes a new challenge, though: the additional dimensions are often difficult to interpret. To mitigate this problem, recent research has introduced methods that estimate multi-dimensional ideal points using both voting data and the texts of the bills being voted on, e.g., using topic models and associating each dimension of the ideal point space with a topic. The words most strongly associated with the topic can sometimes provide a readable description of its corresponding dimension. In this paper, we develop this idea further by introducing HIPTM, the Hierarchical Ideal Point Topic Model, to estimate multi-dimensional ideal points for legislators in the U.S. Congress. HIPTM differs from previous models in three ways. First, HIPTM uses not only votes and associated bill text, but also the language of the legislators themselves; this allows predictions of ideal points from politicians' writing alone. Second, HIPTM improves the interpretability of ideal-point dimensions by incorporating data from the Congressional Bills Project (Adler and Wilkerson, 2015) , in which bills are labeled with major topics from the Policy Agendas Project Topic Codebook. 1 And third, HIPTM discovers a hierarchy of topics, allowing us to analyze both agenda issues and issue-specific frames that legislators use on the congressional floor, following Nguyen et al. (2013) in modeling framing as second-level agenda setting (McCombs, 2005) . Using this new model, we focus on Republican legislators during the 112 th U.S. Congress, from January 2011 until January 2013. This is a particularly interesting session of Congress for political scientists, because of the rise of the Tea Party, a decentralized political movement with populist, libertarian, and conservative elements. Although united with \"establishment\" Republicans against Democrats in the 2010 midterm elections, leading to massive Democratic defeats, the Tea Party was-and still is-wrestling with establishment Republicans for control of the Republican party. The Tea Party is a new and complex phenomenon for political scientists; as Carmines and D'Amico (2015) observe: \"Conventional views of ideology as a single-dimensional, left-right spectrum experience great difficulty in understanding or explaining the Tea Party.\" Our model identifies legislators who have low (or high) levels of \"Tea Partiness\" but are (or are not) members of the Tea Party Caucus, and providing insights into the na-ture of polarization within the Republican party. HIPTM also makes it possible to investigate a number of questions of interest to political scientists. For example, are there Republicans who identify themselves as members of the Tea Party, but whose votes and language betray a lack of enthusiasm for Tea Party issues? How well can we predict from someone's language alone whether they are likely to associate themselves with the Tea Party? Our computational modeling approach to \"Tea Partiness\", distinct from self-declared Tea Party Caucus membership, may have particular value in understanding Republican party politics going forward because, despite the continued influence of the Tea Party, the official Tea Party Caucus in the House of Representatives is largely inactive and its future uncertain (Fuller, 2015) . Polarization across Dimensions Ideal point models describe probabilistic relationships between observed responses (votes) on a set of items (bills) by a set of responders (legislators) who are characterized by continuous latent traits (Fox, 2010) . A popular formulation posits an ideal point u a for each lawmaker a, a polarity x b , and popularity y b for each bill b, all being values in (−∞, +∞) (Martin and Quinn, 2002; Bafumi et al., 2005; Gerrish and Blei, 2011) . Lawmaker a votes \"Yes\" on bill b with probability p(v a,b = Yes | u a , x b , y b ) = Φ(u a x b + y b ) (1) where Φ(α) = exp(α)/(1 + exp(α)) is the logistic (or inverse-logit) function. 2 Intuitively, most lawmakers vote \"Yes\" on bills with high popularity y b and \"No\" on bills with low y b . When a bill's popularity is lower, the outcome of the vote v a,b depends more on the interaction between the lawmaker's ideal point u a and the bill's polarity x b . Multi-dimensional ideal point models replace scalars u a and x b with K-dimensional vectors u a and x b (Heckman and Jr., 1997; Jackman, 2001; Clinton et al., 2004) . Unfortunately, as Lauderdale and Clark (2014) observe, the binary data used for these models are \"insufficiently informative to support analyses beyond one or two dimensions\", and the additional dimensions are difficult to interpret. To address this lack of interpretability, recent work has proposed multi-dimensional ideal point models to jointly capture both binary votes and the associ- Hierarchical Ideal Point Topic Model Bringing topic models (Blei and Lafferty, 2009) into ideal-point modeling provides an interpretable, text-based foundation for political scientists to understand why the models make the predictions they do. However, both the topic-what is discussedand the framing-how it is discussed-also reveal political preferences. We therefore introduce framespecific ideal points, using a hierarchy of topics to model issues and their issue-specific frames. Although the definition of \"frame\" is itself a moving target in political science (Entman, 1993) , we adopt the theoretically motivated but pragmatic approach of Nguyen et al. (2013) : just as agenda-issues map naturally to topics in probabilistic topic models (e.g., Grimmer (2010) ), the frames as second-level agenda-setting (McCombs, 2005) a ∈ [1, A] to bill b ∈ [1, B]. Two types of text supplement the votes: floor speeches (documents) {w d } from legislator a d , and the text w b of bill b. While congressional debates are typically about one piece of legislation, we make no assumptions about the mapping between w d and w b . In principle this allows w d to be any text by legislator a d (e.g., not just floor speeches about this bill, but blogs, social media, press releases) and-unlike Gerrish and Blei (2011) -this permits us to make predictions about individuals even without vote data for them. Figure 1 shows the plate notation diagram of HIPTM, which has the following generative process: 1. For each issue k ∈ [1, K] (a) Draw k's associated topic φ k ∼ Dir(β, φ k ) (b) Draw issue-specific distribution over frames ψ k ∼ GEM(λ0) (c) For each frame j ∈ [1, ∞) (specific to issue k) i. Draw j's associated topic φ k,j ∼ Dir(β, φ k ) ii. Draw j's regression weight η k,j ∼ N (0, γ) 2. For each document d ∈ [1, D] by legislator a d (a) Draw topic (i.e., issue) distribution θ d ∼ Dir(α) (b) For each issue k ∈ [1, K], draw frame distribu- tion ψ d,k ∼ DP(λ, ψ k ) (c) For each token n ∈ [1, N d ] i. Draw an issue z d,n ∼ Mult(θ d ) ii. Draw a frame t d,n ∼ Mult(ψ d,z d,n ) iii. Draw word w d,n ∼ Mult(φz d,n ,t d,n ) 3. For each legislator a ∈ [1, A] on each issue k ∈ [1, K] (a) Draw issue-specific ideal point u a,k ∼ N ( J k j=1 ψa,k,j η k,j , ρ) weighting η k,j by how much the legislator talks about that frame  Topic Hierarchy. With the goal of analyzing agendas and frames in mind, our topic hierarchy has two levels: (1) issue nodes and (2) frame nodes. (Look ahead to Figure 6 for an illustration.) More specifically, there are K issue nodes, each with a topic φ k drawn from a Dirichlet distribution with concentration parameter β and a prior mean vector φ k , i.e., φ k ∼ Dir(β, φ k ). In this hierarchical structure, first-level nodes map to agenda issues, which we treat as non-polarized, and second-level nodes map to issue-specific frames, which we assume polarize on the issue-specific dimension. 3  To improve topic interpretability, issue nodes have an informed prior from the Congressional Bills Project {φ k } (Table 1 ). 4 The frame topic φ k,j at each frame node is a Dirichlet draw centered at the corresponding (parent) issue node. While the number of issues is fixed a priori, the number of second-level frames is unbounded. We also associate each second-level frame node with an ideal point η k,j ∼ N (0, γ). This resembles how supervised topic models (Blei and McAuliffe, 2007; Nguyen et al., 2015) discover polarized topics' associated response variables. ‫ݓ‬ ௗ ܰௗ ‫ݐ‬ ௗ ߠ ௗ ߙ ‫ܦ‬ ߪ ‫ݖ‬ ௗ ߰ ௗ ߰ ߣ ߣ ߶ * ߶ ‫ܭ‬ ‫ݓ‬ ᇱ ‫ݔ‬ ‫ݕ‬ ߴ ‫ݖ‬ ᇱ ߶ ߚ ‫ݒ‬ ‫ܣ‬ ‫ܤ‬ ‫ܯ‬ ‫ܬ‬ ‫ܬ‬ ‫ܭ‬ ߙ ‫ܭ‬ ߩ ߛ ‫ݑ‬ ߟ ‫ܭ‬ Figure Generating Text from Legislators. One of our model's goal is to study how legislators frame policy agenda issues. To achieve that, we analyze congressional speeches (documents) {w d }, each of which is delivered by a legislator a d . To generate each token w d,n of a speech d, legislator a d will (1) first choose an issue z d,n ∈ [1, K] from a document-specific multinomial θ d , then (2) choose a frame t d,n from the set of infinitely many possible frames of the given issue z d,n using the frame proportion ψ d,k drawn from a Dirichlet process, and finally (3) choose a word type from the chosen frame's topic φ z d,n ,t d,n . In other words, our model generates speeches using a mixture of K HDPs (Teh et al., 2006). 5   Generating Bill Text. The bill text provides information about the policy agenda issues that each bill addresses. We use LDA to model the bill text {w b }. Each bill b is a mixture ϑ b over K issues, which is drawn from a symmetric Dirichlet prior, i.e., ϑ b ∼ Dir(α). Each token w b,m in bill b is generated by first choosing a topic z b,m ∼ Mult(ϑ b ), and then choosing a word type w b,m ∼ Mult(φ z b,m ), as in LDA. Generating Roll Call Votes. Following recent work on multi-dimensional ideal points (Lauderdale and Clark, 2014; Sim et al., 2015) , we define the probability of legislator a voting \"Yes\" on bill b as p(v a,b = Yes | u a , x b , y b , θb ) = Φ x b K k=1 θb,k u a,k + y b ( 2 ) where θb is the empirical distribution of bill b over the K issues and is defined as θb,k = M b,k M b,• . Here, M b,k is the number of times in which tokens in b the empirical word distribution from all bills labeled with k. K = 19, corresponding to 19 major topic headings in the Policy Agendas Project Topic Codebook. 5 If we abandoned the labeled data from the Congressional Bills Project to obtain the prior means φ k , it would be relatively straightforward to extend to a fully nonparametric model with unbounded K (Ahmed et al., 2013; Paisley et al., 2014) . are assigned to issue k and M b,• is the marginal count, i.e., the number of tokens in bill b. The ideal point of legislator a specifically on issue k is u a,k and comes from a normal distribution N ( ψT a,k η k , ρ) ≡ N   J k j=1 ψa,k,j η k,j , ρ   (3) where J k is the number of frames for topic k, which is unbounded. The mean of the Normal distribution is a linear combination of the ideal points {η k,j } of all issue k's frames, weighted by how much time legislator a spends on each frame when talking about issue k, i.e., ψ a,k,j = N a,k,j N a,k,• . Here, N a,k,j is the number of tokens authored by a that are assigned to frame j of issue k, and N a,k,• is the marginal count. When N a,k,• = 0, which means that legislator a does not talk about issue k, we back off to an uninformed zero mean. Equation 3 resembles how supervised topic models (SLDA) link topics with a response, in that the response-the issue-specific ideal point u a,k -is latent. It is similar to how Gerrish and Blei (2011) use the bill text to regress on the bill's latent polarity x b and popularity y b . In this paper, we only use text from congressional speeches for regression, as these can capture how legislators frame specific topics. Incorporating the bill text into the regression is an interesting direction for future work. Inference Given observed data of (1) votes {v a,b } by A legislators on B bills, (2) speeches {w d } from legislators, and (3) bill text {w b }, we estimate the latent variables using stochastic EM. In each iteration, we perform the following steps: (1) sampling issue assignments {z b,m } for bill text tokens, (2) sampling the issue assignments {z d,n } and frame assignments {t d,n } for speech tokens, (3) sampling the topics at first-level issue nodes {φ k }, (4) sampling the distribution over frames {ψ k } for all issues, (5) optimizing frames' regression parameters {η k,j } using L-BFGS (Liu and Nocedal, 1989) , and (6) updating legislators' ideal points {u a,k } and bills' polarity {x b } and popularity {y b } using gradient ascent. Sampling Issue Assignments for Bill Tokens The probability of assigning a token w b,m in the bill text to an issue k is p(z b,m = k | rest) ∝ M −b,m b,k + α M −b,m b,• + Kα • φk,w b,m (4) where M b,k denotes the number of tokens in bill text b assigned to issue k. The current estimated probability of word type v given issue k is φk,v (Equation 7 ). Marginal counts are denoted by • and the superscript −b,m excludes the assignment for token w b,m from the corresponding count. Sampling Frame Assignments in Speeches To sample the assignments for tokens in the speeches, we first sample an issue using p(z d,n = k | rest) ∝ N −d,n d,k + α N −d,n d,• + Kα • φk,w d,n (5) where N d,k similarly denotes the number of times that tokens in d are assigned to issue k. Given the sampled issue k, we sample the frame as p(t d,n = j | z d,n = k, a d = a, rest) ∝      N (u a,k ; µ a,k,j , ρ) • N −d,n d,k,j N −d,n d,k,j +λ + λ• ψk,j N −d,n d,k,j +λ , N (u a,k ; µ a,k,j new , ρ) • λ N −d,n d,k,j +λ • ψk,j new , (6) where µ a,k,j = ( J k j =1 η k,j N −d,n d,k,j + η k,j )/N d,k, • for an existing frame j, and for a newly created frame j new , we have µ a,k, j new = ( J k j =1 η k,j N −d,n d,k,j +η k,j new )/N d,k,• , where η k,j new is drawn from the Gaussian prior N (0, γ). Here, the estimated global probability of choosing a frame j of issue k is ψk,j . Sampling Issue Topics In the generative process of HIPTM, the topic φ k of issue k (1) generates tokens in the bill text and (2) provides the Dirichlet priors of the issue's frames. Rather than collapsing multinomials and factorizing (Hu and Boyd-Graber, 2012) , we follow Ahmed et al. (2013) and sample φk ∼ Dir(m k + ñk + βφ k ) where m k ≡ (M k,1 , M k,2 , • • • , M k,V ) is the token count vector from the bill text assigned to each issue. The vector ñk ≡ ( Ñk,1 , Ñk,2 , • • • , Ñk,V ) denotes the token counts propagated from words assigned to topics that are associated with frames of issue k, approximated using minimal or maximal path assumptions (Cowans, 2006; Wallach, 2008) . Sampling Frame Proportions Following the direct assignment method described in Teh et al. (2006) , we sample the global frame proportion as ψk ≡ ( ψk,1 , ψk,2 , • • • , ψk,j new ) ∼ Dir( N•,k,1 , N•,k,2 , • • • , N•,k,J k , λ 0 ) (8) where N•,k,j = D d=1 Nd,k,j and Nd,k,j can be sampled effectively using the Antoniak distribution (Antoniak, 1974) . Optimizing Frame Regression Parameters We update the regression parameters η k of frames under issue k using L-BFGS (Liu and Nocedal, 1989) to optimize L(η k ) − 1 2ρ A a=1 (u a,k − η T k ψa,k ) − 1 2γ J k j=1 η 2 k,j (9) Updating Ideal Points, Polarity and Popularity We update the multi-dimensional ideal point u a of each legislator a and the polarity x b and popularity y b of each bill b by optimizing the log likelihood using gradient ascent. Data Collection What makes a Tea Partier? To address that question, we use key votes identified by Freedom Works as the most important votes on issues of economic freedom. Led by former House Majority Leader Dick Armey (R-TX), Freedom Works is a conservative non-profit organization which promotes \"Lower Taxes, Less Government, More Freedom\". 6 Karpowitz et al. ( 2011 ) report that Freedom Works endorsements are more effective than other Tea Party organizations at getting out votes for Republican candidates in the 2010 midterms. For the 112 th Congress, Freedom Works selected 60 key votes, 40 in 2011 and 20 in 2012. We are interested in ideal points with respect to the Tea Party movement, i.e., on the anti-pro Tea Party dimension: whether a legislator agrees with Freedom Works on a bill. More specifically, we assign v a,b to be 1 if legislator a agrees with Freedom Works on bill b, and 0 otherwise. In addition to the votes, we obtained the bill text with labels from the Congressional Bills Project 7 and the congressional speeches from GovTrack. 8 In total, we have 240 Republicans, 60 who self-identify with the Tea Party Caucus, and 13,856 votes. Predicting Tea Party Membership To quantitatively evaluate the effectiveness of HIPTM in capturing \"Tea Partiness\", we predict Tea Party Caucus membership of legislators given their votes and text. This examines (1) how effective the baseline features extracted from the votes and text are in predicting the Caucus membership, and (2) how much prediction improves using features extracted from HIPTM. For baselines, we consider over five folds using AUC-ROC (higher is better, random baseline achieves 0.5). The features extracted from our model are estimated using both the votes and the text. simple feature sets where each legislator is represented by their speeches as either (1) a TF-IDF vector (Salton, 1968), (2) a normalized TF-IDF vector, or (3) a binary vector containing their votes. Our dataset for binary prediction comprises a set of 60 Republican representatives who self-identify as Tea Party Caucus members and 180 who do not. These are divided using 5-fold cross-validation with stratified sampling, which preserves the ratio of the two classes in both the training and test sets. We report performance using AUC-ROC (Lusted, 1971) using SVM light (Joachims, 1999) . 9 After preprocessing, our vocabulary contains 5,349 unique word types. Membership from Votes and Text. First, given the votes and text of all the legislators, we run HIPTM for 1,000 iterations with a burn-in period of 500 iterations. After burning in, we keep the sampled state of the model after every fifty iterations. The feature values are obtained by averaging over the ten stored models as suggested in Nguyen et al. (2014) . Each legislator a is represented by a vector concatenating: • K-dimensional ideal point vector estimated from both votes and text u a,k • K-dimensional vector, estimating the ideal point using only text η over five folds using AUC-ROC (higher is better, random baseline achieves 0.5). The features extracted from our model for unseen legislators are estimated using their text only. model, HIPTM, also outperform TF and TF-IDF significantly, but only slightly better than VOTE. However, HIPTM and VOTE together significantly outperform VOTE alone. Membership Prediction from Text Only. The results in Figure 2 require both votes and legislators' language. This is limiting, since it permits predictions of \"Tea Partiness\" only for people with an established congressional voting record. A potentially more interesting and practical task is prediction based on language alone. Thus, we first run our inference algorithm on the training data, which includes both votes and text. After training, using multiple models, we sample the issue and frame assignments for each token of the text authored by test lawmakers. Since the votes are not available, HIPTM's extracted features here only consist of (1) the Kdimensional vector η T k ψa,k estimating legislators' ideal point using text alone, and (2) the B probabilities Φ(x b K k=1 θb,k u a,k + y b ) estimating the votes. Figure 3 compares this approach with the two baselines capable of using text alone, TF and TF-IDF. Since HIPTM can no longer access the votes in the test data, its performance drops significantly compared with VOTE. However, it still quite strongly outperforms the two text-based baselines, showing that jointly modeling the voting behavior improves the text-based elements of the model. How the Tea Party Votes In this section, we examine legislators' ideal points. We first expose Tea Party-specific ideal points by examining one-dimensional ideal points and then move on to the issue-specific ideal points that HIPTM enables. One-dimensional Ideal Points First, as a baseline, we estimate the onedimensional ideal points of the legislators in our dataset. 10 Figure 4 shows the box plots of estimated Tea Party ideal points for both members and non-members. 11 The Tea Party ideal points correlate with DW-NOMINATE (ρ = 0.91), and the median ideal point of Tea Party Caucus members is higher than non-members. This confirms that Tea Partiers are more conservative than other Republicans (Williamson et al., 2011; Karpowitz et al., 2011; Gervais and Morris, 2012; Gervais and Morris, 2014) . Divergences involving these ideal points help demonstrate the face validity of our approach. For example, the model gives Jeff Flake (R-AZ) the second highest ideal point; he only disagrees with Freedom Works position on one of 60 Freedom Works key votes, but he is not a member of the Tea Party Caucus. Another example is Justin Amash (R-MI), who founded and is the Chairman of the Liberty Caucus. Its members are conservative and libertarian Republicans, and Amash has agreed with Freedom Works on every single key vote selected by Freedom Works since 2011. Conversely, some self-identified Tea Partiers often disagree with Freedom Works and thus have relatively low ideal points. For example, Rodney Alexander (R-LA) only agrees with Freedom Works 48% of the time, and was a Democrat before 2004. Alexander and Ander Crenshaw (R-FL, 50% agreement) are categorized as \"Green Tea\" by Gervais and Morris (2014), i.e. Republican legislators who are \"associated with the Tea Party on their own initiative\" but lack support from Tea Party organizations. 10 We use gradient ascent to optimize the likelihood of votes whose probabilities are defined in Equation 1 . We also put a Gaussian prior N (0, σ) on ua, x b , and y b . 11 Estimated ideal point signs might be flipped, as uax b = (−ua)(−x b ), which makes no difference in Equation 1. To ensure that higher ideal points are \"pro-Tea Party\", we first sort the legislators according to the fraction of votes for which they agree with Freedom Works and initialize the ideal points of the top and bottom five legislators with +3σ and -3σ, where σ is the variance of ua's Gaussian prior. 1443 q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q q Civil Rights, Minority Ideal Points Tea Party Caucus Member Non−member Multi-dimensional Ideal Points While it is interesting to compare holistic measures of Tea Partiness, it doesn't reveal how legislators conform or deviate from what defines a mainstream Tea Partier. In this section, HIPTM reveals how issue-specific ideal points of the two groups of Republican representatives differ. Figure 5 shows estimated ideal points for each policy agenda issue, sorted by the difference between the median of the two groups' ideal points. On most issues, the ideal point distributions of the two Republican groups are nigh identical. On several issues, though, the ideal point distributions of the two groups of legislators diverge. In the remainder of this section, we consider the Government Operation, Macroeconomics, and Transportation topics, and look at why HIPTM estimates these issues as the most polarized. Government operations Tea Partiers differ from their Republican colleagues on reducing government spending on the Economic Development Administration, the Energy Efficiency and Renewable Energy Program and Fossil Fuel Research and Development. More specifically, for example, on the key vote to eliminate the Energy Efficiency and Renewable Energy Program, nearly 80% (41 out of 53) of Tea Partiers vote \"Yea\" (with Freedom Works) but only 43% of non-Tea Partiers agree. Macroeconomics Our model estimates Macroeconomics policies as being the second most polarizing topic for House Republicans, which is consistent with the emphasis that the Tea Party places on issues like a balanced budget and reduced federal spending. Indeed, we see that Tea Party Republicans have distinct preferences on these types of issues as compared to more mainstream Republican legislators. An illustration of this polarization can be seen in the intra-party fight over the budget. Roll call vote 275 in 2011 and roll call vote 149 in 2012 both would have replaced Paul Ryan's budget (the \"establishment\" Republican budget) with the Republican Study Committee's (RSC) \"Back to Basics\" budget that would cut spending more aggressively and balance the budget in a decade. In 2011, non-Tea Party Republicans were evenly split in their budget preferences, but three quarters of the Tea Party Caucus supported it, which illustrates the difference between the two factions of the Republican party. Similarly, in 2012, more than 80% of Tea Partiers voted for the the RSC budget, but fewer than half of non-Tea Party Republicans did. Other polarizing votes in the Macroeconomics topic include votes to raise the debt ceiling and to avert the \"fiscal cliff\". In these cases, support for these votes was 25 percentage points higher among Tea Partiers than non-Tea Party Republicans, which again illustrates their distinct policy preferences. Transportation Transportation is the third most polarized issue estimated by our model, with two key votes focusing on federal spending on transportation that illustrate some polarization, but also some shared preferences among Republicans. Consistent with the Tea Party's emphasis on reducing government spending, Tea Party Republicans voted differently from their non-Tea Party colleagues on these issues. The first key vote, roll call vote 378 in 2012, caps highway spending at the amount taken in by the gas tax. More than half of Tea Party Caucus members (32 out of 55) voted in favor, while non-members voted against it by a greater than 2:1 margin (122 of 172). Conversely, the second key vote (roll call vote 451 in 2012) authorizes fed- balanc_budget, borrow, debt_ceil, cap, cut_spend, nation_debt, grandchildren, rais_tax, entitl, white_hous, debt_limit, prosper Frame M1 eral highway spending at a level that far exceeds its revenue from the gas tax, which was opposed by Freedom Works. This measure was broadly popular with Republicans regardless of Tea Party affiliation and a majority of both Tea Partiers and non-Tea Partiers opposed it. Macroeconomics How the Tea Party Talks Looking at HIPTM's induced topic hierarchy, using labeled data to create informative priors produces highly interpretable topics at the agendaissue level; e.g., see the first-level nodes in Figure 6 , which capture key issue-level debates. For example, one major event during the 112 th Congress was the 2011 debt-ceiling crisis, which dominates discussions in Macroeconomics. Similarly, Defense is dominated by withdrawing U.S. troops from Iraq. Turning to framing, recall that second-level nodes of the hierarchy capture issue-specific frames of parent issues, each one associated with a framespecific ideal point. To analyze intra-Republican polarization, we first compute, for each issue k, the span of ideal points the frames associated with k, i.e., the difference between the maximum and the minimum ideal points for frames under that issue. 12  We then consider several issues with a large span, i.e. whose frames are highly polarized. Macroeconomics. The HIPTM subtree for Macroeconomics, in Figure 6 (top), foregrounds 12 The frame proportions Dirichlet process ψ k creates many frames with one or two observations (Miller and Harrison, 2013) . We ignore those with posterior probability ψ k,j < 0.1. Republican polarization related to budget issues. The most Tea Party oriented frame node, M3, focuses on criticizing government overspending, a recurring Tea Party theme. 13 In contrast, Frame M1, least oriented toward the Tea Party, focuses on the downsides of a government shutdown, highlighting establishment Republican concerns about being held responsible for the political and economic consequences. Health. Healthcare was a central issue during the 112 th Congress, particularly the Affordable Care Act (Obamacare). Although all Republicans voted to repeal Obamacare, Figure 6 (bottom) highlights intra-party differences in framing the issue. Frame H1 leans strongest toward the establishment Republican end of the spectrum, and frames opposition in terms of the implementation of health care exchanges and the mandatory costs of the program. In contrast, H3 captures the more strident Tea Party framing of Obamacare as an unconstitutional government takeover. More neutral from an intra-party perspective, Frame H2 emphasizes Medicare, Medicaid, and the role of health care professionals within these systems. 14   Labor, Employment and Immigration. The discussion of this issue illustrates how HIPTM sometimes captures frames that are distinct from Tea Partiness, per se. For example, it discovered a strongly Tea Party oriented frame that focused on \"union, south carolina, nlrb, boeing\". On inspection, this frame reflects a controversy in which the National Labor Relations Board accused airline manufacturer Boeing of violating Federal labor law by transferring production to a non-union facility in South Carolina \"for discriminatory reasons\", 15 and surfaces mainly in speeches by four legislators from South Carolina, three of whom are from the Tea Party Caucus. This second-level topic illustrates a limitation of HIPTM; it does not formally distinguish frames from other kinds of subtopics. We observe that modeling polarization on other kinds of sub-issues is nonetheless valuable: here it highlights a geographic locus of conflict involv- Latent and Visible Disagreement Our analyses suggest a novel framework for understanding the political and policymaking implications of the Tea Party in the 112 th Congress, illustrated in Table 2 . Each issue can be characterized by two features: (1) the degree to which ideal points among Republican legislators are polarized, and (2) the degree to which the frames used are polarized. From these two assessments, we can organize all policy issues into four categories that have meaningful implications for congressional politics and policy outcomes. At upper left we will find issues where HIPTM indicates low intra-party polarization between Tea Party and non-Tea Party, and all Republicans tend to frame the issue in similar ways; e.g., Civil Rights, Minority Issues, and Civil Liberties. In such cases, we expect cooperation among Republicans regardless of Tea Party status, therefore a greater likelihood of bill passage in a majority-Republican House. In stark contrast, issues at lower right involve polarized ideal points and polarized framing, e.g., the budget crisis, where many establishment Republicans balked at a government shutdown but hard-line Tea Party legislators did not. These issues pose the greatest challenge to Republican party leaders. Between these extremes are the issues in which either Republicans' ideal points or their policy frames are polarized. Our model suggests that on issues at upper right, with similar framing, the Tea Party and establishment Republicans will appear to be in sync, and therefore it may seem to voters that legislative progress is likely, but the underlying issue polarization will make it hard to find policy common ground, potentially increasing public frustration. Last, at lower left are issues where Republicans generally share similar ideal points and vote similarly, but frame the issue in distinct ways, e.g., Obamacare. Here legislative success may come despite the appearance that Republican factions are talking past each other, because the distribution of their ideal points on the policy is actually quite similar. Put differently, Republicans share policy goals on issues in this quadrant even if they frame those preferences differently, and this underlying agreement on the ideal point may allow Republicans to reach consensus even when the political rhetoric suggests otherwise. Conclusion We introduce HIPTM, which integrates hierarchical topic modeling with multi-dimensional ideal points to jointly model voting behavior, the text content of bills, and the language used by legislators. HIPTM is more effective than previous methods on the task of predicting membership in the Tea Party Caucus. This improvement is especially consequential as the formal organization of the Tea Party Caucus is now defunct in the House, yet Tea Party legislators remain both numerous and influential in Congress. In addition, unlike previous idealpoint methods, HIPTM makes it possible to make predictions for members of Congress who have not yet established a voting record. More intriguingly, this also suggests the possibility of assessing the \"Tea Partiness\" of candidates (or, anyone else, e.g., media outlets) based on language. It is political conventional wisdom that the influx of Tea Party legislators in the 112 th Congress complicated the task of governance and policymaking for Republican leaders. By looking at issuelevel ideal points and issue-specific framing using our model, we begin to address the complexity of this relationship, finding the model successful both in establishing face validity and in suggesting novel insights into the dynamics of a Republican Congress. In future work, we plan to pursue the new framework suggested by our analyses, investigating the interaction of issue polarization and framing-based polarization. With the help of these new tools, we aim to both understand and predict substantive policy areas in which the Tea Party is likely to be most successful working with the Republican party, and, conversely, to flag ahead of time policy areas in which we can expect to see legislative gridlock and grandstanding. Acknowledgements This work was supported by the NSF Grant IIS-1211153 and IIS-1409287. Boyd-Graber is also supported by NSF grants IIS-1320538 and NCSE-1422492. Any opinions, findings, conclusions, or recommendations expressed here are those of the authors and do not necessarily reflect the view of the sponsor.",
    "abstract": "We introduce the Hierarchical Ideal Point Topic Model, which provides a rich picture of policy issues, framing, and voting behavior using a joint model of votes, bill text, and the language that legislators use when debating bills. We use this model to look at the relationship between Tea Party Republicans and \"establishment\" Republicans in the U.S. House of Representatives during the 112 th Congress.",
    "countries": [
        "United States"
    ],
    "languages": [],
    "numcitedby": "58",
    "year": "2015",
    "month": "July",
    "title": "Tea Party in the House: A Hierarchical Ideal Point Topic Model and Its Application to Republican Legislators in the 112th Congress"
}