{
    "article": "Recently, Web forums have been invaded by opinion manipulation trolls. Some trolls try to influence the other users driven by their own convictions, while in other cases they can be organized and paid, e.g., by a political party or a PR agency that gives them specific instructions what to write. Finding paid trolls automatically using machine learning is a hard task, as there is no enough training data to train a classifier; yet some test data is possible to obtain, as these trolls are sometimes caught and widely exposed. In this paper, we solve the training data problem by assuming that a user who is called a troll by several different people is likely to be such, and one who has never been called a troll is unlikely to be such. We compare the profiles of (i) paid trolls vs. (ii) \"mentioned\" trolls vs. (iii) non-trolls, and we further show that a classifier trained to distinguish (ii) from (iii) does quite well also at telling apart (i) from (iii). Introduction During the 2013-2014 Bulgarian protests against the Oresharski cabinet, social networks and news community forums became the main \"battle grounds\" between supporters and opponents of the government. In that period, there was notable censorship in the media, and many people who lived outside the capital did not really know what was actually happening. Moreover, there was a very notable presence of government supporters in Web forums. In series of leaked documents in the independent Bulgarian media Bivol, 1 it was alleged that the ruling Socialist party was paying Internet trolls with EU Parliament money. The Bivol's leaked documents revealed for the first time such a practice by a political party despite the problem with opinion manipulation being generally notable across Eastern Europe. The reputation management documents described the following services:\"Monthly posting online of 250 comments by virtual users with varied, typical and evolving profiles from different (non-recurring) IP addresses to inform, promote, balance or counteract. The intensity of the provided online presence will be adequately distributed and will correspond to the political situation in the country.\" The practice of using Internet trolls for opinion manipulation has been reality since the rise of Internet and community forums. It has been shown that user opinions about products, companies and politics can be influenced by opinions posted by other online users (Dellarocas, 2006) . This makes it easy for companies and political parties to gain popularity by paying for \"reputation management\" to people that write in discussion forums and social networks fake opinions from fake profiles. Yet, over time, forum users developed sensitivity about trolls, and started publicly exposing them. Related Work A popular way to manipulate public opinion in Intternet is by making controversial posts on a specific topic that aim to win the argument at any cost, usually accompanied by untruthful and deceptive information. The problem of deceptive opinion spam is studied in (Ott et al., 2011) , where the authors integrated work from both psychology and computational linguistics trying to detect fake opinions that were written to sound authentic. Malicious troll users posting misinformation posts have also been studied using graph-based approaches over signed social networks (Ortega et al., 2012; Kumar et al., 2014) . A related problem is that of trustworthiness of statements on the Web (Rowe and Butters, 2009) . Troll detection and offensive language use are understudied problems (Xu and Zhu, 2010) . They have been addressed using analysis of the semantics and the sentiment in posts (Cambria et al., 2010) ; there have been also studies of general troll behavior (Herring et al., 2002; Buckels et al., 2014) . Another approach has been to use lexico-syntactic features about user's writing style, structure, and cyber-bullying content (Chen et al., 2012) ; cyber-bullying was detected using user profile and post metadata (Galn-Garca et al., 2014) , and sentiment analysis (Xu et al., 2012) . A related problem is that of Web spam detection, usually addressed as text classification (Sebastiani, 2002) , e.g., using spam keyword spotting (Dave et al., 2003) , lexical affinity of arbitrary words to spam content (Hu and Liu, 2004) , frequency of punctuation and word co-occurrence (Li et al., 2006) . See (Castillo and Davison, 2011) for an overview on adversarial Web search. Data We crawled the largest media community forum in Bulgaria, that of Dnevnik.bg 2 , a daily newspaper that requires users to be signed in to comment (all in Bulgarian), which makes it easy to track them. The platform allows users to comment on news, to reply to other users' comments and to vote on them with thumbs up/down. Each publication has a category, a subcategory, and a list of manually selected tags (keywords). We crawled the Bulgaria, Europe, and World categories for the period 01-Jan-2013 to 01-Apr-2015, together with the comments and the corresponding user profiles: 34,514 publications on 232 topics and with 13,575 tags, 1,930,818 comments (897,806 of them replies), and 14,598 users. We have three groups of users: known paid trolls (as exposed in Bivol), \"mentioned\" trolls (called trolls by a certain number of different users), and non-trolls (never called trolls, despite having a high number of posts). Looking at users with at least 150 comments, we have 314 \"mentioned\" trolls (mentioned by five or more users) vs. 964 non-trolls (vs. some in between); we further have 15 paid trolls from Bivol. Here is an example post with troll accusation (translated): \"To comment from \"Rozalina\": You, trolls, are so funny :) I saw the same signature under other comments:)\" 2 http://dnevnik.bg Method We train a classifier to distinguish \"mentioned\" trolls vs. non-trolls; we experiment both with balanced and (natural) imbalanced classes. Then, at test time, we evaluate how well the classifier performs at discriminating paid trolls vs. non-trolls. We use a support vector machine (SVM) classifier (Chang and Lin, 2011) with a radial basis function (RBF) kernel, and features motivated by several publications about troll behavior. Note that we perform the classification at the user level, i.e., based on user activity history, from which we extract statistics summarizing the user activity. In particular, for each user, we count the number of comments posted, the number of days in the forum, the number of days with at least one comment, and the number of publications commented on. All other features are scaled with respect to these statistics, which makes it possible for us to handle users that registered only recently (which we need to do at test time). Our features can be divided in the following general groups: Vote-based features. We calculate the number of comments with positive and negative votes for each user. This is useful as we assume that non-trolls are likely to disagree with trolls, and to give them negative votes. We use the sum from all comments as a feature. We also count separately the comments with high, low and medium positive to negative ratio. Here are some example features: (a) the number of comments where (positive/negative) < 0.25, and (b) the number of comments where (positive/negative) < 0.50. Comment-to-publication similarity. These features measure the similarity between comments and publications. We use cosine and TF.IDFweighted vectors for the comment and for the publication. The idea is that trolls might try to change or blurr the topic of the publication if it differs from his/her views or agenda. Comment order-based features. We count how many user comments the user has among the first k. The idea is that trolls might try to be among the first to comment to achieve higher impact. Top loved/hated comments. We calculate the number of times the user's comments were among the top 1, 3, 5, 10 most loved/hated comments in some thread. The idea is that in the comment thread below many publications there are some trolls that oppose all other users, and usually their comments are among the most hated. Comment replies-based features. These are features that count how many comments by a given user are replies to other users' comments, how many are replies to other replies, and so on. The assumption here is that trolls post not only a large number of comments, but also a large number or replies, as they want to dominate the conversation, especially when defending a specific cause. We further generate complex features that combine user comment reply features and vote countsbased features, thus generating even more features that model the relationship between replies and user agreement/disagreement. Time-based features. We generate features from the number of comments posted during different time periods on a daily or on a weekly basis. We assume that users who are paid or who could be activists of political parties probably have some usual times to post, e.g., maybe they do it as a fulltime job. On the other hand, most non-trolls work from 9:00 to 18:00, and thus we could expect that they should probably post less comments during this part of the day. We have time-based features that count the number of comments from 9:00 to 9:59, from 12:00 to 12:59, during working hours 9:00-18:00, etc. Note that all the above features are scaled, i.e., divided by the number of comments, by the number of days the user has spent in the forum, by the number of days in which the user posted more than one comment, etc. Overall, we have a total of 338 such scaled features. In addition, we define a new set of features, which are non-scaled. Non-scaled features. The non-scaled features are features based on the same statistics as above, but they are not divided by the number of comments / number of days in the forum / number of days with more that one comment, etc. For example, one non-scaled feature is the number of times a comment by the target user was voted negatively, i.e., as thumbs down, by other users. As a non-scaled feature, we would use this number directly, while above we would scale it by dividing it by the total number of user's comments, by the total number of publications the user has commented on, etc. Obviously, there is a danger in using non-scaled features: older users are likely to have higher values for them compared to recentlyregistered users. Yet, we found unscaled features useful in previous experiments (Mihaylov et al., 2015) , so we included them here as well. Experiments and Evaluation In previous work (Mihaylov et al., 2015) , we have already experiments with distinguishing \"mentioned\" trolls vs. non-trolls, achieving accuracy of 88-94%. Here, we are interested in discriminating between paid trolls and non-trolls. Unfortunately, we only know fifteen paid trolls (from the publication in Bivol), which is too little to use for training and testing. Thus, we trained on \"mentioned\" trolls vs. non-trolls, but we then tested on paid trolls vs. non-trolls. We focused on the top four known paid trolls with the highest number of posts, as they had more than 100 comments, which means that we had enough information about them. 3 Thus, for testing we used the four trolls with 100 posts or more, to which we added four non-trolls (i.e., users who have never been called trolls). For training, we used 314 \"mentioned\" troll with 150 posts or more, to which we added 314 non-trolls, also with 150+ posts. For the experiments, we extracted the features described in the previous section, both scaled and non-scaled, and we normalized them in the -1 to 1 interval. We then trained a support vector machine (SVM) classifier (Chang and Lin, 2011) with a radial basis function (RBF) kernel with C=32 and g=0.0078125. We chose these values using crossvalidation on the training dataset. The testing results are shown in Tables 1 and 2 . Table 1 shows that we can find paid trolls with 100% precision and 75% recall, which is quite good. However, we should be very cautious about any conclusions we draw, as we only had eight testing examples. Yet, let us try to do some analysis. First, note that the best F-score is achieved when using All Scaled features. Moreover, features based on reply status, similarity, up/down votes, number of triggered replies seem to have no impact on the classification performance, as excluding them from the All Scaled features does not affect the results either way. However, excluding time-related features and reply comments votebased features results in bad score, which means that these features have the most impact on finding paid trolls. Finally, excluding all vote-related features results in zero precision and recall on paid trolls evaluation, which means that these features are key for finding paid trolls. We train on 314 \"mentioned\" trolls vs. 314 non-trolls. (The top features are better, as they perform well when used alone.) Features Table 2 shows the performance of selected feature groups when used in isolation. We can see that features such as time of posting and votes are among the most important ones; yet, in our previous research, we have found them to be virtually irrelevant for finding \"mentioned\" trolls vs. nontrolls (Mihaylov et al., 2015) . Table 2 also shows that the best score is achieved by the day of the week feature, which confirms our assumption that paid trolls tend to write on working days. Next come the timerelated features, which includes hour-related features and number of comments posted during working hours vs. in the evenings. Discussion Recall that our objective in this work was to identify paid opinion manipulation trolls in Internet forums. Unfortunately, we could not train a classifier to do that directly, as we did not have enough known paid trolls. Thus, we resorted to a simple trick: we considered as trolls those users who were accused of being such by other users. The assumption was that some of these \"mentioned\" trolls could have actually been paid. However, this is much of a witch hunt and despite our good overall results, the training data is not 100% reliable. For example, some trolls, whether paid or not, could have accused some non-trolls of being trolls, by mistake or on purpose. Recall also that, in our experiments above, we used for testing only four of the fifteen known paid trolls: those with 100 or more comments. It is interesting to see how our classifier would perform if tested on trolls with different minimum number of comments (and the corresponding number of non-trolls). This is shown in Figure 1 : we can see that most known paid users with less than 40 comments cannot be exposed as trolls using \"mentioned\" trolls as training examples. Next, we vary the number of mentions (by different people) needed for us to consider a user a troll; we try 3, 4 and 6, in addition to 5 as above. Table 3 shows the results when testing on paid trolls with 100+ mentions (4 trolls + 4 non-trolls), where we trained with All Scaled features, and users with 150+ comments and varying minimum number of mentions as a troll. Table 4 shows results when training on the same datasets as in Table 3 , but this time evaluating with cross-validation on the training data. We can see that the best results when testing with paid trolls are achieved for \"mentioned\" trolls with a minimum of 4 or 5 mentions (Table 3), while when both training and evaluating with \"mentioned\" trolls (Table 4 ), the best results are with 6 mentions. This could mean that paid trolls behave more like moderately \"mentioned\" trolls rather than like highly \"mentioned\" trolls. More experiments, with a higher number of known paid trolls, are needed in order to confirm this. Finally, we built and analyzed aggregated profiles for the three kinds of users we considered: (i) paid trolls vs. (ii) \"mentioned\" trolls vs. (iii) non-trolls. 4 For this purpose, we selected average values for the most notable features for the users with the highest number of comments from each group. We then normalized these values with value/max. The result is shown on Figure 2 . (1 -Active days to all time rate) shows that \"mentioned\" trolls write at least one comment in 52% of their days of all time being in the forum, while non-trolls do so 36% of the time, and paid trolls only do it 15% of the time. This suggests that paid trolls are less active, maybe because they only write comments when they are paid to do it. (2 -Comments per active day) shows that paid trolls and \"mentioned\" trolls write twice as many comments as non-trolls per day. (3 -Avg comments per publication) shows that both paid and \"mentioned\" trolls post more comments per publication than non-trolls. (4 -Neg voted by other users), (6 -High neg voted by other users), (7 -Med neg voted by other users) show that both paid and \"mentioned\" trolls have much more negatively voted comments than non-trolls. Yet, this is higher for paid trolls, which could mean that they have more influence compared to the self-driven \"mentioned\" trolls. (5) -\"mentioned\" trolls have more positively voted comments compared to paid trolls. (8 -Replies comments rate) -\"mentioned\" trolls are more likely to write comments that are replies to other user's comments compared to non-trolls, while paid trolls prefer to write specific comments and not to enter personal \"battles\". Moreover, paid trolls are more likely to write comments on working days (9 -Work days (Mon-Fri) comments rate) (Mon-Fri), and during working hours (9-18h) ((10 -Work time (9-18h) comments rate),(11 -Nonwork time comments rate)) while \"mentioned\" trolls and non-trolls would write comments at anytime, though mostly during non-working hours. These observations confirm our assumptions that paid trolls write comments primarily for the money, while \"mentioned\" trolls do so anytime, and are \"self-driven\". Yet, note that some of our \"mentioned\" trolls might be actually paid. Conclusion and Future Work We have presented experiments in trying to distinguish paid opinion manipulation trolls vs. nontrolls in Internet forums. As we did not have enough known paid trolls, for training we used \"mentioned\" trolls, assuming that a user who is called a troll by several different people is likely to be one, while one who has never been called a troll is unlikely to be such. We compared the profiles of (i) paid trolls vs. (ii) \"mentioned\" trolls vs. (iii) non-trolls, and we have shown that a classifier trained to distinguish (ii) from (iii) does quite well also at telling apart (i) from (iii). Our further analysis has shown that the most important features were the number of comments, of positive and of negative votes, of posted replies, and the time of commenting. Overall, paid trolls looked roughly like the \"mentioned\" trolls, except that they were posting most of their comments on working days and during working hours. Unfortunately, our features only worked well for trolls with high number of posts. Thus, in future work, we plan to add keywords, topics, named entities, sentiment analysis (Kapukaranov and Nakov, 2015; Jovanoski et al., 2015) , etc, in order to be able to detect \"fresh\" trolls; this would require stemming (Nakov, 2003b; Nakov, 2003a) , POS tagging (Georgiev et al., 2012) , and named entity recognition (Georgiev et al., 2009) . We also plan to analyze the comment threads as a whole (Barrón-Cedeño et al., 2015; Joty et al., 2015) .",
    "abstract": "Recently, Web forums have been invaded by opinion manipulation trolls. Some trolls try to influence the other users driven by their own convictions, while in other cases they can be organized and paid, e.g., by a political party or a PR agency that gives them specific instructions what to write. Finding paid trolls automatically using machine learning is a hard task, as there is no enough training data to train a classifier; yet some test data is possible to obtain, as these trolls are sometimes caught and widely exposed. In this paper, we solve the training data problem by assuming that a user who is called a troll by several different people is likely to be such, and one who has never been called a troll is unlikely to be such. We compare the profiles of (i) paid trolls vs. (ii) \"mentioned\" trolls vs. (iii) non-trolls, and we further show that a classifier trained to distinguish (ii) from (iii) does quite well also at telling apart (i) from (iii).",
    "countries": [
        "Bulgaria",
        "Qatar"
    ],
    "languages": [
        "Bulgarian"
    ],
    "numcitedby": "38",
    "year": "2015",
    "month": "September",
    "title": "Exposing Paid Opinion Manipulation Trolls"
}