{
    "article": "In recent years, several studies have approached the Text Simplification (TS) task as a machine translation (MT) problem. They report promising results in learning how to translate from 'original' to 'simplified' language using the standard phrasebased translation model. However, our results indicate that this approach works well only when the training dataset consists mostly of those sentence pairs in which the simplified sentence is already very similar to its original. Our findings suggest that the standard phrase-based approach might not be appropriate to learn strong simplifications which are needed for certain target populations. Introduction Text Simplification (TS) aims to convert complex texts into simpler variants which are more accessible to a wider audiences, e.g. non-native speakers, children, and people diagnosed with intellectual disability, autism, aphasia, dyslexia or congenital deafness. In the last twenty years, many automatic text simplification systems have been proposed, varying from rule-based, e.g. (Brouwers et al., 2014; Saggion et al., 2015) to datadriven, e.g. (Zhu et al., 2010; Woodsend and Lapata, 2011) , and hybrid (Siddharthan and Angrosh, 2014) . Since 2010, there have been several attempts to approach TS as a machine translation (MT) problem (Specia, 2010; Coster and Kauchak, 2011a; Štajner, 2014) . Instead of translating sentences from one language to another, the goal of text simplification is to translate sentences from 'original' to 'simplified' language. In this paper, we seek to explore the main reasons for the success or failure of the phrasebased statistical machine translation (PB-SMT) approach to TS. The results of our translation experiments in three languages indicate that the size of the dataset might not be the key factor for the success of this approach and that the effectiveness of such systems heavily depends on the similarity between the original and manually simplified sentences in the datasets used for training and tuning. 2 Related Work Specia (2010) achieves BLEU score of 60.75 on a small (only 4,483 sentence pairs) dataset in Brazilian Portuguese, using the standard phrasebased translation model (Koehn et al., 2003) in the Moses toolkit (Koehn et al., 2007) . The dataset consists of original sentences and their corresponding manually simplified versions obtained under the PorSimples project (Aluísio and Gasperin, 2010) following specific guidelines. Coster and Kauchak (2011a) exploit the same translation model to learn how to simplify English sentences using 137,000 sentence pairs from Wikipedia and Simple English Wikipedia. They show that those results (BLEU = 59.87) can be improved by adding phrasal deletion to the probabilistic translation model, reaching the BLEU score of 60.46. Both those approaches seem to outperform all previous non-MT approaches to TS for English. The fact that Specia (2010) and Coster and Kauchak (2011a) achieve similar performances of the PB-SMT system in spite of large differences in size of their datasets motivates our hypothesis that the key factor for a success of such an approach to TS might not lie in the size of the datasets but rather in the nature of the sentence pairs used for training and tuning of the PB-SMT models. Methodology We apply the following methodology: • We run MT-based text simplification exper-iments on three different datasets and languages following the methods proposed in previous studies (Specia, 2010; Coster and Kauchak, 2011a) . • We perform automatic evaluation in terms of the document-wise (BLEU) and the sentencewise BLEU score (S-BLEU). • We conduct a manual error analysis of the output of all three translation experiments. • We calculate sentence-wise BLEU score on the training and development datasets to further understand the differences observed in the translation experiments. Datasets We use three sentence-aligned TS corpora in three different languages: 1. EsSim -The corpus of original news texts in Spanish and their manual simplifications aimed at people with Down syndrome. Simplification was performed by trained human editors under the Simplext project (Saggion et al., 2015) . 2. PorSim -The corpus of original news texts in Brazilian Portuguese and their manual simplifications compiled under the PorSimples project (Caseli et al., 2009) . Original sentences and their corresponding 'natural' simplifications of this corpus were used for in the previous PB-SMT experiments (Specia, 2010). 3. Wiki -The parallel corpus of automatically aligned sentence pairs from English Wikipedia and Simple English Wikipedia, used for the PB-SMT experiments by Coster and Kauchak (2011a) . 1 In order to compare the results of translation experiments among the three corpora, we train and tune all three systems on a similar amount of data. Therefore, we focus only a subset of sentence pairs used by Specia (2010) , and by Coster and Kauchak (Coster and Kauchak, 2011a) . The sizes of the corpora used are shown in Table 1 . Translation Experiments We run three MT experiments using the standard PB-SMT models (Koehn et al., 2003) implemented in the Moses toolkit (Koehn et al., 2007) and GIZA++ (Och and Ney, 2003) Results and Discussion In the next three subsections, we present and discuss the results of the automatic evaluation of the translation experiments (Section 4.1), the error analysis of the translation experiments (Section 4.2), and the distribution of the S-BLEU score across the four datasets (Section 4.3). Automatic Evaluation The results of the translation experiments and sentence similarity metrics on the three datasets used for training the translation models are presented in Table 2 . The BLEU scores achieved by translation experiments in English and Brazilian Portuguese are similar to those reported by Specia (2010) and Coster and Kauchak (2011a) in spite of our experiments having reduced the sizes of the two corpora for fair comparison with the Spanish dataset. As can be observed ( In order to understand better the differences in translation performances (BLEU) across datasets, we calculated BLEU score (t-BLEU) with brevity penalty (BP), and sentence-wise BLEU score (S-BLEU) 5 on the training datasets (EsSim, PorSim, and Wiki). The manual simplifications (or in the case of English, the Simple Wikipedia versions) were used as hypotheses and the original nonsimplified versions as references. It appears that the similarity between the original and simplified sentences used for training is much higher (up to four times higher in the case of the S-BLEU) in the Wiki and PorSim datasets than in the third dataset (EsSim). It can be noted that the EsSim dataset achieves significantly lower BLEU score than the other two. Additionally, the EsSim dataset has a much higher brevity penalty (BP) on the training set than the other two datasets, indicating that the sentence shortening is more commonly used simplifying operation in this dataset than in the other two. It seems that whenever MT performs well (Table 2 ), we actually have a dataset that is more MT-looking and complies with the underlying assumptions of the standard phrase-based model (reflected in the high BLEU score on the training data). The low BLEU score on the training dataset (t-BLEU) suggests that there are many string transformations and strong paraphrases to be learnt, and thus the standard phrase-based translation model might not be the most suitable for the task. As it is known that the BLEU score does not give a fair comparison among systems with different architectures -or, in this case, systems trained for different languages and tested on different datasets -we do not rely on the automatic Error Analysis In order to clarify doubts raised by the results of the automatic evaluation, we performed error analysis on all sentences from the three datasets (90 sentences in Spanish, 100 sentences in English, and 100 sentences in Portuguese). The classification of the test sentences based on the number and type of modifications made by the translation/simplification models is presented in Table 3 . The manual examination of the output of the translation model trained on the EsSim corpora confirmed the poor performance of the system, describing the output of the automatic simplification as barely comprehensible in most of the cases. At the same time, the manual examination of the output of the model trained on the Wiki corpus revealed that such a high performance (in terms of the BLEU score) is indeed due to the fact that the output was in most cases identical to the original sentence. The human evaluation of the automatically generated sentences in Portuguese, confirmed that the model was able to perform at least one lexical substitution in 40% of the sentences, more than one lexical substitution in 20% of the cases, and sentence splitting combined with lexical substitution(s) in 14% of the cases. It was not possible to perform usual human evaluation of the generated sentences in terms of their grammaticality, simplicity, and meaning preservation due to: (1) 82 automatically simplified sentences in Spanish (out of 90) being severely ungrammatical (due to the multiple wrong word substitutions), to the extent that it was impossible to assess their simplicity (as they were barely comprehensible) or to compare their meaning with the meaning of the original sentence, and (2) 65 automatically simplified sentences for English being identical to their originals and another Ex. Original Automatic Reference p1 Porém, ninguém pode subestimar a capacidade de mobilizac ¸ão de Chávez. Mas ninguém pode subestimar a capacidade de mobilizac ¸ão de Chávez. Mas ninguém pode desprezar a capacidade de mobilizac ¸ão de Chávez. A segunda sugestão de modificac ¸ão diz respeito ao veto de pesquisas com células-tronco embrionárias humanas e com clonagem terapêutica. A segunda sugestão de modificac ¸ão diz respeito à proibic ¸ão de pesquisas com células-tronco de embriões humanos e com clonagem para tratamento de doentes. A segunda sugestão de modificac ¸ão diz respeito à proibic ¸ão de pesquisas com células-tronco de embriões humanos e com clonagem para tratamento de doentes. Table 4 : Examples of the automatic simplification in Brazilian Portuguese (differences between the original sentences and their automatic simplifications are shown in bold, and the deviations of the manual simplifications from the automatic simplifications are shown in italics) 28 sentences differing from their originals by only one word. Therefore, we focused on detailed analysis of the generated sentences in all three languages, seeking to discover what are the possibilities and limitations of our simplification models. Portuguese Table 4 shows examples of the original sentences from the test dataset (Original), their automatic simplifications (Automatic), and their corresponding reference simplifications ('gold standards') manually simplified under the PorSimples project (Reference). As previously mentioned, 60 out of 100 original test sentences were lexically modified by the system, while 14 of them were additionally split into two sentences. In the first example (p1), the system performed one lexical substitution replacing the word \"Porém\" (however) with \"Mas\" (but). The same substitution was done by human editors. However, the system only performed this one substitution, while the manual simplification encompassed one additional lexical simplification. In the second example (p2), the system performed a correct sentence splitting taking the apposition in a separate sentence (\"Dom Odilo trabalhou no Vaticano entre 1994 e 2001.\"), and two correct lexical simplifications: \"alinhado\" (aligned, in line) was changed into \"concorda\" (agree, comply) and \"diretrizes\" (guidelines) into \"normas\" (standards, norms). The difference between the manual and automatic simplification of this sentence was not significant (the automatically simplified sentence is still grammatical, although the manually simplified sentence might be stylistically better). The third example (p3) shows a case in which the automatic simplification managed to reach the level of manual simplification by performing three corrected lexical simplifications and generating the output sentence equal to the manually simplified sentence. Spanish Table 5 shows examples of the original sentences from the test dataset (Original), their automatic simplifications (Automatic), and their corresponding reference simplifications ('gold standards') manually simplified under the Simplext project (Reference). In the first example (s1), \"UE\" (EU) was correctly replaced with \"Europa\" (Europe), while the incorrect substitution of \"sacar de la pobreza\" (get out of poverty) with \"objetivo\" (goal/aim/objective) left the sentence meaningless. Together with the deletion of \"20\" (in \"20 million people\") and \"hasta 2020\" (until 2020), and the insertion of \"a\" at the end of the sentence, the generated sentence is completely ungrammatical and meaningless. The original sentence \"The EU wants to get out of poverty 20 million people until 2020\" is simplified as \"The Europe wants goal to millions of people\". The second example (s2) is particularly interesting as the manual simplification ('gold standard') is identical to the original sentence. In the automatically generated sentence, however, the phrase \"dimitirá como presidente\" (will quit as a president) in the original sentence was correctly 'translated' as \"deja la presidencia\" (leaves the presi-Ex. Original Automatic Reference s1 La UE quiere sacar de la pobreza a 20 millones de personas hasta 2020. La Europa quiere objetivo a millones de personas a. Europa quiere ayudar a millones de personas a dejar de ser pobres. s2 Alex de la Iglesia dimitirá como presidente de la Academia de Cine. Cine Alex de la Iglesia deja la presidencia de la Academia de Cine. Alex de la Iglesia dimitirá como presidente de la Academia de Cine. s3 Por otro lado, el informe de \"la Caixa\" sitúa en el 9,5% del PIB el déficit público al término de 2010 y calcula que el conjunto de las administraciones podrán reducirlo hasta el 6,4% durante 2011. , el informe de la sitúa en el 9,5 mitad el el déficit público al término de 2010 y cree que el literaria de las corridas podrán reducirlo hasta el 6,4 mitad en 2011. El informe también mostraba que una parte de la deuda en 2010 era de las administraciones públicas. El informe calcula que las administraciones públicas podrán reducir su deuda en 2011. Table 5 : Examples of the automatic simplification in Spanish (differences between the original sentences and the automatically simplified sentences are given in bold) Ex. Original Automatic Reference e1 Parennes is a commune in the Sarthe department in the region of Pays-dela-Loire in north-western France. Parennes is a commune. It is found in the Sarthe department in the region Pays de la Loire in northwestern France. Parennes is a commune. It is found in the region Pays de la Loire in the Sarthe department in the west of France. e2 Mated females will lay a clutch of 30-60 eggs in a mound of dry leaves or peat. Mated women will lay a clutch of 30-60 eggs in a mound of dry leaves or peat. Mated females will lay a clutch of 30-60 eggs in a mound of dry leaves or peat. e3 Elections to the new authorities were held on three different Thursdays in 1973. Elections to the new government were held on three different Thursdays in 1973. Elections were held to the new authorities on three different Thursdays in 1973. Table 6 : Examples of the automatic simplification in English (differences between the original sentences and their automatic simplifications are shown in bold, and the deviations of the manual simplifications from the automatic simplifications are shown in italics) dency). One could argue that the phrase used in the automatically simplified sentence is actually simpler than the corresponding phrase in the 'gold standard' (and the original), as the verb \"dejar\" (to leave) is more frequent than the verb \"dimitir\" (to quit). This complies with the common practice in text simplification to replace the infrequent and more specific terms/phrases with their more frequent synonyms. The native speakers might argue that use of the verb \"dejar\" (to leave) introduces ambiguity (as it is not clear whether Alex leaves his presidency because his mandate is over or because he is quitting), while the use of the verb \"dimitir\" (quit) does not leave any doubt about the way/reason Alex is leaving his presidency. Still, non-native speakers will definitely be familiar with the Spanish word \"dejar\", while (depending on their level of Spanish) may not be familiar with the Spanish word \"dimitir\". The third example (s3) represents one of the most frequently observed cases of automatic simplification in the test dataset. In those cases, the PB-SMT system generates the output which is at the same time ungrammatical (mostly due to the incorrect deletions of various sentence parts) and meaningless (mostly due to the incorrect word substitutions, but also due to the ungrammatical sentence constructions). For instance, the word \"conjunto\" (set) is replaced with the word \"literaria\" (literary), and the word \"administraciones\" (administrations) with the word \"corridas\" (runs). In the first case, the original word was replaced with the word with a different part-of-speech (a noun replaced with an adjective). However, this example (s3) also shows a particularly interesting case of lexical simplification performed by the PB-SMT system, but not performed by the human editor. The word \"calcula\" (calculates) is replaced with the word \"cree\" (believes). In this sentence, the word \"calcula\" (calculates) was indeed used with the meaning \"cree\" (believes), which is not its most common meaning. Such replacements are favourable in text simplification, as stated in Web Content Accessibility Guidelines (W3C, 2008) . English Table 6 contains several examples of the original sentences from the test dataset (Original), their automatic simplifications (Automatic), and their corresponding reference simplifications ('gold standards') from the Simple English Wikipedia (Reference). They illustrate some of the phenomena Corpus [0, 0.3) [0.3, 0.4) [0.4, 0.5) [0.5, 0.6) [0.6, 0.7) [0.7, 0.8) [0.8, 0.9) revealed during the manual error analysis. Example e1 presents one of the five correctly performed sentence splittings learned by the PB-SMT system. However, it is important to mention that all five split sentences in the test dataset share the same structure of the original sentence ('X is a commune in...'). In all five cases, such an original sentence is transformed into two sentences which again share the same structure ('X is a commune. It is found in...'). The example e2 presents an example of a bad word substitution (lexical simplification which leads to a simpler sentence but changes the original meaning), while e3 shows a good word substitution (lexical simplification). It can be noted that all examples of the automatically simplified sentences are still grammatical. One or two wrongly applied word substitutions may only change the meaning of the sentence but they do not deteriorate the grammaticality of the sentence. Correctly applied word substitutions and sentence splittings preserve the original meaning and grammaticality of the sentence, and lead to a slightly simpler output. Distribution of S-BLEU Scores A closer examination of the S-BLEU distribution (Table 7 ) indicate that the cause behind the good performance of the 'translation' system trained on PorSim and Wiki datasets probably lies in the nature of the data. The Wiki corpus contains only those sentence pairs whose normalised similarity was higher than 0.5 (Coster and Kauchak, 2011b) . The PorSim corpus consists only of the sentence pairs simplified by 'natural' simplification in which the most common simplifying operation is sentence splitting (Gasperin et al., 2009) . EsSim corpus, on the other hand, contain a great number of deletions and strong paraphrases (combinations of lexical and syntactic transformations with deletions) as reported by Štajner et al. (2013) . Such strong paraphrases and reordering of clauses within a sentence are very frequent in the EsSim dataset, while hardly present in the Wiki and Por-Sim datasets. 6 Although well-motivated and necessary for the target population in mind (people with intellectual impairments), those transformations cannot be learnt by the standard PB-SMT model. Conclusions and Future Work Text simplification has recently been treated as a statistical machine translation problem. By comparing the performance of this translation paradigm across three datasets, we have identified possible causes for the success and failure of such a simplification approach. It appears that learning how to 'translate' from original to simplified language using standard PB-SMT model works well only in some special cases, when the training data mostly consists of the sentence pairs which are already very similar. 7 Our results indicate that this approach would not be effective if we want to learn 'real', strong simplifications like those performed by trained human editors familiar with the specific needs of their target population (e.g. people with intellectual disabilities). Those simplifications involve linguistically rich transformations (e.g. paraphrase, summarisation) which cannot be modelled by standard PB-SMT systems. We are currently investigating how to improve the translation model with the addition of synonym datasets and the language model using a large bootstrapped corpus of \"simple\" sentences instead of normal, non-simplified language. Acknowledgements The research described in this paper was partially funded by the project SKATER-UPF-TALN (TIN2012-38584-C06-03), Ministerio de Economía y Competitividad, Secretaría de Estado de Investigación, Desarrollo e Innovación, Spain, and the project ABLE-TO-INCLUDE (CIP-ICT-PSP-2013-7/621055). We would also like to thank Hannah Béchara, Wilker Aziz, and Lucia Specia for the help with the translation experiments and resources.",
    "abstract": "In recent years, several studies have approached the Text Simplification (TS) task as a machine translation (MT) problem. They report promising results in learning how to translate from 'original' to 'simplified' language using the standard phrasebased translation model. However, our results indicate that this approach works well only when the training dataset consists mostly of those sentence pairs in which the simplified sentence is already very similar to its original. Our findings suggest that the standard phrase-based approach might not be appropriate to learn strong simplifications which are needed for certain target populations.",
    "countries": [
        "United Kingdom"
    ],
    "languages": [
        "Portuguese",
        "English",
        "Spanish"
    ],
    "numcitedby": "3",
    "year": "2015",
    "month": "September",
    "title": "Translating from Original to Simplified Sentences using {M}oses: When does it Actually Work?"
}