{
    "framing_question": "If this paper introduces a task or benchmark, which groups are stated to benefit from the task or benchmark, if any?",
    "response": "The provided text does not mention any groups that benefit from the task or benchmark.",
    "article": "In this paper we present a semantic role labeling system submitted to the task Multilevel Semantic Annotation of Catalan and Spanish in the context of SemEval-2007. The core of the system is a memory-based classifier that makes use of full syntactic information. Building on standard features, we train two classifiers to predict separately the semantic class of the verb and the semantic roles. Introduction Semantic role labelling (SRL) has been addressed in the CoNLL-2004 and CoNLL-2005 Shared Tasks (Carreras and Màrquez, 2004; Carreras and Màrquez, 2005) for English. In the task Multilevel Semantic Annotation of Catalan and Spanish of the SemEval competition 2007, the target are two different languages. The general SRL task consists of two tasks: prediction of semantic roles (SR) and prediction of the semantic class of the verb (SC). The data provided in the task (Màrquez et al., 2007) are sentences annotated with lemma, POS tags, syntactic information, semantic roles, and the semantic classes of the verb. A training corpus for Catalan (ca.3LB) and another for Spanish (sp.3LB) are provided. Although the setting is similar to the CoNLL-Shared Task 2005, three relevant differences are that the corpora are significantly smaller, that the syntactic information is based on a manually corrected treebank, which contains also syntactic functions (i.e. direct object, indirect object, etc.), and that the set of semantic roles is larger, especially for core arguments. Our goal is to check whether simple individual systems could produce competitive results in both subtasks, and whether they would be robust enough when applied to two languages and to the held-out test sets provided. System description We approach the SRL task as two classification problems: prediction of SR and prediction of SC. We hypothesize that the two problems can be solved in the same way for both languages. We build two very similar systems that differ only in some of the features used, as we explain below. The task is solved in three phases: 1) A preprocessing phase that is very similar to the sequentialization in (Màrquez et al., 2005) . We call it focus selection. It consists of identifying the potential candidates to be assigned a semantic role or a semantic verb class. 2) The classification. 3) Some limited postprocessing. Focus selection The system starts by finding the target verb (which is marked in the corpus as such). Then, it finds the complete form of the verb (that in the corpus is tagged as verb group, infinitive, gerund, etc.) and the clause boundaries in order to look for the siblings of the verb that are under the same clause. Our assumption is that all siblings of the verb are potential candidates for semantic roles. The focus selection process produces two groups of focus tokens: on the one hand, the verbs and, on the other, the siblings of the verbs. These tokens will be the instances in each training set. Table 1 Classification In both systems we approach the classification task in one step, predicting directly the SR and the SC class. This means that in the SR task we do not perform a previous classification to select the tokens that might be assigned a role. We assume that all verbs belong to a class. As for the SR, we assume that most siblings of the verb will have a class, except for those that have syntactic functions AO, ET, MOD, NEG, IMPERS, PASS, and VOC. The siblings that do not have a semantic role are assigned the NONE tag. Because the corpus is small and because the amount of instances with a NONE class is proportionally low, we do not consider it necessary to filter these cases. Regarding the learning algorithm, we use the IB1 classifier as implemented in TiMBL (version 5.1) (Daelemans et al., 2004) , a supervised inductive algorithm for learning classification tasks based on the k nearest neighbor (k-nn) algorithm. In IB1, similarity is defined by a feature-level distance metric between a test instance and a memorized training instance. The metric combines a per-feature valuebased distance metric with global feature weights that account for relative differences in importance of the features. The TiMBL parameters used in the systems are the IB1 algorithm, the Jeffrey Divergence as feature metric, MVDM threshold at level 1, weighting using GainRatio, k=11, and weighting neighbors as function of their Inverse Linear Distance (for details we refer the reader to the TiMBL reference guide (Daelemans et al., 2004) ). As for the features, we started by using the same feature set for both classifiers and then, after some experimentation, we decided to use slightly differ-ent feature sets for the two sub-tasks. Most of the features we designed are features that have become standard for the SRL task (Gildea and Jurafsky, 2002; Xue and Palmer, 2004; Carreras and Màrquez, 2004; Carreras and Màrquez, 2005 ). In our system, the features relate to the verb, the verb siblings, what we take to be the content word of the siblings, the clause, and the relation verb-arguments. Additionally, we added lexical features extracted from the verb lexicon provided for the task, and from Word-Net. After experimenting with 323 features, we selected 98 for the SR task and 77 for the SC subclass. In order to select the features, we started with a basic system, the results of which were used as a baseline. Every new feature that was added to the basic system was evaluated in terms of average accuracy in 10fold cross-validation experiments; if it improved the performance on held-out data, it was added to the selection. One problem with this hill-climbing method is that the selection of features is determined by the order in which the features have been introduced. We also performed experiments applying the feature selection process reported in (Tjong Kim Sang et al., 2005) , a bi-directional hill climbing process. However, experiments with this advanced method did not produce a better selection of features. The features for the SR prediction subtask are the following: • Features on the verb (6) . They are shared by all the instances that represent phrases belonging to the same clause: VForm; VLemma; VCau: binary feature that indicate if the verb is in a causative construction with hacer, fer or if the main verb is causar; VPron, VImp, VPass: binary features that indicate if the verb is pronominal, impersonal, and in passive form respectively. • Features on the sibling in focus ( 12 • Features that describe the properties of the content word (CW) of the focus sibling (13): in the case of prepositional phrases the CW is the head of the first noun phrase; in cases of coordination, we only take the first element of the coordination. CWord; CWLemma; CWPOS: we take only the first character of the POS tags provided; CWPOSType: the type of POS, second character of the POS tags provided; CWGender; CWne: binary feature that indicates if the CW is a named entity; CWtmp, CWloc: binary features that indicate if the CW is a temporal or a locative adverb respectively; CW+2POS, CW+3POS: POS of the second and third words after CW. CWwnsc1, CWwnsc2, CWwnsc3: additionally, if the CW is a noun, we extract information from WordNet (Fellbaum, 1998) about the first, second, and third more frequent semantic classes of the CW in WordNet. We cannot decide on a single one because the corpus is not disambiguated. The semantic class corresponds to the lexicographer files in WN3.0. For nouns there are 25 file numbers. • Features on the clause (24): CCtot: total number of siblings with function CC (circumstancial complement); SUJRelPos, CAGRelPos, CDRel-Pos, CIRelPos, ATRRelPos, CPREDRelPos, CREGRelPos: relative positions of siblings with functions SUJ, CAG, CD, CI,ATR, CPRED, and CREG in relation to verb (PRE or POST); SEsib: binary feature that indicates if the clause contains a verbal se; SIBtot: total number of verb siblings in the clause; SynFuncSib8, SynCatSib8, PrepSib8,W1Sib8, W2Sib8, W3Sib8, W4Sib8, SynFuncSib9, SynCatSib9, PrepSib9, W1Sib9, W2Sib9, W3Sib9, W4Sib9: syntactic function, syntactic category, preposition, and first to fourth word of siblings 8 and 9. • Features extracted from the lexicon of verbal frames (43) that the task organizers provided. We access the lexicon to check if it is possible for a verb to have a certain semantic role. We check it for all semantic role classes, except for ArgX-Ag, ArgX-Cau, ArgX-Pat, ArgX-Tem because they proved not to be informative. The features are binary. For the SC prediction task the features are similar, but not exactly the same. Both systems contain some features about all candidate arguments. We point out the differences: • Features that are in the SR system and that are not in the SC system: Verb form (VForm), verb lemma (VLemma), absolute position of the sibling in the clause (SibAbsPos), function of the sibling (SibSynFunc), preposition of the sibling (SibPrep), POS tag of the second and third words after CW (CW+2POS, CW+3POS), information about the WN classes of the CW (CWwnsc1, CWwnsc2, CWwnsc3), feature about the CW being a named entity (CWne, SIBtot), syntactic function, syntactic category, preposition and first to fourth word of siblings 8 and 9 (SynFuncSib8, SynCatSib8, PrepSib8,W1Sib8, W2Sib8, W3Sib8, W4Sib8, SynFuncSib9, SynCatSib9, PrepSib9, W1Sib9, W2Sib9, W3Sib9, W4Sib9). • Features that are only in the SC system: AllCats: vector of the syntactic categories of the siblings in the order that they appear in the clause; AllFuncs: vector of the functions of the siblings in the order that they appear; AllFuncs-Bin vector with eight binary values that represent if a sibling with that function is present or not; Sib+1Prep, Sib+2Prep: prepositions of the two siblings after the verb. Postprocessing As for the postprocessing phase, it consists of six simple rules to correct some basic errors in predicting some types of ArgM arguments. It only applies to the SR task. The rules are the following ones: We are aware of the fact that these are very simple rules and that more elaborate postprocessing techniques can be applied, like the ones used in (Tjong Kim Sang et al., 2005) in order to make sure that the same role was not predicted more than once in the same clause. Catalan; 'sp': Spanish). Results The overall official results of the system are shown in Table 2 . The SC system performs better (overall F 1 = 86.46) than the SR system (overall F 1 = 83.78). In global, the systems perform better for Catalan (overall F 1 = 85.24) than for Spanish (overall F 1 = 84.04), although the SC system performs better for Catalan (89.37 vs. 86.46) , and the SR system performs better for Spanish (84.14 vs 83.40). Striking results are that the SR system gets significantly better results with the held-out test for Spanish, and that both of the complete SRL systems get significantly better results with the held-out test for Spanish. This might be due to differences in the process of gathering and annotation of the corpus. Table 3 shows detailed results on the Spanish CESS-ECE corpus for the SR task. Low scores are generally related to low frequency of the SR in the training corpus, and high scores are related to high frequency or to overt marking of the SR. Conclusions We have presented two memory-based SRL systems that make use of full syntactic information and approach the tasks in three steps. Results show that rather simple individual systems can produce competitive results in both tasks, and that they are robust enough to be applied to two languages and to the held-out test sets provided. Improvements of the systems would consist in improving the focus selection step, and applying more elaborate techniques for feature selection and postprocessing. Acknowledgements This research has been funded by the postdoctoral grant EX2005-1145 awarded by the Ministerio de Educación y Ciencia of Spain to the project Técnicas semiautomáticas para el etiquetado de roles semánticos en corpus del español. We would like to thank Martin Reynaert, Caroline Sporleder, Antal van den Bosch, and the anonymous reviewers for their comments and suggestions.",
    "funding": {
        "military": 0.0,
        "corporate": 0.0,
        "research agency": 0.050331662723526516,
        "foundation": 1.6240552812574194e-06,
        "none": 1.0
    }
}