{
    "article": "This paper describes the system used by the LIPN team in the task 10, Multilingual Semantic Textual Similarity, at Sem-Eval 2014, in both the English and Spanish sub-tasks. The system uses a support vector regression model, combining different text similarity measures as features. With respect to our 2013 participation, we included a new feature to take into account the geographical context and a new semantic distance based on the Bhattacharyya distance calculated on cooccurrence distributions derived from the Spanish Google Books n-grams dataset. Introduction After our participation at SemEval 2013 with LIPN-CORE (Buscaldi et al., 2013) we found that geography has an important role in discriminating the semantic similarity of sentences (especially in the case of newswire). If two events happened in a different location, their semantic relatedness is usually low, no matter if the events are the same. Therefore, we worked on a similarity measure able to capture the similarity between the geographic contexts of two sentences. We tried also to reinforce the semantic similarity features by introducing a new measure that calculates word similarities on co-occurrence distributions extracted from Google Books bigrams. This measure was introduced only for the Spanish runs, due to time constraints. The regression model used to integrate the features was the ν-Support Vector Regression This work is licensed under a Creative Commons Attribution 4.0 International Licence. Page numbers and proceedings footer are added by the organisers. Licence details:http://creativecommons.org/licenses/by/4.0/ model (ν-SVR) (Schölkopf et al., 1999) implementation provided by LIBSVM (Chang and Lin, 2011) , with a radial basis function kernel with the standard parameters (ν = 0.5). We describe all the measures in Section 2; the results obtained by the system are detailed in Section 3. Similarity Measures In this section we describe the measures used as features in our system. The description of measures already used in our 2013 participation is less detailed than the description of the new ones. Additional details on the measures may be found in (Buscaldi et al., 2013) . When POS tagging and NE recognition were required, we used the Stanford CoreNLP 1 for English and FreeLing 2 3.1 for Spanish. WordNet-based Conceptual Similarity This measure has been introduced in order to measure similarities between concepts with respect to an ontology. The similarity is calculated as follows: first of all, words in sentences p and q are lemmatised and mapped to the related WordNet synsets. All noun synsets are put into the set of synsets associated to the sentence, C p and C q , respectively. If the synsets are in one of the other POS categories (verb, adjective, adverb) we look for their derivationally related forms in order to find a related noun synset: if there exists one, we put this synset in C p (or C q ). No disambiguation process is carried out, so we take all possible meanings into account. Given C p and C q as the sets of concepts contained in sentences p and q, respectively, with |C p | ≥ |C q |, the conceptual similarity between p and q is calculated as: ss(p, q) = c 1 ∈Cp max c 2 ∈Cq s(c 1 , c 2 ) |C p | where s(c 1 , c 2 ) is a conceptual similarity measure. Concept similarity can be calculated in different ways. We used a variation of the Wu-Palmer formula (Wu and Palmer, 1994) named \"Proxi-Genea3\", introduced by (Dudognon et al., 2010) , which is inspired by the analogy between a family tree and the concept hierarchy in WordNet. The ProxiGenea3 measure is defined as: s(c 1 , c 2 ) = 1 1 + d(c 1 ) + d(c 2 ) − 2 • d(c 0 ) where c 0 is the most specific concept that is present both in the synset path of c 1 and c 2 (that is, the Least Common Subsumer or LCS). The function returning the depth of a concept is noted with d. IC-based Similarity This measure has been proposed by (Mihalcea et al., 2006) as a corpus-based measure which uses Resnik's Information Content (IC) and the Jiang-Conrath (Jiang and Conrath, 1997) similarity metric. This measure is more precise than the one introduced in the previous subsection because it takes into account also the importance of concepts and not only their relative position in the hierarchy. We refer to (Buscaldi et al., 2013) and (Mihalcea et al., 2006) for a detailed description of the measure. The idf weights for the words were calculated using the Google Web 1T (Brants and Franz, 2006) frequency counts, while the IC values used are those calculated by Ted Pedersen (Pedersen et al., 2004) on the British National Corpus 3 . Syntactic Dependencies This measure tries to capture the syntactic similarity between two sentences using dependencies. Previous experiments showed that converting constituents to dependencies still achieved best results on out-of-domain texts (Le Roux et al., 2012) , so we decided to use a 2-step architecture to obtain syntactic dependencies. First we parsed pairs of sentences with the LORG parser 4 . Second we con-verted the resulting parse trees to Stanford dependencies 5 . Given the sets of parsed dependencies D p and D q , for sentence p and q, a dependency d ∈ D x is a triple (l, h, t) where l is the dependency label (for instance, dobj or prep), h the governor and t the dependant. The similarity measure between two syntactic dependencies d 1 = (l 1 , h 1 , t 1 ) and  d 2 = (l 2 , h 2 , t 2 ) is the levenshtein distance between the labels l 1 and l 2 multiplied by the average of idf h * s W N (h 1 , h 2 ) and idf t * s W N (t 1 , t 2 ), where idf h and idf t are the inverse document frequencies calculated on Google Web 1T for the governors and the dependants (we retain the maximum for each pair), respectively, and s W N is calculated using formula ??. NOTE: This measure was used only in the English sub-task. Information Retrieval-based Similarity Let us consider two texts p and q, an IR system S and a document collection D indexed by S. This measure is based on the assumption that p and q are similar if the documents retrieved by S for the two texts, used as input queries, are ranked similarly. Let be L p = {d p 1 , . . . , d p K } and L q = {d q 1 , . . . , d q K }, d x i ∈ D the sets of the top K documents retrieved by S for texts p and q, respectively. Let us define s p (d) and s q (d) the scores assigned by S to a document d for the query p and q, respectively. Then, the similarity score is calculated as: sim IR (p, q) = 1 − d∈Lp∩Lq √ (sp(d)−sq(d)) 2 max(sp(d),sq(d)) |L p ∩ L q | if |L p ∩ L q | = ∅, 0 otherwise. For the participation in the English sub-task we indexed a collection composed by the AQUAINT-2 6 and the English NTCIR-8 7 document collections, using the Lucene 8 4.2 search engine with BM25 similarity. The Spanish index was created using the Spanish QA@CLEF 2005 (agencia EFE1994-95, El Mundo 1994-95) and multiUN (Eisele and Chen, 2010) collections. The K value was set to 70 after a study detailed in (Buscaldi, 2013) . N-gram Based Similarity This measure tries to capture the fact that similar sentences have similar n-grams, even if they are not placed in the same positions. The measure is based on the Clustered Keywords Positional Distance (CKPD) model proposed in (Buscaldi et al., 2009) for the passage retrieval task. The similarity between a text fragment p and another text fragment q is calculated as: sim ngrams (p, q) = ∀x∈Q h(x, P ) n i=1 w i d(x, x max ) Where P is the set of the heaviest n-grams in p where all terms are also contained in q; Q is the set of all the possible n-grams in q, and n is the total number of terms in the longest sentence. The weights for each term w i are calculated as w i = 1 − log(n i ) 1+log(N ) where n i is the frequency of term t i in the Google Web 1T collection, and N is the frequency of the most frequent term in the Google Web 1T collection. The weight for each n-gram (h(x, P )), with |P | = j is calculated as: h(x, P ) = j k=1 w k if x ∈ P 0 otherwise The function d(x, x max ) determines the minimum distance between a n-gram x and the heaviest one x max as the number of words between them. Geographical Context Similarity We observed that in many sentences, especially those extracted from news corpora, the compatibility of the geographic context between the sentences is an important clue to determine if the sentences are related or not. This measure tries to measure if the two sentences refer to events that took place in the same geographical area. We built a database of geographically-related entities, using geo-WordNet (Buscaldi and Rosso, 2008) and expanding it with all the synsets that are related to a geographically grounded synset. This implies that also adjectives and verbs may be used as clues for the identification of the geographical context of a sentence. For instance, \"Afghan\" is associated to \"Afghanistan\", \"Sovietize\" to \"Soviet Union\", etc. The Named Entities of type PER (Person) are also used as clues: we use Yago 9 to check whether the NE corresponds to a famous leader or not, and in the affirmative case we include the related nation to the geographical context of the sentence. For instance, \"Merkel\" is mapped to \"Germany\". Given G p and G q the sets of places found in sentences p and q, respectively, the geographical context similarity is calculated as follows: sim geo (p, q) = 1−log K   1 + x∈Gp min y∈Gq d(x, y) max(|G p |, |G q |)    Where d(x, y) is the spherical distance in Km. between x and y, and K is a normalization factor set to 10000 Km. to obtain similarity values between 1 and 0. 2-grams \"Spectral\" Distance This measure is used to calculate the semantic similarity of two words on the basis of their context, according to the distributional hypothesis. The measure exploits bi-grams in the Google Books n-gram collection 10 and is based on the distributional hypothesis, that is, \"words that tend to appear in similar contexts are supposed to have similar meanings\". Given a word w, we calculate the probability of observing a word x knowing that it is preceded by w as p(x|w) = p(w ∩ x)/p(w) = c(\"wx\")/c(\"w\"), where c(\"wx\") is the number of bigrams \"w x\" observed in Google Books (counting all publication years) 2-grams and c(\"w\") is the number of occurrences of w observed in Google Books 1-grams. We calculate also the probability of observing a word y knowing that it is followed by w as p(y|w) = p(w ∩ y)/p(w) = c(\"yw\")/c(\"w\"). In such a way, we may obtain for a word w i two probability distributions D w i p and D w i f that can be compared to the distributions obtained in the same way for another word w j . Therefore, we calculate the distance of two words comparing the distribution probabilities built in this way, using the Bhattacharyya coefficient: s f (w i , w j ) = − log x∈X D w i f (x) * D w j f (x) s p (w i , w j ) = − log x∈X D w i p (x) * D w j p (x) the resulting distance between w i and w j is calculated as the average between s f (w i , w j ) and s p (w i , w j ). All words in sentence p are compared to the words of sentence q using this similarity value. The words that are semantically closer are paired; if a word cannot be paired (average distance with any of the words in the other sentence > 10), then it is left unpaired. The value used as the final feature is the averaged sum of all distance scores. Other Measures In addition to the above text similarity measures, we used also the following common measures: Cosine Cosine distance calculated between p = (w p 1 , . . . , w pn ) and q = (w q 1 , . . . , w qn ), the vectors of tf.idf weights associated to sentences p and q, with idf values calculated on Google Web 1T. Edit Distance This similarity measure is calculated using the Levenshtein distance on characters between the two sentences. Named Entity Overlap This is a per-class overlap measure (in this way, \"France\" as an Organization does not match \"France\" as a Location) calculated using the Dice coefficient between the sets of NEs found, respectively, in sentences p and q. 3 Results Spanish In order to train the Spanish model, we translated automatically all the sentences in the English SemEval 2012 and 2013 using Google Translate. We also built a corpus manually using definitions from the RAE 11 (Real Academia Española de la Lengua). The definitions were randomly extracted and paired at different similarity levels (taking into account the Dice coefficient calculated on the definitions bag-of-words). Three annotators gave independently their similarity judgments on these paired definitions. A total of 200 definitions were annotated for training. The official results for the Spanish task are shown in Table 1 . In Figure 1 we show the results obtained by taking into account each individual feature as a measure of similarity between texts. These results show that the combination was always better than the single features (as expected), and the feature best able to capture semantic similarity alone was the cosine distance. In Table 2 we show the results of the ablation test, which shows that the features that most contributed to improve the results were the IR-based similarity for the news dataset and the cosine distance for the Wikipedia dataset. The worst feature was the NER overlap (not taking into account it would have allowed us to gain 2 places in the final rankings). The differences between the three submitted runs are only in the training set used. LIPN-run1 uses all the training data available together, LIPN-run3 uses a training set composed by the translated news for the news dataset and the RAE training set for the Wikipedia dataset; finally, the best run LIPN-run2 uses the same training sets of run3 together to build a single model. Wikipedia English Our participation in the English task was hampered by some technical problems which did not allow us to complete the parsing of the tweet data in time. As a consequence of this and some errors in the scripts launched to finalize the experiments, the submitted results were incomplete and we were able to detect the problem only after the submission. We show in Table 3 the official results of run1 with the addition of the results on the OnWN dataset calculated after the participation to the task. Conclusions and Future Work The introduced measures were studied on the Spanish subtask, observing a limited contribution from geographic context similarity and spec-tral distance. The IR-based measure introduced in 2013 proved to be an important feature for newswire-based datasets as in the 2013 English task, even when trained on a training set derived from automatic translation, which include many errors. Our participation in the English subtask was inconclusive due to the technical faults experienced to produce our results. We will nevertheless take into account the lessons learned in this participation for future ones. this work. Acknowledgements Part of this work has been carried out with the support of LabEx-EFL (Empirical Foundation of Linguistics) strand 5 (computational semantic analysis). We are also grateful to CoNACyT (Consejo NAcional de Ciencia y Tecnologia) for support to",
    "abstract": "This paper describes the system used by the LIPN team in the task 10, Multilingual Semantic Textual Similarity, at Sem-Eval 2014, in both the English and Spanish sub-tasks. The system uses a support vector regression model, combining different text similarity measures as features. With respect to our 2013 participation, we included a new feature to take into account the geographical context and a new semantic distance based on the Bhattacharyya distance calculated on cooccurrence distributions derived from the Spanish Google Books n-grams dataset.",
    "countries": [
        "France",
        "Mexico"
    ],
    "languages": [
        "Spanish",
        "English"
    ],
    "numcitedby": "4",
    "year": "2014",
    "month": "August",
    "title": "{LIPN}: Introducing a new Geographical Context Similarity Measure and a Statistical Similarity Measure based on the Bhattacharyya coefficient"
}