{
    "article": "This paper presents an annotation scheme for modelling citation contexts in scientific articles. We present an argumentation framework based on the Toulmin model for scientific articles and develop an annotation scheme with different context types based on the argumentation model. We present the results of the inter-rater reliability study carried out for studying the reliability of our annotation scheme. Introduction Citations play an important role in scientific writing. However, there are not many tools that provide citation context based information services. The citation services provided by academic search engines such as Google Scholar 1 includes information about the number of citing documents and links to citing articles. Search can also be performed for keywords in citing articles. Citation focused tools such as CiteSeerX 2 and Microsoft Academic Search 3 engines go a little further in identifying the passage of citations in citing articles. The objective of such services is to facilitate quick access to citation content to aid the learning process. However, the high volume of research content renders it difficult to achieve optimum use of these services. Identifying this need, we proposed to develop tools for providing intelligent citation context based information services. However, an annotation scheme for citation contexts is one of the key requirements of citation context based information tools. An annotation scheme providing citation contexts can help in classifying citation passages and provide better citation context based information services. Accordingly, we studied the existing annotation 1 http://scholar.google..com 2 http://citeseerx.ist.psu.edu 3 http://academic.research.microsoft.com/ schemes and noted that it was difficult to use these schemes for our application and proposed to develop a new annotation scheme. Angrosh, Cranefield and Stanger (2012a) have successfully used the annotation scheme with machine learning techniques for developing intelligent citation context based tools. These included a linked data application (Angrosh, Cranefield, and Stanger, 2012b ) and a Web-based application 4 . We present in this paper our annotation scheme designed to represent citation contexts based on an argumentation model, which can be used to develop citation context based information tools. Related Work Over the years, several researchers have proposed annotation schemes for scientific articles. These schemes can be classified into two categories: (a) those that consider the full text of an article; and (b) those addressing citation sentences only. Annotation Schemes for Full Text Conceptualizing the idea of 'argumentative zoning ', Teufel (1999) proposed an annotation scheme of seven categories and called them argumentative zones for sentences. Mizuta and Collier (2004a) extended Teufel's argumentation scheme (Teufel, 1999) for zone analysis in biology texts and provided a scheme of seven categories. Langer et al. (2004) noted that newer applications in areas such as the Semantic Web required richer and more fine-grained annotation of seven topic types for documents. Motivated by the need to identify passages of reliable scientific facts, Wilbur et al. (2006) devised an annotation scheme of five categories for biomedical texts. Ibekwe-sanjuan et al. (2007) developed local grammars to annotate sentences in a rhetorical scheme consisting of eight categories. Liakata et al. (2009) presented two complementary annotation schemes for scientific papers in Chemistry: the Core Scientific Concepts (CoreSC) annotation scheme and the Argumentative Zoning-II scheme (AZ-II) (Teufel, 1999) . Annotation Schemes for Citation Sentences Researchers have also specifically focused on citation sentences. In 1965, Eugene Garfield, the creator of Science Citation Index, outlined fifteen different reasons for citations (Garfield, 1964) . Lipetz (1965) explored the possibility of improving selectivity in citation indexes by including citation relationship indicators and devised a scheme of 29 citation relationship types for science literature. Claimed to be the first in-depth study on classifying citations, Moravcsik and Murugesan (1975) proposed a classification scheme for citations consisting of four categories. Chubin and Moitra (1975) redefined the four categories of Moravcsik and Murugesan as a set of six mutually exclusive categories in order to further generalize the scheme. Spiegel-Rosing (1977) analyzed the use of references in 66 articles published in Science Studies and proposed a classification scheme of 13 categories. Oppenheim and Renn (1978) proposed a scheme of seven categories identifying citation reasons for historical papers. Frost (1979) proposed a classification scheme of citations in literary research and applied the scheme for a sample of publications in German literary research. Peritz (1983) proposed a classification scheme of eight categories for substantive-empirical papers in social sciences. Focusing on automatic citation identification and classification, Nanba and Okumura (1999) proposed a simplified classification scheme of three categories based on the 15 reasons identified by Garfield (1964) . Pham and Hoffmann (2003) developed KAFTAN, a \"Knowledge Acquisition Framework for TAsks in Natural language\", which classified citations into four citation types. Teufel, Siddharthan, and Tidhar (2006) presented an annotation scheme for citations involving 12 categories, based on the categories proposed by Spiegel-Rosing (1977) . Le et al. (2006) defined six categories of citations that facilitated emerging trend detection. Radoulov (2008) carried out a study for exploring automatic citation function classification and redesigned Garzone's scheme of 35 categories from the perspective of usability and usefulness. Why another Annotation Scheme? Though there already exist various annotation schemes for scientific articles, we present in this paper another annotation scheme that defines various context types for sentences. The objective of developing this annotation scheme is to provide a set of context type definitions that can be used for providing citation context based information services. There exist several difficulties in using existing schemes across different applications. Baldi (1998) notes the older classification schemes published during the 1970s and the 1980s were developed in a completely ad hoc manner and were virtually isolated from one another during the development process. White (2004) described existing classification schemes as \"idiosyncratic\" and emphasized the difficulty in employing them, particularly when using them across disciplines. Studies that have focused on the full text of the article (Teufel, 1999; Mizuta and Collier, 2004a; Langer et al., 2004; Wilbur et al., 2006; Ibekwesanjuan et al., 2007) have proposed a generic set of categories that would be less useful in designing citation context based services. The objective of these studies has been to achieve text summarization. On the other hand, studies carried out with citation sentences have proposed fine-grained categories that are difficult to use. The use of these classification schemes presents challenges in defining features in order to achieve automatic citation classification. Further, a focus on citation sentences alone would result in excluding surrounding sentences of citations that can provide additional contextual knowledge about citations. Gao, Tang and Lin (2009) recommend that the selection of an annotation scheme should be taskoriented, and that the optimal scheme for use should depend on the level of detail required by the application at hand. The key focus of our study is to identify contexts of citations and develop information systems based on this contextual knowledge. However, the use of existing schemes creates difficulties as it is either too generic or fine grained as mentioned above. Our application would require an annotation scheme that would consider both citation and non-citation sentences and provide a set of context types that can also be used for automatic context identification. The structure of this paper is as follows. In Section 4, we describe an argumentation framework for scientific articles based on the Toulmin model. In Section 5, we present the different context type definitions for sentences in scientific articles, defined based on the argumentation model. In Section 6, we discuss the results of an inter-rater reliability study to evaluate this set of context types, and we conclude the paper in Section 7. Argumentation in Scientific Articles An important characteristic of a scientific article is its persuasive nature, and citations play an important role in developing this feature for an article. Gilbert (1977) viewed scientific papers as 'tools of persuasion' and noted that references increase the persuasiveness of a scientific paper. Brooks (1985) surveyed authors to assess their motivations for citing and concluded that persuasiveness was a major motivating factor. In another study, Brooks (1986) further confirmed his findings with a different survey, concluding that persuasiveness was the dominant reason for citing. Cozzens (1989) observed that the primary function of a document is to persuasively argue about a knowledge claim, and noted that the art of writing scientific papers consists of marshalling the available rhetorical resources such as citations to achieve this goal. Hyland (2002) observed that arguments in research articles required procedural and citation support. Thus, it is evident that scientific papers are argumentative in nature and one of the prominent reasons for using citations is to persuade the reader about the argument presented in the paper. Toulmin Model for Modelling Scientific Discourse In order to develop an argumentation model for scientific articles, we make use of the wellknown Toulmin model of argument (Toulmin, 1958) . The Toulmin model asserts that most arguments can be modelled using six elements: claim, data, warrant, qualifier, rebuttal and backing. The first three are considered as essential components and the last three as additional components of an argument. The Toulmin model of argument can be applied for scientific articles as shown in Figure 1 . The different elements of the Toulmin model as applied to scientific articles are explained below. Figure 1: Argumentation Framework for Scientific Articles A Claim in the Toulmin model refers to the proposition or conclusion of an argument. With respect to a scientific article, a claim therefore consists of the statements that describe the outcomes or the results of the article (block  in Figure 1 ). In other words, these are the statements that refer to the problems solved by the article. The Data in the Toulmin model refers to the factual information that supports the claim. In a scientific article, these are the research findings that are used to substantiate the claim, i.e., the results or outcomes of the article (block ). A Rebuttal in the Toulmin model refers to exceptions to the claim. In a scientific article, these are the statements that refer to the shortcomings or gaps of the article (block ). These are situations where the results of the article may not hold or the problems that the article has not solved. The rebuttal statements also result in statements that refer to future work arising from the article (block ). A Warrant in the Toulmin model forms the key of the argument process and provides the reasoning and the thinking process that binds the data to the claim. With respect to a scientific article, warrants play a crucial role as it is this reasoning aspect that is responsible for making the article presentable. These are specifically a set of sentences that relate the data and claim for making the article convincing. They also connect rebuttal sentences for making the argument clear. The dotted lines in Figure 1 , surrounding blocks  to , indicates this aspect of warrants, bringing together the different components of the article. A Backing in the Toulmin model refers to aspects that provide additional support to a warrant. The use of citations in scientific articles Role of Citations in the Argumentation Model We explained in the previous sections an argumentation model for scientific articles based on the Toulmin model. We also noted that citations play an important role in scientific writing with their persuading nature as one its prime characteristics. In the argumentation model discussed above, citations can play various roles in different components. For example, citations can facilitate development of a good warrant. Citations can also be considered as warrants themselves as they also contribute to the reasoning process for linking data and the claim. Further, the data in the article can be developed using the outputs of the cited work. To generalize this notion, citations can be considered as backing providing additional support to the different components of the argumentation model. This is indicated in Figure 1 with a link provided from block  to the overall warrant block comprising different elements of the Toulmin model. Context Types for Sentences based on Argumentation Model We discussed in the previous section an argumentation framework for scientific articles based on the Toulmin model of argument and identified citations as a backing component for presenting the argumentation made in the paper. We also noted that one of the prominent reasons for using citations is to persuade the reader. Generally, the act of persuasion involves providing sufficient proof in order to convince the reader about a concept or an idea. In a scientific article, the use of citations to persuade the reader may focus on the following: 1. To demonstrate that others (cited work(s)) have identified a similar problem. 2. To demonstrate that others (in cited work(s)) have solved a similar problem. 3. To demonstrate how the current paper solves other problems (presented in cited paper(s)) 4. To demonstrate the limitations or the shortcomings or the gaps of others (in cited work(s)) 5. To compare works of others (in cited paper(s)) 6. To compare the results of the current work with others (in cited work(s)) Thus, we analyzed citations against these persuading characteristics in order to examine the role of citations. To this end, we created a dataset of 1000 paragraphs that had sentences with citations. Paragraphs with citations were only considered, as the focus was to identify the contexts of sentences with citations. These paragraphs were obtained from 71 research articles. The articles were chosen from the Lecture Notes in Computer Science (LNCS) series published by Springer and accessed according to the terms of our institutional licence. The dataset had a total of 4307 sentences, including 1274 citation sentences and 3031 noncitation sentences. We differentiated between citation and non-citation sentences and manually analyzed each of these sentences. This resulted in defining various context types for sentences as discussed below. The Oxford English Dictionary defines the word \"context\" as \"the parts of something written or spoken that immediately precede and follow a word or passage and clarify its meaning\" (Oxford Dictionary of English, 2010). Thus, the set of words in a sentence are chosen with an intention to provide a meaning to the reader. Following this definition, we identify the context type of a sentence as 'the meaning of a sentence'. For example consider the passage shown in Figure 2 . Each of the sentences in the passage has its own meaning and thus a specific context type. For instance, in Sentence 1, the authors refer to a cited work to describe a topic and in Sentences 2 and 3, the authors further describe that cited work. They develop a systematic methodology for determining the types of interaction that are possible in chains of 3 and 4 hops and they study the effect of these interactions on chain performance. They further extend their work to analyze chains of n hops. These studies do not consider the effect of TCP traffic on chain performance. TCP introduces several factors like bi-directional traffic, congestion control, round trip time estimations for timeout prediction etc. that are affected by interference interactions within a chain. As we will show in this paper, the types of interactions within chain have a substantial effect on the performance of a network under TCP traffic. understanding of sentences surrounding this sentence, which necessitates the need to identify the contexts of surrounding sentences. For example, in the passage provided in Figure 2 , though the authors refer to the cited work in sentence 1 and further describe it in sentences 2 and 3, it is only in sentence 4 (shaded in grey) that the authors identify gaps in the cited work(s). Thus, in order to understand the citation context of the citation in sentence 1, we need to identify the context types of surrounding sentences with and without citations. Context Types for Citation Sentences The analysis of citation sentences with a focus on the persuasive nature of citations described above resulted in identifying the following context types for citation sentences. 1 Context Types for Non-Citation Sentences Similarly we analyzed the surrounding noncitation sentences and accordingly identified the following types of non-citation sentences: 1. Background Sentences (BGR) -Sentences that provide background or introduction. 2. Gaps Sentences (GAPS) -Sentences that identify gaps or problems. It was observed that authors identify gaps or problems in different ways. For example, authors identified gaps in the work cited earlier in the article, or related research topics addressed in the article, or could also mention the shortcomings of the current article itself. 3. Issue Sentences (ISSUE) -Sentences that refer to author viewpoints. These sentences are referred as issue sentences as these are the issues or points identified by the author. Current Work Outcome Sentences (CWO) - Sentences that refer to the outcomes of the current research (the work being reported). 5. Future Work Sentences (FW) -Sentences that refer to future work. 6. Descriptive Sentences (DES) -Sentences that are descriptive in nature. For example, authors can further describe a cited work. Thus, following this approach, we developed the annotation scheme shown in Figure 3 for sentences in full text of articles. Figure 3: Our Initial Annotation Scheme As seen in Figure 3 , sentences are initially classified as citation sentences or non-citation sentences. With respect to non-citation sentences, we define six different context types that could be associated with them. However, with respect to citation sentences, we define a hierarchy of context types for sentence. We define at the top level of the hierarchy the class of IRCW (Issue Related Cited Work). Thus, if a citation sentence cannot be classified into any other class, it will have the class of IRCW. This implies that a citation in the article is made for some issue other than the context types defined in our annotation scheme. We identify six context types for citation sentences as subclasses of IRCW. Reliability of Context Types In order to study how reliably coders can interpret the context types defined above in an objective way, we carried out an inter-rater reliability (IRR) study. The approach followed during this study is as follows. Approach of IRR Study Researchers have adopted different strategies while carrying out inter-rater reliability studies. Teufel and Moens (2002) worked with annotations of a subset of 80 conference articles from a larger corpus of 260 articles. The articles were annotated by two annotators other than the first author herself. Wilbur et al. (2006) chose 10 articles randomly and worked with nine annotators for reporting annotation results. With respect to the practice adopted for reporting inter-annotator agreement, Bird et al. (2009) note that double annotation of 10% of the corpus forms a good practice in such studies. Further Artstein and Poesio (2008) observe that the most common approach to infer the reliability of large-scale annotation involves each sentence being marked by one coder and measuring agreement using a smaller subset that is annotated by multiple coders. We adopted a similar approach for measuring the agreement about the context type definitions proposed in our study. As mentioned earlier, the training dataset was created using 70 articles chosen from LNCS. We chose to annotate 10% of the corpus. Each article was annotated by at least three annotators, with one of the annotators being the first author of this paper. This facilitated deriving the following measures: (a) overall agreement between annotators (b) agreement between individual annotators, and (c) agreement for each label. Choice of Statistic -We used Krippendorff's alpha () (Krippendorff, 2011) for measuring reliability as it provides a generalization of several known reliability indices. This statistic enables researchers to evaluate different kinds of data using the same reliability standard and can be used in different situations such as (a) any number of observers, (b) any number of categories, scale values or measures, (c) large and small sample sizes, and (d) incomplete or missing data. Krippendorff's alpha () is defined \"as a reliability coefficient developed to measure the agreement among observers, coders, judges or raters\" (Krippendorff, 2011) . The general form of  is given by:  = 1 − 𝐷 𝐷 Where 𝐷 is the observed disagreement among values assigned to units of analysis: 𝐷 = 1 n 𝑜 and 𝐷 is the expected disagreement due to chance rather than properties of the units: 𝐷 = 1 n(n − 1) n . n The arguments of the two disagreement measures, 𝑜 , n , n and n refer to frequencies of values in the coincidence matrices. Characteristics of the annotators -The annotators in our study had considerable training in scientific writing and publishing with most of them being PhD students pursuing their doctoral research and a few of them being faculty members in the field of information science. Choice of Articles -We provided annotatators articles chosen from their own field. This was done for the following reasons: (a) it would be easier for annotators to understand the content and hence apply the labels easily and thoughtfully; and (b) minimize the annotating time; and (c) as a motivation factor as articles were from their own field. Guidelines for annotators -The guidelines used for annotators provided details of the context type definitions of the study along with example sentences for each definition. Each annotator was briefed about the purpose the study and the context type definitions. The briefing time spent with the annotators ranged between 15 and 30 minutes. The annotators were provided with paragraphs containing citations that were extracted from articles. The paragraphs were formatted to show individual sentences in them with the citation sentences highlighted to help annotators distinguish between citation and non-citation sentences. Before carrying out the study, we conducted a pilot study to examine the feasibility of our approach. The pilot study resulted in making certain changes to the annotation scheme as will be discussed in the following section. Pilot Study We conducted a pilot study with three annotators using three articles, with each annotator annotating one article. All three articles were also annotated by the first author of this article, henceforth referred to as Annotator A. Thus, we were able to compare the annotations made by Annotator A with the annotations of the three other annotators. The paragraphs extracted from the three articles provided a total of 300 sentences and hence there were 300 cases and 600 decisions to be made. After the coding of individual articles, we had discussions with the coders about the study. The coders felt that the context type definitions were clear enough and the examples were helpful in classifying sentences. However, they said there was confusion between the classes DES and ISSUE and, it was difficult to distinguish between the two. The analysis of these experiments resulted in a Krippendorff's Alpha () (Krippendorff, 2011) , score of 0.79 (N = 300, k = 2), where N is the number of items (sentences) and k is the number of coders. This is equivalent to 85% agreement between the Annotator A and each of the three annotators. The classification results for each label along with the confusion matrix are shown in Table 1 5 . As can be seen in Table 1 , there was confusion for the classes DES and ISSUE. With respect to Description (DES) sentences, the coders classified about 10% (14 out of 144) as ISSUE sentences and 62% (18 out of 29) of ISSUE sentences as DES sentences. Thus, in order to avoid this confusion, we merged the classes of DES and ISSUE into one class of DES and removed the label ISSUE from context type definitions. The merging of these classes resulted in achieving a  value of 0.93 for the pilot data, which is 95.7% agreement between the annotators. With these changes we carried out the study with a large number of annotators, as discussed in the next section. The modified annotation scheme based on the results of the pilot study is shown in Figure 4 . 1 is provided at the end of this paper for formatting reasons. IRR Study with Larger Sample After conducting the pilot study and making necessary corrections to the context type definitions, we carried out a study using 11 annotators and 9 articles. This formed 12% of the training dataset. Each article was annotated by two annotators other than Annotator A, (the first author) who annotated all nine articles. The set of 9 articles provided a total of 907 sentences. The overall result achieved for , involving nine articles and 11 annotators was 0.841 as shown in Table 2 . This is equivalent to 89.93% agreement between different pairs of annotators. The number of coders indicates that each article was annotated by three annotators. An agreement  = 0.8 or higher on Krippendorff's scale is considered as a reliable agreement, and an agreement of 0.67 to 0.8 is considered to be marginally reliable. A value lower than 0.67 for  indicates the agreement is unreliable. Therefore, the results indicate that the labels of our scheme can be reliably applied to sentences.  The details of the agreement between Annotator A and the others annotators involved in the study is shown in Table 3 .  The annotators in our study were requested to annotate any number of articles depending on their availability. While some chose to annotate a single article, three of the annotators (Annotators 1, 2 and 3 -shown in grey in Table 3 ) annotated three articles. The  value for these annotators was of the order 0.85 to 0.90. This shows that the increase in annotated sentences resulted in better agreement indicating the ease of applying the labels to sentences by these annotators. The agreement achieved for each article between three of the annotators is tabulated in Table 4 . Conclusion We presented in this paper an annotation scheme of context types for scientific articles, considering the persuasive characteristic of citations. We described the application of the Toulmin model for developing an argumentation framework for scientific articles, which was used for defining our context types. We discussed the results of the inter-rater reliability study carried out for establishing the reliability of our scheme. As we mentioned in Section 1, studies have successfully used this annotation scheme for developing tools that provide intelligent citation context based information services, indicating the usefulness of the annotation scheme. Our future work involves examining the application of annotation schemes across other disciplines. We also intend to focus on using our context types for analyzing sentiments associated with citation contexts.   * Labels CCW and SCCW are not shown in the table as none of the sentences were labeled with these labels. Captions: P -Precision; R -Recall; F -F-Score",
    "abstract": "This paper presents an annotation scheme for modelling citation contexts in scientific articles. We present an argumentation framework based on the Toulmin model for scientific articles and develop an annotation scheme with different context types based on the argumentation model. We present the results of the inter-rater reliability study carried out for studying the reliability of our annotation scheme.",
    "countries": [
        "New Zealand"
    ],
    "languages": [
        "German"
    ],
    "numcitedby": "6",
    "year": "2012",
    "month": "December",
    "title": "A Citation Centric Annotation Scheme for Scientific Articles"
}