{
    "article": "This paper describes the design criteria and annotation guidelines of Sinica Treebank. The three design criteria are: Maximal Resource Sharing, Minimal Structural Complexity, and Optimal Semantic Information. One of the important design decisions following these criteria is the encoding of thematic role information. An on-line interface facilitating empirical studies of Chinese phrase structure is also described. Introduction The Penn Treebank (Marcus et al. 1993 ) initiated a new paradigm in corpus-based research. The English. Penn Treebank has enabled and motivated corpus and computational linguistic research based on information extractable from structurally annotated corpora. Recently, the research has focused on the following two issues: first, when and how can a structurally annotated corpus of language X be built? Second, what information should or can be annotated? A good sample of issues in these two directions can be found in the papers collected in Abeille (1999) . The construction of the Sinica Treebank deals with both issues. First, it is one of the first structurally annotated corpora in Mandarin Chinese. Second, as a design feature, the Sinica Treebank annotation includes thematic role information in addition to syntactic categories. In this paper, we will discuss the design criteria and annotation guidelines of the Sinica Treebank. We will also give a preliminary research result based on the Sinica Treebank. Design Criteria There are three important design criteria for the Sinica Treebank: maximal resource sharing, minimal structural complexity, and optimal semantic information. Other theories may also call for an Annotation Guidelines I: Category and Hierarchy The basic structure of a tree in a treebank is a hierarchy of nodes with is constructed for a more complete list of tags as well as explanation in Chinese. Defining Phrasal Categories There are only 6 non-terminal phrasal categories annotated in the Sinica Treebank. (1) Phrasal Categories 1. S: An S is a complete tree headed by a predicate (i.e. S is the start symbol). 2.VP: A VP is a phrase headed by a predicate. However, it lacks a subject and cannot function alone. NP: An Defining Inheritance Relations Beyond Simple Inheritance When simple inheritance fails, the following principles derived from our design criteria serve to predict the structural assignments of a phrasal category: default inheritance, sisters only, and left most. 5 ) is an instance of the application of this default hierarchy. ( ) [[da41iang4]Neqa [er2]Caa [feng l sheng4]VH11 ]V]VP 5 big-quantity and bountiful \"bountiful and of big quantity\" When lexical conjuncts are involved, the same principle is used. The priority is given to the predicate head of the sentence. Among possible argument roles, the nominal category is the default. An illustrative example can be found in  The result is a flat structure. Left First This principle is designed to account for possible internal structure when there are more than two sisters -without having to add on hierarchical complexity. Hence, the default interpretation of internal structure of multiple sisters is that the internal association starts from leR to right. Annotation Guidelines II: Structural Annotation of Thematic Information A Current Status of the Sinica Treebank and On-line Interface Following the above criteria and Conclusion The construction of the Sinica Treebank is only a first step towards application of structurally annotated corpora. Continuing expansion and correction will make this database an invaluable resource for linguistic and computational studies of Chinese. ",
    "abstract": "This paper describes the design criteria and annotation guidelines of Sinica Treebank. The three design criteria are: Maximal Resource Sharing, Minimal Structural Complexity, and Optimal Semantic Information. One of the important design decisions following these criteria is the encoding of thematic role information. An on-line interface facilitating empirical studies of Chinese phrase structure is also described.",
    "countries": [
        "Taiwan"
    ],
    "languages": [
        "Mandarin",
        "Mandarin",
        "English",
        "Chinese"
    ],
    "numcitedby": "64",
    "year": "2000",
    "month": "October",
    "title": "{S}inica {T}reebank: Design Criteria, Annotation Guidelines, and On-line Interface"
}