{
    "article": "In this paper, we present a method for comparing Lexicalized Tree Adjoining Grammars extracted from annotated corpora for three languages: English, Chinese and Korean. This method makes it possible to do a quantitative comparison between the syntactic structures of each language, thereby providing a way of testing the Universal Grammar Hypothesis, the foundation of modern linguistic theories. Introduction The comparison of the grammars extracted from annotated corpora (i.e., Treebanks) is important on both theoretical and engineering grounds. Theoretically, it allows us to do a quantitative testing of the Universal Grammar Hypothesis. One of the major concerns in modern linguistics is to establish an explanatory basis for the similarities and variations among languages. The working assumption is that languages of the world share a set of universal linguistic principles and the apparent structural differences attested among languages can be explained as variation in the way the universal principles are instantiated. Comparison of the extracted syntactic trees allows us to quantitatively evaluate how similar the syntactic structures of different languages are. From an engineering perspective the extracted grammars and the links between the syntactic structures in the grammars are valuable resources for NLP applications, such as parsing, computational lexicon development, and machine translation (MT), to name a few. In this paper we first briefly discuss some linguistic characteristics of English, Chinese, and Korean, and introduce the Treebanks for the three languages. We then describe a tool that extracts Lexicalized Tree Adjoining Grammars (LTAGs) from Treebanks and the results of its application to these three Treebanks. Next, we describe our methodology for automatic comparison of the extracted Treebank grammars, This consists primarily of matching syntactic structures (namely, templates and sub-templates) in each pair of Treebank grammars. The ability to perform this type of comparison for different languages has a definite positive impact on the possibility of sorting out the universal versus language-dependent features of languages. Therefore, our grammar extraction tool is not only an engineering tool of great value in improving the efficiency and accuracy of grammar development, but it is also very useful for investigating theoretical linguistics. 2 Three Languages and Three 'rreebanks In this section, we briefly discuss some linguistic characteristics of English, Chinese, and Korean, and introduce the Treebanks for these languages. Three Languages These three languages belong to different language families: English is Germanic, Chinese is Sino-Tibetan, and Korean is Altaic (Comrie, 1987). There are several major differences between these languages. First, both English and Chinese have predominantly subjectverb-object (SVO) word order, whereas Korean has underlying SOV order. Second, the word order in Korean is freer than in English and Chinese in the sense that argument NPs are freely permutable (subject to certain discourse constraints). Third, Korean and Chinese freely allow subject and object deletion, but English does not. Fourth, Korean has richer inflectional morphology than English, whereas Chinese has little, if any, inflectional morphology. Three Treebanks The Treebanks that we used in this paper are the English Penn Treebank II (Marcus et al., 1993) , the Chinese Penn Treebank (Xia et al., 2000b) , and the Korean Penn Treebank (Chung-hye Han, 2000) . The main parameters of these Treebanks are summarized in Table 1 .1 The tags in each tagset can be classified into one of four types: (1) syntactic tags for phrase-level annotation, (2) Part-Of-Speech (POS) tags for head-level annotation, (3) function tags for grammatical function annotation, and (4) empty category tags for dropped arguments, traces, and so on. We chose these Treebanks because they all use phrase structure annotation and their annotation schemata are similar, which facilitates the comparison between the extracted Treebank grammars. Figure 1 shows an annotated sentence from the Penn English Treebank. LTAGs and Extraction Algorithm In this section, we give a brief introduction to the LTAG formalism and to a system named LexTract, which we build to extract LTAGs from Treeb~.nks. 1The reason why the average sentence length for Korean is much shorter than those for English and Chinese is that a big portion of the corpus for Korean Treebank includes dialogues that contain many one-word replies, whereas English and Chinese corpora consist of newspaper articles. LTAGs are based on the Tree Adjoining Grammar formalism developed by Joshi, Levy, and Takahashi (Joshi et al., 1975; Joshi and Schabes, 1997) . The primitive elements of an LTAG are elementary trees (etrees). Each etree is associated with a lexical item (called the anchor of the tree) on its frontier. LTAGs possess many desirable properties, such as the Extended Domain of Locality, which allows the encapsulation of all arguments of the anchor associated with an etree. There are two types of etrees: initial trees and auxiliary trees. An auxiliary tree represents a recursive structure and has a unique leaf node, called the foot node, which has the same syntactic category as the root node. Leaf nodes other than anchor nodes and foot nodes are substitution nodes. Etrees are combined by two operations: substitution and adjunction. The resulting structure of the combined etrees is called a derived tree. The combination process is expressed as a derivation tree. Figure 2 shows the etrees, the derived tree, and the derivation tree for the sentence underwriters still draft policies. Foot and substitution nodes are marked by ,, and $, respectively. The dashed and solid lines in the derivation tree are for adjunction and substitution operations, respectively. The Form of Target Grammars Without further constraints, the etrees in the target grammar (i.e., the grammar to be extracted by LexTract) could be of various shapes. LexTract recognizes three types of # of POS # ofsyntactags tic tags Language corpus size (words)  --\"--'\"T'----\"---- The spine-etrees for predicate-argument relations. X ° is the head of X m and the anchor of the etree. The etree is formed by a spine X m ~ X m-1 ~ .. ~ X ° and the arguments of X °. undcxwrRcrs(# 1 ) \\ policies(#4) still(#2) (h) dcrivcd trc¢ (c) dczivatitm trcc The mod-etrees for modification relations. The root of the etree has two children, one is a foot node with the label Wq, and the other node X m is a modifier of the foot node. X m is further expanded into a spine-etree whose head X ° is the anchor of the whole mod-etree. The conj-etrees for coordination relations. In a conj-etree, the children of the root are two conjoined constituents and a node for a coordination conjunction. One conjoined constituent is marked as the foot node, and the other is expanded into a spine-etree whose head is the anchor of the whole tree. Spine-etrees are initial trees, whereas modetrees and conj-etrees are auxiliary trees. Extraction algorithm The core of LexTract is an extraction algorithm that takes a Treebank sentence such as the one in Figure 1 and Treebank-specific information provided by the user of LexTract, and produces a set of etrees as in Figure 4 and a derivation tree. We have described LexTract's architecture, its extraction algorithm, and its applications in (Xia, 1999; Xia et al., 2000a) . Therefore, we shall not repeat them in this paper other than pointing out that LexTract is completely languageindependent. 3.4 Experiments The results of running LexTract on English, Chinese, and Korean Treebanks are shown in Table 2 . Templates are etrees with the lexical items removed. For instance, #3, #6, and #9 in Figure 4 are three distinct etrees but they share the same template. Figure 5 shows the log frequency of templates in the English Figure 4 : The extracted etrees from the fully bracketed ttree types. 2 In both cases, template types are sorted according to their frequencies and plotted on the X-axis. The figure shows that a small subset of template types, which occurs very frequently in the Treebank and can be seen as the core of the Treebank grammar, covers the majority of template tokens in the Treebank. For instance, the most frequent template type covers 9.37% of the template tokens and the top 100 (500, 1000 and 1500, respectively) template types cover 87.1% (96.6%, 98.4% and 99.0%, respectively) of the tokens, whereas about half (3440) of the template types occur once, accounting for only 0.32% of template tokens in total. Comparing Three Treebank Grammars In this section, we describe our methodology for comparing Treebank gr3.mmars and the experimental results. Methodology To compare Treeb~nb grammars, we need to ensure that the Treebank grammars are based on the same tagset. To achieve that, we first create a new tagset that includes all the tags 2If a template occurs n times in the corpus, it is counted as one template type but n template tokens. from the three Treebanks. Then we merge some tags in this new tagset into a single tag. This step is necessary because certain distinctions among some tags in one language do not exist in another language. For example, the English Treebank has distinct tags for verbs in past tense, past participals, gerunds, and so on; however, no such distinction is morphologically marked in Chinese and, therefore, the Chinese Treebank uses the same tag for verbs regardless of the tense and aspect. To make the conversion straightforward for verbs, we use a single tag for verbs in the new tagset. Next, we replace the tags in the original Treebanks with the tags in the new tagset, and then re-run LexTract to build Treebank gr~mraars from those Treebanks. Now that the Treebank grammars are based on the same tagset, we can compare them according to the templates and sub-templates that appear in more than one 'rreebank m that is, given a pair of Treebank grammars, we first calculate how many templates occur in both grammars; 3 Next, we decompose SIdeally, to get more accurate comparison results, we would like to compare etrees, rather than templates (which are non-lexicalized); however, comparing etrees requires bilingual parallel corpora, which we are cur-templates: sub-templates: The decompositions of etree templates (In sub-templates, @ marks the anchor in subcategorization frame, * marks the modifiee in a modifier-modifiee pair.) each template into a list of sub-templates (e.g., spines and subcategorization frames) and calculate how many of those sub-templates occur in both grammars. A template is decomposed as follows: A spine-etree template is decomposed into a spine and a subcategorization frame; a mod-etree template is decomposed into a spine, a subcategorization frame, and a modifier-modifiee pair; a conj-etree template is decomposed into a spine, a subcategorization frame, and a coordination tuple. Figure 6 shows examples of this decomposition for each type of template. Experiments After tags in original Treebn.nks being replaced with the tags in the new tagset, the numbers of templates in the new Treebank gra.mmars decrease by about 50%, as shown in the second colnmn of Table 3 (cf. the second column in Table 2 ). For instance, in the (Eng, Ch) pair, the 237 template types that appear in both grammars is only 77.5% of all the English template types, but they cover 80.1% of template tokens in the English Treebank. If we define the core grammar of a language as the set of the templates that occur very often in the Treebnnk, the data suggest that the majority of the core grammars are easily inter-mappable structures for these three languages. If we compare sub-templates, rather than templates, in the Treebank grammars, the percentages of matched sub-template tokens (as in Table 5 ) are higher than the percentages of matched template tokens. This is because two distinct templates may share common sub-templates. Unmatched templates Our previous experiments (see Table 4 ) show that the percentages of unmatched template tokens in three Treebanks range from 16.0% to 43.8%, depending on the language pairs. Given a language pair, there are many possible reasons why a template appears in one Treebank grammar, but not in the other. We divide those unmatched templates into two categories: spuriously unmatched templates and truly unmatched templates.  (T2) Unique tags: For each pair of languages, some Part-of-speech tags and syntactic tags may appear in only one language. Therefore, the templates with those tags will not match any templates in the other language. For instance, in Korean the counterparts of preposition phrases in English and Chinese are noun phrases (with postpositions attaching to them, not preposition phrases); therefore, the templates with PP in Chinese,   So far, we have listed six possible reasons for unmatched templates. Without manually examining all the unmatched templates, it is difficult to tell how many unmatched templates are caused by a particular reason. Nevertheless, these reasons help us to interpret the results in Table 4 . For instance, the table shows that Korean grammars cover only 57.7% of template tokens in the English Treebank, and 57.2% in the Chinese Treebank, whereas the coverages for other language pairs are all above 80%. We suspect that this difference of coverage is mainly caused by (S1), (T1), and (T2). That is, first, Korean Treebank is much smaller than the English and the Chinese Treebanks, English and Chinese Treebanks may have many tree templates that simply was not found in the Korean Treebank; Second, English and Chinese are predominantly head-initial, whereas Korean is head-final, therefore, many templates in English and Chinese can not find matched templates in Korean because of the word order difference; Third, Korean does not have preposition phrases, causing all the templates in English and Chinese with PPs become unmatched. To measure the effect of the word order factor to the matching rate, we re-did the experiment in Section 4.2, but this time we ignored the word order --that is, we treat templates as unordered trees. The results are given in Table 6 . Comparing this table with Table 4 , we can clearly see that, the percentages of matched templates increase substantially for (Eng, Kor) and (Ch, Kor) when the word order is ignored. Notice that the matching percentage for (Eng, Ch) does not change as much because the word orders in English and Chinese are much similar than the orders in English and Korean. Spuriously unmatched templates Conclusion We have presented a method of quantitatively comparing LTAGs extracted from Treebanks. Our experimental results show a high proportion of easily inter-mappable structures, giving a positive implications for Universal Grammar hypothesis, We have also described a number of reasons why a particular tern- There are two natural extensions of this work. First, running an alignment algorithm on parallel bracketed corpora to produce word-to, word mappings. Given such word-toword mappings and our template matching algorithm, we can automatically create lexicalized etree-to-etree mappings, which can be used for semi-automatic transfer lexicon construction. Second, LexTract can build derivation trees for each sentence in the corpora. By comparing derivation trees for parallel sentences in two languages, instances of structural divergences (Dorr, 1993; Dorr, 1994; Palmer et al., 1998 ) can be automatically detected.",
    "abstract": "In this paper, we present a method for comparing Lexicalized Tree Adjoining Grammars extracted from annotated corpora for three languages: English, Chinese and Korean. This method makes it possible to do a quantitative comparison between the syntactic structures of each language, thereby providing a way of testing the Universal Grammar Hypothesis, the foundation of modern linguistic theories.",
    "countries": [
        "United States"
    ],
    "languages": [
        "Korean",
        "English",
        "Chinese"
    ],
    "numcitedby": "14",
    "year": "2000",
    "month": "October",
    "title": "Comparing Lexicalized Treebank Grammars Extracted from {C}hinese, {K}orean, and {E}nglish Corpora"
}