{
    "article": "Most work in statistical parsing has focused on a single corpus: the Wall Street Journal portion of the Penn Treebank. While this has allowed for quantitative comparison of parsing techniques, it has left open the question of how other types of text might a ect parser performance, and how portable parsing models are across corpora. We examine these questions by comparing results for the Brown and WSJ corpora, and also consider which parts of the parser's probability model are particularly tuned to the corpus on which it was trained. This leads us to a technique for pruning parameters to reduce the size of the parsing model. Introduction The past several years have seen great progress in the eld of natural language parsing, through the use of statistical methods trained using large corpora of hand-parsed training data. The techniques of Charniak 1997 , Collins 1997 , and Ratnaparkhi 1997 achieved roughly comparable results using the same sets of training and test data. In each case, the corpus used was the Penn Treebank's hand-annotated parses of Wall Street Journal articles. Relatively few quantitative parsing results have been reported on other corpora though see Stolcke e t al. 1996 for results on Switchboard, as well as Collins et al. 1999 for results on Czech and Hwa 1999 for bootstrapping from WSJ to ATIS. The inclusion of parses for the Brown corpus in the Penn Treebank allows us to compare parser performance across corpora. In this paper we examine the following questions: To what extent is the performance of statistical parsers on the WSJ task due to its relatively uniform style, and how m i g h t s u c h parsers fare on the more varied Brown corpus? Can training data from one corpus be applied to parsing another? What aspects of the parser's probability m o d e l are particularly tuned to one corpus, and which are more general? Our investigation of these questions leads us to a surprising result about parsing the WSJ corpus: over a third of the model's parameters can be eliminated with little impact on performance. Aside from cross-corpus considerations, this is an important nding if a lightweight parser is desired or memory usage is a consideration. Previous Comparisons of Corpora A great deal of work has been done outside of the parsing community analyzing the variations between corpora and di erent genres of text. Biber 1993 investigated variation in a number syntactic features over genres, or registers, of language. Of particular importance to statistical parsers is the investigation of frequencies for verb subcategorizations such a s R o l a n d a n d Jurafsky 1998 . Roland et al. 2000 nd that subcategorization frequencies for certain verbs vary signi cantly between the Wall Street Journal corpus and the mixed-genre Brown corpus, but that they vary less so between genre-balanced British and American corpora. Argument structure is essentially the task that automatic parsers attempt to solve, and the frequencies of various structures in training data are re ected in a statistical parser's probability model. The variation in verb argument structure found by previous research caused us to wonder to what extent a model trained on one corpus would be useful in parsing another. The probability models of modern parsers include not only the number and syntactic type of a word's arguments, but lexical information about their llers. Although we a r e n o t a ware of previous comparisons of the frequencies of argument llers, we can only assume that they vary at least as much as the syntactic subcategorization frames. The Parsing Model We take as our baseline parser the statistical model of Model 1 of Collins 1997. The model is a historybased, generative model, in which the probability for a parse tree is found by expanding each node in the tree in turn into its child nodes, and multiplying the probabilities for each action in the derivation. It can be thought o f a s a v ariety of lexicalized probabilistic context-free grammar, with the rule probabilities factored into three distributions. The rst distribution gives probability of the syntactic category H of the head child of a parent node with category P , head word H h wwith the head tag the part of speech tag of the head word H h t : P h HjP; Hht; Hhw The head word and head tag of the new node H are de ned to be the same as those of its parent. The remaining two distributions generate the non-head children one after the other. A special STOP symbol is generated to terminate the sequence of children for a given parent. Each child is generated in two steps: rst its syntactic category C and head tag C h tare chosen given the parent's and head child's features and a function representing the distance from the head child: P c C;ChtjP;H;Hht;Hhw; Then the new child's head word C h wis chosen: P cw C h w jP;H;Hht;Hhw;; C ; C h t For each of the three distributions, the empirical distribution of the training data is interpolated with less speci c backo distributions, as we will see in Section 5. Further details of the model, including the distance features used and special handling of punctuation, conjunctions, and base noun phrases, are described in Collins 1999. The fundamental features of used in the probability distributions are the lexical heads and head tags of each constituent, the co-occurrences of parent nodes and their head children, and the cooccurrences of child nodes with their head siblings and parents. The probability models of Charniak 1997, Magerman 1995 and Ratnaparkhi 1997 di er in their details but are based on similar features. Models 2 and 3 of Collins 1997 add some slightly more elaborate features to the probability model, as do the additions of Charniak 2000 to the model of Charniak 1997. Our implementation of Collins' Model 1 performs at 86 precision and recall of labeled parse constituents on the standard Wall Street Journal training and test sets. While this does not re ect the state-of-the-art performance on the WSJ task achieved by the more the complex models of Charniak 2000 and Collins 2000, we regard it as a reasonable baseline for the investigation of corpus e ects on statistical parsing. Parsing Results on the Brown Corpus We conducted separate experiments using WSJ data, Brown data, and a combination of the two as training material. For the WSJ data, we observed the standard division into training sections 2 through 21 of the treebank and test section 23 sets. For the Brown data, we reserved every tenth sentence in the corpus as test data, using the other nine for training. This may underestimate the difculty of the Brown corpus by including sentences from the same documents in training and test sets. However, because of the variation within the Brown corpus, we felt that a single contiguous test section might not be representative. Only the subset of the Brown corpus available in the Treebank II bracketing format was used. This subset consists primarily of various ction genres. Corpus sizes are shown in Table 1 . Training Results for the Brown corpus, along with WSJ results for comparison, are shown in Table 2 . The basic mismatch between the two corpora is shown in the signi cantly lower performance of the WSJtrained model on Brown data than on WSJ data rows 1 and 2. A model trained on Brown data only does signi cantly better, despite the smaller size of the training set. Combining the WSJ and Brown training data in one model improves performance further, but by less than 0.5 absolute. Similarly, adding the Brown data to the WSJ model increased performance on WSJ by less than 0.5. Thus, even a large amount of additional data seems to have relatively little impact if it is not matched to the test material. The more varied nature of the Brown corpus also seems to impact results, as all the results on Brown are lower than the WSJ result. The E ect of Lexical Dependencies The parsers cited above all use some variety of lexical dependency feature to capture statistics on the co-occurrence of pairs of words being found in parentchild relations within the parse tree. The interpolation weights 1 , 2 are chosen as a function of the number of examples seen for the conditioning events and the number of unique values seen for the predicted variable. Only the rst distribution in this interpolation scheme involves pairs of words, and the third component is simply the probability o f a w ord given its part of speech. Because the word pair feature is the most speci c in the model, it is likely to be the most corpusspeci c. The vocabularies used in corpora vary, as do the word frequencies. It is reasonable to expect word co-occurrences to vary as well. In order to test this hypothesis, we removed the distribution PC h w jP;H;Hht;Hhw;C;Cht from the parsing model entirely, relying on the interpolation of the two less speci c distributions in the parser: P cw2 C h w jP;H;Hht;; C ; C h t = 2 P C h w jP; H; Hht; ; C ; C h t + 1 , 2 P C h w jC h t 2 We performed cross-corpus experiments as before to determine whether the simpler parsing model might be more robust to corpus e ects. Results are shown in Table 3 . Perhaps the most striking result is just how little the elimination of lexical bigrams a ects the baseline system: performance on the WSJ corpus decreases by less than 0.5 absolute. Moreover, the performance of a WSJ-trained system without lexical bigrams on Brown test data is identical to the WSJtrained system with lexical bigrams. Lexical cooccurrence statistics seem to be of no bene t when attempting to generalize to a new corpus. Pruning Parser Parameters The relatively high performance of a parsing model with no lexical bigram statistics on the WSJ task led us to explore whether it might be possible to signi cantly reduce the size of the parsing model by selectively removing parameters without sacricing performance. Such a technique reduces the parser's memory requirements as well as the overhead of loading and storing the model, which could be desirable for an application where limited computing resources are available. Signi cant e ort has gone into developing techniques for pruning statistical language models for speech recognition, and we borrow from this work, using the weighted di erence technique of Seymore and Rosenfeld 1996. This technique applies to any statistical model which estimates probabilities by backing o , that is, using probabilities from a less speci c distribution when no data are available are available for the full distribution, as the following equations show for the general case: P ejh =P 1 ejh if e 6 2 BOh = hP 2 ejh 0 if e 2 BOh Here e is the event to be predicted, h is the set of conditioning events or history, is a backo weight, and h 0 is the subset of conditioning events used for the less speci c backo distribution. BOis the backo s e t o f e v ents for which no data are present in the speci c distribution P 1 . In the case of n-gram language modeling, e is the next word to be predicted, and the conditioning events are the n , 1 preceding words. In our case the speci c distribution P 1 of the backo model is P cw of equation 1, itself a linear interpolation of three empirical distributions from the training data. The less speci c distribution P 2 of the backo model is P cw2 of equation 2, an interpolation of two empirical distributions. The backo weight is simply 1 , 1 in our linear interpolation model. The Seymore Rosenfeld pruning technique can be used to prune backo probability models regardless of whether the backo weights are derived from linear interpolation weights or discounting techniques such as Good-Turing. In order to ensure that the model's probabilities still sum to one, the backo weight must be adjusted whenever a parameter is removed from the model. In the Seymore Rosenfeld approach, parameters are pruned according to the following criterion: Ne; hlog pejh , log p 0 ejh 0 3 where p 0 ejh 0 represents the new backed o probability estimate after removing pejh from the model and adjusting the backo weight, and Ne; h is the count in the training data. This criterion aims to prune probabilities that are similar to their backo estimates, and that are not frequently used. As shown by S t o l c ke 1998, this criterion is an approximation of the relative e n tropy b e t ween the original and pruned distributions, but does not take i n to account the e ect of changing the backo weight on other events' probabilities. Adjusting the threshold below which parameters are pruned allows us to successively remove more and more parameters. Results for di erent v alues of are shown in Table 4 . The complete parsing model derived from the WSJ training set has 735,850 parameters in a total of nine distributions: three levels of backo for each of the three distributions P h , P c and P cw . The lexical bigrams are contained in the most speci c distribution for P cw . Removing all these parameters reduces the total model size by 43. The results show a gradual degradation as more parameters are pruned. The ten lexical bigrams with the highest scores for the pruning metric are shown in Table 5 for WSJ and Table 6 . The pruning metric of equation 3 has been normalized by corpus size to allow comparison between WSJ and Brown. The only overlap between the two sets is for pairs of unknown word tokens. The WSJ bigrams are almost all speci c to nance, are all word pairs that are likely to appear immediately adjacent to one another, and are all children of the base NP syntactic category. The Brown bigrams, which have lower correlation values by our metric, include verb subject and preposition object relations and seem more broadly applicable as a model of English. However, the pairs are not strongly related semantically, no doubt because the rst term of the pruning criterion favors the most frequent w ords, such as forms of the verbs be\" and have\". The parsing models of Charniak 2000 and Collins 2000 add more complex features to the parsing model that we use as our baseline. An area for future work is investigation of the degree to which s u c h features apply across corpora, or, on the other hand, further tune the parser to the peculiarities of the Wall Street Journal. Of particular interest are the automatic clusterings of lexical co-occurrences used in Charniak 1997 and Magerman 1995. Cross-corpus experiments could reveal whether these clusters uncover generally applicable semantic categories for the parser's use. Acknowledgments This work was undertaken as part of the FrameNet project at ICSI, with funding from National Science Foundation grant ITR HCI 0086132. References Douglas Biber. 1993. Using register-diversi ed corpora for general language studies.",
    "abstract": "Most work in statistical parsing has focused on a single corpus: the Wall Street Journal portion of the Penn Treebank. While this has allowed for quantitative comparison of parsing techniques, it has left open the question of how other types of text might a ect parser performance, and how portable parsing models are across corpora. We examine these questions by comparing results for the Brown and WSJ corpora, and also consider which parts of the parser's probability model are particularly tuned to the corpus on which it was trained. This leads us to a technique for pruning parameters to reduce the size of the parsing model.",
    "countries": [
        "United States"
    ],
    "languages": [
        "English",
        "Czech"
    ],
    "numcitedby": "330",
    "year": "2001",
    "month": "",
    "title": "Corpus Variation and Parser Performance"
}