{
    "article": "This paper presents a corpus study of evaluative and speculative language. Knowledge of such language would be useful in many applications, such a s text categorization and summarization. Analyses of annotator agreement and of characteristics of subjective language are performed. This study yields knowledge needed to design e ective machine learning systems for identifying subjective language. Introduction Subjectivity in natural language refers to aspects of language used to express opinions and evaluations (Ban eld, 1982 Wiebe, 1994) . Subjectivity tagging is distinguishing sentences used to present opinions and other forms of subjectivity ( subjective sentences) from sentences used to objectively present factual information (objective sentences). This task is especially relevant for news reporting and Internet forums, in which opinions of various agents are expressed. There are numerous applications for which subjectivity tagging is relevant. Two are information retrieval and information extraction. Current extraction and retrieval technology focuses almost exclusively on the subject matter of documents. However, additional aspects of a document in uence its relevance, including, e.g., the evidential status of the material presented, and the attitudes expressed about the topic (Kessler et al., 1997) . Knowledge of subjective language would also be useful in ame recognition (Spertus, 1997 Kaufer, 2000) , email classi cation (Aone et al., 2000) , intellectual attribution in text (Teufel and Moens, 2000) , recognizing speaker role in radio broadcasts (Barzilay e t al., 2000) , review mining (Terveen et al., 1997) , generation and style (Hovy, 1987) , clustering documents by ideological point of view (Sack, 1995) , and any other application that would bene t from knowledge of how opinionated the language is, and whether or not the writer purports to objectively present factual material. To use subjectivity tagging in applications, good linguistic clues must be found. As with many pragmatic and discourse distinctions, existing lexical resources are not comprehensively coded for subjectivity. The goal of our current w ork is learning subjectivity clues from corpora. This paper contributes to this goal by empirically examining subjectivity. W e explore annotating subjectivity at di erent levels (expression, sentence, document) and produce corpora annotated at di erent levels. Annotator agreement is analyzed to understand and assess the viability o f s u c h annotations. In addition, because expression-level annotations are ne-grained and thus very informative, these annotations are examined to gain knowledge about subjectivity. We also use our annotations and existing editorial annotations to generate and test features of subjectivity. Altogether, the observations and results of these studies provide valuable information that will facilitate designing e ective machine learning systems for recognizing subjectivity. The remainder of this paper rst provides background about subjectivity, then presents results for document-level annotations, followed by a n analysis of expression-level annotations. Results for features generated using document-level annotations are next, ending with conclusions. Subjectivity Sentence (1) is an example of a simple subjective sentence, and (2) is an example of a simple objective s e n tence: 1 (1) At several di erent l a yers, it's a fascinating tale. The main types of subjectivity are: 1. Following is an example of opinionated, editorial language, taken from an editorial in the Wall Street Journal: (4) We stand in awe of the Woodstock generation's ability to be unceasingly fascinated by t h e subject of itself. Sentences ( 5 ) and ( 6 ) illustrate the fact that sentences about speech e v ents may be subjective or objective: (5) Northwest Airlines settled the remaining lawsuits led on behalf of 156 people killed in a 1987 crash, but claims against the jetliner's maker are being pursued, a federal judge said. (6) \\The cost of health care is eroding our standard of living and sapping industrial strength,\" complains Walter Maher, a Chrysler health-andbene ts specialist. In (5), the material about lawsuits and claims is presented as factual information, and a federal judge is given as the source of information. In (6), in contrast, a complaint is presented. An NLP system performing information extraction on (6) should not treat the material in the quoted string as factual information, with the complainer as a source of information, whereas a corresponding treatment o f s e n tence (5) would be appropriate. Subjective s e n tences often contain individual expressions of subjectivity. Examples are fascinating in (1), and eroding, sapping, a n d complains in (6). The following paragraphs mention aspects of subjectivity expressions that are relevant for NLP applications. First, although some expressions, such a s !, are subjective in all contexts, many, such a s sapping and eroding, m a y o r m a y not be subjective, depending on the context in which they appear. A potential subjective element (PSE) is a linguistic element t h a t m a y be used to express subjectivity. A subjective element is an instance of a potential subjective element, in a particular context, that is indeed subjective i n t h a t c o n text (Wiebe, 1994) . Second, a subjective e l e m e n t expresses the subjectivity o f a source, who may be the writer or someone mentioned in the text. For example, the source of fascinating in (1) is the writer, while the source of the subjective elements in ( 6 ) is Maher. In addition, a subjective element h a s a target, i.e., what the subjectivity is about or directed toward. In (1), the target is a tale in (6), the target of Maher's subjectivity is the cost of health care. These are examples of object-centric subjectivity, which is about an object mentioned in the text (other examples: \\I love this project\" \\The software is horrible\"). Subjectivity m a y also be addressee-oriented, i.e., directed toward the listener or reader (e.g., \\You are an idiot\"). Third, there may b e m ultiple subjective elements in a sentence, possibly of di erent t ypes and attributed to di erent sources and targets. For example, in (4), subjectivity o f t h e W oodstock generation is described (speci cally, its fascination with itself). In addition, subjectivity of the writer is expressed (e.g., `we stand in awe'). As described below, individual subjective elements were annotated as part of this work, re ning previous work on sentence-level annotations. Finally, PSEs may be complex expressions such as `village idiot', `powers that be', `You' NP, and `What a' NP. There is a great variety o f s u c h expressions, including many studied under the rubric of idioms (see, for example, (Nunberg et al., 1994) ). We a ddress learning such expressions in another project. Previous Work on Subjectivity Tagging In previous work (Wiebe et al., 1999 Bruce and Wiebe, 1999) , a corpus of sentences from the Wall Street Journal Treebank Corpus (Marcus et al., 1993) was manually annotated with subjectivity classi cations by m ultiple judges. The judges were instructed to consider a sentence to be subjective if they perceived any signi cant expression of subjectivity (of any source) in the sentence, and to consider the sentence to be objective, otherwise. Agreement w as summarized in terms of Cohen's (Cohen, 1960) , which compares the total probability of agreement to that expected if the taggers' classi cations were statistically independent (i.e., \\chance agreement\"). After two rounds of tagging by three judges, an average pairwise value of .69 was achieved on a test set. The EM learning algorithm was used to produce corrected tags representing the consensus opinions of the taggers (Goodman, 1974 Dawid and Skene, 1979 ). An automatic system to perform subjectivity tagging was developed using the new tags as training and testing data. In 10-fold cross validation experiments, a probabilistic classi er obtained an average accuracy on subjectivity tagging of 72.17%, more than 20 percentage points higher than a baseline accuracy obtained by a l w ays choosing the more frequent class. Five part-of-speech features, two lexical features, and a paragraph feature were used. To i d e n tify richer features, (Wiebe, 2000 ) used Lin's (1998) method for clustering words according to distributional similarity, s e e d e d b y a small amount of detailed manual annotation, to automatically identify adjective PSEs. There are two parameters of this process, neither of which w as varied in (Wiebe, 2000) : C, the cluster size considered, and F T , a ltering threshold, such that, if the seed word and the words in its cluster have, as a set, lower precision than the ltering threshold on the training data, the entire cluster, including the seed word, is ltered out. This process is adapted for use in the current paper, as described in section 7. Choices in Annotation In expression-level annotation, the judges rst identify the sentences they believe are subjective. They next identify the subjective elements in the sentence, i.e., the expressions they feel are responsible for the subjective classi cation. For example (subjective elements are in parentheses): They promised (yet) more for (really good stu ). (Perhaps you'll forgive me) for reposting his response. Subjective-element (expression-level) annotations are probably the most natural. Ultimately, we w ould like to recognize the subjective elements in a text, and their types, targets, and sources. However, both manual and automatic tagging at this level are di cult because the tags are very ne-grained, and there is no predetermined classi cation unit a subjective e l e m e n t m a y be a single word or a large expression. Thus, in the short term, it is probably best to use subjective-element annotations for knowledge acquisition (analysis, training, feature generation) alone, and not target automatic classi cation of subjective elements. In this work, document-level subjectivity annotations are text categories of which subjectivity is a key aspect. We use three text categories: editorials (Kessler et al., 1997) , reviews, and \\ ames\", i.e., hostile messages (Spertus, 1997 Kaufer, 2000) . For ease of discussion, we group editorials and reviews together under the term opinion pieces. There are bene ts to using such d o c u m e n t-level annotations. First, they are more directly related to applications (e.g., ltering hostile messages and mining reviews from Internet forums). Second, there are existing annotations to be exploited, such as editorials and arts reviews marked as such b y newspapers, as well as on-line product reviews accompanied by formal numerical ratings (e.g., 4 on a scale from 1 to 5). However, a challenging aspect of such data is that opinion pieces and ames contain objective sentences, while documents in other text categories contain subjective sentences. News reports present reactions to and attitudes toward reported events (van Dijk 1988) they often contain segments starting with expressions such a s critics claim and supporters argue. In addition, quotedspeech sentences in which individuals express their subjectivity are often included (Barzilay et al., 2000) . On the other hand, editorials contain objective s e n tences presenting facts supporting the writer's argument, and reviews contain sentences objectively presenting facts about the product. This \\impure\" aspect of opinionated text categories must be considered when such data is used for training and testing. Some speci c results are given below in section 7. We believe that sentence-level classi cations will continue to provide an important l e v el of analysis. The sentence provides a prespecied classi cation unit 2 and, while sentence-level judgements are not as ne-grained as subjective-element judgements, they do not involve the large amount of noise we face with document-level annotations. 5 Document-Level Annotation Results Flame Annotations In this study, newsgroup messages were assigned the tags ame or not-ame. The corpus consists of 1140 Usenet newsgroup messages, balanced among the categories alt, sci, comp, and rec in the Usenet hierarchy. The corpus was divided, preserving the category balance, into a training set of 778 messages and a test set of 362 messages. The annotators were instructed to mark a message as a ame if the \\main intention of the message is a personal attack, containing insulting or abusive language.\" A number of policy decisions were made in the instructions, dealing, primarily, with included messages (part or all of a previous message, included in the current message as part of a reply). Some additional issues addressed in the instructions were who the attack w as directed at, nonsense, sarcasm, humor, rants, and raves. During the training phase, two annotators, MM and R, participated in multiple rounds of tagging, revising the annotation instructions as they proceeded. During the testing phase, MM and R independently annotated the test set, achieving a value on these messages of 0. This study provides evidence for the viability of document-level ame annotation. We p l a n t o build a ame-recognition system in the future. As will be seen below, MM and R also tagged this data at the subjective-element l e v el. Opinion-Piece Classi cations Our opinion-piece classi cations are built on existing annotations in the Wall Street Journal. Specifically, there are articles explicitly identi ed to be Editorials, Letters to the Editor, Arts & Leisure, and Viewpoints together, we c a l l t h e s e opinion pieces. This data is a good resource for subjectivity recognition. However, an inspection of some data revealed that some editorials and reviews are not marked as such. For example, there are articles written in the rst person, and the purpose of the article is to present an argument rather than cover a news story, but there is no explicit indication that they are editorials. To create high quality test data, two judges manually annotated WSJ data for opinion pieces. The instructions were to nd any additional opinion pieces that are not marked as such. The annotators also had the option of disagreeing with the existing annotations, but did not opt to do so in any instances. One judge annotated all articles in four datasets of the Wall Street Journal Treebank corpus (Marcus et al., 1993 ) (W9-4, W9-10, W9-22, and W9-33, each approximately 160K words) as well as t h e c o r p u s o f W all Street Journal articles used in (Wiebe et al., 1999) (called WSJ-SE below). Another judge annotated all articles in two o f t h e datasets (W9-22 and W9-33). This annotation task appears to be relatively easy. With no training at all, the values are very high: .94 for dataset W9-33 and .95 for dataset W9-22. The agreement data for W9-22 is given in Table 1 in the form of a contingency table. In section 7, this data is used to generate and test candidate potential subjective elements (PSEs). Subjective-Element Annotation Results and Analyses Annotations and Data These subsections analyze subjective element a nnotations performed on three datasets, WSJ-SE, NG-FE, a n d NG-SE. WSJ-SE is the corpus of 1001 sentences of the Wall Street Journal Treebank Corpus referred to above in section 3. Recall that the sentences of this corpus were manually annotated with subjectivity classi cations as described in (Wiebe et al., 1999 Bruce and Wiebe, 1999) . For this paper, two annotators (D and M ) w ere asked to identify the subjective elements in WSJ-SE. Speci cally, the taggers were given the subjective sentences identi ed in the previous study, and asked to put brackets around the words they believe cause the sentence to be classi ed as subjective. Note that in ammatory language is a kind of subjective language. NG-FE is a subset of the Usenet newsgroup corpus used in the documentlevel ame-annotation study described in section 5.1. Speci cally, NG-FE consists of the 362message test set for taggers R and MM. For this study, R a n d M M w ere asked to identify the ame elements in NG-FE. Flame elements are the subset of subjective elements that are perceived to be in ammatory. R a n d M M w ere asked to do this in all 362 messages, because some messages that were not judged to be ames at the message level do contain individual in ammatory phrases  (in these cases, the tagger does not believe that these phrases express the main intent of the message). In addition to the above annotations, tagger M performed subjective-element tagging on a di erent set of Usenet newsgroup messages, corpus NG-SE. The size of this corpus is 15413 words. In datasets WSJ-SE and NG-SE, the taggers were also asked to specify one of ve subjective element t ypes: e+ (positive e v aluative), e; (negative e v aluative), e? (some other ty p e o f e v aluation), u (uncertainty), and o (none of the above), with the option to assign multiple types to an instance. All corpora were stemmed (Karp et al., 1992) and part-of-speech tagged (Brill, 1992) . Agreement Among Taggers There are techniques for analyzing agreement when annotations involve segment boundaries (Litman and Passonneau, 1995 Marcu et al., 1999) , but our focus in this paper is on words. Thus, our analyses are at the word level: each word is classi ed as either appearing in a subjective element or not. Punctuation is excluded from our analyses. The WSJ data is divided into two subsets in this section, Exp1 and Exp2. As mentioned above, in WSJ-SE Exp1 and Exp2, the taggers also classi ed subjective elements with respect to the type of subjectivity being expressed. Subjectivity t ype agreement i s again analyzed at the word level, but, in this analysis, only the words classi ed as belonging to subjective elements by both taggers are considered. Table 2 provides values for word agreement in NG-FE (the ame data) as well as for WSJ-SE Exp1 and Exp2. The task of identifying subjective elements in a body of text is di cult, and the agreement results re ect this fact agreement i s much stronger than that expected by c hance, but less than what we w ould like to see when verifying a new classi cation. Further re nement o f t h e coding manual is required. Additionally, i t m a y b e possible to re ne the classi cations automatically using methods such as those described in (Wiebe et al., 1999) . In this analysis, we explore the pat-terns of agreement exhibited by the taggers in an e ort to better understand the classi cation. We begin by looking at word agreement. Word agreement is higher in the ame experiment (NG-FE) than it is in either WSJ experiment (WSJ-SE Exp1 and Exp2). Looking at the WSJ data provides one plausible explanation for the lower word agreement in the WSJ experiments. As exhibited in the subjective e l e m e n ts identi ed for the single clause below, D: (e+ played the role well) (e? obligatory ragged jeans a thicket of long hair and rejection of all things conventional) M : (e+ well) (e? obligatory) (e-ragged) (e? thicket) (e-rejection) (e-all things conventional) tagger D consistently identi es entire phrases as subjective, while Tagger M prefers to select discrete lexical items. This di erence in interpretation of the tagging instructions does not occur in the ame experiment. Nonetheless, even within the ame data, there are many instances where both taggers identify the same segment o f a sentence as forming a subjective element but disagree on the boundaries of that segment, as in the example below. R: (classic case of you deliberately misinterpreting my comments) M M : (you deliberately misinterpreting my comments) These patterns of partial agreement are also evident in the values for words from speci c syntactic categories (see Table 2 again ). In the WSJ data, agreement on determiners is particularly low because they are often included as part of a phrase by t a g g e r D b u t t ypically not included in the speci c lexical items chosen by tagger M. Interestingly, in the WSJ experiments, the taggers most frequently agreed on the selection of modals and adjectives, while in the ame experiment, agreement w as highest on nouns and adjectives. The high agreement on adjectives in both genres is con- (Bruce and Wiebe, 1999 Wiebe et al., 1999) , but high agreement on nouns in the ame data verses high agreement on modals in the WSJ data suggests a genre speci c usage of these categories. This would be the case if, for example, modals were most frequently used to express uncertainty, a t ype of subjectivity that would be relatively rare in ames. Turning to subjective-element t ype, in both WSJ experiments, the values for type agreement are comparable to those for word agreement. Recall that multiple types may be assigned to a single subjective instance. All such instances in the WSJ data are u in combination with an evaluative t a g (i.e., e+, e-and e?), and they are not common: each tagger assigned multiple tags to fewer than 7% of the subjective instances. However, if partial matches between type tags are recognized, i.e., if they share a common tag, then the values improve signi cantly. T able 3 shows both types of results. It is interesting to note the variation in type agreement for words of di erent syntactic categories. Agreement on adjectives is consistently high while the agreement o n t h e t ype of subjectivity expressed by modals and adverbs is consistently low. This contrasts with the fact that word agreement for modals, in particular, and, to a lesser extent, adverbs was high. This lack of agreement s u ggests that the type of subjectivity expressed by adjectives is more easily distinguished than that of modals or adverbs. This is particularly important because the number of adjectives included in subjective elements is high. In contrast, the numbers of modals and adverbs are relatively low. Additional insight can be gained by c o m bining the 3 evaluative classi cations (i.e., e+, e-and e?) to form a single tag, e, representing any form of evaluative expression. Table 4 presents type agreement results for the tag set e, u, o. In contrasting Tables 3 and 4 , it is surprising to note that most of the values decrease when the distinction among the evaluative t ypes is removed. This suggests that the three evaluative types are natural classi cations. Only for adverbs does type agreement i m p r o ve with the smaller tag set this indicates that it is di cult to distinguish the evaluative nature of adverbs. Note also that agreement for modals is not impacted by t h e c hange in tag sets. This fact supports the hypothesis that modals are used primary to express uncertainty. As a nal point, we l o o k a t patterns of agreement i n t ype classi cation using the models of symmetry, marginal homogeneity, quasi-independence, and quasi-symmetry. Each model tests for a speci c pattern of agreement: symmetry tests the interchangeability of taggers, marginal homogeneity v eri es the absence of bias among taggers, quasi-independence veri es that the taggers act independently when they disagree, and quasi-symmetry tests for the presence of any pattern in their disagreements. For a more complete description of these models and their use in analyzing intercoder reliability see (Bruce and Wiebe, 1999) . In short, the results presented in Table 5 indicate that the taggers are not interchangeable: they exhibit biases in their type classi cations, and there is a pattern of correlated disagreement in the assignment of the original type tags. Surprisingly, the taggers appear to act independently when they disagree in assigning the compressed type tags (i.e., tags e, u and o). This shift in the pattern of disagreement b e t ween taggers again suggests that the compression of the evaluative t a g s w as inappropriate. Additionally, these ndings suggest that it may be possible to automatically correct the type biases expressed by the taggers using the technique described in (Bruce and Wiebe, 1999) , a topic that will be investigated in future work. Uniqueness Based on previous work (Wiebe et al., 1998) , we hypothesized that low-frequency words are associated with subjectivity. T able 6 provides evidence that the number of unique words (words that appear just once) in subjective elements is higher than expected. The rst row g i v es information for all words and the second gives information for words that appear just once. The gures in the Num columns are total counts, and the gures in the P columns give the proportion that appear in subjective e l e m e n ts. The Agree columns give i n -All Words Nouns Verbs Modals Adj's Adverbs Det's Exp1 Full Match 0:4216 0:4228 0.2933 0:1422 0:5919 0:1207 0:5000 Partial Match 0:5156 0:4570 0.4447 0:3011 0:6607 0:3305 0:5000 Exp2 Full Match 0:3041 0:2353 0.2765 0:1429 0:5794 0:1207 0:0000 Partial Match 0:4209 0:2353 0.3994 0:3494 0:6719 0:4439 0:1429  Sig. 0:000 0:000 0:527 0:007 e,o,u G 2 85:478 84:142 1:336 12:576 Sig. 0:000 0:000 0:248 0:027 Exp2 All Types G 2 94:669 76:247 18:422 58:892 Sig. 0:000 0:000 0:241 0:001 e,o,u G 2 66:822 66:819 0:003 0:0003 Sig. 0:000 0:000 0:986 0:987 Comparison of rows 1 and 2 across columns shows that the proportion of unique words that are subjective is higher than the proportion of all words that are subjective. In all cases, this di erence in proportions is highly statistically signicant. Types and Context An interesting question is, when a word appears in multiple subjective elements, are those subjective elements all the same type? Table 7 shows that a signi cant portion are used in more than one type. Each item considered in the table is a word-POS pair that appears more than once in the corpus. The gures shown are the total numberof word-POS items that appear more than once (the columns labeled MultInst) and the proportion of those items that appear in more than one type of subjective element (the columns labeled Mult-Type). These results highlight the need for contextual disambiguation. For example, one thinks of great as a positive e v aluative term, but its polarity depends on the context it can be used negatively evaluatively in a context such as \\Just great.\" A goal of performing subjective-element annotations is to support learning such local contextual in uences. 7 Generating and Testing PSEs using Document-Level Annotations This section uses the opinion-piece annotations to expand our set of PSEs beyond those that can be derived from the subjective-element annotations. Precision is used to assess feature quality. T h e precision of feature F for class C is the number of Fs that occur in units of class C over the total numb e r o f F s t h a t o c c u r a n ywhere in the data. An important motivation for using the opinionpiece data is that there is a large amount of it, and manually re ning existing annotations as described in section 5.2 is much easier and more reliable than other types of subjectivity annotation. However, we cannot expect absolutely high precisions for two reasons. First, the distribution of opinions and non-opinions is highly skewed in favor of non-opinions. For example, in Table 1 , tagger 1 classi es only 23 of 293 articles as opinion pieces. Second, as discussed in section 4, opinion pieces contain objective s e n tences and non opinion-pieces contain subjective sentences. For example, in WSJ-SE, which has been annotated at the sentence and document levels, 70% of the sentences in opinion pieces are subjective and 30% are objective. In non-opinion pieces, 44% of the sentences are subjective and only 56% are objective. To give an idea of expected precisions, let us consider the precision of subjective s e n tences with respect to opinion pieces. Suppose that 15% of the sentences in the dataset are in opinions, 85% in non-opinions. Let us assume the proportions of subjective and objective s e n tences in opinion and non-opinion pieces given just above. Let N be the total number of sentences. The desired precision is the number of subjective s e n tences in opinions over the total number of subjective sentences. It is .22: p = . 1 5 * N * . 7 0 / ( . 1 5 * N * . 7 0 + . 8 5 * N * . 4 4 ) . In addition, we are assessing PSEs, which are only potentially subjective many h a ve objective as well as subjective u s e s . Thus, even if precisions are much l o wer than 1, we use increases in precision over a baseline as evidence of promising PSEs. The baseline for comparison is the number of word instances in opinion pieces, divided by the total number of word instances. Table 8 shows the precisions for three types of PSEs. The freq columns give total frequencies, and the +prec columns show the improvements in precision from the baseline. The baseline precisions are given at the bottom of the table. As mentioned above, (Wiebe, 2000) showed success automatically identifying adjective PSEs using Lin's method, seeded by a small amount o f d etailed manual annotations. Desiring to move a way from manually annotated data, for this paper the same process is used, but the seed words are all the adjectives (verbs) in the training data. In addition, in the current setting, there are no a priori values to use for parameters C (cluster size) and F T( ltering threshold), as there were in (Wiebe, 2000) , and results vary with di erent parameter settings. Thus, a train-validate-test process is appropriate. In Table 8 , the numbers given under, e.g., W9-10, are the results obtained when W9-10 is used as the test set. One of the other datasets, say W 9 -2 2 , w as used as the training set, meaning that all the adjectives (verbs) in that dataset are the seed words, and all ltering was performed using only that data. The seed-ltering process was repeated with di erent settings of C and F T , producing a di erent set of adjectives (verbs) for each setting. A third dataset, say W9-33, was used as a validation set, i.e., among all the sets of adjectives generated from the training set, those with good performance on the validation set were selected as  Our manual opinion-piece annotations were used for testing. The row labeled unique words shows the precision on the test set of the individual words that are unique in the test set. The increase over baseline precision shows that low-frequency words can be informative for recognizing subjectivity. Note that the features all do better and worse on the same data sets. This shows that the subjectivity is somehow harder to identify in, say, W 9 -3 3 than in W9-10 it also shows an important consistency among the features, even though they are identi ed in di erent w ays. Conclusions This paper presents the results of an empirical examination of subjectivity at the di erent l e v els of a text: the expression level, the sentence level, and the document l e v el. While analysis of subjectivity is perhaps most natural and precise at the expression level, document-level annotations are freely available from a number of sources and are appropriate for many applications. The sentencelevel annotation is a workable intermediate level: sentence-level judgments are not as ne-grained as expression-level judgments, and they don't involve the large amount of noise found at the document level. As part of this examination, we present a study of annotator agreement c haracterizing the diculty of identifying subjectivity at the di erent levels of a text. The results demonstrate that not only can subjectivity b e i d e n ti ed at the document level with high reliability, but that it is also possible to identify expression-level subjectivity, albeit with lower reliability. Using manual annotations, we are able to characterize subjective language. At the expression level, we found that it is natural to distinguish among positively evaluative, negatively evaluative, and speculative uses of a word. We also found that subjective text contains a high proportion of unique word occurrences, much m o r e s o than ordinary text. Rather than ignoring or discarding unique words, we demonstrate that the occurrence of a unique word is a PSE. We also found that agreement is higher for some syntactic word classes, e.g., for adjectives in comparison with determiners. Finally, w e are able to mine PSEs from text tagged at the document l e v el. Given the di culty of evaluating PSEs in document-level subjectivity classi cation due to the mix of subjective a n d objective s e n tences, the PSEs identi ed in this study exhibit relatively high precision. In future work, we w i l l i n vestigate document-level classication using these PSEs, as well as other methods for extracting PSEs from text tagged at the document level methods to be investigated include mutual-bootstrapping and/or co-training.",
    "abstract": "This paper presents a corpus study of evaluative and speculative language. Knowledge of such language would be useful in many applications, such a s text categorization and summarization. Analyses of annotator agreement and of characteristics of subjective language are performed. This study yields knowledge needed to design e ective machine learning systems for identifying subjective language.",
    "countries": [
        "United States"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "77",
    "year": "2001",
    "month": "",
    "title": "A Corpus Study of Evaluative and Speculative Language"
}