{
    "article": "Ngram modeling is simple in language modeling and has been widely used in many applications. However, it can only capture the short distance context dependency within an N-word window where the largest practical N for natural language is three. In the meantime, much of context dependency in natural language occurs beyond a three-word window. In order to incorporate this kind of long distance context dependency, this paper proposes a new MI-Ngram modeling approach. The MI-Ngram model consists of two components: an ngram model and an MI model. The ngram model captures the short distance context dependency within an N-word window while the MI model captures the long distance context dependency between the word pairs beyond the N-word window by using the concept of mutual information. It is found that MI-Ngram modeling has much better performance than ngram modeling. Evaluation on the XINHUA new corpus of 29 million words shows that inclusion of the best 1,600,000 word pairs decreases the perplexity of the MI-Trigram model by 20 percent compared with the trigram model. In the meanwhile, evaluation on Chinese word segmentation shows that about 35 percent of errors can be corrected by using the MI-Trigram model compared with the trigram model. Introduction Language modeling is the attempt to characterize, capture and exploit the regularities and constraints in natural language. Among various language modeling approaches, ngram modeling has been widely used in many applications, such as speech recognition, machine translation (Katz 1987; Jelinek 1989; Gale and Church 1990; Brown et al. 1992; Yang et al. 1996; Bai et al 1998; Zhou et al 1999; Rosenfeld 2000; Gao et al 2002) . Although ngram modeling is simple in nature and easy to use, it has obvious deficiencies. For instance, ngram modeling can only capture the short distance context dependency within an N-word window where currently the largest practical N for natural language is three. In the meantime, it is found that there always exist many preferred relationships between words. Two highly associated word pairs are 不仅/而且 (\"not only/but also\") and 医 生 / 护 士 (\"doctor/nurse\"). Psychological experiments in Meyer et al. (1975) indicated that the human's reaction to a highly associated word pair was stronger and faster than that to a poorly associated word pair. Such preference information is very useful for natural language processing (Church et al. 1990; Hiddle et al. 1993; Rosenfeld 1994; Zhou et al.1998; Zhou et al 1999) . Obviously, the preference relationships between words can expand from a short to long distance. While we can use traditional ngram modeling to capture the short distance context dependency, the long distance context dependency should also be exploited properly. The purpose of this paper is to propose a new MI-Ngram modeling approach to capture the context dependency over both a short distance and a long distance. Experimentation shows that this new MI-Ngram modeling approach can significantly decrease the perplexity of the new MI-Ngram model compared with traditional ngram model. In the meantime, evaluation on Chinese word segmentation shows that this new approach can significantly reduce the error rate. This paper is organized as follows. In section 2, we describe the traditional ngram modeling approach and discuss its main property. In section 3, we propose the new MI-Ngram modeling approach to capture context dependency over both a short distance and a long distance. In section 4, we measure the MI-Ngram modeling approach and evaluate its application in Chinese word segmentation. Finally we give a summary of this paper in section 5. And the probability P can be estimated by using maximum likelihood estimation (MLE) principle: ) | ( 1 − i i w w ) ( ) ( ) | ( 1 1 1 − − − = i i i i i w C w w C w w P (2.5) Where ) (• C represents the number of times the sequence occurs in the training data. In practice, due to the data sparseness problem, some smoothing techniques, such as linear interpolation (Jelinek 1989; Chen and Goodman 1999) and back-off modeling (Katz 1987) , are applied. Ngram Modeling Let , where 's are the words that make up the hypothesis, the probability of the word string P can be computed by using the chain rule: m m w w w w S ... 2 1 1 = = ) (S i w Obviously, an ngram model assumes that the probability of the next word w is independent of word string w in the history. The difference between bigram, trigram and other ngram models is the value of N. The parameters of an ngram are thus the probabilities: (2.6) So, the classical task of statistical language modeling becomes how to effectively and efficiently predict the next word, given the previous words, that is to say, to estimate expressions of the form . For convenience, P is often written as , where , is called history. i n i − 1 ∏ = − = m i i i w w P w P S P 2 1 1 1 ) | ( ) ( ) ( (2.1) ) ... | ( 1 1 − n n ) | ( 1 1 − i i w w P ) | ( 1 1 − i i w w 1 1 − = i w h ) | ( h w P i Where is the string length, w is the -th word in string . m S i i From equation (2.3) , we have: ) | ( ) | ( 1 1 1 1 − + − − ≈ i n i i i i w w P w w P Ngram modeling has been widely used in estimating . Within an ngram model, the probability of a word occurring next is estimated based on the previous words. That is to say, ) | ( h w P i 1 − n ) ( ) ( ) ( ) ( 1 1 1 1 1 1 1 1 − + − − + − − − ≈ i n i i i n i i i i w P w w P w P w w P ) | ( ) | ( 1 1 1 1 − + − − ≈ i n i i i i w w P w w P (2.3) ) ( ) ( ) ( ) ( ) ( ) ( 1 1 1 1 1 1 1 1 i i n i i i n i i i i i w P w P w w P w P w P w w P − + − − + − − − ≈ For example, in bigram model (n=2), the probability of a word is assumed to depend only on the previous word: ) ( ) ( ) ( log ) ( ) ( ) ( log 1 1 1 1 1 1 1 1 i i n i i i n i i i i i w P w P w w P w P w P w w P − + − − + − − − ≈ (2.7) ) | ( ) | ( 1 1 1 − − ≈ i i i i w w P w w P (2.4) Obviously, we can get ) 1 , , ( ) 1 , , ( 1 1 1 1 = ≈ = − + − − d w w MI d w w MI i i n i i i (2.8) where ) ( ) ( ) ( log ) 1 , , ( 1 1 1 1 1 1 i i i i i i w P w P w w P d w w MI − − − = = ) i w is the mutual information between the word string pair and , ( 1 1 i w − ) ( ) ( ) ( log ) 1 , , 1 1 1 1 1 1 i i n i i i n i i i n i w P w P w w P d w − + − − + − − + − = = ) , 1 i w d (w MI ( 1 i n i w − + − is the mutual information between the word string pair . is the distance of two word strings in the word string pair and is equal to 1 when the two word strings are adjacent. MI-Ngram Modeling Given history H , we can assume . Then we have 1 2 1 1 1 ... − − = = i i w w w w 1 3 2 1 ... − − = i w w w 2 = i w X X w H 1 = (3.1) and ) | ( ) | ( 1 X w w P H w P i i = . (3.2) Since ) 1 , , ( ) ( log ) ( ) ( ) ( log ) ( log ) ( ) ( log ) | ( = + = = = (3.4) where , and i . That is to say, the mutual information of the next word with the history is assumed equal to the summation of that of the next word with the first word in the history and that of the next word with the rest word string in the history. 1 1 − = i w H 1 2 − = i w X N > ) | ( log H w P i ) 1 , , ( ) ( log i i w H MI w P + = ) , , ( ) 1 , , ( ) ( log 1 i w w MI w X MI w P i i i + + = ) , , ( ) ( ) ( ) ( log ) ( log 1 i w w MI X P w P X w P w P i i i i + + = ∑ = = − + = n i i i i w w w P 2 1 1 1 ) | log( ) ( log ) | ( log 2 1 n n w w P + + ) , , ( ) ( ) ( log 1 i w w MI X P X w P i i + = ) 1 , , ( 1 1 + + + n w w MI n ) | ( log 1 1 2 − + = ∑ + i i m n i w w P ) , , ( ) | ( log 1 i w w MI X w P i i + = (3.5) L L L Then we have ∑ = = − + = n i i i i w w w P 2 1 1 1 ) | log( ) ( log ∑ + = − − + m n i i i i w w P 1 1 2 ) | ( log (3.6) ) , , ( ) | ( log ) | ( log 1 1 2 1 1 i w w MI w w P w w P i i i i i + = − − By applying equation (3.6) repeatedly, we have: ) , , ( ) | ( log ) | ( log 1 1 2 1 1 i w w MI w w P w w P i i i i i + = − − ∑ ∑ + = − = = + − + m n i n i k k i k k i w w MI 1 1 ) 1 , , ( (3.8) ) | ( log 1 3 − = i i w w P ) 1 , , ( 2 i w w MI i − + ) , , ( 1 i w w MI i + L L L ) | ( log 1 1 − + − = i n i i w w P ∑ − = = + − + n i k k i k k i w w MI 1 ) 1 , , ( (3.7) Obviously, the first item in equation (3.7) contributes to the log probability of ngram within an N-word window while the second item is the summation of mutual information which contributes to the long distance context dependency of the next word w with the individual previous word over the long distance outside the N-word window.   pairs. Since the number of possible long distance dependent word pairs may be very huge, it is impossible for MI-Ngram modeling to incorporate all of them. Therefore, for MI-Ngram modeling to be practically useful, how to select a reasonable number of word pairs becomes very important. ( ) ( ) , , ( log ) , , ( ) ( ) ( ) , , ( log ) , , ( ) ( ) ( ) , , ( log ) , , ( ) ( ) ( ) , , ( log ) , , ( ) , , Here two approaches are used (Zhou et al 1998 and 1999) . One is to restrict the window size of possible word pairs by computing and comparing the perplexities 1 (Shannon C.E. 1951) of various long distance bigram models for different distances. It is found that the bigram perplexities for different distances outside the 10-word window become stable. Therefore, we only consider MI-Ngram modeling with a window size of 10 words. Another is to adapt average mutual information to select a reasonable number of long distance dependent word pairs. Given distance d and two words A and B, its average mutual information is computed as: Compared with mutual information, average mutual information takes joint probabilities into consideration. In this way, average mutual information prefers frequently occurred word pairs. In our paper, different numbers of long distance dependent word pairs will be considered in MI-Ngram modeling within a window size of 10 words to evaluate the effect of different MI model size. Experimentation As 1 Perplexity is a measure of the average number of possible choices there are for a random variable. The perplexity PP of a random variable X with entropy is defined as: ) ( X H ) ( 2 ) ( X H X PP = Entropy is a measure of uncertainty about a random variable. If a random variable X occurs with a probability distribution P x ( ) , then the entropy H of that event is defined as: ) ( X ∑ ∈ − = X x x P x P X H ) ( log ) ( ) ( 2 x x log 2 0 → Since as x → 0 0 0 0 2 log = , it is conventional to use the relation when computing entropy. Table 1 shows the perplexities of various MI-Trigram models and their performances on Chinese word segmentation. Here, the precision (P) measures the number of correct words in the answer file over the total number of words in the answer file and the recall (R) measures the number of correct words in the answer file over the total number of The units of entropy are bits of information. This is because the entropy of a random variable corresponds to the average number of bits per event needed to encode a typical sequence of event samples from that random variable' s distribution. words in the key file. F-measure is the weighted harmonic mean of precision and recall: P R RP F + + = 2 2 ) 1 ( β β with =1. 2 β Table 1 shows that • The perplexity and the F-measure rise quickly as the number of word pairs in MI-Trigram modeling increases from 0 to 1,600,000 and then rise slowly. Therefore, the best 1,600,000 word pairs should at least be included.",
    "abstract": "Ngram modeling is simple in language modeling and has been widely used in many applications. However, it can only capture the short distance context dependency within an N-word window where the largest practical N for natural language is three. In the meantime, much of context dependency in natural language occurs beyond a three-word window. In order to incorporate this kind of long distance context dependency, this paper proposes a new MI-Ngram modeling approach. The MI-Ngram model consists of two components: an ngram model and an MI model. The ngram model captures the short distance context dependency within an N-word window while the MI model captures the long distance context dependency between the word pairs beyond the N-word window by using the concept of mutual information. It is found that MI-Ngram modeling has much better performance than ngram modeling. Evaluation on the XINHUA new corpus of 29 million words shows that inclusion of the best 1,600,000 word pairs decreases the perplexity of the MI-Trigram model by 20 percent compared with the trigram model. In the meanwhile, evaluation on Chinese word segmentation shows that about 35 percent of errors can be corrected by using the MI-Trigram model compared with the trigram model.",
    "countries": [
        "Singapore"
    ],
    "languages": [
        "Chinese"
    ],
    "numcitedby": "0",
    "year": "2003",
    "month": "July",
    "title": "Modeling of Long Distance Context Dependency in {C}hinese"
}