{
    "article": "Some document genres contain a large number of figures. This position paper outlines approaches to diagram summarization that can augment the many well-developed techniques of text summarization. We discuss figures as surrogates for entire documents, thumbnails, extraction, the relations between text and figures as well as how automation might be achieved. The focus is on diagrams (line drawings) because they allow parsing techniques to be used, in contrast to the difficulties of general image understanding. We describe the advances in raster image vectorization and parsing needed to produce corpora for diagram summarization. Introduction Many documents contain figures, both images and line drawings (diagrams). The Biology literature, the focus of our group's work, is replete with figures. A surprising 50% of the typical Biology paper is figure-related (see Appendix A). A million or so Biology papers are published each year, most with abstracts. But given their high figural content, work on diagram summarization could also be quite useful. This is a position paper that explores this topic, outlining a variety of approaches to the construction of automated diagram summarization systems. System building and use awaits the creation of the requisite corpora, as explained in the next section. This paper builds on our earlier, more lengthy work, extending it in various ways (Futrelle, 1999) . The Current State of the Diagrams Field Automated text summarization has at its disposal, electronic documents that allow the use of all the techniques of computational linguistics. Diagrams in documents are in a more primitive state. The overwhelming majority of diagrams available in the electronic forms of the research literature today are in raster format. What is needed are diagrams in vector format in which an object such as a line is represented not by pixels, but as a line object defined by its endpoints and width. We found only 52 pages containing vector-based diagrams in a collection of 20,000 recent Biology papers in PDF format (Futrelle, Shao, Cieslik, & Grimes, 2003) . Vectorization converts raster diagrams to vector format, much as OCR converts rasters to characters. But the resulting vectorized diagram is an unordered collection of objects in a two dimensional space. An additional analysis step of parsing is required. Our system for parsing diagrams (Futrelle & Nikolakis, 1995) produces descriptions for a data graph, for example, by discovering structures such as scale lines and sets of data points. There appear to be no non-proprietary vectorization systems that are up to the task of vectorizing the diagrams from the scientific literature, so our group is currently focused on developing a system for this in Java. We are also redeveloping our parsing system in Java. Until this work is completed, there will be few diagrams available for the application of diagram summarization techniques. This notwithstanding, diagram sum-marization is an interesting and ultimately important task, which is why we are discussing it here. This work is part of our laboratory's long-term effort to characterize the conceptual content of the Biology literature, including the text and figural content. Figure Views represent a new and important type of summary of entire articles, allowing the rapid browsing that such visual displays pr ovide. One can imagine that authors will adapt to this new mode, packing the major content of their papers into the figures and captions, reducing the need to read the full text. Figures as Surrogate Documents Thumbnail Images are Summaries Thumbnails are images that have been reduced in size and/or cropped to a smaller size. Shrinking an entire image so that it acts as a summary is an analog operation that has no parallel in text. For some images, shrinking them too much can produce an illegible result, a practice that has been roundly criticized (item 4 in Nielsen, 2003) ; cropped i mages may be useful in such cases. An example of cropping two very large images resulting in informative thumbnails appears in the The thumbnails are reproduced here in Figures 1  and 2 . Extraction for Summarization One of the most important techniques used in text summarization, is extraction, typically the extraction of carefully chosen whole sentences. A similar approach can be used for diagram summarization, but some thought needs to be given to what the sentence-like elements in diagrams might be. It is not difficult to give examples of diagram extraction, but automating it is difficult. Diagram-Related Text It might be argued that the most salient content of documents with figures can be found in the text; that the figures are redundant, merely \"illustrative\". This is often not the case. There are queries to documents that cannot be answered based on the content of the text or diagrams considered separately (Futrelle & Rumshisky, 2001) . In Biology it is not unusual for a caption to explain only the methods used to produce the data shown. The independent contribution of diagram content to a paper is often signaled by cue phrases. In referring to data graphs, phrases such as \"shows a significant difference\" or \"are similar\" or \"a pronounced effect\" require that the reader examine the data shown in the figure in order to understand what the phrases refer to.  The references to A and a in Fig. 4 , are deictic references, pointing to objects visible in the context, in the figure. In ordinary conversation, such a reference would point to some physical object in the view of the listener. A summarization of Figure 4 should include the entire diagram. The last sentence of the caption would be a suitable summary of the caption. The non-caption text and the text within figures play important roles and need to be taken into account in any attempt to produce a summary. Space precludes further discussion of these. Prospects for Automation Some degree of summarization might be possible based entirely on the classes of the diagrams or subdiagrams in a paper. We have been able to locate subdiagrams in vector-based diagrams in PDFs and successfully classify them using Support Vector Machines (Futrelle, Shao, Cie slik, & Grimes, 2003) . But any more detailed summarization decisions would require parsed representations of the diagrams. For example, our parser can discover and analyze the two bar charts in Fig. 3 , allowing a system to extract only one of them, though without any knowle dge as to which is the most salient. The parser can also locate keys, such as the ones in Fig. 3 , so they can be extracted also. Standard strategies from text summarization, such as extracting the diagrams most often referred to, diagrams appearing near the beginning and end of a paper, etc., are all possible. Clearly, automation of diagram summarization presents a new set of challenges and is no easier than text summarization. Large scale evaluation of diagram summarization will offer its own challenges, cf. text summarization evaluation (Radev et al., 2003) . Related Work Automated text summarization has advanced substantially in the last decade. See for example, the major collection of papers, (Mani & Maybury, 1999) and the special journal issue (Radev, Hovy, & McKeown, 2002) . Reviews include (Hovy, 2002; Marcu, 2003) . A recent useful monograph is (Mani, 2001) . Another recent work is (Barzilay, 2003) , focused on mult idocument summarization and going beyond sentence extraction to consider phrases. Paradoxically, work on the summarization of scientific articles is inhibited by the fact that virtually all scientific articles have abstracts as a sta ndard component. But there are other tasks such as developing user-tailored summaries (Teufel & Moens, 2002) . The generation of coordinated explanations involving text and graphics offers insight into the relations between them (Feiner & McKeown, 1990) . This task involves dealing with the internal structure of diagrams, as do problems of image retrieval, which can be aided by developing ontol-ogy-based descriptions of the images (Hyvönen, Styrman, & Saarela, 2002) . Diagrams form a part of a coordinated discourse, so that diagram summarization can profit from the work done on text summarization that focuses on discourse structure. Examples of discourse-related approaches include (Boguraev & Neff, 2000; Marcu, 1997a Marcu, , 1997b;; Teufel & Moens, 2002) . Conclusions Document summarization including diagrams seems both possible and desirable. Work in this area is waiting on the development of a corpus of parsed object-based diagrams. The vectorization and parsing systems required are under development. Acknowledgements Appendix A: 50% of the Content of Biology Papers is Figure -Related We arrived at the 50% figure by sampling a variety of recent papers in journals including Science, Nature, PNAS (USA). The column-inches occupied by figures in the hardcopy or equivalent PDF versions of the papers were measured and compared to the total column-inches, omitting the title, abstract and references. Word counts of the captions and direct running text reference sentences were estimated, e.g., \"Fig. 3 shows ...\". Then estimates were made of the sentences that indirectly discussed the figures, often the sentences immediately following direct reference sentences and containing anaphoric and definite noun phrase references to the figures, often in deictic form. The total of the figure and figure reference content consistently amounted to about 50% of the papers sampled.",
    "abstract": "Some document genres contain a large number of figures. This position paper outlines approaches to diagram summarization that can augment the many well-developed techniques of text summarization. We discuss figures as surrogates for entire documents, thumbnails, extraction, the relations between text and figures as well as how automation might be achieved. The focus is on diagrams (line drawings) because they allow parsing techniques to be used, in contrast to the difficulties of general image understanding. We describe the advances in raster image vectorization and parsing needed to produce corpora for diagram summarization.",
    "countries": [
        "United States"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "15",
    "year": "2004",
    "month": "July",
    "title": "Handling Figures in Document Summarization"
}