{
    "article": "State-of-the-art machine translation techniques are still far from producing high quality translations. This drawback leads us to introduce an alternative approach to the translation problem that brings human expertise into the machine translation scenario. In this framework, namely Computer Assisted Translation (CAT), human translators interact with a translation system, as an assistance tool, that dinamically offers, a list of translations that best completes the part of the sentence already translated. In this paper, finite state transducers are presented as a candidate technology in the CAT paradigm. The appropriateness of this technique is evaluated on a printer manual corpus and results from preliminary experiments confirm that human translators would reduce to less than 25% the amount of work to be done for the same task. Introduction State-of-the-art machine translation techniques are still far from producing high quality translations. This drawback leads us to introduce an alternative approach to the translation problem that brings human expertise into the machine translation scenario. (Langlais et al., 2000) proposed this idea that can be illustrated as follows. Initially, the human translator is provided with a possible translation for the sentence to be translated. Unfortunately in most of the cases, this translation is not perfect, so the translator amends it and asks for a translation of the part of the sentence still to be translated (completion). This latter interaction is repeated as many times as needed until the final translation is achieved. The scenario described in the previous paragraph, can be seen as an iterative refinement of the translations offered by the translation system, that without possessing the desired quality, help the translator to increase his/her productivity. Nowadays, this lack of translation excellence is a common characteristic in all machine translation systems. Therefore, the human-machine synergy represented by the CAT paradigm seems to be more promising than fully-automatic translation in the near future. The CAT paradigm has two important aspects: the models need to provide adequate completions and they have to do so efficiently to perform under usability constrains. To fulfill these two requirements, Stochastic Finite State Transducers (SFST) have been selected since they have proved in the past to be able to provide adequate translations (Vidal, 1997; Knight and Al-Onaizan, 1998; Amengual et al., 2000; Casacuberta et al., 2001; Bangalore and Ricardi, 2001) . In addition, efficient parsing algorithms can be easily adapted in order to provide completions. The rest of the paper is structured as follows. The following section introduces the general setting for machine translation and finite state models. In section 3, the search procedure for an interactive translation is presented. Experimental results are presented in section 4. Finally, some conclusions and future work are explained in section 5. Machine translation with finite-state transducers Given a source sentence , the goal of MT is to find a target sentence ¡ t that maximizes: ¡ t argmax t ¡ £¢ ¥¤ t ¦ s § ¨ argmax t ¡ ¨¢ ¥¤ t© s § (1) The joint distribution ¡ ¨¢ ¥¤ t© s § can be modeled by a Stochastic Finite State Transducer (Picó and Casacuberta, 2001) : ¡ t argmax t ¡ ¨¢ ¤ t© s § ¨ argmax t ¡ £¢ ¤ t© s § (2) A Stochastic Finite-State Transducer (SFST) is a finite-state network whose transitions are labeled by three items: 1. a source symbol (a word from the source language vocabulary); 2. a target string (a sequence of words from the target language vocabulary) and 3. a transition probability. They have been successfully applied into many translation tasks (Vidal, 1997; Amengual et al., 2000; Casacuberta et al., 2001) . Furthermore, there exist efficient search algorithms like Viterbi (Viterbi, 1967) for the best path and the Recursive Enumeration Algorithm (REA) (Jiménez and Marzal, 1999) for the -best paths. One possible way of inferring SFSTs is the Grammatical Inference and Alignments for Transducer Inference (GIATI) technique (the previous name of this technique was MGTI -Morphic-Generator Transducer Inference) (Casacuberta et al., 2004) . Given a finite sample of string pairs, it works in three steps: The transformation of a parallel corpus into a corpus of single sentences is performed with the help of statistical alignments: each word is joined with its translation in the output sentence, creating an \"extended word\". This joining is done taking care not to invert the order of the output words. The third step is trivial with this arrangement. In our experiments, the alignments are obtained using the GIZA software (Och and Ney, 2000; Al-Onaizan et al., 1999) , which implements IBM statistical models (Brown et al., 1993) . Interactive search The concept of interactive search is closely related to the CAT paradigm. This paradigm introduces the new factor t into the general machine translation equation (Equation 1 ). t represents a prefix in the target language obtained as a result of the interaction between the human translator and the machine translation system. As a side effect of this reformulation, the optimization defined in Equation 3 is performed over the set of target suffixes rather than the set of complete target sentences. Thence, the goal of CAT in the finite-state transducer framework is to find a prediction of the best suffix ¡ t , given a source sentence s, a prefix of the target sentence t and a SFST : t \"! argmax t# $ &% (' t 0) s1 t2 43 5! argmax t# $ 5% 6' t2 t 71 s3 58 8 argmax t# $ &% @9 £' t2 t 1 s3 (3) A transducer can be understood as a weighted graph in which every path is a possible source-target sentence pair represented in a compact manner. Given a source sentence s to be translated, this sentence is initially employed to define a set of paths in the transducer, whose sequence of source symbols is compatible with the source sentence. Equation 3 is just defining the most probable path (target suffix ¡ t ) among those that are compatible, having t as a target prefix. The search for this path (the product of the probabilities associated with its edges is maximum) is performed according to the Viterbi decoding over the set of paths that were compatible with the source sentence. The concatenation of the target symbols of this best path will give place to the target sentence (translation). The solution to the search problem has been devised in two phases. The first one copes with the extraction of a word graph from a SFST given a source sentence s. A word graph represents the set of paths whose sequence of source symbols is compatible with the source sentence s. The second phase involves the search for the best translation over the word graph . To be more precise, in the present work the concept of best translation has been extended to a set of best translations (n-best translations). This search can be carried out efficiently taking into account not only the a posteriori probability of a given translation ¡ t, but also the minimum edit cost with respect to the target prefix. The way in which this latter criterium is integrated in the search process will be explain in section 3.2. Word-graph derivation A word graph represents the set of all possible translations for a given source sentence s that were embeded in the SFST . The derivation of the word graph is performed by intersecting the SFST with the source sentence s defining a subgraph in whose paths are compatible with the source sentence. Interactive search can be simplified significantly by using this representation of the set of target sentences, since the inclusion of edit cost operations along with the search procedure introduces some peculiarities that can be solved efficiently in the word graph. An example of word graph is shown in Figure 1 . Search for -best translations given a prefix of the target sentence The application of this type of search is aimed at the core of CAT. In this paradigm, given a source sentence s, the human translator is provided with a list of n translations, also called -best translations. Then, the human translator will proceed to accept a prefix of one of these -best translations as correct, appending some rectifications to the selected prefix. This new prefix of the target sentence t together with the source sentence s will generate a new set of best translations that will be again modified by the human translator. This process is repeated as many times as neccessary to achieve the desired final translation. Ideally, the task would be to find the target suffix t that maximizes the probability a posteriori given a prefix t of the target sentence and the input sentence. In practice, however, it may happen that t is not present in the word graph . The solution is to use not t but a prefix t¡ that minimizes the edition distance with t and is compatible with . Therefore, the score of a target translation t ¢ t t is characterized by two functions, the edit cost between the target prefix t and the optimal prefix t¡ found in the word graph and the a posteriori probability of t (£ ¥¤ ¤ t ¦ t¡ § ). In order to value more significantly those translations that were closer to the user preferences, the list ofbest translations has been prioritized using two criteria: first, the minimum edit cost and then, by the a posteriori probability. The algorithm proposed to solve this search problem is an adapted version of the Recursive Enumeration Algorithm (REA) described in (Jiménez and Marzal, 1999) that integrates the minimum edit cost algorithm in the search procedure to deal with words, introduced by the user, that are not present in the word graph. This algorithm consists of two parts: Forward search that calculates the 1-best path from the initial state to every state in the word graph . Paths in the word graph are weighted not only based on their a posteriori probability, but also on their edit cost respect to the target sentence prefix. To this purpose, ficticious edges have been inserted into the word graph to represent edition operations like insertion, substitution and deletion. These edition operations have been included in the word graph in the following way: -Insertion: An insertion edge has been \"inserted\" as a loop for each state in the word graph with unitary cost. -Deletion: A deletion edge is \"added\" for each arc in the word graph having the same source and target state than its sibling arc with unitary cost. -Substitution: Each arc in the word graph is treated as a substitution edge whose edit cost is proportional to the levenshtein distance between the symbol associated with this arc and the word prefix employed to traverse this arc during the search. This substitution cost is zero when the word prefix matches the symbol in the word graph arc. Backward search that enumerates candidates for the ¡ -best path along the ¤ ¡ £¢ ¥¤ § -best path. This recursive algorithm defines the next best path that arrives at a given state ¦ as the next best path that reaches ¦ ¡ plus the arc leaving from ¦ ¡ to ¦ . If this next best path arriving at state ¦ ¡ has not been calculated yet, then the next best path procedure is called recursively until a 1-best path is found or no best paths are found. To reduce the computational cost of the search, the beam-search technique (Ney et al., 1992) has been implemented. During the word graph construction, two beam coefficients were employed to penalize those edges leading to backoff states over those ones arriving at normal states. Finally, a third beam coefficient controls how far in terms of number of edition operations a hypothesis. Experimental results Corpus features The corpus employed to perform experiments was the Xerox corpus (SchlumbergerSema S.A et al., 2001) . It involves the translation of technical Xerox manuals from English to Spanish, French and German and vice-versa. Some statistics about the data used for training and test purposes are shown in Table 1 . Sample session A TT2 interactive prototype, which uses the searching techniques presented in the previous sections, has been implemented. The user is able to customized this prototype in different ways: number of suggested translations, length in number of words of these suggestions, etc. In the example below, the number of suggestions is five and the length of these suggestions has not been bound. Example 1 This example shows the functionality and the interaction between the TT2 prototype and a translator through a translation instance from English to Spanish for a given sentence drawn from the Xerox corpus. For better understanding of this example the reference target sentence is given below: Reference target sentence: Instalación de controladores de impresora y archivos PPD. Source sentence: Installing the Printer Drivers and PPDs. Hypothesis 0.0: Instalación del los controladores de impresión y archivos PPD adaptados. Hypothesis 0.1: Instalación del los controladores de impresión y ver los archivos PPD. Hypothesis 0.2: Instalación de la los controladores de impresión y archivos PPD adaptados. Hypothesis 0.3: Instalación de la los controladores de impresión y ver los archivos PPD. Hypothesis 0.4: Instalación de la esta los controladores de impresión y ver los archivos PPD. User interaction 0: Hypothesis 0.2 is selected and the cursor is positioned at the beginning of the word \"los\". Then, the translator would type the character \"c\", that is, the next character in the reference target sentence. Final hypothesis: Instalación de controladores de impresora y archivos PPD. Translation quality evaluation The assessment of the techniques presented in section 3 has been carried out using three measures: 1. Translation Word Error Rate (TWER): It is defined as the minimum number of word substitution, deletion and insertion operations to convert the target sentence provided by the transducer into the reference translation. Also known as edit distance. 2. Character Error Rate (CER): Edit distance in terms of characters between the target sentence provided by the transducer and the reference translation. 3. Key-Stroke Ratio (KSR): Number of keystrokes that are necessary to achieve the reference translation plus the acceptance keystroke divided by the number of running characters. 4. BiLingual Evaluation Understudy (BLEU) (Papineni et al., 2002) : Basically is a function of the k-substrings that appear in the hypothesized target sentence and in the reference target sentence. These experiments were perfomed with 3gram transducers based on the GIATI technique. On the leftmost column appears the language pair employed for each experiment, English (En), Spanish (Es), French (Fr) and German (De). The main two central columns compare the results obtained with 1-best translation to 5-best translations. When using 5-best translations, that target sentence out of these five, that minimizes most the correspondent error measure is selected. The results are shown in Table 2. The best results were obtained between English and Spanish language pairs, in which the human translator would need to type less than 25% of the total reference sentences. In other words, this would result in a theoretically factor of 4 increase in the productivity of human translators. In fact, preliminary subjective evaluations have received positive feedback from professional translators when testing the prototype. Furthermore, in all cases there is a clear and significant improvement in error measures when moving from 1 to 5-best translations. This gain in translation quality dimishes in a log-wise fashion as the number of best translations increases. However, the number of hypotheses should be limited to the user capability to skim through the candidate translations and decide on which one to select. Table 3 presents the results obtained on a simplified version of the corpus. This simplification consists on tokenization, case normalization and the substitution of numbers, printer codes, etc. by their correspondent category labels. Pair of languages as English and French presents somewhat higher error rates, as is also the case between English and German, reflecting the complexity of the task faced in these experiments. Conclusions and future work Finite-state transducers have been successfully applied to CAT. These models can be learnt from parallel corpora. The concept of interactive search has been introduced in this paper along with some efficient techniques (word graph derivation andbest) that solve the parsing problem given a prefix of the target sentence under real-time constraints. The results show that the 5-best approach clearly improves the quality of the translations, with respect to the 1-best approximation. The promising results achieved in the first experiments provide a new field in machine translation still to be explored, in which the human expertise is combined with machine translation techniques to increase productivity without sacrifying high-quality translation. Finally, the introduction of morpho-syntactic information or bilingual categories in finite-state transducers, are topics that leave an open door to future research. As well as some improvements in the search algorithms to reduce the computational cost of finding a path in the word graph with the minimum edit cost. Acknowledgments The authors would like to thank all the reasearchers involved in the TT2 project who have contributed to the development of the methodologies presented in this paper. Prefix 0: Instalaci ón de c Hypothesis 1.0: Instalaci ón de c los controladores de impresión y archivos PPD adapatados. Hypothesis 1.1: Instalaci ón de c los controladores de impresión y ver los archivos PPD. Hypothesis 1.2: Instalaci ón de c esta los controladores de impresión y archivos PPD adapatados. Hypothesis 1.3: Instalaci ón de c esta los controladores de impresión y ver los archivos PPD. Hypothesis 1.4: Instalaci ón de controladores de impresión y fax y en archivos PPD adapatados. User interaction 1: Hypothesis 1.4 is selected and the cursor is positioned between the character \"s\" and \"i\" of the word \"impresión\". Then, the translator would type the next character in the reference target sentence: \"o\". Prefix 1: Instalaci ón de controladores de impreso Hypothesis 2.0: Instalaci ón de controladores de impresora y archivos PPD adaptados. Hypothesis 2.1: Instalaci ón de controladores de impresora y ver los archivos PPD. Hypothesis 2.2: Instalaci ón de controladores de impresora/fax y ver los archivos PPD. Hypothesis 2.3: Instalaci ón de controladores de impresora/fax y archivos PPD adaptados. Hypothesis 2.4: Instalaci ón de controladores de impresora y fax de CentreWare y ver los archivos PPD. User interaction 2: Hypothesis 2.0 is selected and the cursor is positioned at the end of the word \"PPD\". The translator would just need to add the character \".\". User interaction 3 : Hypothesis 3.0 is selected and the user accepts the target sentence.",
    "abstract": "State-of-the-art machine translation techniques are still far from producing high quality translations. This drawback leads us to introduce an alternative approach to the translation problem that brings human expertise into the machine translation scenario. In this framework, namely Computer Assisted Translation (CAT), human translators interact with a translation system, as an assistance tool, that dinamically offers, a list of translations that best completes the part of the sentence already translated. In this paper, finite state transducers are presented as a candidate technology in the CAT paradigm. The appropriateness of this technique is evaluated on a printer manual corpus and results from preliminary experiments confirm that human translators would reduce to less than 25% the amount of work to be done for the same task.",
    "countries": [
        "Spain"
    ],
    "languages": [
        "French",
        "German",
        "Spanish",
        "English"
    ],
    "numcitedby": "32",
    "year": "2004",
    "month": "July",
    "title": "From Machine Translation to Computer Assisted Translation using Finite-State Models"
}