{
    "article": "The paper presents a corpus-based method for finding metaphorically used lexemes and prevailing semantico-conceptual source domains, given a target domain corpus. It is exemplified by a case study on the target domain of European politics, based on a French 800,000 token corpus. Introduction This investigation is situated within the framework of the Hamburg Metaphor Database 1 (HMD) (Lönneker and Eilts, 2004) , which collects manual annotations of metaphors in context. HMD annotation terminology refers to cognitive linguistic accounts of metaphor. These suggest that abstract \"target\" concepts are often thought and talked of in terms of less abstract \"source\" concepts (Section 2). On these accounts, the paper presents a method for finding metaphorically used lexical items and characterizing the conceptual source domains they belong to, given a target domain corpus. After mentioning related work on metaphor annotation (Section 3), we exemplify our method by a case study on the target domain of European politics, for which a French 800,000 token corpus is prepared and imported into a corpus manager (Section 4). Using corpus manager functions, a small set of highly salient collocates of Europe are classified as candidates of metaphorical usages; after assessing their metaphoricity in context, these lexemes 1 http://www1.uni-hamburg.de/metaphern are grouped into semantico-conceptual domains for which, in a final step, additional lexical instantiations are searched (Section 5). Two important source domains (BUILDING and MOTION) are detected, which are supported by over 1,000 manual corpus annotations. The domains can be characterized as small networks of EuroWordNet synsets (nodes) and lexical as well as conceptual relations (Section 6). Section 7 concludes the paper. Theoretical Aspects The Conceptual Theory of Metaphor (CTM) worked out originally by (Lakoff and Johnson, 1980) claims that conceptual metaphors such as GOOD IS UP and TIME IS MONEY structure the way we think and influence the way we use language. Conceptual metaphors are mappings between conceptual domains, for example between the target domain GOOD and the less abstract source domain UP, or between TIME (target) and MONEY (source) . Conceptual metaphors are rarely directly referred to in speech or writing: Whereas time is money is a standing expression in English, this is much less so for many other conceptual mappings (cf. ?good is up). Consequently, corpus analysis cannot have as a goal finding conceptual mappings as such. Rather, it can find their manifestations through non-literal usages of lexical items -i.e., contexts in which source domain words are used to refer to elements in the target domain. For example, high (a word from the UP source domain) means 'good' in the expression high marks; and spend or save, used in the source domain to refer to actions involving money, refer to actions in the target domain of TIME when used in contexts such as spend time or save time. Adopting a broad notion of metaphor based on CTM, we refer to such non-literal usages (though often conventionalized) as lexical metaphors in this paper. Prominent conceptual metaphors are illustrated by a larger number of lexical metaphors, which support the systematicity of their mapping. Related Work Earlier projects annotating metaphor in corpora include (Martin, 1994) and (Barnden et al., 2002) . In what follows, we give two examples of recent work. Gedigian et al. (2006) annotated a subset of the Wall Street Journal for the senses of verbs from Motion-related, Placing, and Cure frames which were extracted from FrameNet (Fillmore et al., 2003) . The annotation shows that more than 90% of the 4,186 occurrences of these verbs in the corpus data are lexical metaphors in the above sense. Gedigian et al. (2006) conclude that in the domain of economics, Motion-related metaphors are used conventionally to describe market fluctuations and policy decisions. A classifier trained on the annotated corpus can discriminate between literal and metaphorical usages of the verbs. Lee (2006) compiled a 42,000 word corpus of transcribed doctor-patient dialogues, exhaustively hand-annotated for stretches of metaphorical language. These are provided with conceptual labels enabling the author to identify prevalent and interrelated metaphorical mappings used as part of communicative strategies in this domain. The European Constitution Corpus Exploration and annotation of a corpus to find information regarding its predominant conceptual source domains is most productive when applied to an abstract and novel target domain. Abstractness calls for ways to make the topic cognitively accessible, and novelty entails a certain openness about the particular source domains that might be activated for this purpose. Abstractness and novelty are criteria fulfilled by the target domain selected for our study: European Constitutional politics. The domain is represented by the public discourse on the possible introduction of a European Constitution and on the corresponding French referendum (29 May 2005). The referendum allowed voters to accept or refuse the proposed Constitution text (the result being refusal). The remainder of this section describes the sources of the corpus (4.1), its acquisition (4.2), and pre-processing (4.3). Sources The corpus consists of two sub-corpora, collected from online versions of two French dailies, Le Monde and Le Figaro. The site lemonde.fr contains each article published in the printed version of the socialist-liberal newspaper Le Monde, whereas lefigaro.fr contains articles from the conservative newspaper Le Figaro. Collection From 27 April to 5 June, 2005, the above mentioned web sites were screened for articles on Europe and the European Constitution on a daily basis. For the case study presented in this paper, only articles dealing with the Constitution and discussing the referendum are retained. Each of these articles is a document of the European Constitution corpus and contains information on its publication date, author, and newspaper section (e.g. editorial). The selection of relevant articles is performed manually. This is labor-intensive but keeps noise to a minimum. As a guideline for distinguishing between \"general\" European topics and the referendum on the European Constitution, key words including (European) Constitution and referendum are used. Preprocessing The collected documents are converted into text format and annotated with a simple SGML tagset representing document meta data (in the header), paragraph boundaries, and sentence boundaries. Sentence detection is performed reusing TreeTagger scripts 2 because we POS-tag and lemmatize the texts using the TreeTagger (Schmid, 1994) and its French parameter file (Stein and Schmid, 1995) . Finally, the corpus is verticalized for use with the Manatee/Bonito corpus manager (Rychlý and Smrž, 2004) , run in single platform mode on a Linux computer. Table 1 gives an overview of the two sub-corpora. When collecting the corpus, relevance to the topic had been our only criterion. Interestingly, the two newspaper corpora are very similar in size. This means that the selected topic was assigned equal importance by the different newspaper teams. Tables 2  and 3 show absolute frequencies of the top ten lemmas, filtered by a list of 725 French stop words 3 but still including oui -'yes' and non -'no', buzz-words during the political debate on the European Constitution. The frequent words also give an impression of the domain centeredness of the corpus. Lexical Metaphors and Source Domains Our aim is to determine empirically salient metaphorical source domains used in the target domain of European politics, combined with the practical interest in speeding up the detection and annotation of lexical metaphors. In Subsection 3 above, two approaches to corpus annotation for metaphor were mentioned. Due to the size of the corpus and limited annotator resources, we cannot follow the full-text annotation approach adopted by Lee (2006) . Neither do we proceed as Gedigian et al. (2006) , because that approach pre-selects source domains and lemmas. In our approach, we search for metaphorically used lexical items from initially unknown source domains, so interesting lemmas cannot be listed a priori. Therefore, we developed a new method which makes efficient use of existing corpus manager functions. The only constant is the representation of the target domain, predefined at a high level by the selection of our corpus. We fixed the lemma Europe as a low-level anchor of the target domain. 4 The investigation proceeds in three steps: 1. Statistically weighted lists of collocates of the target domain lemma Europe are calculated and screened for candidates of metaphorical language use (5.1). 2. For the obtained candidate collocates, the corpus is concordanced in order to discriminate usages and assign a source domain to each collocate (5.2). 3. The source domains are extended lexically, making use of EuroWordNet synsets and relations (5.3). Corpus data drives the discovery of relevant lemmas in step 1. In steps 2 and 3, the corpus is used to increasingly refine and evaluate findings regarding relevant lemmas and source domains. Collocate analysis At this stage, it is necessary to set a range (span) within which candidate lemmas are to appear, mea-sured in lemma counts starting with the anchor word Europe. Sample concordances show that Europe is often preceded by an article and sometimes by an additional preposition. Based on this insight, we heuristically restrict the context range for collocates to four (i.e. three words are allowed to occur between it and Europe). For example, mère 'mother' in Example ( 1 ) is retained as a collocate: (1) Parce qu'elle a été la mère 4 fondatrice 3 de 2 l 1 'Europe unie. ('Because she [i.e. France] has been the founding mother of the unified Europe.') The minimum absolute frequency of the collocate within the specified context range is set to 3, which ensures results of at least three example sentences per co-occurring lemma. Intentionally, no restriction is applied to the part of speech of the collocate. For both sub-corpora, lists of the top 100 collocate lemmas for Europe are calculated in the Manatee/Bonito corpus manager. We use the MI-score for ranking; it is based on the relative frequency of the co-occurring lemmas. Choosing MI-score over T-score is driven by an interest in salient collocates of Europe, whether or not they are common in the entire corpus. (T-score would tend to prefer collocates that occur frequently throughout the corpus.) The top collocates and their MI-scores are given in Tables 4 and 5 . MI-scores of the 100 top-ranked collocates are between 7.297 and 4.575 in the Monde corpus and between 7.591 and 4.591 in the Figaro corpus. Empirically, a threshold of M I >= 6 retains the most salient collocates of Europe in both corpora. These These highly salient collocates are evaluated for the potential of being used metaphorically in the target domain. The guideline underlying this evaluation is as follows: Those lexemes which, in at least one of their usages, designate entities belonging to domains more concrete than POLITICS (for example, BUILDING or FAMILY) are likely to be used metaphorically in the corpus. Specifically, among those collocates with M I >= 6, we identify the following metaphor candidates: Le Monde panne -'breakdown', réveil -'awakening; alarm clock', construire -'construct', otage -'hostage', bâtir -'build', mère -'mother', révolte -'revolt'; Le Figaro panne, bouc -'goat', ruine -'ruin', traverser -'traverse', racine -'root', visage -'face', reconstruire -'reconstruct'. Merging the lists yields 13 distinct candidate words, which are now evaluated based on contexts from within the corpus. There are a total of 112 occurrences of these lemmas co-occurring with Europe in a range of 4, the setting used to calculate collocate lists. Each of them is inspected in a context of at least one sentence. An annotator decides whether the usage is metaphorical, and confirms this in almost all of the cases (cf. Table 6 ). Source domain identification While disambiguating the 13 candidate lemmas in context, the annotator also assigns a source domain  The LIVING BEING source domain is multifaceted, comprising PROCREATION, BODY, and REST, obviously personifying Europe. However, the frequency of lexical metaphors in these domains is in large part due to recurring quotations: For example, mère -'mother' is used exclusively within the expression la mère fondatrice de l'Europe -'the founding mother of Europe,' attributed to J. L. Rodriguez Zapatero; and réveil -'awakening; alarm clock' (pointing to an action of a living being) occurs only as part of the expression sonner le réveil de l'Europe -'ring the awakening/alarm of Europe,' coined by Ph. de Villiers. Finally, bouc -'goat' is always part of the idiom le bouc émissaire -'scapegoat'. Although it could be grouped under LIVING BEING, this expression is based on particular cultural knowledge rather than on systematic exploitation of general world knowledge about the source domain. The FIGHT domain has the lowest count of lexical metaphors in the annotated co-occurrences of Europe. Also, the noun otage -'hostage' occurs three times out of five within the expression (ne pas) prendre l'Europe en otage -'(not) take Europe hostage,' coined by N. Sarkozy and quoted as such. To summarize, we observe that the most salient lexical metaphors co-occurring with Europe in the European Constitution corpus either refer to the source domains of BUILDING or MOTION, wellknown source domains of conventional metaphors, or the lexical metaphors are sparse, referring to much less clearly delimited source domains such as LIVING BEING or FIGHT. Within the second group, there are a number of newly coined expressions, \"one shot rich image metaphors,\" (Lakoff, 1987) which evoke entire scenes but do not necessarily contribute to a wide-spread systematic exploitation of the source domain. Lexical extension Corpus annotation is now extended to a larger list of lemmas from the source domains of BUILDING and MOTION. The challenge here is finding additional lemmas that might exploit the postulated mappings, given a small set of disambiguated lemmas and ambiguous collocates (cf. Table 7 ). A lexical resource for French containing information on conceptual domains would be helpful here. EuroWord-Net (EWN) could go in this direction. It defines many relation types, including the synonym relation inside synsets, as well as hyponym, near-antonym and meronym relations between synsets. Apart from these lexical relations, EWN also recognizes a family of semantico-conceptual INVOLVED relations, which relate a verb synset Y to a noun synset X if \"X is the one/that who/which is typically involved in Ying\" (Vossen, 1999) (our emphasis). Unfortunately, there are almost no actual instantiations of INVOLVED relations in the French part of EWN. Taking our previously identified collocates of Europe as seeds, we extend our lemma list resorting to EuroWordNet synsets, as follows: • lemmas in synsets lexically related by EWN relations to synsets containing our seed lemmas (hypo-, hyper-, anto-, mero-and synonyms); • lemmas in synsets lexically related across part of speech to synsets containing our seed lemmas, by adding missing XPOS NEAR-SYNONYM and XPOS NEAR ANTONYM relations ourselves; • lemmas in synsets that are conceptually related to the seed synsets, by adding INVOLVED relations ourselves. A reiteration of these steps (using encountered lemmas as new seeds) could lead very soon to general or peripheral lemmas. Ideally, one would set up a limit of reiteration per operation and consider all encountered lemmas as possible keywords of the domain. However, annotator resources being limited, we reduced the list of key lemmas to about 20 per domain (22 for BUILDING and 19 for MOTION), using human judgment. At this stage, the restriction on the keyword of being a collocate of Europe is lifted. This results in search, disambiguation, and annotation being performed on the entire corpus. The annotator finds 663 lexical metaphors among the 1,237 occurrences of 22 BUILDING keywords, and 409 lexical metaphors among the 1,307 occurrences of 19 MOTION keywords. Each key lemma contributes positively to the count of lexical metaphors. Two consequences follow from these figures: 1. Both postulated source domains are systematically exploited by lexical metaphors. 2. Every second or third investigated occurrence is a lexical metaphor. 5 Collection and annotation of metaphors can thus proceed considerably faster on the key lemmas than it would on full text or randomly selected sentences. For each lexical metaphor, the annotator provides EuroWordNet synset information. For the actual meaning in context, the synset belonging to the target domain is encoded. Additionally, the synset containing the metaphorically used lexeme in its source domain sense is indicated (\"source synset\"). Source domain structure The information on source synsets underlies conceptual maps of the two source domains. This is exemplified here by Figure 1 , which represents the MOTION domain. Lexical metaphors are prefixed by M ; those word senses not encoded in EWN are marked with an asterisk at the end. Synsets shaded gray in Figure 1 contain at least one lemma that is exploited as a lexical metaphor, and as such attested in the European Constitution corpus. Ovals represent verb synsets, boxes show noun synsets, and hexagons depict events. Relations between synsets illustrate the internal structure of the domain. Solid lines represent relations encoded in EuroWordNet. For legibility reasons, labels of hyponym relations have been omitted. Dotted lines stand for relations that we added. These were labeled using EWN relation types (Vossen, 1999) , where possible. As obvious from Figure 1 , the domain graph would be separate partitions without our additional relations, especially those of the INVOLVED type. Conceptual relations (\"typically. . . \") are thus a necessary addition to lexical relations (\"necessarily. . . \") in order to represent conceptual source domains. The map representing the source domain is a result of our corpus investigation of this specific target domain corpus. The structure of the source domain is not intended to be a general representation of this domain, nor does it imply fixed domain boundaries. Rather, the network shows the elements of the source domain that mapped onto the target domain from corpus attestations. If the same source domain were to be mapped onto some other target domain, other synsets might be used. A lexico-conceptual resource encoding general information on this source domain would thus have to contain more synsets and relations than those displayed in Figure 1 . The choice of source domains as well as of certain lexical items from within a source domain has the effect of \"highlighting and hiding\" certain aspects of the target domain. For example, among the numerous hyponyms of the central 'move' synset {se déplacer:1 se mouvoir:1 aller:3}-most of which are not displayed in Figure 1 -, the European Constitution corpus shows a tendency towards lexical metaphors in synsets containing the verb traverser -'traverse'. This profiles the path component of the motion event. The path itself is further emphasized by lexical metaphors related to the 'move' synset by INVOLVED LOCATION and INVOLVED DIRECTION. Also vehicles as instruments play a role in the conceptualization, but not all vehicles have metaphorical attestations in the corpus: only train -'train' and bateau -'boat' are found during a cross-check. Finally, synsets referring to the contrary of 'move' are contained within the map of the source domain. Even the 'motor' (as a vehicle part) and its 'breakdown' (causing 'immobilization') are thus lexically and conceptually integrated in the MOTION domain derived from our corpus. All these highlightings and hidings can be interpreted with respect to the situation of Europe before the referendum on its Constitution: Europe is made cognitively accessible as a multi-passenger vehicle in motion on a path, which has not yet arrived but is facing obstacles to its motion, possibly resulting in being stopped. Conclusion and Outlook A method for quickly finding large amounts of lexical metaphors and characterizing their source domains has been exemplified, given a target domain corpus. The method makes use of collocate exploration of a target domain keyword, in order to identify the most promising source domains. Over 1,000 manual annotations have been obtained and will be integrated into the Hamburg Metaphor Database. This outnumbers by far the results of previous studies filed within HMD, which originated under similar conditions but did not resort to a corpus manager. Our method is different from automated work on metaphor recognition such as (Mason, 2004) and (Gedigian et al., 2006) in that it includes nouns as parts of speech. Implementing it in an automated system would require more sophisticated lexicalconceptual resources, representing information on concrete domains (possible source domains). In particular, the addition of lexical and conceptual links between verb and noun synsets is crucial for establishing a connected source domain graph. Acknowledgements Thanks to Patrick Hanks, Jana Klawitter, and three anonymous reviewers for their helpful comments. -This work was supported by a fellowship within the Postdoc-Programme of the German Academic Exchange Service (DAAD), granted to the second author.",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 1.0,
        "foundation": 3.128162811005808e-07,
        "none": 0.0
    },
    "reasoning": "Reasoning: The article explicitly mentions support from a fellowship within the Postdoc-Programme of the German Academic Exchange Service (DAAD), which is a research agency. There is no mention of funding from defense, corporate entities, foundations, or any indication that there were no other funding sources.",
    "abstract": "The paper presents a corpus-based method for finding metaphorically used lexemes and prevailing semantico-conceptual source domains, given a target domain corpus. It is exemplified by a case study on the target domain of European politics, based on a French 800,000 token corpus.",
    "countries": [
        "Germany"
    ],
    "languages": [
        "French"
    ],
    "numcitedby": 14,
    "year": 2007,
    "month": "April",
    "title": "Corpus-driven Metaphor Harvesting"
}