{
    "framing_question": "What motivation does this paper state for the work, if any?",
    "response": "The motivation for this work is to develop a new agreement measure for multiclass annotation tasks, specifically for the annotation of affective text corpora. The authors argue that existing agreement measures are not applicable to this task, as they do not allow for the fact that a single text item may belong to multiple affect categories. They also note that the annotation of affective text corpora is a complex task, as the categories are often ambiguous and difficult to define. The authors believe that their new measure, which they call Am, will be a valuable tool for researchers working on the development of computational affect recognizers.",
    "article": "An affective text may be judged to belong to multiple affect categories as it may evoke different affects with varying degree of intensity. For affect classification of text, it is often required to annotate text corpus with affect categories. This task is often performed by a number of human judges. This paper presents a new agreement measure inspired by Kappa coefficient to compute inter-annotator reliability when the annotators have freedom to categorize a text into more than one class. The extended reliability coefficient has been applied to measure the quality of an affective text corpus. An analysis of the factors that influence corpus quality has been provided. Introduction The accuracy of a supervised machine learning task primarily depends on the annotation quality of the data, that is used for training and cross validation. Reliability of annotation is a key requirement for the usability of an annotated corpus. Inconsistency or noisy annotation may lead to the degradation of performances of supervised learning algorithms. The data annotated by a single annotator may be prone to error and hence an unreliable one. This also holds for annotating an affective corpus, which is highly dependent on the mental state of the subject. The recent trend in corpus development in NLP is to annotate corpus by more than one annotators independently. In corpus statistics, c 2008. Licensed under the Creative Commons Attribution-Noncommercial-Share Alike 3.0 Unported license (http://creativecommons.org/licenses/by-nc-sa/3.0/). Some rights reserved. the corpus reliability is measured by coefficient of agreement. The coefficients of agreement are applied to corpus for various goals like measuring reliability, validity and stability of corpus (Artstein and Poesio, 2008) . Jacob Cohen (Cohen, 1960) introduced Kappa statistics as a coefficient of agreement for nominal scales. The Kappa coefficient measures the proportion of observed agreement over the agreement by chance and the maximum agreement attainable over chance agreement considering pairwise agreement. Later Fleiss (Fleiss, 1981) proposed an extension to measure agreement in ordinal scale data. Cohen's Kappa has been widely used in various research areas. Because of its simplicity and robustness, it has become a popular approach for agreement measurement in the area of electronics (Jung, 2003) , geographical informatics (Hagen, 2003) , medical (Hripcsak and Heitjan, 2002) , and many more domains. There are other variants of Kappa like agreement measures (Carletta, 1996) . Scott's π (Scott, 1955) was introduced to measure agreement in survey research. Kappa and π measures differ in the way they determine the chance related agreements. π-like coefficients determine the chance agreement among arbitrary coders, while κ-like coefficients treats the chance of agreement among the coders who produced the reliability data (Artstein and Poesio, 2008) . One of the drawbacks of π and Kappa like coefficients except Fleiss' Kappa (Fleiss, 1981) is that they treat all kinds of disagreements in the same manner. Krippendorff's α (Krippendorff, 1980) is a reliability measure which treats different kind of disagreements separately by introducing a notion of distance between two categories. It offers a way to measure agreement in nominal, interval, ordinal and ratio scale data. Reliability assessment of corpus is an important issue in corpus driven natural language processing and the existing reliability measures have been used in various corpus development tasks. For example, Kappa coefficient has been used in developing parts of speech corpus (Mieskes and Strube, 2006) , dialogue act tagging efforts like MapTask (Carletta et al., 1997) and Switchboard (Stolke et al., 1997) , subjectivity tagging task (Bruce and Wiebe, 1999 ) and many more. The π and κ coefficients measure the reliability of the annotation task where a data item can be annotated with one category. (Rosenberg and Binkowski, 2004 ) puts an effort towards measuring corpus reliability for multiply labeled data points. In this measure, the annotators are allowed to mark one data point with at most two classes, one of which is primary and other is secondary. This measure was used to determine the reliability of a email corpus where emails are assigned with primary and secondary labels from a set of email types. Affect recognition from text is a recent and promising subarea of natural language processing. The task is to classify text segments into appropriate affect categories. The supervised machine learning techniques, which requires a reliable annotated corpus, may be applied for solving the problem. In general, a blend of emotions is common in both verbal and non-verbal communication. Unlike conventional annotation tasks like POS corpus development, where one data item may belong to only one category, in affective text corpus, a data item may be fuzzy and may belong to multiple affect categories. For example, the following sentence may belong to disgust and sad category since it may evoke both the emotions to different degrees of intensity. A young married woman was burnt to death allegedly by her in-laws for dowry. This property makes the existing agreement measures inapplicable for determining agreement in emotional corpus. Craggs and Wood (2004) adopted a categorical scheme for annotating emotion in affective text dialogue. They claimed to address the problem of agreement measurement for the data set where one data item may belong to more than one category using an extension of Krip-pendorff's α. But the details of the extension is yet to be disseminated. In this paper, we propose a new agreement measure for multiclass annotation which we denote by A m . The new measure is then applied to an affective text corpus to • Assess Reliability: To test whether the corpus can be used for developing computational affect recognizer. • Determine Gold Standard: To define a gold standard that will be used to test the accuracy of the affect recognizer. In section 2, we describe the affective text corpus and the annotation scheme. In section 3, we propose a new reliability measure (A m ) for multiclass annotated data. In section 4, we provide an algorithm to determine gold standard data from the annotation and in section 5, we discuss about applying A m measure to the corpus developed by us and some observations related to the annotation. Affective Text Corpus and Annotation Scheme The affective text corpus collected by us consists of 1000 sentences extracted from Times of India news archive 1 . The sentences were collected from headlines as well as articles belonging to political, social, sports and entertainment domain. Selection of affect categories is a very crucial and important decision problem due to the following reasons. • The affect categories should be applicable to the considered genre. • The affect categories should be identifiable from language. • The categories should be unambiguous. We shall try to validate these points based on the results obtained, after applying the our extended measure on the text corpus with respect to a set of selected basic emotional categories. Basic emotions are those for which the respective expressions across culture, ethnicity, age, sex, social structure are invariant (Ortony and Turner, 1990) . But unfortunately, there is a long persistent debate among the psychologists regarding the number of basic emotional categories (Ortony and Turner, 1990) . One of the theories behind the basic emotions is that they are biologically primitive because they possess evolutionary significance related to the basic needs for the survival of the species (Plutchik, 1980) . The universality of recognition of emotions from distinctive facial expressions is an indirect technique to establish the basic emotions (Darwin, 1965) . Six basic affect categories (Ekman, Friesen and Ellsworth, 1982) have been considered in emotion recognition from speech (Song et al., 2004) , facial expression (Pantic and Rothkrantz, 2000) . Our annotation scheme considers six basic emotions, namely, Anger, Disgust, Fear, Happiness, Sadness, Surprise as specified by Ekman for affect recognition in text corpus. The annotation scheme considers the following points: • Two types are sentences are collected for annotation. -Direct Affective Sentence: Here, the agent present in the sentence is experiencing a set of emotions, which are explicit in the sentence. For example, in the following sentence Indian supporters are the agents experiencing a disgust emotion. Indian supporters are disgusted about players' performances in the World Cup. -Indirect Affective Sentence: Here, the reader of the sentence is experiencing a set of emotions. In the following sentence, the reader is experiencing a disgust emotion because the event of accepting bribe, is an indecent act carried out by responsible agents like Top officials. Top officials are held for accepting bribe from a poor villager. • A sentence may trigger multiple emotions simultaneously. So, one annotator may classify a sentence to more than one affective categories. • For each emotion, the keywords that trigger the particular emotion are marked. • For each emotion, the events or objects that trigger the concerned emotion are marked. Here, we aim at measuring the agreement in annotation. The focus is to measure the agreement in annotation pattern rather than the agreement in individual emotional classes. Proposed Agreement Measure To overcome the shortcomings of existing reliability measures mentioned earlier, we propose A m measure, which is an agreement measure for corpus annotation task considering multiclass classification. We present the notion of agreement below. Notion of Paired Agreement In order to allow for multiple labels, we calculate agreement between all the pairs of possible labels. Let C1 and C2 be two affect categories, e.g., anger and disgust. Let <C1, C2> denote the category pair. An annotator's assignment of labels can be represented as a pair of binary choices for each category pair <C1, C2>, namely, < 0, 0 >, < 0, 1 >, < 1, 0 >, and < 1, 1 >. It should be noted that the proposed metric considers the non-inclusion in a category by an annotator pair as an agreement. For an item, two annotators U1 and U2 are said to agree on <C1, C2> if the following conditions hold. U 1.C1 = U 2.C1 U 1.C2 = U 2.C2 where U i .C j signifies that the value for C j for annotator U i and the value may either be 1 or 0. For example, if one coder marks an item with anger and another with disgust, they would disagree on the pairs that include these labels, but still agree that the item does not express happiness and sadness. A m Agreement Measure With the notion of paired agreement discussed earlier, the observed agreement(P o ) is the proportion of items the annotators agreed on the category pairs and the expected agreement(P e ) is the proportion of items for which agreement is expected by chance when the items are randomly. Following the line of Cohen's Kappa (Cohen, 1960) , A m is defined as the proportion of agreement after expected or chance agreement is removed from consideration and is given by A m = P o − P e 1 − P e (1) When P o equals P e , A m value is computed to be 0, which signifies no non-random agreement among the annotators. An A m value of 1, the upper limit of A m , indicates a perfect agreement among the annotators. We define P o and P e as follows. Observed Agreement (P o ): Let I be the number of items, C is the number of categories and U is the number of annotators and S be the set of all category pairs with cardinality C 2 . The total agreement on a category pair p for an item i is n ip , the number of annotator pairs who agree on p for i. The average agreement on a category pair p for an item i is n ip divided by the total number of annotator pairs and is given by P ip = 1 U 2 n ip (2) The average agreement for the item i is the mean of P ip over all category pairs and is given by P i = 1 C 2 U 2 p∈S n ip (3) The observed agreement is the average agreement over all the item and is given by P o = 1 I I i=1 P i = 1 I C 2 U 2 I i=1 p∈S n ip (4) = 4 IC(C − 1)U(U − 1) I i=1 p∈S n ip Expected Agreement (P e ): The expected agreement is defined as the agreement among the annotators when they assign the items to a set of categories randomly. However, since we are considering the agreement on category pairs, we consider the expected agreement to be the expectation that the annotators agree on a category pair. For a category pair, four possible assignment combinations constitute a set which is given by G = {[0 0], [0 1], [1 1]}. It is to be noted that the combinations [0 1] and [1 0] are clubbed to one element as they are symmetric to each other. Let P (p g |u) be the overall proportion of items assigned with assignment combination g ∈ G to category pair p ∈ S by annotator u and n pgu be the total number of assignments of items by annotator u with assignment combination g to category pair p. Then P (p g |u) is given by P (p g |u) = n pgu I (5) For an item, the probability that two arbitrary coders agree with the same assignment combination in a category pair is the joint probability of individual coders making this assignments independently. For two annotators u x and u y the joint probability is given by P (p g |u x ) P (pg|u y ). The probability that two arbitrary annotators agree on a category pair p with assignment combination g is the average over all annotator pairs belonging to W , the set of annotator pairs and is given by P (p g ) = 1 U 2 (ux,uy)∈W P (p g |u x ) P (p g |u y ) (6) The probability that two arbitrary annotators agree on a category pair for all assignment combinations is given by P (p) = pg∈G P (p g ) (7) The chance agreement is calculated by taking average over all category pairs. P e = 1 C 2 p∈S P (p) (8) The A m measure may be calculated based on the expressions of P o and P e as given in Equation 4 and Equation 8 to compute the reliability of annotation with respect to multiclass annotation. Gold Standard Determination Gold standard data is used as a reference data set for various goals like If n O = n φ , then we resolve the tie based on the performances of the annotators in previous assignments. We assign an expert coder index(ξ) to each annotator and it is updated based on the agreement of their judgments over the corpus. There are two cases when the ξ values are incremented • If the item is assigned to a category in the gold standard data, the ξ values are incremented for those annotators who have assigned the item into that category. • If the item is not assigned to a category in the gold standard data, the ξ values are in-cremented for those annotators who have not assigned the item into that category. If n O and n φ are equal for an item, we make use of the ξ values for deciding upon the assignment of the item to the category in concern. We assign the item into that category if the combined ξ values of the annotators who have assigned the item into that category is greater than the combined ξ values of the annotators who have not assigned the item into that category, i.e., n O i=1 ξ i > n φ j=1 ξ j The algorithm for determining gold standard data is given in Algorithm 1. Experimental Results We applied the proposed A m measure to estimate the quality of the affective corpus described in section 2. Below we present the annotation experiment followed by some relevant analysis. Annotation Experiment Ten human judges with the same social background participated in the study, assigning affective categories to sentences independently of one another. The annotators were provided with the annotation instructions and they were trained with some sentences not belonging to the corpus. The annotation was performed with the help of a web based annotation interface 2 . The corpus consists of 1000 sentences. Three of judges were able to complete the task within 20 days. In this paper, we report the result of applying the measure with data provided by three annotators without considering the incomplete annotations. Distribution of the sentences across the affective categories for the three judges is given in Figure 1 . Analysis of Corpus Quality The corpus was evaluated in terms of the proposed measure. Some of the relevant observations are presented below. • Agreement Value: Different agreement values related to A m measure are given in Table 1. We present A m values for all the annotator pairs in Table 2 .  • Agreement Study: Table 3 provides that 71.5% of the corpus belongs to [0.7 1.0] range of observed agreement and among this bulk portion of the corpus, the annotators assign 78.6% of the sentences into a single category. This is due to the existence of a dominant emotion in a sentence and in most of the cases, the sentence contains enough clues to decode it. For the non-dominant emotions in a sentence, ambiguity has been found while decoding. • Disagreement Study: In Table 4 , we present the category wise disagreement for all the annotator pairs. From the disagreement table it is evident that the categories with maximum number of disagreements are anger, disgust and fear. The emotions which are close to each other in the evaluation-activation space are inherently ambiguous. For example, anger and disgust are close to each other in the evaluation-activation space. So, ambiguity between these categories will be higher compared to other pairs. If [a b] is the pair, we count the number of cases where one annotator categorized one item into [a -] pattern and other annotator classified the same item into [-b] pattern. In Table 5 , we provide the confusion between two affective categories for all annotator pairs. This confusion matrix is a symmetric one. So, we have provided only the upper triangular matrix. In Figure 2 , we provide ambiguity counts of the affective category pairs. It can be ob- served that anger, disgust and fear are associated with three topmost ambiguous pairs. Gold Standard for Affective Text Corpus To determine the gold standard corpus, we have applied majority decision label based approach discussed in section 4 on the judgements provided by only three annotators. However, as the number of annotators is much less in the current study, the determined gold standard corpus may not have Conclusion and Future Work Measuring the reliability of the affective text corpus where one single item may be classified into more than one single category is a complex task. In this paper, we have provided a new coefficient to measure reliability in multiclass annotation task by incorporating pairwise agreement in affective class pairs. The measure yields an agreement value 0.72, when applied to an annotated corpus provided by three users. This considerable agreement value indicates that the affect categories considered for annotation may be applicable to the news genre. We are in process of collecting annotated corpus from more annotators which will ensure a statistically significant result. According to the disagreement study presented in section 5.2, confusions between specific emotions is most likely between categories which are adjacent in the activationevaluation space. The models of annotator agreement which use weights for different types of disagreement will be interesting for future study. The direct and indirect affective sentences have not been treated separately in this study. The algorithm for determination of gold standard requires more details investigation as simple majority voting may not be sufficient for highly subjective data like emotion. Acknowledgement Plaban Kr. Bhowmick is partially supported by Microsoft Corporation, USA and Media Lab Asia, India. The authors are thankful to the reviewers for their detailed suggestions regarding the work.",
    "funding": {
        "military": 0.0,
        "corporate": 0.9896711848878069,
        "research agency": 3.655006203018285e-05,
        "foundation": 1.6524378470994527e-05,
        "none": 4.320199066265573e-07
    }
}