{
    "article": "We introduce the ACL Anthology Network (AAN), a manually curated networked database of citations, collaborations, and summaries in the field of Computational Linguistics. We also present a number of statistics about the network including the most cited authors, the most central collaborators, as well as network statistics about the paper citation, author citation, and author collaboration networks. Introduction The ACL Anthology is one of the most successful initiatives of the ACL. It was initiated by Steven Bird and is now maintained by Min Yen Kan. It includes all papers published by ACL and related organizations as well as the Computational Linguistics journal over a period of four decades. It is available at http://www.aclweb.org/anthology-new/ . One fundamental problem with the ACL Anthology, however, is the fact that it is just a collection of papers. It doesn't include any citation information or any statistics about the productivity of the various researchers who contributed papers to it. We embarked on an ambitious initiative to manually annotate the entire Anthology in order to make it possible to compute such statistics. In addition, we were able to use the annotated data for extracting citation summaries of all papers in the collection and we also annotated each paper by the gender of the authors (and are currently in the process of doing similarly for their institutions) in the goal of creating multiple gold standard data sets for training automated systems for performing such tasks. Curation The ACL Anthology includes 13,739 papers (excluding book reviews and posters). Each of the papers was converted from pdf to text using an OCR tool (www.pdfbox.org). After this conversion, we extracted the references semi-automatically using string matching. The above process outputs all the references as a single block so we then manually inserted line breaks between references. These references were then manually matched to other papers in the ACL Anthology using a \"k-best\" (with k = 5) string matching algorithm built into a CGI interface. A snapshot of this interface is shown in Figure 1 . The matched references were stored together to produce the citation network. References to publications outside of the AAN were recorded but not included in the network. In order to fix the issue of wrong author names and multiple author identities we had to perform a lot of manual post-processing. The first names and the last names were swapped for a lot of authors. For example, the author name \"Caroline Brun\" was present as \"Brun Caroline\" in some of her papers. Another big source of error was the exclusion of middle names or initials in a number of papers. For example, Julia Hirschberg had two identities as \"Julia Hirschberg\" and \"Julia B. Hirschberg\". There were a few spelling mistakes, like \"Madeleine Bates\" was misspelled as \"Medeleine Bates\". Finally, many papers included incorrect titles in their citation sections. Some used the wrong years and/or venues as well. Using the metadata and the citations extracted after curation, we have built three different networks. The paper citation network is a directed network with each node representing a paper labeled with an ACL ID number and the edges representing a citation within that paper to another paper represented by an ACL ID. The paper citation network consists of 13,739 papers and 54,538 citations. The author citation network and the author collaboration network are additional networks derived from the paper citation network. In both of these networks a node is created for each unique author. In the author citation network an edge is an occurrence of an author citing another author. For example, if a paper written by Franz Josef Och cites a paper written by Joshua Goodman, then an edge is created between Franz Josef Och and Joshua Goodman. Self citations cause self loops in the author citation network. The author citation network consists of 11,180 unique authors and 332,815 edges (196,905 edges if duplicates are removed). In the author collaboration network, an edge is created for each collaboration. For example, if a paper is written by Franz Josef Och and Hermann Ney, then an edge is created between the two authors. Table 1 shows some brief statistics about the first two releases of the data set (2006 and 2007) .   factor, correlations between different measures of impact like H-Index, total number of incoming citations, PageRank. They also report results from a regression analysis using H-Index scores from different sources (AAN, Google Scholar) in an attempt to identify multi-disciplinary authors. Sample rankings This section shows some of the rankings that were computed using AAN.      We have also computed the related phrases for every author using the text from the papers they have authored, using the simple TF-IDF scoring scheme (see Figure 4 ). The citation summary of an article, P, is the set of sentences that appear in the litera-ture and cite P. These sentences usually mention at least one of the cited paper's contributions. We use AAN to extract the citation summaries of all articles, and thus the citation summary of P is a self-contained set and only includes the citing sentences that appear in AAN papers. Extraction is performed automatically using string-based heuristics by matching the citation pattern, author names and publication year, within the sentences. The following example shows the citation summary extracted for \"Koo, Terry, Carreras, Xavier, Collins, Michael John, Simple Semisupervised Dependency Parsing\". The citation summary of (Koo et al., 2008) mentions KCC08, dependency parsing, and the use of word clustering in semi-supervised NLP. Rank Icit Title C08-1051 1 7:191 Furthermore, recent studies revealed that word clustering is useful for semi-supervised learning in NLP (Miller et al., 2004; Li and McCallum, 2005; Kazama and Torisawa, 2008; Koo et al., 2008) . D08-1042 2 78:214 There has been a lot of progress in learning dependency tree parsers (McDonald et al., 2005; Koo et al., 2008; Wang et al., 2008) . W08-2102 3 194:209 The method shows improvements over the method described in (Koo et al., 2008) , which is a state-of-the-art second-order dependency parser similar to that of (McDonald and Pereira, 2006) , suggesting that the incorporation of constituent structure can improve dependency accuracy. W08-2102 4 32:209 The model also recovers dependencies with significantly higher accuracy than state-of-theart dependency parsers such as (Koo et al., 2008; McDonald and Pereira, 2006) . W08-2102 5 163:209 KCC08 unlabeled is from (Koo et al., 2008) , a model that has previously been shown to have higher accuracy than (McDonald and Pereira, 2006) . W08-2102 6 164:209 KCC08 labeled is the labeled dependency parser from (Koo et al., 2008) ; here we only evaluate the unlabeled accuracy. We also include a large set of scripts which use the paper citation network and the metadata file to output the auxiliary networks and the different statistics. The scripts are documented here: http://clair.si.umich.edu/ .The data set has already been downloaded from 2,775 unique IPs since June 2007. Also, the website has been very popular based on access statistics. There have been more than 2M accesses in 2009. The citation text that we have extracted for each paper is a good resource to generate summaries of the contributions of that paper. We have previously developed systems using clustering the similarity networks to generate short, and yet informative, summaries of individual papers (Qazvinian and Radev 2008) , and more general scientific topics, such as Dependency Parsing, and Machine Translation (Radev et al. 2009) . Gender annotation We have manually annotated the gender of most authors in AAN using the name of the author. If the gender cannot be identified without any ambiguity using the name of the author, we resorted to finding the homepage of the author. We have been able to annotate 8,578 authors this way: 6,396 male and 2,182 female. Downloads The following files can be downloaded: Text files of the paper: The raw text files of the papers after converting them from pdf to text is available for all papers. The files are named by the corresponding ACL ID. Metadata: This file contains all the metadata associated with each paper. The metadata associated with every paper consists of the paper id, title, year, venue. Citations: The paper citation network indicating which paper cites which other paper. Figure 7 includes some examples.",
    "abstract": "We introduce the ACL Anthology Network (AAN), a manually curated networked database of citations, collaborations, and summaries in the field of Computational Linguistics. We also present a number of statistics about the network including the most cited authors, the most central collaborators, as well as network statistics about the paper citation, author citation, and author collaboration networks.",
    "countries": [
        "United States"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "300",
    "year": "2009",
    "month": "August",
    "title": "The {ACL} {A}nthology Network"
}