{
    "article": "Multi-document summarization is the automatic production of a unique summary from a collection of texts. In this paper, we propose a statistical generative approach for multi-document summarization that combines simple information such as sentence position in the text and semantic-discursive information from CST (Cross-Document Structure Theory). In particular, we formulate the multi-document summarization task using a Noisy-Channel model. Introduction Multi-Document Summarization (MDS) is the process of building a summary from a group of texts that have similar content (Mani, 2001) . In this work we explore a Generative Approach for MDS by using a Noisy-Channel framework (Shannon, 1948) for learning a MDS model. In this approach we integrate semantic-discursive knowledge to model different Multi-Document phenomena such as redundant, complementary and contradictory information. This semantic-discursive information across documents is given, for example, by CST model (Cross-Document Structure Theory) (Radev, 2000) and also RST (Rhetorical Structure Theory) (Mann and Thompson, 1987) . This novel approach yields a theoretical generative learning model for MDS. A Noisy-Channel approach for Multi-document Sumarization The Noisy-Channel model is represented by a framework composed of three parts: a source, a noisy-channel and a decoder. This structure is showed in Figure 1 . Figure 1. Noisy-Channel Model Source Message X P(x) Noisy-Channel P(y|x) Message Y P(y) Decoding P(x|y) The source produces an original message which passes through a channel where some noise is introduced, and therefore, a corrupted message y is produced. The decoding stage consists in recovering the most likely x (original message), from a set of x's, given y. This whole process is formulated through the Bayes rule. When instantiating MDS in the Noisy-Channel framework, we assume that the source will produce a multi-document summary. The probability for this summary expressed by P(S) and it represents the language model of the summary which models factors such as grammaticality, coherence and cohesion in the summary. The probability of expanding the summary into a cluster (group of bigger texts from which the summary came from) is given by P(C|S). As an initial approach we will assume that this cluster will be a set of sentences, without making any difference to which texts of the cluster those sentences belong to. This two probabilities P(S) and P(C|S) are combined through the Bayes Rule to obtain P(S|C). In the decoding stage a set of possible summaries will instantiate the Bayes Rule for obtaining the best summary (1). ) ( ) ( ) | ( ) | ( C P S P S C P C S P × = (1) In this work we will concentrate on the exploration of the channel model, P(C|S). For the moment, P(S) will be considered uniform among different clusters of texts. Similarly, P(C) will not be taken into account since it will be an observed value and, therefore, constant. In the context of MDS, we consider that \"noise\" could be elements that emerge from multi-document phenomena factors such as redundancy, complementarity and contradiction. For instance, a sentence from a summary could generate complementary, redundant and contradictory sentences in the original texts. We use CST to model these factors by means of semantic relations among sentences of multiple documents. For example, complementary information can be modeled by the \"Elaboration\" relation; redundant information can be modeled by relations like \"Equivalence\", \"Subsumption\", etc.; and contradiction can be modeled by the \"Contradiction\" relation. Besides Crossdocument relations, it can also be considered rhetorical information from RST. For this work, we will concentrate on a model based on Cross-document relations. We can formalize this generative process by establishing three initial conditions: A summary is a set of sentences SS={ SS 1 , …,SS n } The original texts from which each summary comes from form a cluster (group). This cluster is a set containing all the sentences of the original texts: CS= {CS 1 , …, CSm}. A set of MDS phenomena factors is given, F={F 1 , …,F z } To build this generative model, we consider having a parallel multi-document corpus containing clusters of texts annotated with CST relations, and their correspondent extractive summaries. Once we have the corpus available, P(C|S) is calculated by multiplying probabilities describing the chance of a sentence SSi to generate a quantity Nx of sentences through factor Fj. This is formulated in (2) ∏ = ∏ = = 1 1 ) , | ( ) | ( j i F SS N P S C P j i x (2) The value of P(Nx|SS i ,F j ) is obtained by dividing the number of summary sentences generating N sentences through factor F j. by the total number of summary sentences SS i in the corpus. A probability P(F j |SS i ) is associated to each probability, in order to express the chance of a summary sentence to be associated to the factor F j . This is obtained dividing the number of associated to F j by the total number of cluster sentences CS i generated by SS i . Another generative factor considered in our model is the location of the cluster sentences. For this, we associate a probability P(N y |SS i, Location), which expresses the chance of SS i generating a number N y of sentences at a particular location in the texts. For instance, three possible locations are considered: \"Begin\", \"Middle\" and \"End\". The first sentence of a text is considered to be located at \"Begin\", the last sentence is said to be located at \"End\", and all other sentences are located at \"Middle\" in the text. The value of P(N y |SS i, Location) is obtained diving the number of summary sentences generating N y cluster sentences at Location by the total number of summary sentences in the same Location. It is important to say that not all Cluster Sentences are generated by the factors mentioned above. For this reason, we introduce P(N z |None) which is the probability of N z sentences being generated without the influence of any of the factors mentioned above or by some still unknown factor. The value of P(N z |None) is obtained dividing the number of cluster sentences associated to none of the MDS factors, by the total number of cluster sentences. The union of all of the probabilities described above formulate P(C|S). This is shown in (3). ∏ ∏ × × × = j i None N P Location SS N P SS F P F SS N P S C P z i y i i i i x ) | ( ) , | ( ) , ( ) , | ( ) | ( (3) A brief example Let's consider an hypothetical corpus composed only by a two-text cluster on the topic of the earthquake of Japan. These texts and their CST relations are shown in Figure 2 . Text 1 <S1_T1> A tsunami spawned by one of the largest earthquakes ever recorded slammed Japan's eastern coast Friday, killing hundreds of people as it swept away boats and cars. <S2_T1> The magnitude-8.9 offshore quake unleashed the 23-foot tsunami and was followed by more than 50 aftershocks for hours. Text 2 <S1_T2> A massive quake hit northeast Japan on Friday, causing hundreds of deaths. <S2_T2> The earthquake resulted from thrust faulting on or near the subduction zone plate boundary. Figure 2. Example of Cluster of texts and CST Relations Lets also consider that the correspondent extractive summary for this one-cluster corpus is a summary composed of two sentences only: <S1_T2> and <S2_T2>. According to this, we learn the probabilities, which are the model parameters: It is important to notice that some probabilities will obtain value 0, since they may represent patterns that don't occur in the corpus. In this case, we may smooth those values by assigning a very small value close to 0, for example 0. 00001. Once we have these parameters trained, we do the decoding process. In this stage we generate all possible extractive summaries a given cluster and instantiate into the P(S|C) formula. For example, let's consider two candidate summaries each containing 1 sentence: <S1_T1> and <S2_T1> respectively:  After doing all the calculations, we obtain a value of 12.5×10 -11 for P(Summary1|C) and a value of 12.5×10 -12 for P(Summary2|C). In this example, Summary1 outperforms Summary2. ) None | 0 ( ) End , 1 _ 2 | 1 ( ) Middle , 1 _ 1 | 0 ( ) Begin , 1 _ 1 | 1 ( ) 1 _ 1 | ion Contradict ( ) ion Contradict , 1 _ 1 | 0 ( ) 1 _ 2 | arity Complement ( ) arity Complement , 1 _ 1 1 ( ) 1 _ 1 | ( ) , 1 _ 1 | 1 ( ) | P × × × × × × × × × = ) | 0 ( ) End , 1 _ 2 | 0 ( ) Middle , 1 _ 2 | 0 ( ) Begin , 1 _ 2 | 1 ( ) 1 _ 2 | ion Contradict ( ) ion Contradict , 1 _ 2 | 0 ( ) 1 _ 2 | arity Complement ( ) arity Complement , 1 _ 2 | 0 ( ) 1 _ 2 | Redundancy ( ) Redundancy , 1 _ 2 | 1 ( ) | Summary2 Final Remarks In this paper we have presented a generative approach for MDS using the Noisy-Channel model, semantic-discursive information provided by CST and some other superficial features such as sentence position. One of the main contributions of this theoretical model is that it allows exploring the process of summary generation by analyzing different MDS factors. In future works we intend to turn this initial idea into a more sophisticated model that includes rhetorical information as another way to explore information generation. We also plan to investigate the most adequate Language model for P(S). Finally, we will explore heuristics for the decoding process, since for every possible summary, the probability P(S|C) has to be calculated and, depending on the database size, this can be a very expensive task. Acknowledgements The authors are thankful to FAPESP, CAPES and CNPq for their support. ...",
    "abstract": "Multi-document summarization is the automatic production of a unique summary from a collection of texts. In this paper, we propose a statistical generative approach for multi-document summarization that combines simple information such as sentence position in the text and semantic-discursive information from CST (Cross-Document Structure Theory). In particular, we formulate the multi-document summarization task using a Noisy-Channel model.",
    "countries": [
        "Brazil"
    ],
    "languages": [],
    "numcitedby": "0",
    "year": "2011",
    "month": "",
    "title": "A Generative Approach for Multi-Document Summarization using Semantic-Discursive information"
}