{
    "article": "This paper presents the preparation, resources, results and analysis of the Infectious Diseases (ID) information extraction task, a main task of the BioNLP Shared Task 2011. The ID task represents an application and extension of the BioNLP'09 shared task event extraction approach to full papers on infectious diseases. Seven teams submitted final results to the task, with the highest-performing system achieving 56% F-score in the full task, comparable to state-of-the-art performance in the established BioNLP'09 task. The results indicate that event extraction methods generalize well to new domains and full-text publications and are applicable to the extraction of events relevant to the molecular mechanisms of infectious diseases. Introduction The Infectious Diseases (ID) task of the BioNLP Shared Task 2011 (Kim et al., 2011a ) is an information extraction task focusing on the biomolecular mechanisms of infectious diseases. The primary target of the task is event extraction (Ananiadou et al., 2010) , broadly following the task setup of the BioNLP'09 Shared Task (BioNLP ST'09) (Kim et al., 2009) . The task concentrates on the specific domain of two-component systems (TCSs, or two-component regulatory systems), a mechanism widely used by bacteria to sense and respond to the environment (Thomason and Kay, 2000) . Typical TCSs consist of two proteins, a membrane-associated sensor kinase and a cytoplasmic response regulator. The sensor kinase monitors changes in the environment while the response regulator mediates an adaptive response, usually through differential expression of target genes (Mascher et al., 2006) . TCSs have many functions, but those of particular interest for infectious disease researchers include virulence, response to antibiotics, quorum sensing, and bacterial cell attachment (Krell et al., 2010) . Not all TCS functions are well known: in some cases, TCSs are involved in metabolic processes that are difficult to precisely characterize (Wang et al., 2010) . TCSs are of interest also as drugs designed to disrupt TCSs may reduce the virulence of bacteria without killing it, thus avoiding the potential selective pressure of antibiotics lethal to some pathogenic bacteria (Gotoh et al., 2010) . Information extraction techniques may support better understanding of these fundamental systems by identifying and structuring the molecular processes underlying two component signaling. The ID task seeks to address these opportunities by adapting the BioNLP ST'09 event extraction model to domain scientific publications. This model was originally introduced to represent biomolecular events relating to transcription factors in human blood cells, and its adaptation to a domain that centrally concerns both bacteria and their hosts involves a variety of novel aspects, such as events concerning whole organisms, the chemical environment of bacteria, prokaryote-specific concepts (e.g. regulons as elements of gene expression), as well as the effects of biomolecules on larger-scale processes involving hosts such as virulence. Task Setting The ID task broadly follows the task definition and event types of the BioNLP ST'09, extending it with new entity categories, correspondingly broadening the scope of events, and introducing a new class of events, high-level biological processes. Entities The ID task defines five core types of entities: genes/gene products, two-component systems, regulons/operons, chemicals, and organisms. Following the general policy of the BioNLP Shared Task, the recognition of the core entities is not part of the ID task. As named entity recognition (NER) is considered in other prominent domain evaluations (Krallinger et al., 2008) , we have chosen to isolate aspects of extraction performance relating to NER from the main task of interest, event extraction, by providing participants with human-created gold annotations for core entities. These annotations are briefly presented in the following. Mentions of names of genes and their products (RNA and proteins) are annotated with a single type, without differentiating between subtypes, following the guidelines of the GENIA GGP corpus (Ohta et al., 2009) . This type is named PRO-TEIN to maintain consistency with related tasks (e.g. BioNLP ST'09), despite slight inaccuracy for cases specifically referencing RNA or DNA forms. Two-component systems, consisting of two proteins, frequently have names derived from the names of the proteins involved (e.g. PhoP-PhoR or SsrA/SsrB). Mentions of TCSs are annotated as TWO-COMPONENT-SYSTEM, nesting PROTEIN annotations if present. Regulons and operons are collections of genes whose expression is jointly regulated. Like the names of TCSs, their names may derive from the names of the involved genes and proteins, and are annotated as embedding PROTEIN annotations when they do. The annotation does not differentiate between the two, marking both with a single type REGULON-OPERON. In addition to these three classes relating to genes and proteins, the core entity annotation recognizes the classes CHEMICAL and ORGANISM. All mentions of formal and informal names of atoms, inorganic compounds, carbohydrates and lipids as well as organic compounds other than amino acid and nucleic acid compounds (i.e. gene/protein-related compounds) are annotated as CHEMICAL. Mentions of names of families, genera, species and strains as well as non-name references with comparable specificity are annotated as ORGANISM. Finally, the non-specific type ENTITY 1 is defined for marking entities that specify additional details of events such as the binding site in a BINDING event or the location an entity moves to in a LOCALIZATION event. Unlike the core entities, annotations of the generic ENTITY type are not provided for test data and must be detected by participants addressing the full task. Relations The ID task involves one relation, EQUIV, defining entities (of any of the core types) to be equivalent. This relation is used to annotate abbreviations and local aliases and it is not a target of extraction, but provided for reference and applied in evaluation, where references to any of a set of equivalent entities are treated identically. Events The primary extraction targets of the ID task are the event types summarized in Table 1 . These are a superset of those targeted in the BioNLP ST'09 and its repeat, the 2011 GE task (Kim et al., 2011b) . This design makes it possible to study aspects of domain adaptation by having the same extraction targets in two subdomains of biomedicine, that of transcription factors in human blood cells (GE) and infectious diseases. The events in the ID task extend on those of GE in the inclusion of additional entity types as participants in previously considered event types and the introduction of a new type, PROCESS. We next briefly discuss the semantics of these events, defined (as in GE) with reference to the communitystandard Gene Ontology (Ashburner et al., 2000) . We refer to (Kim et al., 2008; Kim et al., 2009) for the ST'09/GE definitions. 1 : Event types and their arguments. The type of entity allowed as argument is specified in parenthesis. \"Core entity\" is any of PROTEIN, TWO-COMPONENT-SYSTEM, REGULON-OPERON, CHEMICAL, or ORGANISM. Arguments that can be filled multiple times marked with \"+\", non-mandatory core arguments with \"?\" (all additional arguments are non-mandatory). The definitions of the first four types in Table 1 are otherwise unchanged from the ST'09 definitions except that GENE EXPRESSION and TRANSCRIP-TION extend on the former definition in recognizing REGULON-OPERON as an alternative unit of expression. LOCALIZATION, taking only PROTEIN type arguments in the ST'09 definition, is allowed to take any core entity argument. This expanded definition remains consistent with the scope of the corresponding GO term (GO:0051179). BINDING is similarly extended, giving it a scope largely consistent with GO:0005488 (binding) but also encompassing GO:0007155 (cell adhesion) (e.g. a bacterium binding another) and protein-organism binding. The three regulation types (REGULATION, POSITIVE REGULATION, and NEGATIVE REGULA-TION) likewise allow the new core entity types as arguments, but their definitions are otherwise unchanged from those in ST'09, that is, the GENIA ontology definitions. As in these resources, regulation types are used not only for the biological sense but also to capture statements of general causality (Kim et al., 2008) . As in ST'09, all events of types discussed above require a Theme argument: only events involving an explicitly stated theme (of an appropriate type) should be extracted. All other arguments are optional. The PROCESS type, new to ID, is used to annotate high-level processes such as virulence, infection and resistance that involve infectious organisms. This type differs from the others in that it has no mandatory arguments: the targeted processes should be ex-tracted even if they have no explicitly stated participants, reflecting that they are of interest even without the further specification. When stated, the involved participants are captured using the generic role type Participant. Figure 1 shows an illustration of some of the the ID task extraction targets. We term the first five event types in Table 1 taking exactly one Theme argument as their core argument simple events. In analysis we further differentiate non-regulation events (the first seven) and regulation (the last three), which is known to represent particular challenges for extraction in involving events as arguments, thus creating nested event structures. Event modifications The ID task defines two event modification extraction targets, NEGATION and SPECULATION. These modifications mark events as being explicitly negated (e.g. virB is not expressed) or stated in a speculative context (e.g. virB may be expressed). Both may apply simultaneously. The modification definitions are identical to the ST'09 ones, including the representation in which modifications (unlike events) are not assigned text bindings. Data The ID task data were newly annotated for the BioNLP Shared Task and are not based on any previously released resource. Annotation was performed by two teams, one in Tsujii laboratory (University of Tokyo) and one in Virginia Bioinformatics Institute (Virginia Tech). The entity and event annotation  design was guided by previous studies on NER and event extraction in a closely related domain (Pyysalo et al., 2010; Ananiadou et al., 2011) . Document selection The training and test data were drawn from the primary text content of recent full-text PMC open access documents selected by infectious diseases domain experts (Virginia Tech team) as representative publications on two-component regulatory systems. Table 2 presents some characteristics of the corpus composition. To focus efforts on natural language text likely to express novel information, we excluded tables, figures and their captions, as well as methods sections, acknowledgments, authors' contributions, and similar meta-content. Annotation Annotation was performed in two primary stages, one for marking core entities and the other for events and secondary entities. As a preliminary processing step, initial sentence segmentation was performed with the GENIA Sentence Splitter 2 . Segmentation errors were corrected during core entity annotation. Core entity annotation was performed from the basis of an automatic annotation created using selected existing taggers for the target entities. The following tools and settings were adopted, with parameters tuned on initial annotation for two documents: PROTEIN: NeMine (Sasaki et al., 2008) trained on the JNLPBA data (Kim et al., 2004) with threshold 0.05, filtered to only GENE and PROTEIN types. ORGANISM: Linnaeus (Gerner et al., 2010) with \"variant matching\" for species names variants. CHEMICAL: OSCAR3 (Corbett and Murray-Rust, 2006) with confidence 90%. TWO-COMPONENT-SYSTEM: Custom regular expressions. Initial automatic tagging was not applied for entities of the REGULON-OPERON type or the generic ENTITY type (for additional event arguments). All automatically generated annotations were at least confirmed through manual inspection, and the majority of the automatic annotations were revised in manual annotation. Table 3 summarizes the tagging performance of the automatic tools as measured against the final human-annotated training and development datasets. 3  Annotation for the task extraction targets -events and event modifications -was created entirely manually without automatic annotation support to avoid any possible bias toward specific extraction methods or approaches. The Tsujii laboratory team orga- nized the annotation effort, with a coordinating annotator with extensive experience in event annotation (TO) leading annotator training and annotation scheme development. Detailed annotation guidelines (Pyysalo et al., 2011) extending on the GE-NIA annotation guidelines were developed jointly with all annotators and refined throughout the annotation effort. Based on measurements of interannotator consistency between annotations independently created by the two teams, made throughout annotator training and primary annotation (excluding final corpus cleanup), we estimate the consistency of the final entity annotation to be no lower than 90% F-score and that of the event annotation to be no lower than 75% F-score for the primary evaluation criteria (see Section 4). Datasets and statistics Initial annotation was produced for the selected sections (see Section 3.1) in 33 full-text articles, of which 30 were selected for the final dataset as representative of the extraction targets. These documents were split into training, development and test sets of 15, 5 and 10 documents, respectively. Participants were provided with all training and development set annotations and test set core entity annotations. The overall statistics of the datasets are given in Table 4 . As the corpus consists of full-text articles, it contains a somewhat limited number of articles, but in other terms it is of broadly comparable size to the largest of the BioNLP ST corpora: the corpus word count, for example, corresponds to that of a corpus of approximately 800 PubMed abstracts, and the core entity count is comparable to that in the ST'09 data. However, for reasons that may relate in part to the domain, the event count is approximately a third of that for the ST'09 data. In addition to having less training data, the entity/event ratio is thus considerably higher (i.e. there are more candidates for each true target), suggesting that the ID data could be expected to provide a more challenging extraction task. Evaluation The performance of participating systems was evaluated in terms of events using the standard precision/recall/F-score metrics. For the primary evaluation, we adopted the standard criteria defined in the BioNLP'09 shared task. In brief, for determining whether a reference annotation and a predicted annotation match, these criteria relax exact matching for event triggers and arguments in two ways: matching of text-bound annotation (event triggers and ENTITY type entities) allows limited boundary variation, and only core arguments need to match in nested event arguments for events to match. For details of the matching criteria, please refer to Kim et al. (2009) . The primary evaluation for the task requires the extraction of all event arguments (both core and additional; see Table 1 ) as well as event modifications (NEGATION and SPECULATION). This is termed the full task. We additionally report extraction results for evaluation where both the gold standard reference data and the submission events are reduced to only core arguments, event modifications are removed, and resulting duplicate events removed. We term this the core task. In terms of the subtask division applied in the BioNLP'09 Shared Task and the GE task of 2011, the core task is analogous to subtask 1 and the full task analogous to the combination of subtasks 1-3. Results Participation Final results to the task were successfully submitted by seven participants. Table 5 summarizes the information provided by the participating teams. We note that full parsing is applied in all systems, with the specific choice of the parser of Charniak and Johnson (2005) with the biomedical domain model of McClosky (2009) and conversion into the Stanford Dependency representation (de Marneffe et al., 2006 ) being adopted by five participants. Further, five of the seven systems are predominantly machine learning-based. These can be seen as extensions of trends that were noted in analysis of the BioNLP  ST'09 participation. In system design choices, we note an indication of increased use of joint models as opposed to pure pipeline designs, with the three highest-ranking systems involving a joint model. Several participants compiled dictionaries of event trigger words and two dictionaries of hedge words from the data. Four teams, including the three top-ranking, used the GE task corpus as supplementary material, indicating that the GE annotations are largely compatible with ID ones (see detailed results below). This is encouraging for future applications of the event extraction approach: as manual annotation requires considerable effort and time, the ability to use existing annotations is important for the feasibility of adaptation of the approach to new domains. While several participants made use of supporting syntactic analyses provided by the organizers (Stenetorp et al., 2011) , none applied the analyses for supporting tasks, such as coreference or entity relation extraction results -at least in cases due to time constraints (Kilicoglu and Bergler, 2011) . Evaluation results Table 6 presents the primary results by event type, and Table 7 summarizes these results. The full task requires the extraction of additional arguments and event modifications and involves multiple novel challenges from previously addressed domain tasks including a new subdomain, full-text documents, several new entity types and a new event category. Nevertheless, extraction performance for the top systems is comparable to the state-of-the-art results for the established BioNLP ST'09 task (Miwa et al., 2010) as well as its repetition as the 2011 GE task (Kim et al., 2011b) , where the highest overall result for the primary evaluation criteria was also 56% Fscore for the FAUST system (Riedel et al., 2011) . This result is encouraging regarding the ability of the extraction approach and methods to generalize to new domains as well as their applicability specifically to texts on the molecular mechanisms of infectious diseases. We note that there is substantial variation in the relative performance of systems for different entity types. For example, Stanford (McClosky et al., 2011) has relatively low performance for simple events but achieves the highest result for PROCESS, while UTurku (Björne and Salakoski, 2011) results show roughly the reverse. This suggests further potential for improvement from system combinations. The best performance for simple events and for PROCESS approaches or exceeds 70% F-score, arguably approaching a sufficient level for user-facing applications of the extraction technology. By contrast, BINDING and regulation events, found challenging in ST'09 and GE, remain problematic also in the ID task, with best overall performance below 50% F-score. Only two teams, UTurku and Con-cordU (Kilicoglu and Bergler, 2011) , attempted to extract event modifications, with somewhat limited performance. The difficulty of correct extraction of event modifications is related in part to the recursive nature of the problem (similarly as for nested regulation events): to extract a modification correctly, the modified event must also be extracted correctly. Further, only UTurku predicted any instances of secondary arguments. Thus, teams other than UTurku and ConcordU addressed only the core task extraction targets. With the exception of ConcordU, all systems clearly favor precision over recall (Table 7 ), in many cases having over 15% point higher precision than recall. This a a somewhat unexpected inversion, as the ConcordU system is one of the two rule-based in the task, an approach typically associated with high precision. The five top-ranking systems participated also in the GE task (Kim et al., 2011b) , which involves a subset of the ID extraction targets. This allows additional perspective into the relative performance of the systems. While there is a 13% point spread in overall results for the top five systems here, in GE all these systems achieved F-scores ranging between 50-56%. The results for FAUST, UMass and Stanford were similar in both tasks, while the ConcordU result was 6% points higher for GE and the UTurku result over 10% points higher for GE, ranking third after FAUST and UMass. These results suggest that while the FAUST and UMass systems in particular have some systematic (e.g. architectural) advantage at both tasks, much of the performance difference observed here between the top three systems and those of ConcordU and UTurku is due to strengths or weaknesses specific to ID. Possible weaknesses may relate to the treatment of multiple core entity types (vs. only PROTEIN in GE) or challenges related to nested entity annotations (not appearing in GE). A possible ID-specific strength of the three top-ranking systems is the use of GE data for training: Riedel and McCallum (2011) could potentially be applied also with other systems, an experiment that could further clarify the relative strengths of the various systems. The top-ranking five systems all participated also in the EPI task (Ohta et al., 2011) , for which UTurku ranked first with FAUST having comparable performance for the core task. While this supports the conclusion that ID performance differences do not reflect a simple universal ranking of the systems, due to many substantial differences between the ID and EPI setups it is not straightforward to identify specific reasons for relative differences to performance at EPI. Table 8 summarizes the core task results. There are only modest and largely consistent differences to the corresponding full task results, reflecting in part the relative sparseness of additional arguments: in the training data, for example, only approximately 3% of instances of event types that can potentially take additional arguments had at least one additional argument. While event modifications represent a further 4% of full task extraction targets not required for the core task, the overall low extraction performance for additional arguments and modifications limits the practical effect of these annotation categories on the performance difference between systems addressing only the core targets and those addressing the full task. Discussion and Conclusions We have presented the preparation, resources, results and analysis of the Infectious Diseases (ID) task of the BioNLP Shared Task 2011. A corpus of 30 full-text publications on the two-component systems subdomain of infectious diseases was created for the task in a collaboration of event annotation and domain experts, adapting and extending the BioNLP'09 Shared Task (ST'09) event representation to the domain. Seven teams submitted final results to the ID task. Despite the novel challenges of full papers, four new entity types, extension of event scopes and the introduction of a new event category for high-level processes, the highest results for the full ID task were comparable to the state-of-the-art performance on the established ST'09 data, showing that the event extraction approach and present systems generalize well and demonstrating the feasibility of event extraction for the infectious diseases domain. Analysis of results suggested further opportunities for improving extraction performance by combining the strengths of various systems and the use of other event resources. The task design takes into account the needs of supporting practical applications, and its results and findings will be adopted in future development of the Pathosystems Resource Integration Center 4 (PATRIC). Specifically, PATRIC will combine domain named entity recognition and event extraction to mine the virulence factor literature and integrate the results with literature search and retrieval services, protein feature analysis, and systems such as Disease View. 5 Present and future advances at the ID event extraction task can thus assist biologists in efforts of substantial public health interest. The ID task will be continued as an open shared task challenge with data, supporting resources, and evaluation tools freely available from the shared task site, http://sites.google. com/site/bionlpst/. Acknowledgments This work was supported by Grant-in-Aid for Specially Promoted Research (MEXT, Japan). This project has been funded in whole or in part with Federal funds from the National Institute of Allergy and Infectious Diseases, National Institutes of Health, Department of Health and Human Services, under Contract No. HHSN272200900040C, awarded to BWS Sobral.",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 1.0,
        "foundation": 0.0,
        "none": 0.0
    },
    "reasoning": "Reasoning: The acknowledgments section of the article mentions support from Grant-in-Aid for Specially Promoted Research (MEXT, Japan), which is a government funding program, and Federal funds from the National Institute of Allergy and Infectious Diseases, National Institutes of Health, Department of Health and Human Services, under a specific contract. These indicate funding from research agencies. There is no mention of defense, corporate, or foundation funding.",
    "abstract": "This paper presents the preparation, resources, results and analysis of the Infectious Diseases (ID) information extraction task, a main task of the BioNLP Shared Task 2011. The ID task represents an application and extension of the BioNLP'09 shared task event extraction approach to full papers on infectious diseases. Seven teams submitted final results to the task, with the highest-performing system achieving 56% F-score in the full task, comparable to state-of-the-art performance in the established BioNLP'09 task. The results indicate that event extraction methods generalize well to new domains and full-text publications and are applicable to the extraction of events relevant to the molecular mechanisms of infectious diseases.",
    "countries": [
        "Japan",
        "China",
        "United States",
        "United Kingdom"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "53",
    "year": 2011,
    "month": "June",
    "title": "Overview of the Infectious Diseases ({ID}) task of {B}io{NLP} Shared Task 2011"
}