{
    "framing_question": "Who are the intended users of the work described in the paper, if any?",
    "response": "The intended users of the work described in the paper are researchers in the field of Natural Language Processing (NLP), specifically those working on unsupervised semantic role induction. The paper presents a novel unsupervised approach to semantic role labeling that uses a generative Bayesian model, which integrates the concept of verb classes into the model. This approach outperforms a strong baseline on French and achieves results comparable to the state-of-the-art unsupervised approaches on English, making it a valuable contribution to the field of NLP.",
    "article": "This paper introduces a novel unsupervised approach to semantic role induction that uses a generative Bayesian model. To the best of our knowledge, it is the first model that jointly clusters syntactic verbs arguments into semantic roles, and also creates verbs classes according to the syntactic frames accepted by the verbs. The model is evaluated on French and English, outperforming, in both cases, a strong baseline. On English, it achieves results comparable to state-of-the-art unsupervised approaches to semantic role induction. Introduction and background Semantic Role Labeling (SRL) is a major task in Natural Language Processing which provides a shallow semantic parsing of a text. Its primary goal is to identify and label the semantic relations that hold between predicates (typically verbs), and their associated arguments (Màrquez et al., 2008) . The extensive research carried out in this area resulted in a variety of annotated resources, which, in time, opened up new possibilities for supervised SRL systems. Although such systems show very good performance, they require large amounts of annotated data in order to be successful. This annotated data is not always available, very expensive to create and often domain specific (Pradhan et al., 2008) . There is in particular no such data available for French. To bypass this shortcoming, \"annotation-by-projection\" approaches have been proposed (Pado and Lapata, 2006) which in essence, (i) project the semantic annotations available in one language (usually English), to text in another language (in this case French); and (ii) use the resulting annotations to train a semantic role labeller. Thus Pado and Pitel (2007) show that the projection-based annotation framework permits bootstrapping a semantic role labeller for FrameNet which reaches an F-measure of 63%; and van der Plas et al. (2011) show that training a joint syntactic-semantic parser based on the projection approach permits reaching an F-measure for the labeled attachment score on PropBank annotation of 65%. Although they minimize the manual effort involved, these approaches still require both an annotated source corpus and an aligned target corpus. Moreover, they assume a specific role labeling (e.g., PropBank, FrameNet or VerbNet roles) and are not generally portable from one framework to another. These drawbacks with supervised approaches motivated the need for unsupervised methods capable of exploiting large amounts of unannotated data. In this context several approaches have been proposed. Swier and Stevenson (2004) were the first to introduce unsupervised SRL in an approach that used the VerbNet lexicon to guide unsupervised learning. Grenager and Manning (2006) proposed a directed graphical model for role induction that exploits linguistic priors for syntactic and semantic inference. Following this work, Lang and Lapata (2010) formulated role induction as the problem of detecting alternations and mapping non-standard linkings to cannonical ones, and later as a graph partitioning problem in (Lang and Lapata, 2011b) . They also proposed an algorithm that uses successive splits and merges of semantic roles clusters in order to improve their quality in (Lang and Lapata, 2011a) . Finally, Titov and Klementiev (2012) , introduce two new Bayesian models that treat unsupervised role induction as the clustering of syntactic argument signatures, with clusters corresponding to semantic roles, and achieve the best state-of-the-art results. In this paper, we propose a novel unsupervised approach to semantic role labeling that differs from previous work in that it integrates the notion of verb classes into the model (by analogy with VerbNet, we call these verb classes, frames). We show that this approach gives good results both on the English PropBank and on a French corpus annotated with VerbNet style semantic roles. For the English PropBank, although the model is more suitable for a framework that uses a shared set of role labels such as VerbNet, we obtain results comparable to the state-of-the-art. For French, the model is shown to outperform a strong baseline by a wide margin. Probabilistic Model As mentioned in the introduction, semantic role labeling comprises two sub-tasks: argument identification and role induction. Following common practice (Lang and Lapata, 2011a; Titov and Klementiev, 2012) , we assume oracle argument identification and focus on argument labeling. The approach we propose is an unsupervised generative Bayesian model that clusters arguments into classes each of which can be associated with a semantic role. The model starts by generating a frame assignment to each verb instance where a frame is a clustering of verbs and associated roles. Then, for each observed verb argument, a semantic role is drawn conditioned on the frame. Finally, the word and dependency label of this argument are generated. The model admits a simple Gibbs algorithm where the number of latent variables is proportional to the number of roles and frames to be clustered. There are two key benefits of this model architecture. First, it directly encodes linguistic intuitions about semantic frames: the model structure reflects the subcategorisation property of the frame variable, which also groups verbs that share the same set of semantic roles, something very close to the VerbNet notion of frames. Second, by ignoring the \"verbspecific\" nature of PropBank labels, we reduce the need for a large amount of data and we better share evidence across roles. In addition, because it is unsupervised, the model is independent both of the language and of the specific semantic framework (since no inventory of semantic role is a priori chosen). Model description The goal of the task is to assign argument instances to clusters, such that each argument cluster represents a specific semantic role, and each role corresponds to one cluster. The model is represented in the form of a plate diagram in Figure 1 . The observed random variables are the verb V (lemma), its voice V o (active or passive), the words W (lemma) that are arguments of this verb, and the syntactic dependency labels D that link the argument to its head. There are two latent variables: the frame F that represents the class of the verb, and the role R assigned to each of its arguments. The parameters θ of all multinomial distributions are Dirichlet distributed, with fixed symmetric concentration hyper-parameter α. The frame plays a fundamental role in this setting, since it intends to capture classes of verbs that share similar distributions of role arguments. The model's generative story is described next, followed by a description of the inference algorithm used to apply the model to an unannotated corpus. Generative story For each verb instance, the proposed model first generates a frame cluster, a voice (active or passive), and then a verb lemma from the distribution of verbs in this frame. The number of arguments is assumed fixed. For each argument, a role is sampled conditioned on the frame. Then, a word is sampled from the distribution of words associated to this role, and finally a dependency label is generated, conditioned both on the role and the voice. All multinomial parameters are collapsed, and thus not sampled. All Dirichlet hyper-parameters are assumed constant. To identify words, we use either word lemmas or part-of-speech tags. In order to avoid data sparseness issues, we consider the word lemma only in cases where there are more than 9 instances of the word lemma in the corpus. Otherwise, if the number of word lemma instances is less than 10, we use the part-of-speech tags. Learning and Inference A collapsed Gibbs sampler is used to perform posterior inference on the model. Initially, all frames F i are sampled randomly from a uniform distribution, while the roles R i,j are assigned either randomly or following the deterministic syntactic function baseline, which simply clusters predicate arguments according to their syntactic function. This function is described in detail in Section 3. The Gibbs sampling algorithm samples each latent variable (F i and R i,j ) in turn according to its posterior distribution conditioned on all other instances of this variable (noted F ¬i and R ¬(i,j) respectively) and all other variables. These posteriors are detailed next. In the following, R i,j represents the random variable for the j th role of the i th verb in the corpus: its value is R i,j = r i,j at a given iteration of the sampling algorithm. nr f,r is the count of occurrences of (F i = f, R i,j = r) in the whole corpus, excluding the i th instance when the superscript −i is used. A star * matches any possible value. The joint probability over the whole corpus with collapsed multinomial parameters is: p(F, R, V, W, D, V o|α) = N f i=1 Γ(nf i + α F ) Γ( N f i=1 nf i + α F ) Γ( N f i=1 α F ) N f i=1 Γ(α F ) × N f i=1 Nv j=1 Γ(nv i,j + α V ) Γ( Nv j=1 nv i,j + α V ) Γ( Nv j=1 α V ) Nv j=1 Γ(α V ) × N f i=1 Nr j=1 Γ(nr i,j + α R ) Γ( Nr j=1 nr i,j + α R ) Γ( Nr j=1 α R ) Nr j=1 Γ(α R ) × Nvo i=1 Nr j=1 N d k=1 Γ(nd i,j,k + α D ) Γ( N d k=1 nd i,j,k + α D ) Γ( N d k=1 α D ) N d k=1 Γ(α D ) × N r i=1 N w j=1 Γ(nw i,j + α W ) Γ( Nw j=1 nw i,j + α W ) Γ( Nw j=1 α W ) N w j=1 Γ(α W ) × Nvo i=1 Γ(nvo i + α V o ) Γ( Nvo i=1 nvo i + α V o ) Γ( Nvo i=1 α V o ) Nvo i=1 Γ(α V o ) The posterior from which the frame is sampled is derived from the joint distribution as follows: p(F i = y|F ¬i , R, V, W, V o) (1) ∝ p(F, R, V, W, D, V o) p(F ¬i , R ¬i , V ¬i , W ¬i , D ¬i , V o ¬i ) = (nf −i y + α F ) ( N f z=1 nf −i z + α F ) × (nv −i y,v i + α V ) ( Nv j=1 nv −i y,j + α V ) × r∈r i, * nr +i r −1 x=0 (nr −i y,r + α R + x) M i x=0 ( Nr r=1 nr −i y,r + α R + x) where nr +i r is the count of occurrences of role r in the arguments of verb instance i (M i = r nr +i r ). The update equation for sampling the role becomes: p(R i,j = y|R ¬(i,j) , F, V, W, D, V o) (2) ∝ p(F, R, V, W, D, V o) p(F ¬i , V ¬i , R ¬(i,j) , W ¬(i,j) , D ¬(i,j) , V o ¬(i,j) ) = (nr −(i,j) f i ,y + α R ) ( Nr k=1 nr −(i,j) f i ,k + α R ) × (nd −(i,j) vo i ,y,d i,j + α D ) ( N d k=1 nd −(i,j) vo i ,y,k + α D ) × (nw −(i,j) y,w i,j + α W ) ( Nw k=1 nw −(i,j) y,k + α W ) After T iterations, the process is stopped and the expected value of the sampled frames and roles after the burn-in period (20 iterations) is computed. With deterministic (syntactic) initialization, T is set to 200, while it is set to 2000 with random initialization because of slower convergence. Evaluations and results We evaluate our model both on English to situate our approach with respect to the state of the art; and on French to demonstrate its portability to other languages. Common experimental setup The model's parameters have been tuned with a few rounds of trial-and-error on the English development corpus: For the hyper-parameters, we set α F = 0.5, α R = 1.e −3 , α V = 1.e −7 , α V o = 1.e −3 , α D = 1.e −8 and α W = 0.5. For the evaluation on French, we only changed the α F and α W parameters. In order to reflect the rather uniform distribution of verb instances across verb classes we set α F to 1. Moreover, we set α W to 0.001 because of the smaller number of words and roles in the French corpus. The number of roles and frames were chosen based on the properties of each corpus. We set number of roles to 40 and 10, and the number of frames to 300 and 60 for English and French respectively. As done in (Lang and Lapata, 2011a) and (Titov and Klementiev, 2012) , we use purity and collocation measures to assess the quality of our role induction process. For each verb, the purity of roles' clusters is computed as follows: P U = 1 N i max j |G j ∩ C i | where C i is the set of arguments in the i th cluster found, G j is the set of arguments in the j th gold class, and N is the number of argument instances. In a similar way, the collocation of roles' clusters is computed as follows: CO = 1 N j max i |G j ∩ C i | Then, each score is averaged over all verbs. In the same way as (Lang and Lapata, 2011a) , we use the micro-average obtained by weighting the scores for individual verbs proportionally to the number of argument instances for that verb. Finally the F1 measure is the harmonic mean of the aggregated values of purity and collocation: F 1 = 2 * CO * P U CO + P U Evaluations on French To evaluate our model on French, we used a manually annotated corpora consisting on sentences from the Paris 7 Treebank (Abeillé et al., 2000) , containing verbs extracted from the gold standard V-GOLD (Sun et al., 2010) selected and annotated with VerbNet-style thematic roles. In some cases, the annotated roles were obtained by merging some of the VerbNet roles (e.g., Actor, Actor1 and Actor2 are merged); or by grouping together classes sharing the same thematic grids. The resulting roles assignment groups 116 verbs into 12 VerbNet classes, each associated with a unique thematic grid. Table 1 shows the set of roles used and their relation to VerbNet roles. This constitutes our gold evaluation corpus. The baseline model is the \"syntactic function\" used for instance in (Lang and Lapata, 2011a) , which simply clusters predicate arguments according to the dependency relation to their head. This is a standard baseline for unsupervised SRL, which, although simple, has been shown difficult to outperform. As done in previous work, it is implemented by allocating a different cluster to each of the 10 most frequent syntactic relations, and one extra cluster for all the other relations. Evaluation results are shown in Table 2 . The proposed model significantly outperforms the deterministic baseline, which validates the unsupervised learning process. Evaluations on English We made our best to follow the setup used in previous work (Lang and Lapata, 2011a; Titov and Kle-mentiev, 2012) , in order to compare with the current state of the art. The data used is the standard CoNLL 2008 shared task (Surdeanu et al., 2008) version of Penn Treebank WSJ and PropBank. Our model is evaluated on gold generated parses, using the gold PropBank annotations. In PropBank, predicates are associated with a set of roles, where roles A2-A5 or AA are verb specific, while adjuncts roles (AM) are consistent across verbs. Besides, roles A0 and A1 attempt to capture Proto-Agent and Proto-Patient roles (Dowty, 1991) , and thus are more valid across verbs and verb instances than A2-A5 roles. Table 3 reports the evaluation results of the proposed model along with those of the baseline system and of some of the latest state-of-the-art results. We can first note that, despite our efforts to reproduce the same baseline, there is still a difference between our baseline (Synt.Func.) and the baseline reported in (Lang and Lapata, 2011a) (Synt.Func.(LL)) 2 . The other results respectively correspond to the Split Merge approach presented in (Lang and Lapata, 2011a) (Split Merge), the Graph Partitioning algorithm (Graph Part.) presented in (Lang and Lapata, 2011b) , and two Bayesian approaches presented in (Titov and Klementiev, 2012) , which achieve the best current unsupervised SRL results. The first such model (TK-Bay.1) clusters argument fillers and directly maps some syntactic labels to semantic roles for some adjunct like modifiers that are explicitly represented in the syntax, while the second model (TK-Bay.2) does not include these two features. Two versions of the proposed model are reported in the last rows of Table 3 : one with random (uniform) initialization of all variables, and the other with deterministic initialization of all R i from the syntactic function. Indeed, although many unsupervised system are very sensitive to initialization, we observe that in the proposed model, unsupervised inference reaches reasonably good performances even with a knowledge-free initialization. Furthermore, when initialized with the strong deterministic baseline, the model still learns new evidences and improves over the baseline to give comparable results to the best unsupervised state-of-the-art systems. Conclusions and future work We have presented a method for unsupervised SRL that is based on an intuitive generative Bayesian model that not only clusters arguments into semantic roles, but also explicitly integrates the concept of frames in SRL. Previous approaches to semantic role induction proposed some clustering of roles without explicitly focusing on the verb classes generated. Although there has been work on verb clustering, this is, to the best of our knowledge, the first approach that jointly considers both tasks. In this work in progress, we focused on the role induction task and we only evaluated this part, leaving the evaluation of verb classes as future work. We successfully evaluated the proposed model on two languages, French and English, showing, in both cases, consistent performances improvement over the deterministic baseline. Furthermore, its accuracy reaches a level comparable to that of the best state-of-the-art unsupervised systems. The model could be improved in many ways, and in particular by including some penalization term for sampling the same role for several arguments of a verb instance (at least for core roles). Moreover, we believe that our model better fits within a framework that allows roles sharing between verbs (or frames), such as VerbNet, and we would like to carry out a deeper evaluation on this concept. Acknowledgments The authors wish to thank Claire Gardent for her valuable suggestions and Ingrid Falk for providing the data for the evaluation on French.",
    "funding": {
        "military": 0.0,
        "corporate": 0.0,
        "research agency": 5.676965185941185e-06,
        "foundation": 1.5048518676730183e-06,
        "none": 0.999999091165773
    }
}