{
    "article": "Introduction The use of large-scale naturalistic data has been opening up new investigative possibilities for language acquisition studies, providing a basis for empirical predictions and for evaluations of alternative acquisition hypotheses. One widely used resource is CHILDES (MacWhinney, 1995) with transcriptions for over 25 languages of interactions involving children, with the English corpora available in raw, part-of-speech tagged, lemmatized and parsed formats (Sagae et al., 2010; Buttery and Korhonen, 2005) . With a recent increase in the availability of lexical and psycholinguistic resources and robust natural language processing tools, it is now possible to further enrich childlanguage corpora with additional sources of information. In this paper we describe the English CHILDES Verb Database (ECVD), which extends the original lexical and syntactic annotation of verbs in CHILDES with information about frequency, grammatical relations, semantic classes, and other psycholinguistic and statistical information. In addition, these corpora are organized in a searchable database that allows the retrieval of data according to complex queries that combine different sources of information. This database is also modular and can be straightforwardly extended with additional annotation levels. In what follows, we discuss the tools and resources used for the annotation ( §2), and conclude with a discussion of the implications of this initial work along with directions for future research ( §3). Linguistic and Statistical Properties The English CHILDES Verb Database contains information about the English corpora in CHILDES parsed using three different pipelines: (1) MEGRASP; (2) RASP; and (3) the CHILDES Treebank. In the first, made available as part of the CHILDES distribution 1 , the corpora are POS In the second pipeline, the RASP system (Briscoe et al., 2006) is used for tokenisation, tagging, lemmatization and parsing of the input sentences, outputting syntactic trees (in %ST) and grammatical relations (%GR). 3 In both examples each GR denotes a relation, along with its head and dependent: The third focuses on the Adam corpus from the Brown data set (Brown, 1973) and uses the Charniak parser with Penn Treebank style part of speech tags and output, followed by hand-curation, as described by Pearl and Sprouse (2012) : (S1 (SBARQ (WHNP (WP who)) (SQ (VP (COP is) (NP (NN that)))) (. ?))) The use of annotations from multiple parsers enables the combination of the complementary strengths of each in terms of coverage and accuracy, similar to inter-annotator agreement approaches. These differences are also useful for optimizing search patterns in terms of the source which produces the best accuracy for a particular case. Information about corpora sizes and the annotated portions for each of the parsers is displayed in table 1. The verbs in each sentence are also annotated with information about shared patterns of meaning and syntactic behavior from 190 fine-grained subclasses that cover 3,100 verb types (Levin, 1993) . This annotation allows searches defined in terms of verb classes, and include all sentences that contain verbs that belong to a given class. For instance, searching for verbs of running would return sentences containing not only run but also related verbs like slide, roll and stroll. Additional annotation of properties linked to language use and recognition include extrinsic factors such as word frequency and intrinsic factors such as the length of a word in terms of syllables; age of acquisition; imageability; and familiarity. Some of this annotation is obtained from the MRC Psycholinguistic Database (Coltheart, 1981) which contains 150,837 entries with information about 26 properties, although not all properties are available for every word (e.g. IMAG is only available for 9,240 words). For enabling complex search functionalities that potentially combine information from several sources, the annotated sentences were organized in a database, and Tables 2 and 3 list some of the available annotations. Given the focus on verbs, for search efficiency each sentence is indexed according to the verbs it contains. In addition, verbs and nouns are further annotated with information shown in table 3 whenever it is available in the existing resources. These levels of annotation allow for complex searches involving for example, a combination of information about a verb's lemma, target grammatical relations, and occurrence of Levin's classes in the corpora. Not all sentences have been successfully analyzed, and the comments field contains informa-  tion about the missing annotations and cases of near perfect matches that arise from the parsers using different heuristics for e.g. non-words, metacharacters and punctuation. These required more complex matching procedures for identifying the corresponding cases in the annotations of the parsers. Conclusions and future work This paper describes the construction of the English CHILDES Verb Database. It combines information from different parsing systems to capitalize on their complementary recall and precision strengths and ensure the accuracy of the searches. It also includes information about Levin's classes for verbs, and some psycholinguistic information for some of the words, like age of acquisition, familiarity and imageability. The result is a large-scale integrated resource that allows complex searches involving different annotation levels. This database can be used to inform analysis, for instance, about the complexity of the language employed with and by a child as her age increases, that can shed some light on discussions about the poverty of the stimulus. This is an ongoing project to make the annotated data available to the research community in a user-friendly interface that allows complex patterns to be specified in a simple way. Acknowledgements This research was partly supported by CNPq Projects 551964/2011-1, 202007/2010-3,",
    "abstract": "",
    "countries": [
        "Brazil"
    ],
    "languages": [
        "English"
    ],
    "numcitedby": "1",
    "year": "2012",
    "month": "April",
    "title": "An annotated {E}nglish child language database"
}