{
    "article": "This paper introduces our methodology for annotating variations in enunciative and modal commitment in a text. We first present the theoretical background of the study which puts the emphasis on the close interaction between time, aspect, modality and evidentiality (TAME) categories (and also markers). We then present our semantic resources which encompass not only lexical items, but also morphological inflections and syntactic constructions. We finally describe the first step of our global natural language processing (NLP) workflow which uses a syntactic analysis parser. Introduction Our paper concerns the design and development of lexical and grammatical resources for French in order to annotated textual segments in texts with regard to their modal and enunciative characteristics. The present study is part of a broader project (named ChronoLines 1 ) which deals with the generation of innovative interfaces to display information according to temporal criteria from newswire texts in French provided by the Agence France Presse (AFP). The main goal of this project is closely related to applications such as the construction of timelines from texts (e.g. Alonso and al. 2009) ; its originality, however, compared to current timelines, is that we aim to take explicitly into account the problem of different levels of temporal referencing. These levels are associated with the different strategies to manage enunciative and modal expression which can be identified within the texts. Along similar lines to the annotation of \"attributions\" and \"private states\" (Wilson and Wiebe, 2005) or the calculation of \"factuality degrees of events\" (Sauri and Pustejovsky, 2012) , we aim to take into account the fact that, independently of their calendar anchoring, situations can be presented as certain, fully accomplished, or only possible/probable, by an enunciator who can be the author of the text but who can also be another enunciator (explicitly named or not) from whom the author reports some content that he has heard, read, imagined. ... It should be noted that around 90% of newswire text sentences contain at least one clue of an epistemic modal and/or enunciative shift. In section 2, we present the theoretical background of the study. Section 3 details our methodology for detecting variations in enunciative and modal commitment in a text (via the detection of certain lexical and grammatical cues, including certain kinds of syntactic constructions) and then identifying embedded textual segments which correspond to these shifts/variations (thanks to a syntactic parser analysis). Section 4 describes the first step of our global natural language processing (NLP) methodology. Theoretical background: modality meaning and TAME categories The notion of modality, which is closely linked to the notion of evidentiality 2 , has been studied from many different perspectives: logic, philosophy and linguistics -see for example (Bybee and al., 1994; Palmer, 2001; Nuyts, 2006) . In the field of linguistics, modality can be considered from an enunciative perspective -see (Bally, 1935; Benveniste, 1966; Culioli, 1973) . From this perspective, which is the one we adopt here, the construction of an utterance (or a text) has to take into account certain language operations such as predication, discourse operations and operations of commitment3, the expression of which leaves a certain number of surface linguistic traces (or clues). The enunciator's degree of commitment to a predicative content introduces variations in aspect, time and modality and also what is called enunciative modalities, all marked in the utterance by traces that the enunciator leaves in the discourse. In the case of direct speech, these traces can manifest themselves in the introductory portion of the direct reported speech in different forms: they may indicate the enunciator's stance towards what is reported, describe the speaker's attitude towards what is being said (in general) or towards what the speaker himself is saying; or refer to the relationship between the speaker and the enunciator, etc. The linguistic act of reported speech permits the enunciator to indicate his/her commitment to what is said or written by another source. Thus, what is emphasized in an enunciative perspective is the intrinsic presence of the enunciator in every discourse production. This presence is mainly manifested via time, aspect, modal and/or evidential traces. These four kinds of linguistic traces refer to four kinds of intrinsically linked semantic categories (see the well-known acronym TAME). When only the categories of modality and evidentiality are considered, it can be said that the enunciator expresses different degrees of commitment to the truth of the propositional content. At an analytical and descriptive level, which is essential in annotation tasks, and which is, moreover, sensitive to a specific language, several questions arise: • what kinds of linguistic markers (even if they are most of the time ambiguous) can be considered as prototypical for each of 3 The term of commitment is a close counterpart to the French term \"prise en charge\" -see (De Brabanter and Dendale, 2008) . the TAME categories (let's see for example \"modal verbs\" (as must, …), \"hedging adverbs\" (as probably), \"reported speech verbs\" (as to say or to tell), …)? • how can markers that encode semantic instructions belonging to several TAME categories be handled? For example, certain tenses can play a role at all TAME levels -see for example (de Haan 1999, Hassler, 2010) • how can the four (cognitivo-linguistic ) operations that TAME categories refer to be ordered -see (Dik, 1997 )? • how can a textual perspective of TAME categories be taken into account, that is to say how can these categories be explored beyond the syntactic level of utterances? This problem has been very rarely addressed in theoretical linguistics and in NLP approaches -see for example (Battistelli, 2011) • how should one deal with the problem of the interaction of different epistemic modality markers, at a sentence level -see (Sauri et Pustejovsky, 2012 ) -and at a textual level? Note that this question directly leads to the question of possibly different levels of predication. Let's take the case of sentence level. One sentence frequently expresses more than one situation (predicative content) and each of the situations can be qualified with a different degree of certainty; • how can one deal with the problem, closely linked to the previous one, of the scope of modality markers, and therefore of the length of \"modalised\" textual segments? In order to analyze the highly complex interaction between the categories of modality and evidentiality, our methodology first focuses on detecting these \"modalised\" textual segments and on analyzing their hierarchical organization. This is what we choose to present in this paper. From our enunciative perspective, this leads us to take a look at the text in its enunciative and/or modal variations. Indeed, throughout a text (even within a single sentence), enunciative and modal values tend to vary. For example, encountering a reporting verb such as dire/to say, répondre/to answer, annonce/to announce, introduces a variation in the enunciative value but no variation in the modal value; an adverb such as sûrement/ probably, probablement/likely, introduces a variation in the modal value; a verb such as prétendre/to claim, croire/to believe, imaginer/to imagine, introduces a variation in both the modal and the enunciative value. In the next section, we detail the methodology developed to analyze these variations. Methodology for analyzing discursive heterogeneity by detecting E_M segments Any discourse (and by extension even a discourse comprising a single sentence) is necessarily presented from the viewpoint of a human cognizer (in our case, the journalist who writes the newswire). Thus, any discourse always has a default source who is its author. Moreover, as explained in the previous section, we consider modality from an enunciative perspective. Any newswire can then be considered as a textual segment having \"default\" enunciative (= 'author') and modal (= 'true', based on the Gricean maxim of quality which testifies that sources are trustworthy) values. Most of the time, in a text (even within a single sentence), textual segments which have different enunciative and modal values can be identified. This is due to the complex mechanisms of interaction between semantic clues that we outlined in section 2. Our methodology consists in focusing on the tracking on semantic clues which have to be taken into account in order to identify different enunciative and modal textual segments. This kind of approach to modal meaning focuses on discursive heterogeneity and also makes it possible to deal with the interaction between Modality and other related linguistic categories (Time, Aspect and Evidentiality). Furthermore, we believe that developing such an approach could -beyond the applicative interest in information retrieval (cf. ChronoLines already mentioned) -help to achieve a better understanding of this complex TAME interaction at a discursive level, i.e. at a level where pertinent textual units are not only sentences or utterances. In the remainder of the article, we will give just examples of sentences, but we wish to emphasize that our methodology also enables a discourse level analysis. We propose to set up a NLP workflow (see Fig. 1 ) that automates the annotation process of the text into textual segments that have enunciative and modal features. These textual segments will be called from now on E_M segments. In this workflow, we distinguish two main steps: Step 1: concerns the E_M splitter module which produces annotation of a text as a succession or imbrication of E_M segments. It uses semantic clues (organized in E_M semantic resources database) that lead to the opening of new E_M segments; it also uses a syntactic parser to calculate the length of an E_M segment at the sentence level; Step 1bis: aims at linking different sentences in a single E_M segment if they denote a homogeneous discourse unit; Step 2: the E_M value assigner determines the values of E_M segments. Semantic clues are again used insofar as some of them have an influence only on the enunciative value of an E_M segment, or only on its modal value, or on both its enunciative and modal value. Figure 2 shows as embedded boxes the E_M segments (from 'E_M_1_dft' to 'E_M_4') that we want the final system to produce for the sentence in example 1. The involved semantic clues (from c=1 to 3) are highlighted.  In the next section, we detail Step1 and then focus on the building of semantic resources and the relevance of using a syntactic parser to identify E_M segments. Step1bis and Step2 will be dealt with in other papers. Using semantic resources and a syntactic parser analysis to detect E_M segments The identification of an E_M segment in the text is, as we have just seen, founded on the tracking of semantic clues that open a new segment. In other words, every variation in the enunciative and/or modal meaning introduces a new E_M segment. Section 4.1 describes the organization of semantic resources and illustrates them with some examples. Then in section 4.2 we explain how we use the syntactic analysis produced by the parser. Semantic resources Semantic clues that are able to open a new E_M segment can be (see Fig. 3 ): lexical items (verbs of propositional attitude, speech verbs, nouns, adverbs, etc.), morphological inflections (for example tense inflections like in French conditionnel and imparfait tenses 5 ), or specific syntactic constructions (subordinate clauses of condition, prepositional constructions). All kinds of them are used during Step1 in order to detect and split E_M segments. Note that these resources are also organized in the database at a deeper level in order to be used during Step2 to calculate the precise E_M segments values.  • Building lexical resources The development of these lexical resources is based on the most frequent lexical items that occur in press AFP newswires. To find these most frequent items, we used a corpus of 20,000 texts (from the years 2010 and 2011). We then generated the frequency of the lemmatized corpus to find the most frequent lexical items. Our goal is to build resources that can cover at least 80% of the corpus. This coverage is reached with the 320 most frequent verbs. From this list of 320 verbs, we manually sorted 140 verbs which introduce a modal and/or an enunciative variation. We used the same technique to build the list of 15 adverbs and the list of 10 adjectives. For predicative nouns, we had to use another method because the number of nouns was too high and we also wanted to keep only predicative nouns. To solve this issue, we used Verbaction 6 which is a lexicon of nouns morphologically related to verbs. For each of our 140 verbs, we searched whether a related noun existed in Verbaction (this task has been automated). We obtained a list of nouns which can potentially be clues but the results then had to be manually filtered as some items were irrelevant for our work. For example Verbaction gives two predicative nouns coming from the verb accepter/to accept: acceptation/acceptance and acception/acceptation, and we decided to keep only the first noun (acceptation/acceptance). After this filtering process, the list of predicative nouns comprised 80 items. Let's mention we are currently still exploring additional resources, in particular by integrating syntactic and semantic information about verbs from (Hadouche and Lapalme, 2010) . Morphological inflections Several morphological inflections in French form another type of clue implied in the opening of a new E_M segment; for example, the French conditional tense, which has the morphological inflection (-rais, -rais,-rait,-rions,-riez,-raient) . This tense is prototypical of French journalistic practice. It introduces uncertainty about the source of the information and/or about the epistemic modal status of the information. In example ( 7 ), the verb form aurait annoncé/would have announced 7 is composed of two clues. The clue annoncé/announced introduces a new enunciative source 'Jean' (distinct from the journalist source). The other clue is the morphological inflection \"-rait\". This morpheme is interpreted as a trace of the journalist's lack of commitment: the hearer/reader interprets this trace as an ambiguity marker concerning the true source of information (is it 'Jean' or someone else who announced…?) and/or the modal status of the E_M segment le départ de Paul/Paul's departure. The ambiguity about the origin of the uncertainty (which can be enunciative and/or modal) implied by the use of the French conditionnel tense comes across particularly clearly when we look at the possible translations of the sentence in English. The translation we have chosen (Jean is said to have announced Paul's departure ) shows that the ambiguity concerns the source and not the epistemic value of le départ de Paul/Paul's departure. However, this interpretation really depends on the context and it is often difficult in French to decide which of the two interpretations is intended. We will therefore simply consider that the French conditionnel tense leads to the opening of a new E_M segment, with indetermination concerning the origin of the journalist's lack of commitment. Syntactic constructions The third class of clues contains syntactic constructions which are able to open E_M segments. • Subordinate clauses of condition A subordinate clause of condition indicates in which conditions the propositional content of the main clause is realized. The main clause is therefore considered as an E_M segment and the subordinate clause as a semantic (modal) clue. In example (8), the subordinate clause si Paul n'accepte pas/if Paul does not accept acts as a clue opening the E_M segment associated to the main clause. Example (9) shows a similar case with a subordinate clause introduced by the conjunction à condition de/on condition that. From the observation of all these kinds of contexts, we have developed the general rule RULE_G1 which makes it possible to delimit an E_M segment: if a new E_M segment has been opened due to the presence of one predicative clue, then all the complements of this predicative clue except its modifiers 8 (e.g. temporal modifiers, purpose clause modifiers, etc.) are part of this new E_M segment. Furthermore, since any text (taken as a whole) is considered as an E_M segment having \"default\" enunciative and modal features, the text is always associated to E_M_1_dft and this constitutes the second general rule RULE_G2. To illustrate the application of these two general rules, let's return to the example of sentence (1) given above. Figure 2 illustrates both the syntactic relations produced by the parser (shown by arrows) and the semantic clues implied in the analysis (shown in dotted lines). The dotted boxes delimit the E_M segments we want the system to detect. In the case of figure 2 , the text comprises a single sentence, and is thus associated to E_M_1_dft (RULE_G2 The E_M segment splitting system we have started to develop (named E_M splitter) takes into account the two general rules described above. We are currently working on E_M value assigner module (see Fig. 1 ) which is dedicated to assign values to the E_M segments. This module uses the deeper level of semantic resources organization (see Fig. 3 ), that is to say the distinction between intrinsic modal and/or enunciative meaning of clues. It uses also a heritage mechanism able to apprehend segment embedding (and thus the interaction between several clues). Figure 4 . Using syntactic information to split E_M segments Conclusion In this paper, we have focused on the different kinds of French resources that need to be involved in the annotation of textual segments according towhat is called in our enunciative theoretical background terminology -their enunciative and modal characteristics (hence the notion, and notation, of E_M segment). These two types of characteristics are involved both: • in an information retrieval purpose (when dealing with -or calculating -the factual status of situations described in a text, as for example in certain textual entailment applications, or when dealing with attributions and polarity, as for example in opinion or sentiment analysis applications); • and in a theoretical semantic purpose (when addressing the difficult matter of the shifting boundaries -either lexical or grammatical, and variously marked in different languages -between the notions of evidentiality and epistemic modality). Thus, in the methodology that we have proposed to explore modal meaning and its annotation, the precise E_M characteristics are deliberately not addressed in the first step, but only in the second step (cf. Step 2 in Fig. 1 ), when the task of delimiting textual segments has already been approached (cf. Step 1 in Fig. 1 ). As we have seen, the present paper focuses on the problem of splitting a text into textual segments, and it presents how we envisage combining E_M semantic resources and a dependency syntactic analysis parser results to achieve segmentation. We would like to point out that the way we build these semantic resources is quite original especially in an NLP perspective: firstly, because these resources encompass not only lexical items, but also morphological inflections and syntactic constructions (see section 4.1); secondly, because they aim to reflect some important theoretical investigations about the close interaction between TAME categories.",
    "abstract": "This paper introduces our methodology for annotating variations in enunciative and modal commitment in a text. We first present the theoretical background of the study which puts the emphasis on the close interaction between time, aspect, modality and evidentiality (TAME) categories (and also markers). We then present our semantic resources which encompass not only lexical items, but also morphological inflections and syntactic constructions. We finally describe the first step of our global natural language processing (NLP) workflow which uses a syntactic analysis parser.",
    "countries": [
        "France"
    ],
    "languages": [
        "French"
    ],
    "numcitedby": "4",
    "year": "2013",
    "month": "March",
    "title": "Analyzing modal and enunciative discursive heterogeneity: how to combine semantic resources and a syntactic parser analysis"
}