{
    "article": "This article aims to develop the subframe SENTENCING, which is part of the complex frame Knowledge Process frame in the Civil Procedural Law. Having the parent frame and its frame elements previously structured, we here elaborate the sentence subframe according to Frame Semantics and based on the FrameNet feature. To it so, we present the theory, the legal domain, the subframe sentence and annotation of real occurrences. Resumo. Este artigo objetiva desenvolver o subframe SENTENÇA, o qual é parte do complexo frame Processo de Conhecimento no Direito Processual Civil. Tendo o frame pai e seus elementos de frame previamente estruturados, elabora-se o subframe sentença seguindo a Semântica de Frames e baseandose no recurso FrameNet. Para tanto, aborda-se a Semântica de Frames, o domínio jurídico, o subframe sentença e anotam-se ocorrências reais. Introdução Construir frames e subframes, de acordo com os princípios da Semântica de Frames (doravante SF), exige, além da descrição de uma cena e definição de seus elementos constituintes, a descrição semântica e sintática, o estudo de elementos de frame (doravante EF), unidades lexicais (doravante UL) evocadoras, relação entre frames e anotação de um corpus para a verificação real das ocorrências. Projeto lexicográfico nesta perspectiva em língua portuguesa e segundo a pioneira FrameNet [Fillmore et al. 2003 ] é a FrameNet Brasil [Salomão 2009] Processo_de_conhecimento_no_direito_processual_civil [Minghelli, 2012] , descrevendo o subframe Sentença consoante a teoria da SF e com base no subframe Sentencing do recurso lexicográfico FrameNet 2 . Para tanto, estrutura-se este artigo da seguinte forma: na seção 2, trazem-se noções sobre SF, aborda-se o recurso FrameNet, contrastando os EF do subframe Sentencing aos que ora se propõe; na seção 3, fala-se do domínio jurídico, alvo da parte aplicada do trabalho, descreve-se o subframe proposto expondo seus EF, definem-se algumas UL evocadoras 1 Projeto FrameCorp (http://projeto.unisinos.br/semantec/index.php/projetos/8-projetos/2-framecorp). 2 Este trabalho representa a primeira etapa na construção de um recurso lexicográfico, o qual poderá ser utilizado, posteriormente, na anotação de textos jurídicos. Assim, não há a pretensão, nesse momento, de gerar um produto, um corpus anotado. e anotam-se ocorrências referentes ao evento sentença, mostrando uma aplicação da parte teórica estudada. Encerra-se com algumas reflexões linguísticas advindas das anotações. Noções sobre Semântica de Frames e o subframe Sentencing A SF corresponde a uma teoria que leva em consideração o significado enciclopédico [Evans 2007 ] e a representação do significado da palavra, buscando desvelar o conhecimento associado às palavras, um conhecimento convencional atrelado à experiência e à cultura, representado no nível conceitual e armazenado na memória a longo prazo. Fillmore (1982) explica que a SF oferece um modo peculiar de olhar o significado e os princípios para a criação de palavras e frases, acrescentando novos significados aos itens lexicais e construindo o significado em um contexto, dentro de seu significado total. Conforme esta teoria, o significado da palavra é descrito em frames, \"representações esquemáticas das estruturas conceituais e padrões de crenças, práticas, instituições, imagens, etc., que fornecem uma base para uma interação significativa em uma determinada comunidade de fala\" [Fillmore, 1982] . Assim, frames representam esquematizações da experiência, uma estrutura do conhecimento detalhada ou esquemas que emergem de experiências do dia a dia, representadas em nível conceitual e armazenadas na memória a longo prazo, em que se relacionam elementos e entidades associadas a uma cena específica da experiência. Trata-se da representação de uma situação, um objeto ou evento, a qual está inserida em um plano de fundo (background). Sob esta perspectiva, o entendimento e o uso apropriado de itens lexicais ou frases do significado de uma palavra dependem do conhecimento do frame individual ao qual ela está associada. Logo, conhecer o significado de uma palavra implica conhecer o frame evocado por ela. O recurso lexicográfico FrameNet [Baker, Fillmore and Lowe, 1998 ] representa uma aplicação dessa teoria. Extraindo informações sobre as propriedades semânticas e sintáticas de palavras retiradas de corpora, usando procedimentos manuais e automáticos, essa aplicação identifica e descreve frames semânticos, analisando a relação de unidades lexicais com os frames por elas evocados. A FrameNet estuda as propriedades sintáticas e semânticas, lembrando que um de seus maiores objetivos é a identificação de padrões valenciais [Fillmore 2003a ]. Tal recurso trabalha com EF, lemas, lexemas, formas de palavras, partes de discurso, relações de frame para frame, sentenças anotadas baseadas em corpora e um conjunto de camadas anotadas para os EF, tipos sintagmáticos e padrões valenciais, oferecendo toda a informação necessária para a caracterização de uma UL [Fillmore, et. al. 2003a ]. Abordando mais a fundo alguns conceitos centrais da FrameNet, aproveitase para tratar de forma mais detalhada o subframe Sentencing. Os frames da FrameNet trazem os papéis dos participantes ou aspectos de uma situação, sendo estes denominados de elementos de frame (EF). Junto à FrameNet, Sentencing tem como EF nucleares CONVICT (condenado), COURT (júri, juiz), OFFENSE (ofensa, ato ilegal), SENTENCE (sentença, decisão) e TERM OF SENTENCE (aludindo à duração da pena). Note-se que os EF são grafados em fonte maiúscula para mostrar que não se trata de léxico utilizado ordinariamente, sendo denominados mnemonicamente 3 , como também que há duas categorias de EF, nucleares (core) e periféricos (non-core). Os primeiros trazem os participantes centrais, arrolados acima, e os periféricos não são necessariamente conceptuais, isto é, os EF não centrais não fazem parte da predicação e representam informações não essenciais para o frame, como tempo e lugar. Os EF periféricos do subframe citado são: DEPCTIVE (referindo-se a presença do condenado no julgamento), PLACE (lugar do julgamento), TIME (tempo, quando ocorre) e TYPE (o tipo de pena, se de reclusão em regime fechado, por exemplo). A FrameNet faz uso do conceito de unidades lexicais (UL), seguindo a definição de Cruse (1986) de que uma UL corresponde a uma palavra ou uma expressão em um de seus sentidos. Vale referir que cada um dos sentidos de uma palavra pode estar ligado a um frame específico, quando se diz que o sentido da palavra evoca o frame [Fillmore, 2003a,b] . Evocadores de frame, comumente, são verbos; contudo, substantivos eventivos também têm esta prerrogativa, ao contrário dos nomeadores de artefatos e coisas da natureza [Fillmore, 2003b] . Atendo-se ao subframe Sentencing, suas UL são: condem (condenar), order (ordenar), send up (enviar), sentence n. (sentença,) e sentence v. (sentenciar). A FrameNet também descreve relações entre frames, havendo diferentes tipos, tal como a de herança, em que um frame filho é mais específico, elaborado e complexo que o frame pai, permitindo a apresentação de um estado sequencial e transacional entre frames, como também a representação individual do frame mais específico. Em tais casos, todos os EF, subframes e tipos semânticos do frame pai têm correspondentes no frame filho, sendo possível que este tenha características adicionais, isto é, EF e tipos semânticos que não estejam no frame pai. É interessante notar, ademais, que um frame filho pode herdar de mais de um frame pai. Logo, Sentencing tem uma relação de herança com o frame pai Criminal_process na FrameNet, assim como o subframe Sentença é frame filho no frame do português. A relação de precedência é outra que está presente no recurso lexicográfico, a qual vem organizar a ordem de subeventos em um evento mais complexo. Contextualizando, verifica-se a relação de precedência entre os demais subframes e o subframe Sentença, os quais compõem o frame maior, o que ficará evidente na figura da seção seguinte. Outra relação importante é a de perspectiva, a qual permite representar diferentes olhares sobre uma mesma cena. No domínio jurídico, ilustra-se a noção de perspectiva em A juíza inquiriu o réu, quando a perspectiva é da julgadora; enquanto em O réu depôs mostra a perspectiva do réu. Assim, a noção de perspectiva possibilita explorar e representar os diferentes pontos de vista de participantes de um frame em um cenário maior. Esclarece-se que em ambas as sentenças, criadas para fins exemplificativos, a unidade evocadora é condenar, a qual evoca o subframe sentença. Por fim, deve-se ter em mente que junto às palavras há toda uma cena de fundo e saber quais os demais elementos que a compõem é relevante para a construção do seu significado. Tendo-se, outrossim, estudado os principais conceitos atinentes à SF e ao recurso lexicográfico FrameNet, segue-se à breve apresentação do domínio jurídico e definição dos conceitos centrais para a parte aplicada deste trabalho. O evento sentença no Direito Processual Civil Processo de conhecimento no Direito Processual Civil corresponde à primeira fase de um processo orientado pelo Processo Civil. Descrever esta realidade em frames implica representar seus subeventos desde o ingresso da petição inicial pela parte interessada, autora da ação, junto à justiça competente, provocando o juiz a se manifestar e instruir o processo, até o momento em que se profere uma sentença de mérito, declarando qual das partes tem razão, decidindo, assim, pela procedência, a improcedência ou a parcial procedência da ação. Representando, graficamente, o frame pai processo_de_conhecimento_no_direito_processual_civil e seus subframes, segue a Figura 01, chamando-se a atenção para as relações de precedência e herança entre eles: Analisando a figura, nota-se a existência de uma série ordenada e processual de atos formalizados pela lei para um litígio judicial, iniciando pelo ajuizamento da petição inicial, seguindo para a avaliação do juiz, a citação do réu e sua resposta, partindo para a audiência preliminar e de instrução e julgamento, finalizando com a prolação da sentença. Percebe-se que o subframe proposto é o último da cadeia de eventos, tendo uma relação de herança com o frame pai, além de todos os demais subframes, os quais precedem este último evento sentença. Conforme definição retirada de dicionário especializado, sentença significa \"a decisão que resolve a causa ou questão controvertida sobre a relação de direito litigioso\" [Náufel 2008 ]. Importa acrescentar que esta decisão resolve o caso litigioso em primeira instância, quando o processo está em fase de conhecimento pelo juiz, pois caso uma das partes litigantes ou ambas apelem, recorram, uma nova fase inicia, a chamada fase recursal. O subframe Sentença A presente seção está dividida em duas partes. A primeira define o subframe, seus EF e as UL evocadoras, contrastando-os ao subframe Sentencing da FrameNet 4 e a segunda apresenta o corpus, a metodologia utilizada e a anotação de algumas ocorrências reais referentes ao evento sentença. O subframe Sentença no Direito Processual Civil Com base na definição acima descrita formula-se a definição do subframe Sentença, marcando em fonte maiúscula os EF que o compõem: Sentença corresponde à DECISÃO proferida por JULGADOR, representante do PODER JUDICIÁRIO, que em determinado LUGAR e TEMPO, acerca de um CASO CONCRETO, envolvendo LITIGANTE AUTOR e LITIGANTE RÉU profere uma decisão. Neste documento, relata-se o PEDIDO, expõem-se a FUNDAMENTAÇÃO da decisão, a BASE LEGAL e a PENA. A partir da definição acima e seguindo os critérios da FrameNet, apresenta-se na tabela abaixo os EF nucleares e periféricos, contrastando-os com o subframe Sentencing. Acrescenta-se o sinal de asterisco (*) ao lado do EF herdado do frame pai [Minghelli 2012 ]. LITIGANTE AUTOR corresponde \"àquele que propõe (...) uma ação em juízo (...) parte em um processo judicial\", herdado do frame Processo_de_conhecimento_no_direito_processual_civil e não está presente no subframe Sentencing. LITIGANTE RÉU refere-se \"aquele que (...) contesta uma ação em juízo (...) parte em um processo judicial\", equivalendo ao EF CONVICT no recurso FrameNet. Tal como o primeiro EF acima descrito, ele também é herdado. JULGADOR e COURT equiparam-se. JULGADOR é herdado frame pai, entendendo-se como a \"autoridade judiciária ou administrativa a quem cabe decidir uma questão\" e court tratase de uma palavra polissêmica no direito americano, a qual tanto remete ao juiz, júri, quanto ao prédio corte, tribunal. CASO CONCRETO e OFFENSE aludem a uma mesma questão, qual seja ao caso palpável, de existência real. DECISÃO , EF herdado do frame pai, e SENTENCING (aqui no sentido de EF) assemelham-se na medida em que correspondem ao \"ato pelo qual uma autoridade administrativa ou judiciária resolve uma questão submetida à sua apreciação e julgamento (...)\", relatando o caso concreto, o trâmite processual, a fundamentação e a decisão propriamente dita. PEDIDO, BASE LEGAL, PENA e FUNDAMENTAÇÃO não encontram correspondência no estudo contrastivo junto à FrameNet, o que não ocorre pelo fato do subframe Sentencing estar atrelado a um frame da esfera criminal, pois qualquer sentença deve contemplar estes quesitos pedido, base legal, pena e fundamentação. A falta de correspondência desses EF (pedido, base legal, pena e fundamentação) decorre da inexistência no recurso FrameNet, quiçá pelo fato de não ter tido interesse em aprofundar o subframe Sentencing. Assim, herdados do frame Processo_de_conhecimento_no_direito processual_civil PEDIDO, BASE LEGAL e PENA , são definidos, respectivamente, da seguinte maneira: (i) pedido é \"aquilo que alguém que vai a juízo, depois de fazer a exposição de suas razões, pede-lhe seja assegurado pelos poderes públicos, por intervenção do órgão judiciário. É o objeto da demanda. Aquilo que se indica como fim desta\"; (ii) base legal é o fundamento legal e pena (iii) a \"sanção de natureza pecuniária que a lei impõe àqueles que infringem determinações legais ou administrativas. Multa\" e o EF específico do subframe Sentença FUNDAMENTAÇÃO (derivação de fundamentar) significa \"dar fundamento. Expor razões e motivos de modo a justificar o pedido, a contestação ou a decisão. Basear em motivos e documentos\". Não se pode dizer que os EF periféricos LUGAR e TEMPO , presentes na FrameNet e no subframe proposto, tenham sido herdados, haja vista sua generalidade e uso em frames diversos. No que tange ao EF TYPE , entende-se que esteja abrangido pelo EF nuclear PENA , essencial, portanto, ao evento sentença. O EF DEPICTIVE não se viu como relevante quando da anotação do corpus, motivo pelo qual ele não foi acrescentado ao rol de EF. E o EF PODER JUDICIÁRIO , presente em muitas ocorrências, mas não essencial ao subevento sentença, compôs o rol de EF periféricos, sendo definido pelo dicionário especializado como \"aquele que é formado pelo conjunto de órgãos a que incumbe a distribuição da justiça (...) são órgãos do Poder Judiciário: O Supremo Tribunal Federal, O Supremo Tribunal de Justiça, juízes (...)\". A partir do estabelecimento dos EF nucleares, nota-se que, dos nove EF existentes, sete são herdados do frame pai, quatro equivalem ao subframe americano e apenas um é específico ao subframe Sentença. Isso demonstra o relevante papel da herança na criação de frames, uma aproximação cultural quanto ao evento sentença entre os dois sistemas legais (brasileiro e americano) e subdomínios legais (Penal e Cível), como a importância do EF FUNDAMENTAÇÃO em uma decisão, o qual é peculiar ao subframe em elaboração. No que tange às UL, em um total de cinco, três advieram do estudo contrastivo e uma foi criada, totalizando quatro UL evocadoras, das quais três são verbos e uma substantivo. Esta constatação, de que as UL se equivalem nos frames cível em português e penal em inglês, frise-se no que tange ao subevento sentença, reforça a proximidade entre os sistemas e subdomínios (cível e penal) no ato de sentenciar, ainda que pertençam a sistemas legais distintos (brasileiro e americano). Consoante consulta aos verbetes no dicionário jurídico [Náufel 2008 ], foram encontradas as seguintes definições, utilizadas nas ocorrências a seguir: condenar, \"pronunciar sentença contra o acusado ou contra um dos litigantes no processo civil, obrigando-o a praticar ou deixar de praticar determinado ato ou fato ou a fazer determinada prestação (...)\"; sentença (substantivo) (ou na forma verbal sentenciar), \"é a decisão que resolve a causa ou questão controvertida sobre a relação de direito litigioso\" e, por fim, absolver, \"Julgar improcedente a ação proposta em relação ao réu\". O corpus, a metodologia e anotações de ocorrências O corpus corresponde a excertos de textos jornalísticos publicados em mídia digital, cujas ocorrências elucidam adequadamente os EF estudados. A partir da leitura das notícias, foram selecionadas as ocorrências em que as UL absolver e condenar (e suas derivações) estavam presentes e que melhor pudessem ilustrar o subframe. A metodologia implicou (i) seleção de ocorrências; (ii) anotação dos EF e (iii) exposição de comentário acerca das anotações. A seleção das ocorrências levou em conta a orientação de Fillmore et al. (2003) , no sentido de que ilustrassem o subframe que se descreve e as possibilidades valenciais de cada evocador. Ou seja, a ocorrência deve ser elucidativa a ponto de explicar o sentido da UL alvo, apontando, ainda, os EF componentes da cena. A sentença deve, ainda, ser uma estrutura simples, que elucide o comportamento gramatical básico da UL alvo, sua valência, evitando-se sentenças que desloquem o complemento da palavra alvo de modo que nada tenha a ver com suas propriedades sintáticas e semânticas. 4 ), o grau de polissemia, em face da metonímia, é ainda maior e este duplo sentido se deve ao fato de \"O Tribunal de Justiça do RN\" aludir à instituição, bem como ao verbo que vem em seguida reformou remeter ao julgador, ato realizado por ente animado. Assim, há de se chamar a atenção à existência de uma relação metonímica entre PODER JUDICIÁRIO e JULGADOR , em que o primeiro representa o todo e o segundo a parte, podendo um ser utilizado pelo outro. Outra constatação averiguada foi a proximidade entre CASO CONCRETO e FUNDAMENTAÇÃO . O exemplo (2) elucida o primeiro, trata-se de uma acusação, do fato litigioso \"do [crime de rapto CASO CONCRETO \"; da mesma forma que a primeira parte da ocorrência (3) \"do [caso Eliza(...) CASO CONCRETO ], ao passo que a última parte deste mesmo parágrafo, \"[por participação nas ações (...) FUNDAMENTAÇÃO ]\", elucida o EF FUNDAMENTAÇÃO , remetendo ao fato que restou provado. Linguisticamente, percebe-se que a preposição por ressalta o motivo de algo, indo ao encontro da fundamentação e a preposição de alude à acusação. Tais preposições justificam o argumento que se sustenta acerca da distinção entre CASO CONCRETO e FUNDAMENTAÇÃO . Neste mesmo sentido, a ocorrência (4) \"absolveu a (...) da [acusação de (...) CASO CONCRETO ]\", chama-se atenção para a preposição da e \"ante a divulgação (...) FUNDAMENTAÇÃO ]\", quando ante corresponde à fundamentação. Considerações Finais Entender o significado das palavras no domínio jurídico sem compreender as instituições sociais ou as estruturas experienciais pressupostas é complexo. O entendimento de uma UL exige um plano de fundo, uma cena. Assim, criar um frame conforme a SF requer mais do que a descrição de uma cena, exige apresentar o domínio com seus EF, UL, abordar as relações entre frames e anotar ocorrências reais, analisando o que delas surgem. Finalizando este estudo, destacam-se, a relação de herança entre o frame Processo_de_conhecimento_no_direito processual_civil e o subframe Sentença, a proximidade entre o evento Sentença nos sistemas e subdomínios legais, a polissemia causada pela relação metonímica presente em alguns EF e, por fim, que é por meio da anotação de ocorrências que, realmente, se elabora um frame, constatando-se o comportamento valencial. Assim, tem-se presente que conhecimentos linguísticos e jurídicos são fundamentais para construir um frame que cumpra aos fins de uma válida e eficaz anotação.",
    "abstract": "This article aims to develop the subframe SENTENCING, which is part of the complex frame Knowledge Process frame in the Civil Procedural Law. Having the parent frame and its frame elements previously structured, we here elaborate the sentence subframe according to Frame Semantics and based on the FrameNet feature. To it so, we present the theory, the legal domain, the subframe sentence and annotation of real occurrences. Resumo. Este artigo objetiva desenvolver o subframe SENTENÇA, o qual é parte do complexo frame Processo de Conhecimento no Direito Processual Civil. Tendo o frame pai e seus elementos de frame previamente estruturados, elabora-se o subframe sentença seguindo a Semântica de Frames e baseandose no recurso FrameNet. Para tanto, aborda-se a Semântica de Frames, o domínio jurídico, o subframe sentença e anotam-se ocorrências reais.",
    "countries": [
        "Brazil"
    ],
    "languages": [],
    "numcitedby": "0",
    "year": "2013",
    "month": "",
    "title": "{O} Subframe Senten{\\c{c}}a no Complexo Frame Processo de Conhecimento no Direito Processual Civil (The Sentencing Subframe in the Complex Knowledge Process Frame in the Civil Procedural Law) [in {P}ortuguese]"
}