{
    "article": "Discourse relation may entail sentiment information. In this work, we annotate both discourse relation and sentiment information on a moderate-sized Chinese corpus extracted from the ClueWeb09. Based on the annotation, we investigate the association between the relation type and the sentiment polarity in Chinese and interpret the data from various aspects. Finally, we highlight some language phenomena and give some remarks. Introduction A discourse relation indicates how two arguments (i.e., elementary discourse units) cohere to each other. Various discourse relations were defined according to different taxonomy (Carlson and Marcu, 2001; Carlson et al., 2002; Prasad et al., 2008) . In the work of the Penn Discourse Treebank 2.0 annotation, Prasad et al. (2008) labeled four grammatical classes of connectives in English, including subordinating conjunctions, coordinating conjunctions, adverbial connectives, and implicit connectives. Besides, the sense of each connective was also tagged. They defined three levels of sense hierarchy for the connectives. The four classes on the top level are Temporal, Contingency, Comparison, and Expansion. There are explicit and implicit uses of discourse relations. An explicit discourse relation indicates the arguments are connected with an overt discourse marker (i.e., connective). A connective joins two discourse units such as phrases, clauses, or sentences together. For example, the word however is a common connective that indicates a Comparison relation between two arguments. The sense of a discourse marker denotes how its two arguments cohere. In other words, a discourse marker presents the relation of its two arguments. In other cases, discourse marker is absent from an implicit relation. However, readers can still infer the relation from its argument pair. To resolve implicit discourse relations, i.e., without the information from discourse markers, is more challenging (Lin et al., 2009; Zhou et al., 2010) . Hutchinson (2004) pointed out the properties of a discourse marker from three dimensions, including polarity, veridicality, and type. The polarity of a discourse marker indicates the sentiment transition of its two arguments. Veridicality, the second dimension of a discourse marker, specifies whether both the two arguments are true or not. Type, similar to the sense which is annotated in the PDTB, is the third dimension of a discourse marker. Our previous work (Huang and Chen, 2012a; Huang and Chen, 2012b) addressed the interaction between the sentiment polarity and the discourse structure in Chinese. Consider (S1), which consists of three clauses and forms a nested discourse structure shown in Figure 1 . (S1) 管理處雖然嘗試要讓長期以來作為大 台北後花園的陽明山區更回歸自然 (Although the management office tried to make the Yangmingshan area a more natural environment as the long-term garden of Taipei)，但隨著週休二日、 經濟環境改善 (but due to the two-day weekend and the improved economic conditions)，遊客 帶來停車、垃圾等間接影響卻更嚴重 (the issues of tourist parking, garbage, and other indirect effects become more serious)。 The second and the third clauses form a Contingency relation with a sentiment polarity transition from Positive to Negative. Furthermore, Discourse relation recognition (Hernault et al., 2010; Soricut and Marcu, 2003) and sentiment analysis (Pang and Lee, 2008) have attracted much attention recently. Due to the limitation of the resources, the research on Chinese discourse relation analysis is relatively rare. In our previous work, we annotated a collection of Chinese discourse corpora, namely NTU Chinese Discourse Resources (http://nlg.csie.ntu.edu.tw/ntudiscourse/), for inter-sentential and intrasentential discourse relation recognition (Huang and Chen, 2011; Huang and Chen, 2012a ). However, no sentiment information is labeled in these corpora. In another work (Huang and Chen, 2012b), we proposed an annotation scheme to construct a Chinese discourse corpus with rich information including sentiment polarities, but the corpus is still under construction due to its complexity. Zhou and Xue (2012) did PDTBstyle Chinese discourse corpus annotation, but the corpus is also not available yet. In this paper, we annotate a moderate-sized Chinese corpus with the information of discourse relations and sentiment polarities. Total 7,638 sentences are sampled from the ClueWeb09. We review the results of annotation and analyze some language phenomena found in the corpus. The rest of this paper is organized as follows. In Section 2, we introduce the ClueWeb corpus and a dictionary of Chinese discourse markers. In Section 3, the criteria to sample instances and the annotation scheme are shown. We analyze the language phenomena found in the annotated data and discuss the correlation between discourse relations and sentiment polarities in Section 4. Finally, we conclude the remarks in Section 5. Linguistic Resources The PDTB is a popular dataset used in the English discourse research. In contrast, no Chinese discourse corpus is publicly available at present. To construct a Chinese discourse corpus, we sample instances from a huge Chinese corpus (Yu et al., 2012) . This corpus was developed based on the ClueWeb09 dataset, where Chinese material is the second largest. It contains a total of 9,598,430,559 POS-tagged sentences in 172,298,866 documents. In this paper, only the explicit discourse relations are concerned. A dictionary of discourse markers is consulted to extract the instances of explicit discourse relations from the ClueWeb. This Chinese discourse marker dictionary is developed based on Cheng and Tian (1989) , Cheng (2006) and Lu (2007) . Table 1 shows an overview of the discourse marker dictionary. It contains 808 words and word pairs mapped into the PDTB four top-level classes (Cheng and Tian, 1989; Wolf and Gibson, 2005) . Besides the types of discourse relations, we further classify the markers into three groups of scopes shown in the second column, including Single word, Intrasentential, and Inter-sentential, according to their grammatical usages. The Single word group contains those individual words used as discourse markers. The Intra-sentential group contains pairs of words that occur inside the same sentence and denote a discourse relation. Here, a Chinese sentence is defined as a sequence of successive words that is ended by a period, a question mark, or an exclamation mark. The clauses of a sentence are delimited by commas. The Intersentential discourse markers are similar to the Intra-sentential ones, but the two words of a pair individually appear in different sentences. Some discourse markers can be used as both Intersentential and Intra-sentential. In this work, the Inter-sentential only discourse markers are excluded because we only concern the discourse relation occurring within a sentence. The third column lists the number of discourse markers for each scope under each PDTB class, and the fourth column gives some examples. Annotation Based on the Chinese part of the ClueWeb09 (Yu et al., 2012) , we sample a moderate-sized data with some criteria and annotate them with the information of discourse relations and sentiment polarities. Sampling a reliable dataset Discourse relations may be explicit or implicit, and a sentence may contain more than one discourse marker. Multiple discourse relations occurring in a sentence will make the annotation more complex. In this work, we focus on the correlation between discourse relations and sentiment polarity. To get a reliable dataset for analysis, we sample sentences based on the following three criteria. 1. A sentence should contain only two clauses. 2. A sentence should contain exact one discourse marker shown in the Chinese discourse marker dictionary. We match the discourse marker on the word level. For the Single word markers, the marker can appear in either of the clauses. For the pairwise markers, the first word should appear in the first clause, and the second word should appear in the second one. 3. The lengths of both clauses in a sentence are no more than 20 Chinese characters. As shown in Figure 1 , the sentiment polarity determination is more challenging when more than one discourse relation is involved in a sentence. In order to facilitate the analysis, we focus on those sentences that contain exact one dis-course marker. The limitation of clause length is also applied to avoid the noise from implicit discourse relation. Based on a preliminary statistics, we find that most clauses in the Chinese part of the ClueWeb (Yu et al., 2012) are no longer than 20 Chinese characters shown in Figure 2 . Annotation scheme Using the criteria described in Section 3.1, total 7,638 instances are randomly selected from the ClueWeb, and 87 native speakers annotate these instances. Each instance is shown to three annotators. The annotator labels the polarities of the first clause, the second clause, and the whole instance with Negative, Neutral, and Positive. In addition, the discourse relation between the two clauses is also labeled with Temporal, Contingency, Comparison, and Expansion. For each target sentence, the annotation is based on the information from the sentence only. The sentences are not given to annotators. Finally, the majority of each label is taken. For example, the polarity p 1 of the first clause in the instance (S2) is labeled as Positive, the polarity p 2 of the second clause is labeled as Negative, the resulting polarity p w of the whole sentence is also labeled as Negative, and the discourse relation between the two clauses is labeled as Comparison. (S2) 法國品牌的汽車在本土市場的佔有率 雖然過半 (Although French brand cars share more than half of the domestic market share)， 但市場份額持續萎縮 (but the market share continued to shrink)。 The inter-agreements of p 1 , p 2 , p w , and discourse relation among annotators are 0.49, 0.50, 0.47, and 0.41 in Fleiss' Kappa values, respectively (all are moderate agreement). The resulting corpus is publicly available on the website of NTU Chinese Discourse Resources 1 . Results and Discussion To investigate the corpus annotated with discourse relation and sentiment polarity, we firstly give an overview of results with respect to these two types of linguistic phenomena. And then, the most frequent discourse markers for each class of discourse relations are discussed. Finally, we reorganize the results to several aspects and discuss the association between discourse relations and sentiment polarities. Overview of the annotated corpus The distribution of the discourse relations versus the polarities of whole sentence (p w ) is shown in Table 2 . Compared to the distributions of discourse relations in the Penn Discourse Treebank (Prasad et al., 2008) shown in Table 3 , the explicit Chinese discourse corpus is more similar to the whole English corpus. The instances of Expansion form the largest set among four discourse relation classes. In Chinese, the instances of Expansion are even more. Temporal is the most infrequent relation which has close frequencies in both corpora. The different characteristic is the frequency of Comparison relation. In our Chinese corpus, the frequency of Comparison relation is about half of that in the PDTB. In Table 2 , the symbol † is used to highlight the relatively major polarity of each relation. The symbol ‡ is marked when the polarity is the majority (i.e., with a frequency greater than 50% The distribution of the discourse relations versus (p 1 , p 2 ), the sentiment polarity transitions between two clauses, is shown in Table 4 . Neutral-Neutral is the most frequent polarity transition in all relations. More than half of the Temporal instances are Neutral-Neutral. The reason may be that the Temporal relations are usually used in the sentences that describe the objective facts of the past, present, or the future. In such sentences, the sentiments are relatively rare. On the other hand, the sentences of Comparison and Contingency occur more in the critical and analytical scenarios. Although the most frequent transition of Comparison is also Neutral-Neutral (23.14%), the other three types of transitions, Positive-Negative, Neutral-Negative, and Negative-Positive, have close frequencies of 22.71%, 16.90%, and 15.72%, respectively. Moreover, Negative polarity is involved in all these three transitions in one of their clauses. The relations between p 1 , p 2 , and p w are also interesting. Table 5 shows the top 10 most frequent correlations of the polarities (p 1 , p 2 , p w ) of the first clause, the second clause, and the whole sentence. On the one hand, it is not surprising that most instances belong to (Neutral, Neutral, Neutral) . On the other hand, it is worthy of noting that p 2 and p w are identical in the top eight types of combinations in Table 5 . In other words, the resulting sentiment polarity of a two-clause sentence is mostly consistent with the polarity of   the second clause. Table 6 shows the correlations of sentiment polarities between clauses and the whole sentence. Total 92.50% of instances belong to the case (p 2 = p w ), where the polarity of the second clause is identical to the polarity of the whole sentence. In Chinese writing, putting the important part of a sentence at the end of the sentence is very common. Frequent discourse markers The top discourse markers in our Chinese corpus are shown in Table 7 . For each PDTB class, the five most frequent discourse markers are listed. In each row of the table, its number of occurrences and the distribution of its nine sentiment polarity transitions are given. Note that there are three polarities, i.e., positive, neutral, and negative. The relatively major sentiment polarity transition of each discourser maker is labeled with the symbol †. The symbol ‡ is marked when the sentiment polarity is the majority, i.e., its ratio is greater than 50%. Some discourse markers are the top markers in more than one discourse relation such as 也 (also) and 還 (still). In the discourse marker dictionary, the word 也 (also) is defined as a discourse marker of the Expansion relation. However, this word is frequent in the instances of all the four relations. In different relations, the distributions of the sentiment transitions of this word differ. In other words, the word 也 (also), which is a common word in Chinese, is not only used as a discourse marker for emphasizing the Expansion relation, but also has various senses in other usages. For instance, the word 也 in ( S3 ) is a discourse marker to denote an Expansion relation, but it is a particle in (S4). In fact, (S4) is an instance of the implicit Contingency relation. We ignore all of instances of the word 也 (also) in the following analysis since it is an outlier. (S3) 這既是對我們工作的肯定 (This is an affirmation of our work)，也是對我們的一種鼓 勵和鞭策(and also our encouragement and motivation)。 (S4) 不能放開心前行 (The mind cannot be open to forward progress)，天地也變得狹小 (the world becomes narrow)。 The word 還 (still) is another ambiguous discourse marker. Besides the Expansion relation defined in the dictionary, it is sometimes used to denote the Temporal relation, especially in the negation context, e.g., 還沒 (not yet). The two frequent discourse markers of the Contingency relation, 由於 (due to) and 因為 (because) share the similar sense, and their distributions of sentiment polarity transitions are more consistent than the other markers of the Contingency relation. The most frequent discourse marker of the Comparison class is 但 (but). The other two discourse markers 卻 (but) and 但是 (but) share the similar sense, however, their polarity distributions differ significantly. Compared to the more general marker 但 (but), the second frequent marker 卻 (but) is bolder and more critical. (S5) is an example of the marker 卻 (but). As shown in our data, the marker 卻 (but) is likely to highlight the negative sentences. (S5) 這樣觸目驚心的新型犯罪 (The new type of crime is so startling)，卻在偵破前一直 沒被披露(but had never been disclosed before solved)。 The other discourser marker 但是 (but) is an emphasized version of the marker 但 (but) so that it is more likely used in the stronger polarity transitions such as Positive-Negative and Negative-Positive. In addition, the sense of the marker 而 (however) is also similar to the sense of 但 (but), but it is more frequent to be used in the neutral situations. These linguistic phenomena show that the synonyms may have different sentiment usages in the real world. Association between discourse relation and sentiment polarity To analyze the data at a higher level, we reorganize the sentiment transitions into several transition categories from four aspects. The details are shown in The third aspect is Direction, which captures the movement from the first clause to the second one. To-Positive stands for the transitions in which the polarity of the second clause is more positive than that of the first clause. On the other hand, To-Negative stands for the transitions in which the polarity of the second clause is less positive than that of the first clause. Equal stands for the cases in which the polarities of both clauses are identical. The last aspect is Negativity, which regards the polarity of an argument as binary values, i.e., Negative and NonNegative. In this way, we re-classify the nine-way sentiment polarity transitions into four transitions. In other words, both the polarity states Neutral and Positive are merged into one state NonNegative in this aspect. Such a binary scheme is also used in some related work, in which the negative polarity is distinguished and the rest are considered Positive (Kim and Hovy, 2004; Devitt and Ahmad, 2007) . For each type of each aspect, five discourse markers that occur more than 10 times in the dataset and have the highest ratio of the corresponding type are listed in the fifth column of Table 8 as significant discourse markers. We analyze the annotations according to the four aspects, and the results are shown in Table 9 . The chi-squared test is used to test the dependency between the PDTB classes of discourse markers and each aspect of sentiment transitions. The results show that no matter whether the sentiment polarity transitions are categorized into Polarity Tendency, Polarity Change, Direction, or Negativity, the classes of discourse relations are significantly dependent on the sentiment polarities of the arguments at p=0.001. In the aspect of Polarity Tendency, the ratios of Neutral in the Temporal and Expansion relations are 57.01% and 48.33%, respectively, which are definitely higher than those of Contingency and Comparison relations. In other words, the two arguments of Contingency and Comparison relations are less likely to be neutral. The ratio of Negative-Tendency of the Comparison relation is 46.72%. It confirms the Comparison relation is likely to be involved in negative statements. As shown in Table 8 , three of the five significant discourse markers of Negative-Tendency are the synonyms of 卻 (but), which are discourse markers of the Comparison relation. The other two markers, 否則 (otherwise) and 因 (because), are discourse markers of the Contingency relation. Like the word otherwise in English, 否則 (otherwise) is used for introducing what bad scenario will happen if something is not done. The marker 因 (because) is not only a significant discourse marker of the category Negative-Tendency, but also a significant marker of Negative-Negative from the aspect of Negativity. From the real data, we find this marker is often used in bad cause-and-effect statements. (S6) is an example. The usage of the other discourse marker 因為 (because), which is a synonyms of 因 (because), is more general. (S6) 因毛巾日久不見陽光 (Because the towel is without sunlight for a long time)，容易滋 生細菌和真菌 (it is easy to breed bacteria and fungi)。 The ratio of Opposite of Comparison relation from the aspect of Polarity Change is 38.43%. Although it is not as high as expected, it is the highest among the four PDTB classes and much higher than those of three other classes. Compared to the other classes, Comparison is most likely to have a pair of opposite arguments. Four of the five significant discourse markers of Opposite in Table 8 The Negativity aspect in Table 9 also shows the NonNegative-Negative is more likely to happen than the Negative-NonNegative in all relations. This statistics reflects a particular phenomenon \"good words ahead\" in Chinese. That is, speakers tend to express a negative opinion after kind words. The sentiment polarity flips in the instances of the two categories Negative-NonNegative and NonNegative-Negative. However, the significant discourse markers of the two categories are very different. In spite of the general marker 但是 (but), the discourse markers 卻 (but), 否則 (otherwise), 即使...也 (even if...), and 可是 (but) are often used in NonNegative-Negative, which usually results a negative remark. On the other hand, the discourse markers 雖然...但 (although...), 不 過 (but), 終於 (finally), and 但 (but) are often used in Negative-NonNegative, which usually results a positive remark. For example, the discourse marker 終於 (finally), which is a discourse marker of the Temporal relation, is usually used when an event successfully accomplished after twists and turns such as (S7). (S7) 歷 經 多 次 磨 難 的 國 產 手 機 巨 頭 波 導 (Domestic mobile phone giant Ningbo Bird after many tribulations) ， 終 於 成 功 轉 戰 汽 車 行 業 (finally successfully fought in the automotive industry)。 Conclusion To investigate the discourse relation and the sentiment polarity of Chinese discourse markers, we construct a moderate-sized corpus based on the Chinese part of ClueWeb09. In this paper, our annotation scheme and the analysis of the annotation results are shown. Total 7,638 instances are annotated by native speakers. The discourse relation distribution of the annotated data is comparable to the distribution of the well-known English discourse corpus PDTB 2.0. Through the data analysis, we validate certain human intuitions in Chinese language. Near half of instances are in neutral sentiment while the Comparison relation is most likely to be involved in negative sentiment. Furthermore, the high sentiment dependency between the last clause and the whole sentence is validated in the data. The data shows the significant association between the discourse relation and the sentiment polarity. The arguments of a Comparison relation or a Contingency relation are more likely to be involved in expressing sentiment. Moreover, the Comparison relation often occurs in the sentences with sentiment polarity transitions, and frequently occurs in the instances with the negative sentiment. On the other hand, the arguments of the Temporal and the Expansion relations are relatively objective. The behavior of word choice between synonyms is also observed in the data. Each synonym of a sense may have its own usage in expressing sentiment. This paper points out the ambiguities of the discourse markers in Chinese. That is, a marker may suggest more than one discourse relation. Besides, words may have both the functions of discourse connectives and non-discourse ones in their surface forms. These two issues make the interpretation of Chinese discourse markers more challenging. Determination of their correct uses and disambiguation of their discourse functions will be investigated in the future. Acknowledgments This research was partially supported by Excellent Research Projects of National Taiwan University under contract 102R890858 and 2012 Google Research Award.",
    "abstract": "Discourse relation may entail sentiment information. In this work, we annotate both discourse relation and sentiment information on a moderate-sized Chinese corpus extracted from the ClueWeb09. Based on the annotation, we investigate the association between the relation type and the sentiment polarity in Chinese and interpret the data from various aspects. Finally, we highlight some language phenomena and give some remarks.",
    "countries": [
        "Taiwan"
    ],
    "languages": [
        "Chinese"
    ],
    "numcitedby": "7",
    "year": "2013",
    "month": "August",
    "title": "Analyses of the Association between Discourse Relation and Sentiment Polarity with a {C}hinese Human-Annotated Corpus"
}