{
    "article": "In this paper we describe a framework for classifying and annotating Egyptian Arabic Multiword Expressions (EMWE) in a specialized computational lexical resource. The framework intends to encompass comprehensive linguistic information for each MWE including: a. phonological and orthographic information; b. POS tags; c. structural information for the phrase structure of the expression; d. lexicographic classification; e. semantic classification covering semantic fields and semantic relations; f. degree of idiomaticity where we adopt a three-level rating scale; g. pragmatic information in the form of usage labels; h. Modern Standard Arabic equivalents and English translations, thereby rendering our resource a three-way -Egyptian Arabic, Modern Standard Arabic and English -repository for MWEs. Introduction Multiword expressions (MWEs) comprise a wide range of diverse, arbitrary and yet linguistically related phenomena that share the characteristic of crossing word boundaries (Sag et al., 2002) . MWEs are computationally challenging because the exact interpretation of an MWE is not directly obtained from its component parts. MWEs are intrinsically single units on the deep conceptual and semantic levels, but on the surface (lexical and syntactic) levels they are expressed as multiple units. MWEs vary in their syntactic category, morphological behavior, and degree of semantic opaqueness. MWEs are pervasively present in natural texts, which makes it imperative to tackle them explicitly if we aspire to make large-scale, linguistically-motivated, and precise processing of a human language. Integrating MWEs in NLP applications has evidently and consistently shown to improve the performance in tasks such as Information Retrieval (Acosta et al. 2011; da Silva and Souza, 2012) , Text Mining (SanJuan and Ibekwe-SanJuan, 2006) , Syntactic Parsing (Eryiğit et al., 2011; Nivre and Nilsson, 2004; Attia, 2006; Korkontzelos and Manandhar, 2010) , Machine Translation (Deksne, 2008; Carpuat and Diab, 2010; Ghoneim and Diab 2013; Bouamor et al., 2011) , Question Answering, and Named-Entity extraction (Bu et al., 2011) . In the current work, we propose guidelines for detailed linguistic annotation of an MWE lexicon for dialectal (Egyptian) Arabic that covers, among other types, expressions that are traditionally classified as idioms (e.g. ‫ﺍاﻟﺮﻳﯾﻖ‬ ‫ﻋﻠﻰ‬ EalaY Alriyq 1 'on an empty stomach'), prepositional verbs (e.g. ‫ﻋﻠﻰ‬ ‫ﺗﻮﻛﻞ‬ tawak~al EalaY 'rely on'), compound nouns (e.g. ‫ﻣﺮﻭوﺭر‬ ‫ﺇإﺷﺎﺭرﺓة‬ <i$Arap muruwr 'traffic light'), and collocations (e.g. ‫ﺩدﺵش‬ ‫ﺃأﺧﺪ‬ >axad du$~ 'to take a shower'). Creating a repository of annotated MWEs that is focused on dialects is essential for computational linguistics research as it provides a crucial resource that is conducive to better analysis and understanding of the user-generated content rife in the social media (such as Facebook, Twitter, blogs, and forums). Moreover, it helps in understanding he correspondences between different languages and their representation of the semantic space. We hope that the multilingual data in this repository will lead to a significant enhancement in the processing of comparable and parallel corpora. We believe that our proposed framework will contribute to the sustainability of MWE research in general, and provide a blue print for research on MWEs in dialects, informal vernaculars, as well as morphologically rich languages. MWE are not only interesting from an NLP perspective but also from a linguistic perspective, as MWE can help in understanding the link between lexicon, syntax and semantics. Until now, this is hampered by the lack of comprehensive resources for MWEs with fine-grained classification on different dimensions related to semantic roles and syntactic functions. Arabic comprises numerous divergent dialects, and having an annotated MWE lexical resource in dialects and Modern Standard Arabic (MSA) will allow for studying transformation, change and development in this language. From a theoretical linguistic point of view, our work will be interesting particularly in studies related to Diglossia. Diglossia (Walters, 1996) is where two languages or dialects exist side by side within a community, where typically one is used in formal contexts while the other is used in informal communications and interactions. Studying the MWE space for dialects and MSA as a continuum will lead to deeper insights into variations as we note intersection and overlap between the two. In many instances, we see that MSA MWEs and their dialectal equivalents are not necessarily shared as they occupy complementary linguistic spaces. However, the nature of this complementarity and its cultural and social implications will need more exploration and investigation, which will be possible once a complete resource becomes available. In the current work, we give detailed description of our methodology and guidelines for annotating phonological, morphological, syntactic, semantic and pragmatic information of an Egyptian Multiword Expressions (EMWE) lexical resource. Our annotation scheme covers the following areas. a) Phonological and orthographic information; b) POS tag, based on the observation of how an MWE functions as a whole lexical unit; c) Syntactic variability and structural composition; d) Lexicographic types, which includes the classifications followed in the dictionarywriting domain (idioms, support verbs, compound nouns, etc.); e) Semantic information, where we cover semantic fields and relations; f) Idiomaticity Degree; we adopt a three level rating scale (Mel'čuk, 1998) to measure the degree of semantic opaqueness; g) Degree of morphological, lexical and syntactic flexibility (Sag et al., 2002) ; h) Pragmatic information, which includes adding usage labels to MWEs where applicable; i) Translation, which includes the MSA and English equivalents, either as an MWE in MSA and English if available or as a paraphrase otherwise. Previous Work There are four main areas of research on MWEs: extraction from structured and unstructured data, construction of lexicons for specific languages, integration in NLP applications, and the construction of guidelines and best practices. A significant amount of research has focused on the identification and extraction of MWEs (Ramisch et al., 2010; Dubremetz and Nivre, 2014; Attia et al., 2010; Weller and Heid, 2010; Schneider et al., 2014) . Description and specifications of MWE lexical resources have been presented for Japanese (Shudo et al. 2011) , Italian (Zaninello and Nissim, 2010) , Dutch (Grégoire, 2010; Odijk, 2013) , and Modern Standard Arabic (Hawwari et al., 2012) . Moreover, Calzolari et al. (2002) presented a project that attempted to introduce best practice recommendations for the treatment of MWE in mono-and multi-lingual computational lexicons that incorporate both syntactic and semantic information, but the limitation of their work is that they focus on only two types of MWEs, namely, support verbs and noun compounds. Apart from Schneider et al. (2014) , who focused on the language of the social web, none of these projects dealt with informal or dialectal languages, which are rampant in user-generated content (UGC). With the explosion of social media, the language of Web 2.0 is undergoing fundamental changes: English is no longer dominating the web, and UGC is outpacing professionally edited content. UGC is re-shaping the way people are consuming and dealing with information, as the user is no longer a passive recipient, but has now turned into an active participant, and in many instances, a source or producer of information. Social media have empowered users to be more creative and interactive, and allowed them to voice their opinions on events and products and exert powerful influence on the behavior and opinion of others. Yet, the current overflow of UGC poses significant challenges in data gathering, annotation and presentation. MWE Taxonomy Although the importance of the MWEs has been acknowledged by many researchers in the field of NLP as evident by the large number of research papers and dedicated workshops in the past decade, the theory of MWEs is still underdeveloped (Sag et al., 2002) . There is critical need for studying MWEs both from the theoretical and practical point of views. MWEs have diverse categories, varying degrees of idiomaticity, different syntactic compositions, and different morphological, lexical and syntactic behavior, and dealing with them is complicated even further by the fact that there is no \"watertight criteria\" for distinguishing them them (Atkins and Rundell, 2008) . Moreover, there is no universally-agreed taxonomy of MWEs (Ramisch, 2012) , and different researchers proposed different typology for this phenomena. Fillmore et al. (1988) From the lexicographic point of view, the legacy three-way division of MWEs proved to be too coarse-grained to cater for the needs of lexicographers who need to identify the large array of sub-types that fall under the umbrella of 'MWEs'. Atkins and Rundell (2008) emphasized the need for lexicographers to be able to recognize MWE types such as fixed phrases, transparent collocations, similes, catch phrases, proverbs, quotations, greetings, phatic expressions, compounds, phrasal verbs, and support verbs. When we look deeply into the different classifications, we notice that each approach has looked at the phenomenon from a different angle, either focusing on its syntactic regularity, semantic and pragmatic properties, meaning compositionality, surface flexibility, POS (part of speech) category, or lexicographic relevance. What we propose is that it is not possible to come up with a hard and fast classification that cuts through all levels of representation. All afore-mentioned classifications are valid and can work parallel to each other, instead of substituting for each other. The assumption that we follow in this paper is that MWEs have different classifications at different levels of representation from the very deep level of semantics and pragmatics to the very shallow level of morphology and phonetics. The details of our annotation scheme are explained in the following section. It is worth noting that in our current work, we move the focus away from edited text to the challenging and creative language found in UGC and by trying to close the language resource gap between edited and unedited text. We handle this gap by focusing on dialects, the language used in informal communications such as emails, chat rooms, and in social media in general. We cover the full range of MWEs (nominal, verbal, adverbial, adjectival and prepositional expressions) in Egyptian Arabic, covering 7,331 MWEs (collected from corpora and paper dictionaries). Annotation of Linguistic Features in MWE In this section, we provide a comprehensive specification of MWE types and the detailed linguistic information, including the phonological, orthographical, syntactic, semantic and pragmatic features. Phonological Each MWE is provided in full diacritization to indicate its common pronunciation in Cairene Arabic accent, such as َ ‫ﻋ‬ َ ‫ﻠ‬ َ ‫ﻛ‬ ‫ﻰ‬ ‫ﻒّ‬ َ ‫ﻋ‬ ْ ‫ﻔ‬ ِ ‫ﺮ‬ ‫ﻳﯾﺖ‬ EalaY kaf~ Eaforiyt 'at high risk', 'lit. on the palm of a demon'. We also list other phonological variants when available. Orthography Since dialects do not have a standard orthography, we follow the CODA style (Habash et al., 2012) , which is a devised standard for conventionalizing the orthography of dialectal Arabic. CODA takes canonical forms and etymological facts into consideration. For example, the Egyptian expression ‫ﺑﺎﻟﻪﮫ‬ ‫ﺃأﺧﺪ‬ >axad bAluh 'to pay attention' is rendered in CODA as ‫ﺑﺎﻟﻪﮫ‬ ‫ﺃأﺧﺬ‬ >axa* bAluh. POS At this level of annotation we consider the POS of the entire MWE when regarded as one unit from a functional perspective. We annotate each MWE with a POS tag from a predefined tagset. We define the POS tag based on the headword POS in the MWE. Our POS tagset includes verb, noun, adjective, adverb, interjection, proper noun, and preposition. The list of POS tags used along with examples is shown in Table 1 . POS Example 1 Syntactic Annotation A syntactic variable is a slot that intervenes between the component parts of an MWE, without being itself a part of it, but fills a syntactic gap. Syntactic variables are added, when needed, to MWEs to represent the syntactic behavior of an MWE and they exemplify how the MWE interacts with other elements within its scope. We create a tagset of syntactic variables reflecting the argument structure of an MWE. Examples are shown in Table 2 . No Syntactic Lexicographic Annotation In the dictionary market there are specialized dictionaries for idioms, phrasal verbs, proverbs and quotations. However, general domain dictionaries try to avoid the use of too technical terms in the description of MWEs and use for the sake of simplicity a general term like 'phrase' to denote them to users. Yet, in the meta language of the dictionary compiling profession, lexicographers make a more fine-grained distinction between the various types of MWEs. Our lexicographic classification of MWEs is adapted from Atkins and Rundell (2008) Structural Classification We provide the syntactic phrase structure composition of the expressions, giving the MWE pattern or the POS of its component elements. The purpose is to show the normal productive syntac-tic patterns underlying the expressions. Table 4 shows the list of possible structural pattern in Egyptian MWEs. Structure Semantic Fields The entries in the current lexical resource are classified into semantic fields based on their semantic contents. The objective is to assign one semantic field tag for each MWE in the lexicon. Organizing Lexical data in semantic field format brings many theoretical and practical benefits, one of those is to allow the current lexical resource to function both as a lexicon and a thesau-rus. In Table 5 we show a sample of our semantic field classification. • Polysemy. This is when an MWE has more than one meaning. For example, ‫ﻁطﻮﻳﯾﻠﺔ‬ ‫ﻳﯾﺪﻩه‬ ِ ‫ﺇإ‬ <iyduh Tawiylap [lit. his hand is long] can mean either a 'powerful person' or a 'thief'. Semantic Idiomaticity Degree Mel'čuk (1998) classified MWEs with regards to idiomaticity into three types: full phrasemes, quasi-phrasemes and semi-phrasemes. • Full phrasemes are when the meaning of the expression does not match the meaning of the component words, such as ‫ﺟﺮﺍا‬ ‫ﻭوﻫﮬﮪھﻠﻢ‬ Wa-halum~ jar~A 'and so on'. Morpho-lexico-grammatical flexibility A scale of three levels is used to measure the degree of morphological, lexical and grammatical flexibility of a MWE, adopted from Sag et al. (2002) . The three levels are as follows: • Fixed MWE: An MWE is considered as a fixed expression if it does not have any degree of syntactic, morphological or lexical flexibility, and its meaning cannot be predicted from its component elements, for example, ‫ﻣﺪﺍاﺡح‬ ‫ﺳﺪﺍاﺡح‬ sadAH madAH 'slapdash'. Pragmatic Annotation (Usage Labels) The reason we provide usage labels is inspired by the CALLHOME Egyptian Arabic corpus (Gadalla et al., 1997) ), which is a collection of data gathered from spoken colloquial language. The usage labels present specifications on who uses an MWE and how it is used. The usage label tagset in our lexicon includes labels such vulgar, youth, aggressive or taboo, as exemplified in Table 6 . Who or how Conclusion We have described the annotation guidelines for a lexical database of MWE for dialectal Arabic. We provide descriptive specifications of MWE at the phonological, orthographical, syntactic and semantic levels. The main contribution of this paper is that it is the first description of a classification and annotation scheme of a lexical database for dialects, which can be extended for informal languages and with direct applicability on user-generated content. Acknowledgement This work was supported by the Defense Advanced Research Projects Agency (DARPA) Contract No. HR0011-12-C-0014, BOLT program with subcontract from Raytheon BBN.",
    "abstract": "In this paper we describe a framework for classifying and annotating Egyptian Arabic Multiword Expressions (EMWE) in a specialized computational lexical resource. The framework intends to encompass comprehensive linguistic information for each MWE including: a. phonological and orthographic information; b. POS tags; c. structural information for the phrase structure of the expression; d. lexicographic classification; e. semantic classification covering semantic fields and semantic relations; f. degree of idiomaticity where we adopt a three-level rating scale; g. pragmatic information in the form of usage labels; h. Modern Standard Arabic equivalents and English translations, thereby rendering our resource a three-way -Egyptian Arabic, Modern Standard Arabic and English -repository for MWEs.",
    "countries": [
        "United States"
    ],
    "languages": [
        "Arabic",
        "Japanese"
    ],
    "numcitedby": "13",
    "year": "2014",
    "month": "October",
    "title": "A Framework for the Classification and Annotation of Multiword Expressions in Dialectal {A}rabic"
}