{
    "article": "Depression is typically diagnosed as being present or absent. However, depression severity is believed to be continuously distributed rather than dichotomous. Severity may vary for a given patient daily and seasonally as a function of many variables ranging from life events to environmental factors. Repeated population-scale assessment of depression through questionnaires is expensive. In this paper we use survey responses and status updates from 28,749 Facebook users to develop a regression model that predicts users' degree of depression based on their Facebook status updates. Our user-level predictive accuracy is modest, significantly outperforming a baseline of average user sentiment. We use our model to estimate user changes in depression across seasons, and find, consistent with literature, users' degree of depression most often increases from summer to winter. We then show the potential to study factors driving individuals' level of depression by looking at its most highly correlated language features. Introduction Depression, a common mental disorder, greatly contributes to the economic, social, and physical burden of people worldwide. Along with other mental disorders it has been related to early termination of education, unstable marriages, teenage pregnancy, financial problems, role impairment, heart disease, and other negative outcomes (Kessler and Bromet, 2013; Lichtman et al., 2014) Currently, depression is primarily assessed through surveys. Diagnoses require a medical or psychological evaluation, and are typically classi-fied into discrete categories (absent, mild, moderate, severe). Clinicians rely on retrospective reports by patients to monitor symptoms and treatment. Unobtrusive assessments based on language use in Facebook and social media usage could amend both the self-help resources available to patients as well as repertoire of clinicians with richer information. Such a tool could allow for more frequent and fine grained (i.e., continuously scored) assessment and could provide contextualized information (e.g. specific words and online activities that are contributing to the user's depression score). Here, we predict and characterize one's degree of depression (DDep) based on their language use in Facebook. Datasets connecting surveyed depression with language in Facebook are rare at best. To operationalize DDep, we use the depression facet scores of the \"Big 5\" item pool (Goldberg, 1999) from the MyPersonality dataset. This provides a continuous value outcome, for which we fit a regression model based on ngrams, LDA topics, and lexica usage. By predicting continuous values, rather than classes, one can track changes in DDep of varying size across time; we find significantly more users' DDep increases from summer to winter than vice-versa. Our primary contribution is the exploration of predicting continuous-valued depression scores from individuals' social media messages. To the best of our knowledge this has not previously been studied, with other social media and depression work focused on discrete classes: present or absent. We compare our predictive model of DDep to one derived from a state-of-the-art sentiment lexicon and look at changes across seasons. Finally, we characterize DDep by looking at its top ngram and topic correlates. Background Depression Depression is generally characterized by persistent low mood, poor concentration, fatigue, and little interest in normally enjoyable activities. Depression can range from mild to severe, and can occur as an acute episode (major depressive episode), extend chronically over time (major depressive disorder, persistent depressive disorder), reoccur after a period of remission (recurrent depression), or occur at specific periods (seasonal affective disorder, postpartum depression, premenstrual dysphoric disorder). Prevalence rates vary; the World Health Organization estimates that over 350 million people worldwide have a depressive disorder, with many more reporting at least some symptoms (Organization, 2012). In the U.S., in the World Health Mental Survey, over half of the respondents (62%) endorsed at least one diagnostic stem questions for depression, with 19.2% meeting criteria for at least one major depressive episode (Kessler et al., 2010) . Although depression has long been defined as a single disease with a set of diagnostic criteria, it often occurs comorbidly with other psychological and physical disorders. Anxiety, anger, and other psychological disorders often co-occur with depression, and some have suggested that anxiety and depression are different manifestations of the same underlying pathology (Mineka et al., 1998) . An expert panel convened by the American Heart Association recently recommended that depression be considered a formal risk factor for heart disease (Lichtman et al., 2014) . Depression has been related to a range of physical conditions, including asthma, cancer, cardiovascular disease, diabetes, and chronic pain (Kessler and Bromet, 2013) , although the causal direction is confounded; it may be that other factors cause both depression and physical illness (Friedman and Kern, 2014) . As noted previously, assessing degree of depression as a continuous value allows us to look at changes in depression across time. There has been longstanding interest and discussion of seasonal patterns of depression, with observations of seasonal depressive patterns apparent in ancient times, and the first systematic description occurring in 1984 (Westrin and Lam, 2007) . Commonly called Seasonal Affective Disorder (SAD), the DSM-V now refers to this pattern as recur-rent major depressive disorder with a seasonal pattern. A clinical diagnosis of seasonal depression requires that two major depressive episodes have occurred in the past two years, with the onset and remission showing a regular temporal pattern (predominantly with onset occurring in the fall/winter and full remission in spring/summer). Patients with depression often have common symptoms of low energy, reduced or intensified psychomotor movements, low concentration, indecisiveness, and thoughts of death, as well as related symptoms such as fatigue, insomnia, and weight gain. A challenge in diagnosis is that it relies on a patient's historical report, and other possible causes such as physical illness must be ruled out. Further, with stigmas against mental illness and feats about seeking treatment, many cases go unrecognized, causing considerable burden on the individual and society as a whole. Prevalence rates vary, but rigorous reviews suggest a prevalence of .4% in the U.S., although estimates have been reported as high as 10% (Blazer et al., 1998; Magnusson and Partonen, 2005) . There are a number of different hypotheses about the pathophysiology of S A D, including circadian, neurotransmitter, and genetic causes (Lam and Levitan, 2000) . Reviews suggest that light therapy is an effective and well-tolerated treatment, with effects equal to or larger than antidepressants (Golden et al., 2005; Lam and Levitan, 2000; Thompson, 2001; Westrin and Lam, 2007) . Attempts to explain why light therapy is so effective have included shifting photoperiods (lightdark cycles, with less light in the winter), changes in melotonin secretion, and circadian phase shifts (Lam and Levitan, 2000) . One related explanation for the photoperiod effect is latitude, with the prevalence of seasonal depression increasing with growing distance from the equator. Although there has been some support for this hypothesis in the U.S. (Rosen et al., 1990) , findings in other countries have been mixed (Mersch et al., 1999) . Although latitude may play some role, other factors such as climate, genetic vulnerability, and the sociocultural context may have a stronger impact. Altogether, inconsistent results suggest that there is considerable variation in the magnitude, causes and manifestations of seasonal depression, much of which is not fully understood, in part due to diagnostic issues (Lam and Levitan, 2000) . A Dislike myself. Am often down in the dumps. Have frequent mood swings. Feel desperate. Feel comfortable with myself. (-) Seldom feel blue. (-) Am very pleased with myself. (-) Table 1: The seven items of the depression facet from the 100-item International Personality Item Pool (IPIP) proxy to the NEO-PI-R (Goldberg, 1999). (-) indicates a reverse coded item. weekly or even daily depression assessment tool would allow us to more fully understand the seasonal and other temporal changes in depression. We use the \"depression facet\" scores derived from a subset of the \"big-5\" personality items. Specifically, depression is one of several facets (e.g. anger, depression, anxiety, selfconsciousness, impulsiveness, vulnerability) of the neuroticism personality factor. Neuroticism refers to individual differences in the tendency to experience negative, distressing emotions, and behavioral and cognitive styles that result from this (McCrae and John, 1992) . It includes traits such as tension, depression, frustration, guilt, and selfconsciousness, and is associated with low selfesteem, irrational thoughts and behaviors, ineffective coping styles, and somatic complaints. Various scales have been developed to measure neuroticism, such as the Eysenck Personality Questionnaire (Eysenck and Eysenck, 1975) and the NEO-PI-R (Costa and McCrae, 1992) . Some items on these scales overlap with self-reported items that screen for depression (e.g., personality item: \"I am often down in the dumps\"; depression screening item: \"how often have you been feeling down, depressed, or hopeless?\"; see Table 1 .), such that the personality items effectively provide a proxy measure of depressive tendencies. Related Work Depression has been linked with many online behaviors. In fact, even Internet usage itself seems to vary as a function of being depressed (Katikalapudi et al., 2012) . Other behaviors include social networking (Moreno et al., 2011) and differences in location sharing on Facebook (Park et al., 2013) . Most related to our work, are those using linguistic features to assess various measures of de-pression. For example, De Choudhury et al. ( 2013 ) used online posting behavior, network characteristics, and linguistic features when trying to predict depression rather than find its correlates. They used crowdsourcing to screen Twitter users with the CES-D test (Beekman et al., 1997) , while others analyzed one year of Facebook status updates for DSM diagnostic critera of a Major Depressive Episode (Moreno et al., 2011) . In addition, Park et al. (2013) predicted results of the Beck Depression Inventory (Beck et al., 1961) . While previous works have made major headway toward automatic depression assessment tools from social media, to the best of our knowledge, none have tried to predict depression as a continuum rather than a discrete, present or absent, attribute. For instance, Neuman et al. (2012) classified blog posts based on whether they contained signs of depression, and De Choudhury et al. ( 2013 ) classified which newfound mothers would suffer from postpartum depression. 3 Predicting Degree of Depression Method Dataset. We used a dataset of 28,749 nonclinical users who opted into a Facebook application (\"MyPersonality\"; Kosinski and Stillwell, 2012) between June 2009 and March 2011, completed a 100-item personality questionnaire (an International Personality Item Pool (IPIP) proxy to the NEO-PI-R (Goldberg, 1999), and shared access to their status updates containing at least 500 words. Users wrote on average of 4,236 words (69,917,624 total word instances), and a subset of 16,507 users provided gender and age, in which 57.0% were female and the mean age was 24.8. The dataset was divided into training and testing samples. In particular, the testing sample consisted of a random set of 1000 users who wrote at least 1000 words and completed the personality measure, while the training set contained the 27,749 remaining users. Degree of depression. We estimated user-level degree of depression (DDep) as the average response to seven depression facet items, which are nested within the larger Neuroticism item pool. For each item, users indicated how accurately short phrases described themselves (e.g., \"often feel blue\", \"dislike myself\"; responses ranged from 1 = very inaccurate to 5 = very accu- rate). Figure 1a shows the distribution of surveyassessed DDep (standardized). The items can be seen in Table 1 . Figure 2 shows the daily averages of surveyassessed DDep, collapsed across years. A LOESS smoother over the daily averages illustrates a seasonal trend, with depression rising over the winter months and dropping during the summer. Regression modeling. In order to get a continuous value output from our model, we explored regression techniques over our training data. Since this first work exploring regression was concerned primarily with language content, our features for predicting depression were based entirely on language use (other social media activity and friend networks may be considered in future work). These features can be broken into four categories: ngrams: Ngrams of order to 1 to 3, found via Hap-pierFunTokenizer, and restricted to those used by at least 5% of users (resulting in 10,450 ngrams number of words: Encoded simply as the integer value for that user. We used penalized linear regression to fit our features to DDep. We experimented with a few penalization types over the training set and settled on L2 (\"ridge regression\"), using Principal Components Analysis to first reduce the ngram and topic features to 10 % of their original size. In order to ensure users tested provided an adequate amount of features, we only tested over those with at least 1,000 words. However, we found that including more users in our training set at the expense of words per user increased model accuracy. Thus, we only required our training data users to mention 500 words, essentially allowing more noise in order to increase the number of training examples. We also experimented with training models on two sets of messages: all messages and the subset of messages written in the same three-month season as the survey administration (season only messages). Because the degree of depression may vary over time, we reasoned that messages written closer to survey administration might better reflect the degree of depression assessed by the survey. When generating predictions on users in the test set, we applied both the all messages model and the season only messages model to features from all messages and then to just the features from the same season as the survey administration. Evaluation and Results We evaluated accuracy using the Pearson correlation coefficient r between our predictions and survey-assessed DDep. As a baseline, we built a regression model simply using the NRC sentiment (Mohammad et al., 2013) feature. Accuracies are shown in Table 2 . Accuracy was highest (r = .386) when we trained a model over all messages from users in the training set and then applied this model to all messages by users in the test set. Though our model allows for seasonal change in depression, we suspect the test across all messages was more accurate than that of only using the season in which the users depression was assessed due to the larger amount messages and language features provided to the model. Both models (season-only messages, and all messages) gave significant (p < 0.05) improvement over the baseline (r = .149) and though these accuracies may look small, it's worth noting that a correlation above r = 0.3 is often regarded as a strong link between a behavior and a psychological outcome (Meyer et al., 2001) . Still, we fit many behavior variables (i.e., language use features) to an outcome and so we might hope for higher variance explained. We suspect having more users to train on and taking more features into account could improve results. For example, people who nearly stopped writing for a season would be thrown out of our analyses since it is completely based on language content, even though they are more likely to be depressed (social isolation is a common symptom in depression). Similarly, we do not use demographics in our models, even though women are more likely to become depressed than men. To assess individual seasonal changes in degree of depression, we predicted summer and winter DDep values for each user with at least 1000 words across both summer-only and winter-only messages, respectively. We then compared the differences across the seasonal predictions; Figure 3 shows the distribution of user-level seasonal differences across 676 users with sufficient language for both seasonal predictions. In line with the trends seen in survey data, average user-level DDep values, as predicted by language, were significantly higher in the winter months (t = 4.63, p < .001). Differential Language Analysis Figure 4 shows the 100 ngrams most highly correlated with depression score across the 21,913 Facebook users in our dataset writing at least 1,000 words. Unlike typical word clouds, the clouds represent language that differentiates users scoring high on depression. The size of a word represents its correlation with depression (larger = stronger), the color its relative frequency (grey = rarely used, blue = moderately used, red = frequently used). The f-word emerges as both the most correlated feature (as indicated by the size of the word) and is highly frequent (indicated by the red color). Together with words such as 'pissed' and 'bloody', these curse words suggest hostility or aggression. Similarly, words such has 'hate' and 'lonely' suggest negative social relationships. Perhaps surprisingly, the words 'depression' and 'depressed' emerge as highly correlated features. These face valid features occur infrequently (as indicated by their grey color), yet are strongly associated with depressive tendencies, demonstrating the high statistical power of our approach applied to this large dataset in identifying significant but rarely used language features. The both frequent and highly correlated word 'why' hints at signs of hopelessness and meaninglessness, a core feature of depressive disorders. As illustrated in Figure 5 , extending the words and phrase results, automatically derived topics demonstrate substantial overlap with the major clinical symptoms of major depressive disorder (American Psychiatric Association et al., 2013) . Hopelessness and meaninglessness are seemingly expressed by 'hopeless' and 'helpless'. Perhaps the most noticable symptom of depression, depressed mood, is expressed in topics mentioning 'feel', 'crap', 'sad', and 'miserable'. Depression often affects psychomotor function, either in terms of fatigue and low energy or inversely as insomnia and hyperactivity. Such symptoms are reflected in words such as 'tired', and 'sleep'. Depression is often expressed somatically through bodily symptoms, captured through 'hurt', 'my head' and 'pain'. One of the most predictive questions on depressive screening questionnaires asks about suicidal thought, which appears with topics related to thoughts of death, with words such as 'kill', 'die', and 'dying'. Topics also reflected hostility, aggression, and negative relationships with other people. Loneliness has emerged as one of the strongest predictors of physical morbidity and mortality (Hawkley and Cacioppo, 2010), and both 'lonely' and 'alone' appear as some of the most correlated single words. Given such striking descriptive results, future work might try to detect depression associ-Figure 5 : Top ten topics most positively correlated with depression (from r = .14 at top to r = .11 at bottom). All are significant at a Bonferronicorrected threshold of p < 0.001. Word size corresponds to prevalence within the topics. ated conditions as well such as insomnia, loneliness, and aggression. Conclusion Depression can be viewed as a continuous construct that changes over time, rather than simply as being a disease that one has or does not have. We showed that regression models based on Facebook language can be used to predict an individual's degree of depression, as measured by a depression facet survey. In line with survey seasonal trends and the broader literature, we found that languagebased predictions of depression were higher in the winter than the summer, suggesting that our",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 0.0,
        "foundation": 1.9361263126072004e-07,
        "none": 0.9996537502582826
    },
    "reasoning": "Reasoning: The provided text does not mention any specific funding sources, including defense, corporate, research agencies, foundations, or an explicit statement of having no funding. Without direct evidence or mention of funding within the text, we cannot assume any specific source of funding was involved.",
    "abstract": "Depression is typically diagnosed as being present or absent. However, depression severity is believed to be continuously distributed rather than dichotomous. Severity may vary for a given patient daily and seasonally as a function of many variables ranging from life events to environmental factors. Repeated population-scale assessment of depression through questionnaires is expensive. In this paper we use survey responses and status updates from 28,749 Facebook users to develop a regression model that predicts users' degree of depression based on their Facebook status updates. Our user-level predictive accuracy is modest, significantly outperforming a baseline of average user sentiment. We use our model to estimate user changes in depression across seasons, and find, consistent with literature, users' degree of depression most often increases from summer to winter. We then show the potential to study factors driving individuals' level of depression by looking at its most highly correlated language features.",
    "countries": [
        "United Kingdom"
    ],
    "languages": [],
    "numcitedby": 182,
    "year": 2014,
    "month": "June",
    "title": "Towards Assessing Changes in Degree of Depression through {F}acebook",
    "values": {
        "novelty": " To the best of our knowledge this has not previously been studied, with other social media and depression work focused on discrete classes: present or absent.  We compare our predictive model of DDep to one derived from a state-of-the-art sentiment lexicon and look at changes across seasons.",
        "performance": "Our user-level predictive accuracy is modest, significantly outperforming a baseline of average user sentiment."
    }
}