{
    "article": "This paper presents a new data collection of feature norms for 572 German nounnoun compounds. The feature norms complement existing data sets for the same targets, including compositionality ratings, association norms, and images. We demonstrate that the feature norms are potentially useful for research on the nounnoun compounds and their semantic transparency: The feature overlap of the compounds and their constituents correlates with human ratings on the compoundconstituent degrees of compositionality, ρ = 0.46. Introduction Feature norms are short descriptions of typical attributes for a set of objects. They often describe the visual appearance (a firetruck is red), function or purpose (a cup holds liquid), location (mushrooms grow in forests), and relationships between objects (a cheetah is a cat). The underlying features are usually elicited by asking a subject to carefully describe a cue object, and recording their responses. Feature norms have been widely used in psycholinguistic research on conceptual representations in semantic memory. Prominent collections have been pursued by McRae et al. (2005) for living vs. non-living basic-level concepts; by Vinson and Vigliocco (2008) for objects and events; and by Wu and Barsalou (2009) for noun and noun phrase objects. In recent years, feature norms have also acted as a loose proxy for perceptual information in data-intensive computational models of semantic tasks, in order to bridge the gap between language and the real world (Andrews et al., 2009; Silberer and Lapata, 2012; Roller and Schulte im Walde, 2013) . In this paper, we present a new resource of feature norms for a set of 572 concrete, depictable German nouns. More specifically, these nouns include 244 noun-noun compounds and their corresponding constituents. For example, we include features for 'Schneeball' ('snowball'), 'Schnee' ('snow'), and 'Ball' ('ball'). Table 1 presents the most prominent features of this example compound and its constituents. Our collection complements existing data sets for the same targets, including compositionality ratings (von der Heide and Borgwaldt, 2009); associations (Schulte im Walde et al., 2012; Schulte im Walde and Borgwaldt, 2014) ; and images (Roller and Schulte im Walde, 2013) . The remainder of this paper details the collection process of the feature norms, discusses two forms of cleansing and normalization we employed, and performs quantitative and qualitative analyses. We find that the normalization procedures improve quality in terms of feature tokens per feature type, that the normalized feature norms have a desirable distribution of features per cue, and that the feature norms are useful in semantic models to predict compositionality. Feature Norm Collection We employ Amazon Mechanical Turk (AMT) 1 for data collection. AMT is an online crowdsourcing platform where requesters post small, atomic tasks which require manual completion by humans. Workers can complete these tasks, called HITs, in order to earn a small bounty. Setup and Data Workers were presented with a simple page asking them to describe the typical attributes of a given noun. They were explicitly informed in English that only native German speakers should complete We collected responses from September 21, 2012 until January 31, 2013. Workers who were obvious spammers were rejected and not rewarded payment. Typically spammers pasted text from Google, Wikipedia, or the task instructions and were easy to spot. Users who failed to follow instructions (responded in English, did not provide the minimum number of features, or gave nonsensical responses) were also rejected without payment. Users who put in a good faith effort and consistently gave reasonable responses had all of their responses accepted and rewarded. In total, 98 different workers completed at least one accepted hit, but the top 25 workers accounted for nearly 90% of the responses. We accepted 28,404 different response tokens over 18,996 response types for 572 different cues, or roughly 50 features per cue. Cleansing and Normalization We provide two cleaned and normalized versions of our feature norms. 2 In the first version, we correct primarily orthographic mistakes such as inconsistent capitalization, spelling errors, and surface usage, but feature norms remain otherwise unchanged. This version will likely be more useful to researchers interested in more subtle variations 2 The norms can be downloaded from www.ims.uni-stuttgart.de/forschung/ressourcen/ experiment-daten/feature-norms.en.html. and distinctions made by the workers. The second version of our feature norms are more aggressively normalized, to reduce the quantity of unique and low frequency responses while maintaining the spirit of the original response. The resulting data is considerably less sparse than the orthographically normalized version. This version is likely to be more useful for research that is highly affected by sparse data, such as multimodal experiments (Andrews et al., 2009; Silberer and Lapata, 2012; Roller and Schulte im Walde, 2013) . Orthographic Normalization Orthographic normalization is performed in four automatic passes and one manual pass in the following order: Letter Case Normalization: Many workers inconsistently capitalize the first word of feature norms as though they are writing a complete sentence. For example, 'ist rund' and 'Ist rund' ('is round') were both provided for the cue 'Ball'. We cannot normalize capitalization by simply using lowercase everywhere, as the first letter of German nouns should always be capitalized. To handle the most common instances, we lowercase the first letter of features that began with articles, modal verbs, prepositions, conjunctions, or the high-frequency verbs 'kommt', 'wird', and 'ist'. Umlaut Normalization: The same German word may sometimes be spelled differently because some workers use German keyboards (which have the letters ä, ö, ü, and ß), and others use English keyboards (which do not). We automatically normalize to the umlaut form (i.e. 'gruen' to 'grün', 'weiss' to 'weiß') whenever two workers gave both versions for the same cue. Spelling Correction: We automatically correct common misspellings (such as errecihen → erreichen), using a list from previous collection experiments (Schulte im Walde et al., 2008; Schulte im Walde et al., 2012) . The list was created semiautomatically, and manually corrected. Usage of 'ist' and 'hat': Workers sometimes drop the verbs 'ist' ('is') and 'hat' ('has'), e.g. the worker writes only 'rund' ('round') instead of 'ist rund', or 'Obst' ('fruit') instead of 'hat Obst'. We normalize to the 'ist' and 'hat' forms when two workers gave both versions for the same cue. Note that we cannot automatically do this across separate cues, as the relationship may change: a tree has fruit, but a banana is fruit. Manual correction: Following the above automatic normalizations, we manually review all nonunique responses. In this pass, responses are normalized and corrected with respect to punctuation, capitalization, spelling, and orthography. Roughly 170 response types are modified in this phase. Variant Normalization The second manual pass consists of more aggressive normalization of expression variants. In this pass, features are manually edited to minimize the number of feature types while preserving as much semantic meaning as possible: • Replacing plurals with singulars; Quantitative Analysis In the following two analyses, we explore the type and token counts of our feature norms across the steps in the cleansing process, and analyze the underlying distributions of the features per cues. Type and Token counts Table 2 shows the token and type counts for all features in each step of the cleansing process. We also present the counts for non-idiosyncratic features, or features which are provided for at least two distinct cues. The orthographic normalizations generally lower the number of total and non-idiosyncratic types, and increase the number of non-idiosyncratic tokens. This indicates we are successfully identifying and correcting many simple orthographic errors, resulting in a less sparse matrix. The necessary amount of manual correction is relatively low, indicating we are able to catch the majority of mistakes using simple, automatic methods.  The more aggressively normalized norms are considerably different than the orthographically normalized norms. Notably, the number of total tokens increases from the atomic splits. The data is also less sparse and more robust, as indicated by the drops in both total and non-idiosyncratic types. Furthermore, the number of non-idiosyncratic tokens also increases considerably, indicating we were able to find numerous edge cases and place them in existing, frequently-used bins. Number of Features per Cue Another important aspect of the data set is the number of features per cue. An ideal feature norm data set would contain a roughly equal number of (non-idiosyncratic) features for every cue; if most of the features are underrepresented, with a majority of the features lying in only a few cues, then our data set may only properly represent for these few, heavily represented cues. Figure 1 shows the number of features per cue for (a) all features and (b) the non-idiosyncratic features, for the aggressively normalized data set. In the first histogram, we see a clear bimodal distribution around the number of features per cue. This is an artifact of the two parts of our collection process: the shorter, wider distribution corresponds to the first part of collection, where workers gave more responses for less reward. The taller, skinnier distribution corresponds to the second half of collection, when workers were rewarded more for less work. The second collection procedure was clearly effective in raising the number of hits completed, but resulted in fewer features per cue. In the second histogram, we see only the nonidiosyncratic features for each cue. Unlike the first histogram, we see only one mode with a relatively long tail. This indicates that mandating more features per worker (as in the first collection process) often results in more idiosyncratic features, and not necessarily a stronger representation of each cue. We also see that roughly 85% of the cues have at least 9 non-idiosyncratic features each. In summary, our representations are nicely distributed for the majority of cues. Qualitative Analysis Our main motivation to collect the feature norms for the German noun compounds and their constituents was that the features provide insight into the semantic properties of the compounds and their constituents and should therefore represent a valuable resource for cognitive and computational linguistics research on compositionality. The following two case studies demonstrate that the feature norms indeed have that potential. Predicting the Compositionality The first case study relies on a simple feature overlap measure to predict the degree of compositionality of the compound-constituent pairs of nouns: We use the proportion of shared features of the compound and a constituent with respect to the total number of features of the compound. The degree of compo-sitionality of a compound noun is calculated with respect to each constituent of the compound. For example, if a compound noun N 0 received a total of 30 features (tokens), out of which it shares 20 with the first constituent N 1 and 10 with the second constituent N 2 , the predicted degrees of compositionality are 20 30 = 0.67 for N 0 -N 1 , and 10 30 = 0.33 for N 0 -N 2 . The predicted degrees of compositionality are compared against the mean compositionality judgments as collected by von der Heide and Borgwaldt (2009), using the Spearman rank-order correlation coefficient. The resulting correlations are ρ = 0.45, p < .000001 for the standard normalized norms, and ρ = 0.46, p < .000001 for the aggressively normalized norms, which we consider a surprisingly successful result concerning our simple measure. Focusing on the compound-head pairs, the feature norms reached ρ = 0.57 and ρ = 0.59, respectively. Perceptual Model Information As mentioned in the Introduction, feature norms have also acted as a loose proxy for perceptual information in data-intensive computational models of semantic tasks. The second case study is taken from Roller and Schulte im Walde ( 2013 ), who integrated feature norms as one type of perceptual information into an extension and variations of the LDA model by Andrews et al. (2009) . A bimodal LDA model integrating textual co-occurrence features and our feature norms significantly outperformed the LDA model that only relied on the textual cooccurrence. The evaluation of the LDA models was performed on the same compositionality ratings as described in the previous paragraph. Conclusion This paper presented a new collection of feature norms for 572 German noun-noun compounds. The feature norms complement existing data sets for the same targets, including compositionality ratings, association norms, and images. We have described our collection process, and the cleaning and normalization, and we have shown both the orthographically normalized and more aggressively normalized feature norms to be of higher quality than the raw responses in terms of types per token, and that the normalized feature norms have a desirable distribution of features per cue. We also demonstrated by two case studies that the norms represent a valuable resource for research on compositionality.",
    "abstract": "This paper presents a new data collection of feature norms for 572 German nounnoun compounds. The feature norms complement existing data sets for the same targets, including compositionality ratings, association norms, and images. We demonstrate that the feature norms are potentially useful for research on the nounnoun compounds and their semantic transparency: The feature overlap of the compounds and their constituents correlates with human ratings on the compoundconstituent degrees of compositionality, ρ = 0.46.",
    "countries": [
        "Germany",
        "United States"
    ],
    "languages": [
        "German"
    ],
    "numcitedby": "5",
    "year": "2014",
    "month": "April",
    "title": "Feature Norms of {G}erman Noun Compounds"
}