{
    "framing_question": "If this paper introduces a task or benchmark, what benefits of the task or benchmark does it state, if any?",
    "response": "The paper does not introduce a task or benchmark, so it does not state any benefits of a task or benchmark.",
    "article": "This paper reports on the francophone corpus archive Corpus des variétés nationales du français (CoVaNa-FR) and the lexico-statistical platform Varitext. It outlines the design and data format of the samples as well as presenting various usage scenarios related to the applications featured by the platform's toolbox. Introduction This contribution presents the francophone corpus archive Corpus des variétés nationales du français (CoVaNa-FR) and its hosting platform Varitext. The paper is structured as follows. Section 2 will outline the rationale behind the corpus archive, its composition and its data format. In section 3, we will then introduce the toolbox implemented by the Varitext platform, by illustrating some of its functionalities and giving brief sketches of corresponding usage scenarios. Section 4 provides a brief summary and discusses possible directions for the future development of the resources presented in this paper. 2 The CoVaNa-FR corpus archive Rationale and composition of the CoVaNa-FR The creation of the Corpus des variétés nationales du français (CoVaNa-FR) is motivated by the aim of offering a large-scale resource to researchers working on the French language from a pluricentric perspective. It is thus primarily designed to provide methodological support for investigations in the French tradition of 'lexicologie différentielle' ('variationist differential lexicography') focusing on elements of endonormative differentiation, i.e. the emergence of regionally specific norms compared to a supposed metropolitan standard variety of French (for studies on various francophone regions, see Rézeau 2007 , Thibault 2008 ; for studies especially focusing on Subsaharan Africa and the Maghreb, cf. Queffélec 1997 , Lafage 2002 , Naffati and Queffélec 2004 , Nzesse 2009 , to mention just a few examples of a sizable body of literature). Alongside the lexico-statistical toolbox implemented by the Varitext platform (cf. Section 3 below), the design of the CoVaNa-FR goes beyond the rather conventional lexicographic rationale of the lexicological framework just mentioned and can be seen as a contribution to meeting the desideratum, voiced by Stein (2003:14f) , of carrying out large-scale investigations on Francophone varieties using contemporary corpus linguistic methods. In this regard, the CoVaNa-FR differs from existing French corpora such as Frantext (cf. ATILF-CNRS), Québétext (cf. Trésor de la langue française au Québec) and Suistext (cf. Trésor des Vocabulaires francophones Neuchâtel) in offering broad regional coverage (bundling samples from Africa, Europe and North America), a wider range of query functionalities and free access (large parts of Frantext not being accessible free of charge and Suistext only being available locally at its hosting institution, cf. Thibault 2007:480) . Apart from corpus linguistic uses, the CoVaNa-FR could also be a valuable resource for research on the automatic classification of language varieties, which has recently aroused considerable interest in the field of NLP (for relevant contributions see, amongst others, Ranaivo-Malancon 2006 , Ljubešić et al. 2007 , Tiedemann and Ljubešić 2012 , Trieschnigg et al. 2012 , Zampieri and Gebre 2012 , Tan et al. 2014) . It should be noted, though, that in accordance with copyright restrictions, the CoVaNa-FR is not directly available for download and can only be consulted via the GUI of the password-protected Varitext platform. Due to its focus on endonormative differentiation, the CoVaNa-FR is less balanced with respect to genre than similar corpora for other languages such as the International Corpus of English (ICE, cf. Greenbaum 1996), the Corpus of Contemporary American English (COCA, cf. Davies 2009), the Corpus de Referencia del Español Actual (CREA, cf. Real Academia Española), the Corpus del Español (cf. Davies 2002) or the Corpus do Português (cf. Davies 2014) . 1 The initial version of the CoVaNa-FR, accessible on the Varitext platform, is made up of journalistic texts published by national newspapers in different Francophone countries in Africa, Europe and North America. The choice of national newspapers as primary sources is based on the assumption made by Glessgen (2007:97 ) that these are particularly representative of contemporary standard varieties (\"les grands journaux [...] reflètent assez bien les variétés standard actuelles\"). Work is also underway on the extension of the CoVaNa-FR, such that future versions will include a subcorpus of fiction and academic texts. In its present state, the CoVaNa-FR is divided into 11 samples collected across a span of at least two years and categorized by regional parameters as listed in Table 1 . The compilation of the overall corpus archive outlined in Table 1 has been carried out according to the requirement that each country be represented by a sample comprising at least two newspapers with articles from the same (or similar) two years. It should be noted, though, that some samples do not fully meet these guidelines, as is the case with the corpora representing Algeria and Canada (containing two newspapers from single and different years) or the sample representing the Democratic Republic of Congo (containing three years of only one newspaper). Processing format of the CoVaNa-FR All documents in the CoVaNa-FR corpus are formatted in eXtensible Markup Language (XML) with the structural units (i) subcorpus, (ii) text, (iii) paragraph, and (iv) sentence. The texts are annotated with (i) part-of-speech (PoS) tags, (ii) lemmas and (iii) dependency-parses using the commercially licensed Connexor annotation tool (Tapanainen and Järvinen 1997) . The corpus files are in standard CWB input format (cf. Evert and Hardie 2011:5f) with XML tags and each token record (one surface form + associated TAB-delimited token-level annotations) appearing on separate lines. The set of XML tagged structural units is specified by the DTD given in Figure 1 . Note that the top level <corpus>...</corpus> element defines one country related sample and that each subcorpus corresponds to a one year newspaper volume. The element attributes which are provided inside the query platform as metadata categories for corpus partitioning or the description of concordance extracts are highlighted in boldface. <!DOCTYPE varcorpus [ <!--country related sample --> <!ELEMENT corpus (subcorpus)+> <!--one year newspaper volume --> <!ELEMENT subcorpus (text)+> <!--newspaper article --> <!ELEMENT text (p)+> <!--paragraph --> <!ELEMENT p (s)+> <!--sentence --> <!ELEMENT s (#PCDATA)> <!ATTLIST corpus id CDATA #REQUIRED name CDATA #REQUIRED code CDATA #REQUIRED geocode CDATA #REQUIRED geoname CDATA #REQUIRED > <!ATTLIST subcorpus id CDATA #REQUIRED name CDATA #REQUIRED code CDATA #REQUIRED source CDATA #REQUIRED year CDATA #REQUIRED > <!ATTLIST text id CDATA #REQUIRED title CDATA #REQUIRED author CDATA #REQUIRED date CDATA #REQUIRED section CDATA #REQUIRED > <!ATTLIST p id CDATA #REQUIRED type CDATA #IMPLIED > <!ATTLIST s id CDATA #REQUIRED> ]> Fig. 1 : DTD specifying the structural elements of the country-related samples in the CoVaNa-FR corpus archive. As for the token rows, their core structure is basically defined according to the so-called CoNLL format, introduced on the occasion of the correspondent 2007 shared task on dependency parsing (cf. Nivre et al. 2007:916) . For rather technical reasons, this structure has been extended by a number of fields whose purpose is to optimize the processing of queries exploring the dependency relations annotated in the corpus. The fields in question are marked by an asterisk in the following table, which outlines the overall structure of the token records: The 11 country specific samples making up the present online version of the CoVaNa-FR (see Table 1 above) have been encoded by means of the IMS Open Corpus Workbench (CWB, cf. Evert and Hardie 2011; see also the project's web site http://cwb.sourceforge.net/), the total size of the corresponding index files summing up to 58,4 GB of disk space. The components of CWB are integrated as main query processing tools in the Varitext platform, which will be described in more detail in the following section. 3 The Varitext platform Design and GUI Varitext is a web-based platform (cf. http://syrah.uni-koeln.de/varitext/ and http: //extranet-ldi.univ-paris13.fr/varitext/) providing free-of-charge access to the CoVaNa-FR corpus archive presented in section 2. As is indicated by its name, it is open to host corpora for other languages compiled according to the same rationale of large-scale variationist research in a pluricentric perspective. Work has already been completed on the prototype of a hispanophone corpus archive, which will be released via Varitext in the near future. There are also plans to compile similar resources for Portuguese, Russian and Arabic. The toolbox implemented by the Varitext platform is built upon three major software components: CWB for query processing, the UCS toolkit version 0.6 (cf. Evert 2005, the software being available at http://www.collocations.de/software.html) for cooccurrence analysis and R (R Core Team 2014) for statistical computing and plotting. The platform's user interface allows fairly complex queries in terms of subsampling and the formulation of search expressions. Using the menu options relating to the available metadata categories (such as country code, newspaper volume or thematic section), it is possible to create subcorpora and partitions with different degrees of granularity, as is shown by Fig. 2 : As for the formulation of query expressions, the interface integrates a sub-menu to set up search constraints flexibly by combining several token properties (such as lemma, PoS or syntactic function; see the data model outlined in table 2 above) and / or assembling sequences of various length (see Figure 3 ). In its present state, the Varitext platform features as its standard applications a KWIC concordancer and a set of tools for frequency computing, key word analysis and collocation processing, the latter of which will be outlined in some detail below. Future releases of the platform will also include advanced functionalities of statistical computing and plotting that are currently under development and testing and which will be briefly sketched at the end of this section. 3.2 Usage Scenario: Sample Specific Frequencies and Lexical Differences 3.2.1 chaussure vs. soulier One of the platform's standard applications besides KWIC concordancing is the computation of sample specific frequencies and key word analysis. In a corpus-based perspective, these methods can be used for instance as diagnostics to test the results of 'differential' lexicology. Similar to Thibault's (2007) study on some lexical specificities of Canadian (Quebec), Swiss and metropolitan standard French, it would be possible to analyze geographical lexical variants in terms of their frequency distribution. An example also mentioned by Thibault (2007:468-475 ) is provided by the nouns chaussure and soulier (\"shoe\"), with soulier being regarded as regional variant especially of Canadian French (cf. the reference dictionary Le Petit Robert (Rey-Debove and Rey 2006) s.v. SOULIER). A key word analysis based on the samples representing Canada/Quebec (geographical code: CAN), France (FRA) and Switzerland (CHE) yields the log-likelihood ratio (LL) scores given by the following bar plots in Fig. 4 (for the use of the log likelihood ratio in key word analysis see Rayson 2003) . The computation has been carried out on a 2x2 basis, with one sample as the main corpus and the combination of the remaining two as the reference corpus. These figures indicate that there are clear-cut distributional divergences, with the two nouns being respectively under-and overrepresented in the samples related to Quebec and France. This seems to suggest that soulier is still part of the French standard as it evolves in Quebec, or at least in its national newspapers, which qualifies to some extent the findings of Thibault (2007:474) , according to which Quebec newspaper language is moving towards greater conformity with French metropolitan usage in the case of chaussure and soulier. It should be noted that Thibault only considers the relative frequencies of the two items within each national sample. Applying this approach to our corpus data would provide no more than a confirmation of Thibault's findings. In light of the aforementioned key word analysis, though, there is sufficient evidence to conclude that, in Quebec French, the relationship between the two variants is rather more complex and should be subjected to a more detailed analysis in terms of collocational distribution. One promising approach in this respect would be Hoey's (2005) lexical priming theory. Quebec Specific Lexical Items At this point, it is worth noting that, although major national newspapers might reflect trends of standard varieties quite faithfully (see our reference to Glessgen 2007 in section 2), the data obtained from these sources should be handled with some caution (cf. also Thibault 2007:474) . This is of particular importance if we adopt a corpus-driven approach, which involves identifying the most characteristic features in a sample by means of statistical techniques such as key word analysis. This may be illustrated with the results of a key word analysis contrasting the Quebec subcorpus as a whole with the sample representing France. The data given in Table 3 show that the most specific items are proper nouns closely related to sociocultural context, whereas words which clearly qualify as Quebecisms, such as chum (\"friend, pal\"), magasiner (\"to go shopping\"), placoter (\"to chat\"; cf. Poirier 1995:32) or paqueter (\"to pack\"; cf. Poirier ibid) only come at lower ranks, their log-likelihood scores being nonetheless highly significant. Usage Scenario: Lexical Cooccurrences and Collocational Variation The second main application provided by the platform's toolbox is collocation analysis. We will illustrate this functionality by considering the example of the causative support verb occasionner (\"to occasion sth\") and the semantic associations instantiated by its most significant collocates within each of the samples making up the CoVaNa-Fr corpus archive. The following cross table which is based on the lexicogram (defined as list of collocates specified by association scores; see Tournier 1987) computed for occasionner displays some of the nouns in direct object position significantly collocating with this verb in terms of the log-likelihood ratio (the use of the latter as an association measure for collocation analysis having been proposed, amongst others, by Dunning 1993) It is easy to see that the combinatorial profile of occasionner is essentially characterized by negative semantic prosody throughout all the samples under investigation (for the concept of semantic prosody, see Stubbs 1995 and Xiao and McEnery 2006) . At the same time, however, it exhibits some degree of regional variation; in the case of the sub-corpus representing the Congo (COD), for example, there is an additional semantic feature in evidence which may be described as INTENSITY (cf. the collocates accroissement [\"increase, growth\"], augmentation [\"increase, rise\"] and baisse [\"decrease, fall\"]). A similar statement can be made with regard to the significant noun collocates of causer (\"to cause\"), although in this case it is the Quebec sample which adds more neutral marked elements (surprise [\"surprise\"]) to the overall picture. We illustrate this by a means of a plot generated by a correspondence analysis (CA, see Lebart et al. 1998:47ff) performed on the sample specific lexicograms comprising the direct object nouns significantly associated 6 with the verb in question (further examples of using CA to explore the CoVaNa-FR are given by Diwersy and Loiseau forthcoming): The CA plot 7 given in Fig. 5 highlights in its main (horizontal) dimension the contrast between the Quebec subcorpus and the remaining samples, this contrast being paralleled by the contrast between the noun surprise and other items such as souci (\"worry\") and dégât (\"damage\"). 8 Correspondence analysis is a useful technique in providing a condensed view of divergences relating to samples and lexical items. It will be included in the next release of the Varitext platform. Conclusion As the examples in the preceding section have shown, there is considerable scope for using corpus-related techniques (beyond concordancing) to investigate geographical variation from a pluricentric perspective, but researchers must exercise caution when working on the diverse sets of data which can be obtained using the resources outlined in this paper. A major case in point is the composition of the corpus archive and its current restriction to journalistic texts, which may bring about phenomena related to the socio-cultural context rather than the linguistic one (although, from the point of view of media discourse analysis and communication studies, these thematic \"side effects\" could be of quite some interest). It should be obvious, then, that our present activities focus on diversifying the corpus resources, especially with regard to other written genres. At the same time, we are engaged in extending the overall text archive to include corpora for different languages, the rationale being to apply the methodological framework implemented by the Varitext platform to linguistic areas other than Francophonia. This framework is itself undergoing considerable modifications which will lead to the integration of advanced statistical functionalities. At present, our main interest is to enhance the platform's toolbox by implementing several exploratory multivariate techniques, which will be tested in experimental settings that, however, go beyond the narrow focus of this paper. That said, the development of the corpus archive and of the platform is still in its infancy, and is set to evolve further in various ways and directions. At least, this is what should happen if the community makes good use of it. Acknowledgements The author wishes to thank the reviewers for their valuable comments which helped to clarify the main points of the paper.",
    "funding": {
        "military": 0.0,
        "corporate": 0.0,
        "research agency": 5.51223498068687e-07,
        "foundation": 6.98819728239819e-06,
        "none": 0.9999984951481323
    }
}