{
    "article": "We have used a novel Bayesian model of joint word alignment and part of speech (PoS) annotation transfer to enrich the Swedish Sign Language Corpus with PoS tags. The annotations were then handcorrected in order to both improve annotation quality for the corpus, and allow the empirical evaluation presented herein. Introduction While Swedish Sign Language (SSL) is a recognized language of Sweden, there are no NLP tools available for it. We used a novel method for part of speech (PoS) annotation transfer to create the first automatically PoS-tagged corpus of any sign language, by exploiting the existing translation of the corpus into written Swedish. We then manually corrected the resulting annotations, in order to provide high-quality data that could be used for e.g. future supervised PoS taggers. Parts of Speech in Sign Languages In early sign language (SL) linguistics, Supalla and Newport (1978) observed that consistent phonological patterns can distinguish PoS in phonologically and semantically related nounverb pairs in American SL: nouns more often being restrained and repeated; verbs having a continuous articulation. A number of studies have similarly investigated nouns and verbs in a variety of SLs-e.g. Johnston (2001) for Australian SL; Hunger (2006) for Austrian SL; Kimmelman (2009) for Russian SL; and Tkachman and Sandler (2013) for Al-Sayyid Bedouin SL and Israeli SL-finding that e.g. manner, repetition, duration, size and mouthing 1 can differentiate nouns from verbs. However, extensive research of PoS in SLs is generally lacking (Schwager and Zeshan, 2008) . Turning to SSL, one study looked at morphosyntactic constraints differentiating e.g. verbs and adjectives (Bergman, 1983) , and a recent overview of the linguistic structure of SSL lists 8 PoS (Ahlgren and Bergman, 2006) -based mainly on semantic and syntactic criteria identified in previous research-which is the set used in this work. There are currently a number of ongoing SL corpus projects around the world, but few of them have extensive annotations for e.g. grammatical categories. One exception is the Auslan Corpus (Johnston, 2010) , which features annotations of \"grammatical classes\" that to a large extent correspond to functional PoS (Johnston, 2014) . However, the annotations in all of these SL corpora are done manually, which is rather time-consuming. The Swedish Sign Language Corpus The Swedish Sign Language Corpus (SSLC) (Mesch et al., 2012; Mesch et al., 2014) contains 25 hrs of partially transcribed, conversational data from 42 different signers of SSL. Its annotations mainly consist of a gloss for each sign (see 4.3), and a translation into written Swedish. The version used in our evaluations contains 24 976 SSL tokens, not sentence-segmented, and 41 910 Swedish tokens divided into 3 522 sentences. Segmenting SSL data into sentences or utterances is no trivial task (Börstell et al., 2014) , and there is currently no such segmentation in the SSLC. In order to use sentence-based word alignment models, we follow Sjons (2013) in using the Swedish sentences as a basis for segmentation. Method Since SSLC contains translations of each utterance into written Swedish, it is in effect a parallel corpus of Swedish and SSL. It has long been recognized that parallel corpora are useful for transfering annotation between languages (Yarowsky et al., 2001) , and so our goal is to automatically transfer part of speech (PoS) tags from the Swedish translations to the SSL glosses. Given the relatively small size of the corpus, and the significant differences between the two languages, the error rate is expected to be high enough to warrant a final stage of manual correction. Bayesian word alignment Most previous research on word alignment has been building on the IBM models Brown et al. (1993) using Expectation-Maximization (EM) for inference. Recently, Bayesian models have been proposed as an alternative, offering a theoretically well-founded way of introducing soft constraints that encourage linguistically plausible solutions (DeNero et al., 2008; Mermer and Sarac ¸lar, 2011; Riley and Gildea, 2012; Gal and Blunsom, 2013) . Alignment and part of speech transfer Several authors, starting from Brown et al. (1993) , have used word classes to aid word alignment in various manners. Toutanova et al. (2002) show that if both parts of a bitext are annotated with PoS tags, alignment accuracy can be improved simply by using a tag translation model p(t f |t e ) in addition to the word translation model p(f |e). Given that PoS tags improves the quality of word alignments, and that word alignments can be used to transfer PoS tags from one language to an-other, we use a model that jointly learns PoS tags and word alignment. Figure 1 illustrates our circular generation model, so termed because a source language token is assumed to generate a target language token (through p t (f |e) = θ te ), which then generates its corresponding PoS tag (through p g (t f |f ) = θ gf ), which finally generates a PoS tag for the source language token (through p c (t e |t f ) = θct f ). We assume categorical distributions with Dirichlet priors: θ t ∼ Dir(α t ); θ g ∼ Dir(α g ); θ c ∼ Dir(α c ) These priors are symmetrical, except for α c which is biased towards consistency between the tagsets. In our evaluations, we use α c = 1000 for consistent tag pairs, α c = 1 for others. Inference in this model is performed using collapsed Gibbs sampling, where the alignment variable a j (which links target token f j to source token e i ) is sampled jointly with the target PoS tag t f j . The sampling equation is similar to those used by Mermer and Sarac ¸lar (2011) and Gal and Blunsom (2013) , with extra factors for the PoS tag dependencies. We also use the HMM-based word order model of Vogel et al. (1996) , but as this does not directly interact with the PoS tags, we exclude it from Figure 1 for clarity. From this model we obtain SSL part of speech tags in one of two different ways: directly from the model (the t f j variables), or by direct projection through the final alignment variables a j . In both cases the sampling procedure is identical, the difference lies only in how the final PoS tags are read out. Data processing SSLC is annotated using the ELAN software (Wittenburg et al., 2006) . Annotations are arranged into tiers, each containing a sequence of annotations with time slots. For the present study, two types of tiers are of interest: the signs of the dominant hand and the Swedish sentences. Signs are transcribed using glosses, whose names are most often derived from a corresponding word or expression in Swedish. Each gloss may also have a number of properties marked, such as which hand it was performed with, whether it was reduplicated, interrupted, and so on. The annotation conventions are described in further detail by Wallin et al. (2014) . The first step of processing is to group SSL glosses according to which Swedish sentence they overlap most with. Second, glosses with certain marks are removed: • Interrupted signs (marked @&). • Gestures (marked @g). • Incomprehensible signs (transcribed as XXX). Finally, some marks are simply stripped from glosses, since they are not considered important to the current task. • Signs performed with the non-dominant hand (marked @nh). • Signs held with the non-dominant hand during production of signs with the dominant hand. The gloss of the held sign (following a <> symbol) is removed. • Signs where the annotator is uncertain about which sign was used (marked @xxx) or whether the correct gloss was chosen (marked @zzz). In all, this is nearly identical to the procedure used by Sjons (2013, p. 14) . Example 1 illustrates the output of the processing, with English glosses and translation added. The Swedish translations were tokenized and PoS-tagged with Stagger ( Östling, 2013) , trained on the Stockholm-Umeå Corpus (SUC) (Ejerhed et al., 1992; Källgren, 2006) and the Stockholm Internet Corpus (SIC). 2 Evaluation data At the outset of the project, two annotators manually assigned PoS tags to the 371 most frequent sign glosses in the corpus. This was used for initial annotation transfer evaluations, and when the methods reached a certain level of maturity the remaining gloss types were automatically annotated, and the resulting list of 3 466 glosses manually corrected. Thus the initial goal of using annotation transfer to facilitate the PoS annotation was achieved, since all of the currently transcribed SSLC data now has manually verified annotations. In order to evaluate the performance of the annotation transfer algorithms, we use this final set of 3 466 annotated types as a gold standard. Tag set conversion As previously mentioned, we use the eight PoS categories suggested by Ahlgren and Bergman (2006) for SSL. The Swedish side is tagged using the SUC tagset, whose core consists of 22 tags (Källgren, 2006, p. 20) . For direct tag projection and the tag translation priors in the circular generation model, the SUC tags are translated as in Table 1 . Task-specific constraints SSLC contains various annotations that are useful for part of speech tagging. First of all, a few parts of speech are already apparent from the annotation: proper nouns (marked @en), pronouns (begin with PRO-or POSS-), and classifier constructions (marked @p, considered to be verbs). Second, the choice of gloss (in Swedish) correlates strongly with the SSL part of speech. In Example 1, for instance, the part of speech of most signs can be correctly guessed from the gloss alone, although sometimes this is not possible due ambiguity (e.g. stämma is ambiguous between noun and verb) or because the gloss name is not a Swedish word (e.g. PERF). We exploit this correspondence by requiring glosses to be tagged consistently with the SALDO morphological lexicon (Borin and Forsberg, 2009) . That is, if the SALDO lexicon says that the name of a gloss is a Swedish word form with an unambiguous word class, this word class will always be assumed for the gloss. As can be seen from the baseline row in 2 : Token-level PoS tagging accuracy, using direct projection from the final alignment (projection) or for the joint models, the sampled PoS tag variables t f j (model). Note that in the former case, the PoS tag variables are ignored except during the alignment process. Figures given are averages ± standard deviation estimated over 64 randomly initialized evaluations for each configuration. these constraints alone reach a fairly high level of accuracy. Results Table 2 shows the per-type and per-token accuracy for a number of different configurations, using both direct projection (project) and the sampled t f j PoS tag variables (model). While the model itself assigns tags on the token level, when obtaining the figures in Table 2 we ensure typelevel tagging by assigning each token the majority tag of its type. This is also done for the tokens columns. Since the SSLC annotation does not contain glosses with ambiguous part of speech, using only token-level would introduce unnecessary noise. The baseline model performs word alignment only, assigning random values to the PoS tag variables. Projection accuracy is fair (indicating that the word alignments are acceptable), but the much lower scores in the model columns represent an entirely random baseline. When the constraints described in Section 4.6 are enforced during sampling, the model scores increase as expected. Without coupling between the word alignment and PoS tags, the projected tags are not changed. Using the circular generation model, the coupling between PoS tags and word alignment leads to better accuracy, as expected. This is also the case when using direct projection, indicating that the joint model increases word alignment quality (which we are unable to evaluate directly, lacking a gold standard word alignment). Adding bigram dependencies between SSLC PoS tags allows the model to use (monolingual) contextual information, but this does not seem to affect the accuracy. The probable reason for this is that the coupling between Swedish and SSLC PoS tags is quite strong, and the contextual information can not significantly affect the final tagging. The best results were obtained by using the circular model in conjunction with enforcing the task-specific constraints. The improvement when adding the constraints is particularly large on the type level, because this allows reasonable guesses for many of the rare types where there is not enough data for reliable word alignments. This is important for our goal, since we actually want type-based part of speech assignments. The 77% accurate type-level tag list was manually corrected by two annotators (reaching consensus) in order to obtain the final tagging of the corpus, which is also used as the gold standard for the evaluation described in this section. Conclusions We have shown that annotation transfer, performed in a Bayesian model of joint word alignment and part of speech transfer, can be a useful tool when annotating a sign language corpus with parts of speech. It should be stressed that our conclusions apply to this particular data set, which is rather untypical for annotation projection tasks, especially due to its limited size. Work carried out in parallel with the present study indicates that for longer parallel texts with better translations, other models may be more accurate. Since the primary aim of this study was to investigate methods for annotating the SSLC, rather than exploring annotation transfer in general, we are not currently concerned with other data.",
    "abstract": "We have used a novel Bayesian model of joint word alignment and part of speech (PoS) annotation transfer to enrich the Swedish Sign Language Corpus with PoS tags. The annotations were then handcorrected in order to both improve annotation quality for the corpus, and allow the empirical evaluation presented herein.",
    "countries": [
        "Sweden"
    ],
    "languages": [
        "Russian",
        "Swedish"
    ],
    "numcitedby": "10",
    "year": "2015",
    "month": "May",
    "title": "Enriching the {S}wedish {S}ign {L}anguage Corpus with Part of Speech Tags Using Joint {B}ayesian Word Alignment and Annotation Transfer"
}