{
    "article": "The paper studies the diversity of ways to express entity aspects in users' reviews. Besides explicit aspect terms, it is possible to distinguish implicit aspect terms and sentiment facts. These subtypes of aspect terms were annotated during SentiRuEval evaluation of Russian sentiment analysis systems organized in 2014-2015. The created annotation gives the possibility to analyze the contribution of non-explicit aspects to the overall sentiment of a review, their main patterns, and possible use. Introduction When the authors of texts express their opinions about some entities, they often indicate specific properties (or aspects) of the entity that evoke positive or negative sentiments. Revealing these aspects and related sentiment is very important for various directions of automatic sentiment analysis, including analysis of user reviews, reputation monitoring, or social mood analysis because such analysis helps to find problems or strong points of the discussed entities. Therefore, socalled Aspect-Based Sentiment Analysis (ABSA) becomes more popular (Liu and Zhang, 2012; Bagheri et al., 2013; Popescu and Etzioni, 2005; Feldman, 2013; Poria et al., 2014) . Entity aspects are expressed in texts with aspect terms and can usually be classified into categories. For example, Service aspect category in restaurant reviews can be expressed in such terms as staff, waiter, waitress, server, and etc. Aspect-based sentiment analysis includes several stages, such as revealing aspect terms and their categories, extraction of sentiments expressed toward found aspects, and visualization of extracted information. It is usually supposed that an aspect of an entity is conveyed by a noun or a noun group that explicitly denotes a property of an entity and does not contain sentiment within itself, so called explicit aspects. So, in aspect-based sentiment analysis evaluations organized in the framework of Se-mEval conference, only explicit aspects were annotated (Pontiki et al., 2014; Pontiki et al., 2015) . However, aspects can be expressed in an implicit way. For example, the phrase ready to help expresses positive sentiment toward restaurant service, without mentioning aspects explicitly. In SentiRuEval evaluation of aspect-based sentiment analysis of Russian texts (Loukachevitch et al., 2015) , besides explicit aspects, so-called implicit aspects (sentiment words with implied aspects) and sentiment facts (phrases with implicit sentiments and aspects such as answered all questions) were labeled. These annotations give a new possibility to study the contribution of various types of aspects into the overall sentiment of users' reviews and their possible use in sentimentoriented summaries. This evaluation is the second Russian sentiment analysis evaluation event after ROMIP sentiment analysis tracks in 2011-2013 (Chetviorkin and Loukachevitch, 2013) . In this paper, we consider subtypes of aspect terms and principles of aspect labeling in the framework of SentiRuEval evaluation. Also, we present the analysis of manually labeled aspect terms expressed implicitly and show their usefulness for generating sentiment-oriented summaries. Related Work For studying aspect-oriented sentiment analysis, several datasets were created. The restaurant review dataset created by Ganu et al. (2009) uses six coarse-grained aspect categories (e.g., FOOD, PRICE, SERVICE) and four overall sentence polarity labels (positive, negative, conflict, neutral). Each sentence is assigned to one or more aspect categories together with a polarity label for each category. Hu and Liu (2004) created the product review dataset containing 100 reviews for each of five electronics products. They labeled terms naming aspects (e.g., voice dialing) together with their sentiment strength scores. They found that aspects can be expressed explicitly or implicitly, as the size aspect in the sentence it fits in a pocket nicely. Zhang and Liu (2011) argue that there are many types of expressions that do not bear sentiments on their own, but they imply sentiment in specific contexts. One such type of expressions involves resources, which are important for many application domains. For example, money is a resource in probably every domain, gas is a resource in the car domain, and ink is a resource in the printer domain. An expression containing a quantifier (some, more, large, small, etc.) in combination with a resource term may often look like a reference to an objective fact but, in practice, it often implies a specific sentiment. In (Gupta, 2013; Tutubalina and Ivanov, 2014; Zhang et al., 2012) , extraction of so-called technical problems mentioned by users in reviews was discussed. Technical problems can also be considered as specific types of sentiment-oriented facts. Besides, some non-opinionated words can have negative or positive associations (connotations (Feng et al., 2013) ) that their appearance in a text can imply relevant sentiment, e.g., word hair has usually the negative connotation in the restaurant domain (hair on the plate). The dataset created by Ganu et al. (2009) was used as a basis for aspect-based review analysis evaluation at SemEval in 2014 (Pontiki et al., 2014) . The dataset included isolated, out of context sentences in two domains: restaurants and laptops. The set of aspect categories for restaurants included: FOOD, SERVICE, PRICE, AMBIENCE, ANECDOTES/MISCELLANEOUS. In 2015 SemEval evaluations of the aspectbased sentiment analysis of reviews was focused on entire reviews (Pontiki et al., 2015) . Aspect categories of terms became more complicated and now consist of Entity-Attribute pairs (E-A), for example FOOD-PRICE, FOOD-QUALITY. In both cases, only explicit aspects (comprising named entities, common nouns, or multiword noun groups) were labeled and used for systems testing. The ultimate goal of the ABSA was formulated as generation of summaries enumerating all the aspects and their overall polarity (Figure 1 ). Figure 1 : Sentiment-aspect summary as a goal for aspect-based sentiment analysis (Pontiki et al., 2015) . SentiRuEval Testing of Russian Sentiment Analysis Systems The SentiRuEval evaluation organized in 2014-2015 was focused on entity-oriented sentiment analysis of Twitter and aspect-oriented analysis of users reviews in Russian. For evaluation of aspectoriented sentiment analysis systems, two domains (restaurant reviews and automobile reviews) were chosen (Loukachevitch et al., 2015) . During the annotation phase, not only explicit aspects but also aspects expressed implicitly (see Section 4) were marked up. To each labeled aspect, its sentiment (positive, negative, neutral, or both) and aspect category should be assigned to. For restaurant reviews, aspect categories included: FOOD, SERVICE, INTERIOR (including ambience), PRICE, GENERAL. For automobiles, aspect categories were: DRIVEABILITY, RELIABILITY, SAFETY, APPEARANCE, COMFORT, COSTS, GENERAL. The aspect categories with their sentiment scores (positive, negative, both, or absent) were also attached to the whole review. The participants were to solve one or more of the following tasks in two domains: automatic extraction of explicit aspects, automatic extraction of all aspect terms, extraction of sentiments towards explicit aspects, automatic categorization of explicit aspects into aspect categories, and sentiment analysis of the whole review according to aspect categories. The labeling of training and test data was conducted with BRAT annotating tool (Stenetorp et al., 2012) . Aspects in each review were labeled by a single linguist under inspection of a supervisor. Besides, to check up the quality of aspect labeling, several specialized procedures were implemented. So, some accidental mistakes were found and corrected (Loukachevitch et al., 2015) . Altogether, about 200 reviews were prepared for each domain as a training collection and additional 200 reviews in each domain served as a test collection. Table 1 shows labeled data statistics in two domains. Nine Russian groups and individual researchers were participants of SentiRuEval-2015. The results of the participants are described in (Loukachevitch et al., 2015) . All data and results are publicly available. 1 In this paper, we analyze the aspect labeling carried out in the framework of SentiRuEval. Restaurants Automobiles Labeling Types of Aspects in SentiRuEval In contrast to SemEval ABSA labeling, the ultimate goal of aspect labeling at SentiRuEval is to generate summaries in form of informative keywords expressing both aspect and related sentiment. It was supposed that such summaries can better convey the mood of users' opinions than traditional star-oriented summaries. Keyword-based interfaces are appropriate not only for desktop computers, but also for mobile devices. The similar approach is described in (Yatani et al., 2011) . However, in that work, only sentimentoriented adjective-noun word pairs were extracted (see Figure 2 ). Besides, extraction of implicit sentiment and aspects was not considered. The SentiRuEval labeling was directed to study various forms of aspect-sentiment tags that can be utilized for visualization of users' opinions. From this point of view, it was found that the labeling of 1 http://goo.gl/Wqsqit several types of aspect-related expressions is useful including explicit aspects, implicit aspects, and sentiment facts. Figure 2 : Example of the aspect-oriented review summary as a set of sentiment-aspect keywords (Yatani et al., 2011) . As in previous works, explicit aspect terms denote some parts of an entity (such as an engine, a compartment, or a trunk of a car) or its characteristics (appearance of a car). They can also denote produced products (pasta, desserts), related services (staff, personnel), or surrounding conditions (music, noise, smell, and etc.). The cost (price) related aspect is present in most domains. To form sentiment-oriented keywords, explicit aspects should be combined with sentiment words. Explicit aspects are usually expressed by nouns or noun groups, but in some aspect categories, it is possible to encounter explicit aspects expressed as verbs or verb groups. For example, in restaurant reviews, such verbs as eat, drink (FOOD category); greet (SERVICE) are often used to express explicit aspects. In the car domain, frequent examples of such verbs and verb groups are look (AP-PEARANCE), speed up, park, hold the road (DRIV-ABILITY). 2 Verbs expressing explicit aspects can be met in constructions with sentiment-oriented adverbs such as ate very well, greeted well, etc. Keywords in such forms (greeted well) can be presented to users in sentiment-oriented summaries. Therefore, in the SentiRuEval data, verbs may also be labeled as explicit aspect terms. The presence of verbs in aspect categories varies. Implicit aspect terms are evident sentiment words having appraisal as a sense component but, in the current domain, these words also imply a specific aspect category. Frequent examples of implicit aspect terms in the restaurant domain are tasty (positive+FOOD), polite (positive+SERVICE), comfortable (positive+INTERIOR), cosy (posi-tive+INTERIOR), expensive (negative+PRICE). In the car domain, frequently mentioned implicit aspects are beautiful (positive+APPEARANCE), mighty (pos-itive+DRIVABILITY), spacious (posi-tive+COMFORT), comfortable (posi-tive+COMFORT), reliable (positive+RELIABILITY), safe (positive+SAFETY), economical (posi-tive+PRICE). Phrases that included an implicit aspect term and a negation or intensifier were also considered as implicit aspect terms (not comfortable (negative+INTERIOR)). The importance of these words for automatic sentiment analysis is in that implicit aspects allow a sentiment system to reveal the implied opinion about entity characteristics even if an explicit aspect term is unknown, written with an error, or referred to in a complicated way. In a keywordoriented interface, implicit aspects can be presented alone (tasty), or with the corresponding category (tasty food). In Russian, implicit aspects can be shown in an adverb form: vkusno (tastily). Sentiment facts are single words or short, syntactically correct phrases that do not mention the user sentiment directly but inform about user's opinion via mentioning facts. In the restaurant domain, frequent sentiment facts include such expressions as: large portions, large choice of dishes (FOOD); waited for a long time, forgot, didn't bring (SERVICE); dim lights, plenty of space (INTERIOR); come again, come back (GENERAL). In sentiment facts, aspects are also often implicit. Sentiment facts express the specificity of an object under review and can be directly depicted (in an appropriate form) as sentiment keywords. In the SentiRuEval data, the amount of reviews with more than 10% of implicit sentences (containing only implicit aspects or sentiment facts without mentioning explicit aspects) ranges from 15 to 30% across training and test collections. For some reviews, the amount of such sentences constitutes up to 40%. Figure 3 shows that more than a half of the reviews in the SentiRuEval restaurant training collection (106 of 201) contains sentences with implicitly expressed aspects. If we compare the SentiRuEval aspect annota- tion with labeling in the framework of SemEval ABSA-2015 then it can be seen that the ABSA dataset also contains sentences with implicit aspects and sentiment facts but such sentences are marked with the label target=NULL (Pontiki et al., 2014; Pontiki et al., 2015) what means an absent (null) target. In the NULL-labeled ABSA examples, it is often possible to mark-up sentiment facts. For example, in the following sentence from the ABSA guidelines marked with NULL target \"They never brought us complimentary noodles, ignored repeated requests for sugar, and threw our dishes on the table\", three sentiment facts could be annotated: never brought, ignored repeated requests, and threw our dishes. Syntactic Patterns and Semantic Subtypes of Sentiment Facts Extraction of sentiment facts is not a simple task because syntactic structures of sentiment facts are quite diverse. Their most frequent syntactic patterns are different in two domains (Table 2 ). It is important to note that in Verb+Noun patterns, a noun can be in function of a subject or an object because of free word order in Russian. The annotators were asked to label sentiment facts as minimal syntactically correct phrases indicating an aspect and a sentiment within them- selves but currently this requirement was not fully observed. Therefore, we can see that in the restaurant domain, syntactic patterns seem to be more diverse and the frequency of the most frequent patterns is lower. From the lexico-semantic point of view, multiple cases of RESOURCE-BASED FACTS containing resource terms described in (Zhang and Liu, 2011) can be revealed among sentiment facts. In the restaurant domain, one can find the following kinds of resource terms: time of a restaurant guest; attention of waiters; three food-oriented resources including food on a plate, choice in a menu, and availability of a specific dish; space in a restaurant room and free tables; and money of visitors. In the automobile domain, there are such resource terms as space in a compartment or trunk; fuel; and money for purchase, fuel, or maintenance of a car. In both domains, the resource terms are often mentioned in phrases together with quantifiers (many, small, large, and etc.). The particle not in a phrase with a notopinionated verb often denotes the deviation from a normal state of affairs (FAILURE FACTS). A similar effect appears from the usage of words absence, absent. Gradable adjectives, which are a priori not correlated with a specific sentiment, in phrases with explicit aspects often become sentiment facts (cold kebab, broad windows)(GRADABILITY FACTS). Words denoting sounds or noises (loud, crackle, and etc.) can express positive or negative sentiment facts in various domains (NOISE FACTS). They are met in both domains under analysis. Thus, for automatic extraction of sentiment facts and utilizing them in sentiment-oriented interfaces, it is useful to extract at least: phrases with negation particles not containing sentiment words; phrases with gradual adjectives, and phrases with quantifiers. A vocabulary with noise-and failuremeaning words and phrases can be also useful for extraction of sentiment facts in various domains. If extracted correctly, a keyword-based sentiment summary about a restaurant can include various types of aspect terms and look as follows: nice dessert, broad windows, waited for a long time, politely, will come again. Each keyword conveys information about both an aspect and related sentiment. Conclusion The paper studies the diversity of ways to express entity aspects in users' reviews and considers subtypes of aspect terms in aspect-oriented sentiment analysis. Besides explicit aspect terms, it is possible to distinguish implicit aspects and sentiment facts. These subtypes of aspects were annotated during SentiRuEval evaluation of Russian sentiment analysis systems organized in 2014-2015. The created annotation allowed us to analyze the contribution of non-explicit aspects to the overall sentiment of a review, their frequent patterns and their possible use in sentiment-oriented interfaces. The analysis of labeled sentiment facts in the SentiRuEval data revealed such types of frequent sentiment facts as RESOURCE-BASED FACTS, FAILURE FACTS, GRADABILITY FACTS, and NOISE FACTS. Acknowledgments This work is partially supported by RFBR grants No. 14-07-00682, No. 15-07-09306 and by the Russian Ministry of Education and Science, research project No. 586."
}