{
    "article": "This paper proposes a framework to extract diverse opinionated sentences within a given news article, by introducing the concept of diversity in a graphical model for opinion detection. We conduct extensive evaluation and find that the proposed modification leads to impressive improvements in performance and makes the final results of the model more usable. The proposed method (OP-D) not only performs much better than the other techniques used for opinion detection and introducing diversity, but is also able to select opinions from different categories (Asher et al., 2009) . By developing a classification model which categorizes the identified sentences into various opinion categories, we find that OP-D is able to push opinions from different categories uniformly among the top opinions. Introduction Online publishing houses desire to develop engagement of users around the articles published on their websites. An important aspect of user engagement is commenting on the article and subsequently building up a conversation around it. In order to facilitate meaningful conversation, an option might be to identify and highlight specific relevant portions of the article, which may act as a seed for such conversation. For ensuring wide engagement, it would be best if the sentences chosen are opinions expressed in the article, as unlike factual statements, opinions might easily kick-start discussions. Further, to be able to engage a wide range of audience, it would be helpful if each chosen sentence expresses different context than the other. In general, all opinions are not of the same type. Opinions can be categorized into various categories and sub-categories (Asher et al., 2009) , and it would be ideal if the extracted opinions cover multiple such categories. Some examples of these categories are provided below: 1) Report : e.g., Christie's staffs have denied Zimmer's allegation. 2) Judgment : e.g., McGreevey's lover was being paid 11000 Dollar even though he was wildly unqualified for the position. 3) Advise : e.g., Let's shoot at the opposition not our own troops, one Insider pleaded. 4) Sentimental : e.g., So why do so many people enjoy ridiculing my New Jersey One word Jealousy? Opinion analysis has been a major field of study in natural language processing and data mining for many years. Several works such as (Kim and Hovy, 2006; Qadir, 2009; Scholz and Conrad, 2013; Yu and Hatzivassiloglou, 2003) focus on opinion mining. Opinion mining is very similar to subjectivity classification where subjective nature indicates the tendency of expressing one's thoughts and opinions. Work has been done in the past for developing classifiers (Wiebe and Riloff, 2005) which separate subjective sentences from objective ones, using several features present in the sentences. (Soni et al., 2014) describes how to predict certainty (factuality) of text (e.g., tweet) by using keywords collected from source introducing predicates (cues) and groups (Saurí, 2008) . These models focus only on the local context (takes no global context into account) from a sentence to measure its subjectivity. Side by side, there have been works where graphical models have been proposed to capture the global context, where the sentences are treated as nodes in the graph and a similarity measure between sentences is defined to build this graph. While some of the approaches use PageRank to model each node in a similar manner (Erkan and Radev, 2004) , HITS framework has also been used that establishes a relationship between opinions and supporting facts by modeling opinions as hubs and facts as authorities (Rajkumar et al., 2014) . None of these works, however, focus on finding diverse opinions from an article. Experiments on MPQA and Yahoo datasets (both are English datasets) show that this leads to a sub-optimal performance, while trying to extract the most opinionated sentences in a news article. The graphical models end up choosing similar sentences -which is not ideal to enable wide-ranging user engagement. We, therefore, attempt to modify a variant of graphical model proposed in (Rajkumar et al., 2014) to introduce diversity. The basic idea of our approach is that once a node (sentence) is selected as an opinion because of a high hub score (as per the HITS framework used in (Rajkumar et al., 2014 )), we can discount the hub scores for the nodes it links to, as these might be sub-opinions supporting the main opinion, and discounting their hub scores might improve diversity. We find that this simple modification to the earlier framework leads to impressive improvement in performance for (i) Classifying opinions and facts, and (ii) Identifying diverse opinion categories in both datasets. Extensive experimental results are reported to show that as a result of this modification, the output opinions can be used more meaningfully. Note that the proposed technique is unique from the general work on diversity (Carbonell and Goldstein, 1998; Munson et al., 2009; Zhu et al., 2007; Mei et al., 2010) in that we introduce diversity in a model with two different kinds of nodes in the document graph, as opposed to the other algorithms, which treat all the sentences equally. Further, to understand the distribution of extracted opinions from online news in various categories, e.g., Report, Judgment, Advise and Sentiment etc. (Asher et al., 2009) , we develop an opinion classification model. While classification of opinions into various sentiment levels such as positive, negative and neutral has been tried (Saggionα and Funk, 2010; Yu et al., 2008) , automated classification of opinions into various categories is not available. Analysis using the opinion classification model shows that our algorithm (OP-D) actually adds diversity even at the category level by selecting opinions from different opinion categories. Extracting Diverse Opinions: OP-D The proposed algorithm for extracting diverse opinions from news articles comprises of three steps: (i) Extracting features and assigning a score to indicate opinionatedness of a sentence. (ii) Building up the fact-opinion graph, applying HITS algorithm and identifying highly opinionated sentences. (iii) Identifying diverse opinionated sentences (i.e. report, judgment, advise, sentiment). (i) Feature Extraction: We extract an extensive set of features at the sentence level to classify a sentence as an opinion / fact using a binary Naïve Bayes (NB) classifier. The features used include: (a) count of the strong polar words, weak polar words in the sentence (Wiebe et al., 1999) , (b) polarity of the root verb of the sentence, (c) presence of aComp, xComp and advMod dependencies (Qadir, 2009) , (d) opinionated n-grams (Wiebe et al., ) , (e) presence of modal verbs, (f) presence of pronouns, (g) opinionated words (e.g., 'should', 'always', 'anyone', 'if' etc.) . From LIWC (Pennebaker et al., 2001) we collected words belonging to the categories -'feel', 'swear', 'certain', 'percept', 'time', as their presence in the sentence can make it more subjective or objective. A list of positive and negative polar words was used from MPQA opinion lexicon. Stanford dependency parser (De Marneffe et al., 2006) was utilized to compute the dependencies for each sentence within the news article. After those features are extracted from sentences, the Weka implementation 1 of the Naïve Bayes classifier is used to calculate the probability for each sentence to be an opinion, based on the presence of the above features. (ii) Graph Formation and Hub-Authority Calculation: In this step, a graph is generated considering each sentence as a node. The scores from the NB classifier are used to assign the initial hub scores to the sentences in the graph. In HITS, edges flow from Hubs to Authorities, so an edge between two nodes (S i to S j ) is given a higher weight W ij if the source sentence has a high probability of being an opinion (probability value obtained from the NB classifier, which is also used to initialize the hub score of this sentence as H i (0) and Initial Authority-score as 1-H i (0).), the cosine similarity between these sentences (Sim ij ) is high and the number of sentences separating i and j, (dist ij ) is small. The weight function, W ij 2 is as following W ij = H i 3 (0) • Sim ij • (0.2 + 1 dist ij ) (1) We now consider only the top k% of the edges, having the highest weights in the graph. Once we have established a hub-authority structure in the document, we compute the hub and authority scores of every node in the graph by applying the HITS algorithm Ideally, the 'important' opinion sentences would obtain high hub scores because such sentences usually are stressed more in the article by using supporting facts or other related sentences; this results in high number of outgoing edges from these opinion sentences. Sentences supporting these opinions, similarly, should get high authority score. Algorithm 1 OP-D Algorithm (output: k sentences) 1: procedure OP-D 2: for All sentences do Initialization Take top k% edges with edge weight 1 (thresholded). Set other edge weights to 0. 6: end for 7: while Root Mean Squared Error < do was set to 0.0001 8: Update hubscore(h) & authscore(a) 9: h ← AA T h ; a ← A T Aa A:Adjacency Matrix 10: end while 11: while NoOfSentencesChosen < k do 12: Sort the hub scores and select the max 13: Rank this maximum in final list 14: Decrease the hub score of the authorities of max hub 15: end while 16: end procedure (iii). Ensuring Diversity: To introduce the notion of diversity in this framework, let us assume that we have selected a node i with the highest Hub score H i as the opinion to be retrieved; and let node j be one of the authorities which has contributed to its hubness. Since we want the results to be more diverse, we decrease the hub scores of these nodes before selecting the next sentence with the highest hub score. The hub score of the authority (node j) is decremented by a fraction of the edge weight from hub (node i) to authority (node j), i.e., H j ← H j − λ.W ij (2) where λ is a constant, H j is the hub score of the authority node j and W ij is the weight of the edge from node (hub) i to node (authority) j. The decrement ensures that these sentences do not get selected immediately when picking up the node with the next highest hub score. This process is repeated until we have selected the required number of opinionated sentences from the document. Steps are shown in Algorithm 1-Opinion Diversity (OP-D). Dataset To investigate the effectiveness of the proposed framework, experiments are conducted using two different datasets, a) the standard Multi-Perspective Question Answering (MPQA) dataset (contains 535 documents) and b) 120 news articles crawled from Yahoo news. Each document is a news article pertaining to some topic. In the MPQA dataset, each sentence is classified as either opinionated or factual by checking for the presence of certain subjective elements as annotated by the authors of the corpus (Wiebe (P, R)@3 (P, R)@5 (P, R)@3 (P, R)@5 (P, R)@3 (P, R)@5 (P, R)@3 (P, R)@5 wt=w wt=w w=1/0 w=1/ Parameter Fixing: The parameters that we needed to fix for the proposed algorithm were: weight of the edges (absolute (wt) or thresholded (1/0)), k for the top k% edges if thresholded weights are used and the constant λ in Equation 2 . Table 2 shows results obtained by OP-D for different k and weight. In all the cases, we find that we get better results when the weight is properly thresholded rather than taking the absolute weight -we follow that henceforth. k = 10 performs the best, so we take top 10% of the edges. Figure 1 shows how the precision and recall values vary for different choices of λ using 5-fold cross validation for all the experiments reported. Since the best results are obtained for λ = 20, that has been fixed for all the experiments. Recall Lambda Figure 1: Variation of precision (P @3 and P @5) and recall (R@3 and R@5) for different values of λ. Baselines: We use the following baselines for comparison: a). Random Baseline: Each sentence is randomly assigned to one of the two classes, opinion or fact 4 . red We choose 3 and 5 sentences randomly to evaluate P@3 and P@5. b). Naïve Bayes (NB): The next baseline is the first stage sentence-level classifier, as described earlier. We also experimented with Logistic Regression, SMO (Sequential Minimal Optimization), Support Vector Machine (SVM), Repeated Incremental Pruning -Java version (JRip) as well as other classifiers, however NB gave the best results and was used as a baseline. c). HITS (Rajkumar et al., 2014) : We use the method proposed by (Rajkumar et al., 2014) as another baseline. Note that the first two stages of our approach are similar to (Rajkumar et al., 2014) except that we use a more extensive set of features as well as the network is unweighted. We verified that these modifications indeed lead to performance gain, and used the modified approach as the baseline. d). FactJudge (Soni et al., 2014) : FactJudge proposes a method to detect factuality of tweet. We use the factuality score given by this approach as a baseline to detect opinions, i.e., higher the factuality score, lower is the probability of being an opinion. Evaluation Metrics: We use precisions P @3, P @5 and recalls R@3 , R@5 as the evaluation measures, as we would like to obtain the best 3 or 5 opinions from the document. We perform a series of evaluations to compare the proposed approach with other baselines. In the first evaluation, we verify if the top 3 or 5 sentences returned by the algorithm are actually opinions. We also report the recall at top 3 or 5 places. We consider only those files (86 out of 100 for MPQA and 23 out of 25 for Yahoo) for testing which have at least one opinion. 3 shows the comparison results for the two datasets. We see that the random baseline, along with (Soni et al., 2014) gives a precision close to 0.5. The first stage NB classifier performs better than these methods. The graphical framework (second stage) gives further improvements upon the NB classifier, and OP-D outperforms all these baselines consistently at least by 5%. Performance on different buckets of opinion fraction: Since the fraction of opinions in each document varies, we wanted to investigate the performance at various sparsity levels and thus study the robustness of the proposed algorithm. The test datasets were divided into various buckets according to the fraction of opinionated sentence (sparse, medium and dense) in the document. The results shown in Table 4 confirm that OP-D performs better consistently across various buckets. Specifically, even for the documents with small fraction of opinions, it is able to improve performance from the NB and HITS baselines. In general, for the documents with sparse opinions, the performance is poor (across methods) which is bringing down the overall performance. This needs detailed future inspection. Diversity Experiment: While these evaluations establish that the top 3-5 sentences extracted by OP-D contain more opinions than the baselines, they do not provide insights into whether these selected opinions are more important and diverse topics with respect to the entire article. We, therefore, randomly select 50 MPQA articles and 25 Yahoo articles, provide all the sentences with gold standard opinion / fact labels to the annotators, and ask them to label 5 opinions, which they feel are important as well as diverse topics to cover the entire article. Each article is provided to 3 annotators and we use a rank aggregation method to prepare a gold standard of 5 important and diverse opinions from these articles. We now measure P @3 and P @5 (Total annotated important and diverse opinions per article is 5, so recall is a simple function of precision, therefore we omitted.) depending on what fraction of the top 3 or 5 sentences returned by various systems feature in the 5 important and diverse opinions, as selected by the annotators. We use the standard diversity algorithms, MMR (Carbonell and Goldstein, 1998) and Grasshopper (Zhu et al., 2007) , both on the results of NB and HITS, as well as DivRank (Mei et al., 2010) as baseline algorithms for diversity. Table 5 shows that OP-D outperforms other methods (sometimes even by 10%) in detecting diverse opinions. While both MMR and Grasshopper are able to achieve improvement over both NB and HITS classifiers, the order of improvement by OP-D over HITS is much higher, indicating that decreasing the hub scores of the authority of the selected hubs results eventually in more diverse opinions getting selected. A goodness test of algorithms would be if the chosen sentences fall uniformly under various categories and sub-categories -this may instill diverse type of user engagement. We took the top 5 sentences for 23 Articles from Yahoo Dataset detected by OP-D, DivRank, Grasshopper (on NB), Grasshopper (on HITS), MMR (on NB), MMR (on HITS) and then got each sentence (opinions) labeled by 2 anonymous human annotators for the category and subcategories it belongs to. Any tie has been settled by another annotator. Figures 2 and 3 show the distribution of opinions detected by these algorithms into various categories and subcategories respectively 5 . Clearly, OP-D is able to select the opinionated sentences from various categories and subcategories much more uniformly than the other algorithms. OP-D achieves the highest Shannon entropy among all the baselines reinforcing that claim. The performance can be even better . appreciated if we can understand the overall distribution of opinions in an article. However, manually classifying all opinionated sentences is not possible -hence we build an automated classification model, which has been described in the next section. Automatic Classification of Opinions into Opinion Categories Dataset Preparation: 134 articles from MPQA and 29 articles from Yahoo dataset are taken randomly and have been annotated (with categories of opinion) manually using volunteers, different from the authors (Inter-annotator agreement Cohen κ is 0.8). Details of the datasets are provided in Table 6 .  We first performed a 5-fold cross-validation using different classifiers. We achieve 70.1% accuracy, 0.74 precision (macro-average), 0.71 recall, 0.725 F-Score for MPQA and 70.17% accuracy, 0.63 precision (macro-average), 0.70 recall and 0.664 F-Score for Yahoo dataset for the task of opinion classification by the JRip classifier which produces better results than other five classifiers -Logistic Regression (LR), Multi-Class Classifier (MCC), Naive Bayes (NB), Sequential Minimal Optimization (SMO), Support Vector Machine (SVM). The results are shown in Table 7 . We now use this classifier to plot the opinion category distribution. We plot this distribution for top 3, 5 and 10 opinionated sentences retrieved by OP-D algorithm from the entire MPQA and Yahoo dataset. Then these top 3 (5 and 10) opinionated sentences are collected from each article into a set and the distribution of the set is plotted in Figure 4 . We clearly observe that if we focus on the top 3 opinions only, OP-D is able to select uniformly from the four categories. However, as we look at top 5 or top 10 opinions, more opinions from Report category come in, which might be due to the fact that Report category is more prevalent in the dataset. Conclusion In this paper, we first introduced diversity in a graphical framework to identify diverse and important opinions from a news article. Further, we built an automated classification model to classify the opinions into various opinion categories. Extensive evaluation establishes that the proposed modification helps in identifying the most diverse opinions from different opinion categories, giving a promising performance gain over the competing baselines. The top sentences returned by the algorithm can therefore be used to kick-start user discussions on a given news article. Building and deploying a system to that effect will be the immediate future step. Also, we would like to study more on how the distribution of opinions to facts, as well as across various opinion categories varies across various news categories.",
    "funding": {
        "defense": 1.9361263126072004e-07,
        "corporate": 0.0,
        "research agency": 0.0,
        "foundation": 5.51223498068687e-07,
        "none": 1.0
    },
    "reasoning": "Reasoning: The article does not mention any specific funding sources, including defense, corporate, research agencies, foundations, or any other type of financial support for the research conducted or for the writing of the paper.",
    "abstract": "This paper proposes a framework to extract diverse opinionated sentences within a given news article, by introducing the concept of diversity in a graphical model for opinion detection. We conduct extensive evaluation and find that the proposed modification leads to impressive improvements in performance and makes the final results of the model more usable. The proposed method (OP-D) not only performs much better than the other techniques used for opinion detection and introducing diversity, but is also able to select opinions from different categories (Asher et al., 2009) . By developing a classification model which categorizes the identified sentences into various opinion categories, we find that OP-D is able to push opinions from different categories uniformly among the top opinions.",
    "countries": [
        "India"
    ],
    "languages": [
        "English"
    ],
    "numcitedby": 5,
    "year": 2016,
    "month": "December",
    "title": "A graphical framework to detect and categorize diverse opinions from online news"
}