{
    "article": "This article presents the building process of GeoCorpus, developed for the Geology domain, more specifically for the Bacia Sedimentar Brasileira subarea. The annotation is focused on Geological Entities in Portuguese text, and aims at Named Entity Recognition in the proposed domain. A case study validated both the annotation process and a tool which supported the specialists in the identification and classification of Geological Entities. Resumo. Este artigo apresenta o processo de construc ¸ão do GeoCorpus, desenvolvido para o domínio de Geologia, mais especificamente, para a subárea Bacia Sedimentar Brasileira. A anotac ¸ão restringe-se às Entidades Geológicas contidas nos textos em Português e visa o Reconhecimento de Entidades Nomeadas no domínio proposto. Um estudo de caso validou o processo de anotac ¸ão desse corpus e de uma ferramenta que auxiliou os especialistas na identificac ¸ão e classificac ¸ão das Entidades Geológicas. Introduc ¸ão Este trabalho apresenta a construc ¸ão do corpus GeoCorpus, o qual está sendo anotado com Entidades Geológicas (EG) e visa o Reconhecimento de Entidades Nomeadas (REN) no domínio de Geologia. REN consiste na identificac ¸ão e na classificac ¸ão de expressões linguísticas, na sua maioria nomes próprios (como pessoa, local ou organizac ¸ão) que remetem para um referente específico [Mota et al. 2007 ]. Essas expressões são chamadas de Entidades Nomeadas (EN), e podem variar conforme os diferentes domínios, por exemplo, Medicina, Biologia e Geologia. O que constitui um tipo (classe ou categoria) de EN é sua aplicac ¸ão, ou seja, em Biologia as classes de interesse podem ser os genes, proteínas [Cohen and Demner-Fushman 2014] e as doenc ¸as. Neste trabalho, o domínio em foco é o da Geologia, em que as ENs de interesse são as Entidades Geológicas (EG). As EG, consideradas neste estudo, consistem em termos específicos no texto, desde que esses fac ¸am parte das classes definidas de acordo com a subárea Bacia Sedimentar Brasileira. A escolha do domínio geológico deve-se ao fato de que o REN para Geologia é pouco encontrado na literatura. Enquanto REN para Medicina, Biomedicina e Biologia apresenta uma gama bem maior de trabalhos [Zaccara 2012 ] [Akhondi et al. 2015 ] [Collier et al. 2014 ] [Dánger et al. 2014 ] [Majumder and Ekbal 2015] [Ohta et al. 2002] . Proceedings of Symposium in Information and Human Language Technology. Uberlândia, MG, Brazil, October 2-5, 2017. c 2017 Sociedade Brasileira de Computac ¸ão. Destaca-se que a adequada identificac ¸ão e classificac ¸ão de ENs sob domínios específicos como o de Geologia, representa um grande desafio aos pesquisadores de PLN. Em especial, devido à carência de bases textuais nesse domínio, em Português, e de ferramentas automáticas para capturá-las. Logo, o trabalho apresentado aqui descreve o processo de anotac ¸ão manual de entidades geológicas visando a construc ¸ão do GeoCorpus para a tarefa de REN. Este artigo está organizado da seguinte forma. A sec ¸ão 2 apresenta o estudo do domínio de Geologia. A construc ¸ão do corpus é descrita no sec ¸ão 3. Na sequência, o processo de anotac ¸ão do corpus geológico, bem como a ferramenta de anotac ¸ão utilizada são detalhados na sec ¸ão 4. Um estudo de caso é apresentado na sec ¸ão 5. Por fim, as considerac ¸ões finais são relatadas na sec ¸ão 6. Estudo do Domínio Dentre os domínios de pesquisa estudados para a tarefa de REN, destaca-se o de Geologia devido a carência de trabalhos que envolvam EG, além da falta de ferramentas automatizadas para extrair tais informac ¸ões, principalmente para textos do Português. A partir do estudo do domínio de Geologia, verificou-se várias subáreas, como Sedimentologia, Cronoestratigrafia, Petrografia e Estratigrafia. Houve assim a necessidade de delimitar uma subárea de estudo, no caso a subárea Bacia Sedimentar Brasileira, devido a grande quantidade de EG no domínio em questão e para se obter uma avaliac ¸ão mais especializada na tarefa de REN. As bacias sedimentares são definidas conforme uma concepc ¸ão geográfica, isto é, uma área caracterizada pelo acúmulo espesso de sedimentos por um grande período de tempo geológico. A \"Bacia do São Francisco\" é um exemplo didático para essa definic ¸ão [Martins-Neto 2005] . Na próxima sec ¸ão as classes geológicas das Bacias Sedimentares Brasileiras consideradas neste trabalho são apresentadas. Determinac ¸ão das Entidades Geológicas e suas Classes Com base no estudo da subárea Bacia Sedimentar Brasileira, na orientac ¸ão de geólogos e professores dessa subárea foram definidas as classes geológicas deste trabalho. A seguir são apresentadas as referidas classes juntamente com alguns exemplos de EG de acordo com [Cohen et al. 2013 ] e [Hallsworth and Knox 1999] 5. Idade: Subdivisão de Época. Alguns exemplos: Pleistocênico (Pleistoceno) Superior, Pleistocênico (Pleistoceno) Médio, Calabriano, Gelasiano, entre outros. Exemplo na sentenc ¸a: \"Maior incidência entre 80 Milhões de anos (Ma) e 90 Ma (Santoniano/Turoniano): -predominam intrusões de composic ¸ão básica a intermediária\". • Rochas Sedimentares 6. Rocha Sedimentar Siliciclástica: Origina-se de fragmentos de rochas ígneas, metamórficas ou sedimentares, transportados e depositados para, posteriormente, formar uma rocha sedimentar Siliciclástica. Alguns exemplos: arenito, argilito, siltito, conglomerado, folhelho, diamictito, varvito, etc. Exemplo na sentenc ¸a: \"Os arenitos da Formac ¸ão Juruá são constituídos por minerais provenientes de rochas-fonte situadas ao Norte da Bacia do Solimões, transportados por um sistema de paleodrenagens pleistocênica\". 7. Rocha Sedimentar Carbonática: Formada, predominantemente, por carbonato de cálcio e/ou por fragmentos de organismos (bioclastos), bem como pela interac ¸ão entre o metabolismo de microorganismos e as partículas sedimentares presentes no ambiente deposicional. Alguns exemplos: calcário, dolomito, etc. Exemplo na sentenc ¸a: \"O calcário é cinza claro e apresenta proporc ¸ões variáveis de fragmentos detríticos que podem chegar a 40 % da rocha\". 8. Rocha Sedimentar Química: Formada por precipitados químicos: sais, carbonatos ou sulfatos. Por exemplo: evaporitos, fosforitos, Ironstones. Exemplo na sentenc ¸a: \"Na região da Fazenda Ressaca ocorrem fosforitos associados à porc ¸ão superior desta formac ¸ão\". 9. Rocha Sedimentar Orgânica: Origina-se dos restos de fragmentos dos organismos vivos, a qual está relacionada à preservac ¸ão de matéria orgânica. Processo de construc ¸ão de um corpus anotado com Entidades Geológicas visando REN Exemplo: carvão, etc. Exemplo na sentenc ¸a: \"Apenas recentemente ocorreu alguma recuperac ¸ão, com a elevac ¸ão dos prec ¸os e o maior consumo de Carvão no complexo termoelétrico de Tubarão-SC\". • Outras classes 10. Bacias Sedimentares Brasileiras: São grandes áreas de sedimentac ¸ão, ou seja, deposic ¸ão de sedimentos (agregados de matéria orgânica e/ou mineral), formada por rochas sedimentares e, eventualmente, por rochas magmáticas. Sua formac ¸ão foi a partir do Paleozóico. São elas: Bacia do São Francisco, Bacia do Espírito Santo, Bacia de Campos, Bacia do Paraná, entre outras. Exemplo na sentenc ¸a: \"Guerra (1989) estudou a influência da sobrecarga do Banco Vulcânico de Abrolhos sobre a estruturac ¸ão halocinética da Bacia do Espírito Santo\". 11. Contexto Geológico de Bacia: É a classificac ¸ão relacionada aos eventos geológicos (espacial e temporal), ou seja, são os estágios relacionados à Tectônica, Sedimentac ¸ão e Magmatismo. Por exemplo: Intracratônica ou Sinéclise, Rifte, Drifte e Margem Passiva. Exemplo na sentenc ¸a: \"Sequência Rifte, constituída unicamente pela Formac ¸ão Abaiara, de idade neocomiana, formada por sucessão de arenitos descontínuos lateralmente intercalados em folhelhos calcíferos de colorac ¸ão variegada\". 12. Unidade Estratigráfica: compreende três componentes estratigráficos: Formac ¸ão, Grupo e Membro [ESTRATIGRAFICA-SBG 1986] . A Formac ¸ão consiste na unidade principal da litoestratigrafia. Uma formac ¸ão é constituída por um corpo rochoso e pode conter um ou mais tipos de rochas, estruturas sedimentares e fósseis. Já o segundo, o Grupo, é constituído por duas ou mais formac ¸ões contíguas associadas, que tenham propriedades litológicas distintas e diagnósticas em comum. O terceiro componente, Membro Estratigráfico, representa a subdivisão litológica de uma formac ¸ão. Ele consiste de uma entidade que possui características litológicas próprias, as quais permitem diferenciá-las das partes adjacente da formac ¸ão. Exemplos: Formac ¸ão Irati, Formac ¸ão Abrolhos, Javari, Tapajós, Curuá, Arari, Fazendinha, etc. Exemplo na sentenc ¸a: \"A bacia do Rio do Peixe tem como substrato rochas sedimentares cretáceas dos grupos Bauru e Caiuá e esporádicas e localizadas ocorrências de basaltos da Formac ¸ão Serra Geral.\" 13. Outro: Esta é uma classe de excec ¸ão, pois o foco está nas classes definidas anteriormente. Deve ser utilizada apenas para os casos em que o especialista achar um termo muito relevante à subárea Bacia Sedimentar Brasileira, mas que não se enquadra exatamente nas classes anteriores. Exemplos: fácies, módulo calcários, organismos fósseis. Construc ¸ão do Corpus Para a construc ¸ão do corpus GeoCorpus realizou-se a leitura de trabalhos científicos para a identificac ¸ão de EG relacionadas à subárea Bacia Sedimentar Brasileira com Processo de construc ¸ão de um corpus anotado com Entidades Geológicas visando REN [Cohen et al. 2013 ] e [Hallsworth and Knox 1999] . Após, selecionou-se semimanualmente, um conjunto de textos para o domínio de Geologia. Esses textos são formados por teses, dissertac ¸ões, artigos e boletins de Geociências da Petrobras no idioma português do Brasil. As EG pesquisadas foram: termos geológicos de acordo com a tabela Cronoestratigráfia [Cohen et al. 2013] , nomes de rochas sedimentares [Hallsworth and Knox 1999] , nomes de bacias sedimentares brasileiras [Martins-Neto 2005 ] [Bizzi et al. 2003 ], os estágios relacionados à Tectônica, Sedimentac ¸ão e Magmatismo e unidades estratigráficas. Dentre os servic ¸os 'on-line' utilizados para a formac ¸ão do corpus geológico estão: bibliotecas digitais, como Portal de Periódicos da Capes, Scielo, ACM Digital Library, IEEE Xplore, além do Google Scholar. Obedeceram-se três critérios para a construc ¸ão do corpus: relevância, sincronicidade e homogeneidade. O primeiro critério teve o cuidado de coletar textos teoricamente importantes dentro da subárea definida e respeitando o domínio estabelecido. Já o segundo estabeleceu um ciclo de tempo definido para a selec ¸ão dos textos, o que ocorreu num período de seis meses. Por fim, a homogeneidade foi estabelecida, principalmente, para não misturar textos com outros elementos, como imagens, tabelas e gráficos. Como o objetivo de gerar um corpus de leitura e avaliac ¸ão, foram retirados, semiautomaticamente todos os abstracts, figuras, legendas, tabelas, gráficos, fórmulas e referências bibliográficas. No caso de teses e dissertac ¸ões, excluíram-se também sumários, apêndices e anexos para que fique um conjunto de dados formado apenas pelo texto propriamente dito. Após a eliminac ¸ão de todos os referidos elementos e para garantir a qualidade do corpus proposto, realizou-se uma revisão manual texto à texto. O corpus é constituído de 52 textos, em que cada documento corresponde a um arquivo de texto com tamanho entre 10 Kbytes e 53 Kbytes (de 1.460 palavras a 7.793 palavras). O processo de anotac ¸ão é descrito na sec ¸ão a seguir. Processo de Anotac ¸ão Nesta sec ¸ão é apresentado o processo de anotac ¸ão das EG contidas nos textos do GeoCorpus, o qual segue as mesmas etapas de REN: identificar as EG e após, classificá-las em uma das classes geológicas descritas na sec ¸ão 2.1. Destaca-se que a etapa de classificac ¸ão é mais complexa devido a ambiguidade das palavras, em que uma mesma EG pode ser classificada com mais de uma classe dependendo do contexto e do domínio que está inserida. Por exemplo, na sentenc ¸a: \"O rio São Francisco faz parte da bacia São Francisco\", a primeira EG é classificada como Rio e a segunda como Bacia Sedimentar. Basicamente, o processo de anotac ¸ão envolve os seguintes passos: 1 o ) Marcar os termos que referem-se a uma EG no texto, caso não tenham sido anotados e atribuir uma classe; 2 o ) Verificar a delimitac ¸ão da EG (palavras que formam uma EG) já marcada no texto, corrigindo-a caso necessário; 3 o ) Verificar a classificac ¸ão da EG já identificada, corrigindo-a caso necessário. O segundo e o terceiro passos ocorreram, porque o GeoCorpus foi processado num modelo de classificac ¸ão, desenvolvido para um experimento inicial [Amaral and Vieira 2014] . Esse modelo possui várias classes de Geologia e não se restringiu a uma subárea específica. A anotac ¸ão dos textos será realizada com o auxílio da Processo de construc ¸ão de um corpus anotado com Entidades Geológicas visando REN ferramenta IdENGeo descrita a seguir. IdENGeo A IdENGeo é uma ferramenta de marcac ¸ão de Entidades Nomeadas em textos do domínio de Geologia, a qual objetiva auxiliar os anotadores na identificac ¸ão e na classificac ¸ão das EG, tornando a tarefa de anotac ¸ão o mais intuitiva e simplificada possível. Os arquivos de texto que receberão a anotac ¸ão devem estar no formato xml, do contrário a ferramenta não os reconhecerá. Essa ferramenta possui uma interface gráfica que permite ao usuário a visualizac ¸ão e a edic ¸ão/adic ¸ão de informac ¸ões relevantes para a tarefa de anotac ¸ão. Dentre as funcionalidades do IdENGeo temos: • Área de edic ¸ão: painel em que o usuário visualiza o texto de entrada a ser marcado com as EG; • Menu de filtros: de func ¸ões de filtros que servem para facilitar a visualizac ¸ão das EG classificadas no texto. Esse menu é constituído pelos botões \"Desmarcar Tudo\", \"Marcar Tudo\" e a lista de botões com as 13 classes geológicas ilustradas em cores diferentes. A aplicac ¸ão dos filtros possibilita: a visualizac ¸ão de todas as EG já classificadas no texto (botão \"Marcar Tudo\") e a visualizac ¸ão das EG por classe (botão \"Desmarcar Tudo\" seguido dos botões correspondentes à uma ou mais classes de interesse). • Grupos de ac ¸ões: quatro grupos de ac ¸ões localizados abaixo da área de edic ¸ão que compreendem as seguintes func ¸ões: 1) Novo texto: func ¸ão de selec ¸ão do novo texto a ser anotado e identificac ¸ão do seu anotador; 2) Atualizar texto: func ¸ão de selec ¸ão de um texto com a anotac ¸ão ainda não concluída e assim poder dar continuidade a mesma; 3) Marcac ¸ão de texto: func ¸ão de habilitar o menu de classificac ¸ão das EG; 4) Salvar texto: func ¸ão de salvar o texto anotado. A Figura 1 ilustra a interface gráfica do IdENGeo. Nela, um texto inicial foi carregado na Área de edic ¸ão, bem como as EG já marcadas nas cores correspondentes à cada classe geológica do menu filtro. Além disso, o anotador pode iniciar um nova anotac ¸ão das EG ou ainda continuar a marcac ¸ão de um texto ainda não finalizado através dos Grupos de ac ¸ões. Nesse contexto, o anotador realizará a classificac ¸ão das EG seguindo o processo de anotac ¸ão descrito na sec ¸ão 4. Para realizar a marcac ¸ão de uma EG ainda não classificada deve-se selecionar o trecho do texto que expressa a EG e clicar no botão \"Adicionar Marcac ¸ão\". Após, deve-se selecionar a referida classe da EG a partir do menu de classes, seguido do botão \"OK\". Cabe salientar que, o menu de classes seguiu a organizac ¸ão de classes por grupos, conforme apresentado na sec ¸ão 2.1. Caso o anotador necessite remover a classe escolhida, deve utilizar o botão \"Remover Marcac ¸ão\". Estudo de Caso Nesta sec ¸ão descrevemos um estudo de caso com o objetivo de validar o processo de anotac ¸ão e a ferramenta IdENGeo. Realizou-se esse estudo com base na experiência da anotac ¸ão de um texto do GeoCorpus, o qual corresponde a um arquivo de 5.984 palavras. O texto foi anotado por um geólogo e o tempo total, estimado pelo anotador, foi de noventa minutos. A anotac ¸ão resultou num total de 549 EG distribuídas nas seguintes classes ilustradas na Tabela 1. Processo de construc ¸ão de um corpus anotado com Entidades Geológicas visando REN Figura 1. Interface Gr áfica do IdENGeo A partir desses resultados, constatou-se que as classes Rocha Sedimentar Siliciclástica e Unidade Estratigráfica foram as mais frequentes no texto, pois o seu assunto compreende a estratigrafia e a paleogeografia da Formac ¸ão Brejo Santo, na Bacia do Araripe, com base no estudo de aspectos sedimentológicos, faciológicos e paleontológicos. Já as classes Rocha Sedimentar Química e Rocha Sedimentar Orgânica não tiveram ocorrência pelo mesmo motivo acima, ou seja, o tema que o texto aborda. Observouse também que a classe Outro apresentou vários casos, os quais o especialista julgou relevantes para a subárea Bacia Sedimentar Brasileira. Como por exemplo as EG \"organismos fósseis\", \"ostracodes\" e \"conchostráceos\". O anotador notou que um dos pontos de dificuldade é a delimitac ¸ão das palavras que formam uma EG. Por exemplo, no trecho da sentenc ¸a: \"a respeito do rico acervo paleontológico das formac ¸ões Brejo Santo, Crato e Romualdo\", o anotador identificou três EG (\"Brejo Santo\", \"Crato\" e \"Romualdo\") para a classe Unidade Estratigráfica e não incluiu a palavra \"formac ¸ões\", a qual se refere às três EG. Em contrapartida no trecho \"Sugere-se que os sedimentos da Formac ¸ão Brejo Santo teriam sido depositados\", o anotador identificou a EG \"Formac ¸ão Brejo Santo\" incluindo a palavra \"Formac ¸ão\". Outra questão analisada refere-se ao aspecto morfológico das palavras dispostas nos textos, ou seja, a forma em que o termo geológico está inserido na sentenc ¸a. Significa que, quando uma expressão é constituída por um substantivo seguida de um adjetivo, esse último não configura uma EG, pois ele caracteriza um substantivo. Por exemplo: \"Assim, no Espinhac ¸o Meridional os sedimentos paleoproterozóicos têm expressão reduzida, predominando os mesoproterozoicos\", o anotador não classificou \"paleoproterozóicos\" como Era, porque essa palavra exerce a func ¸ão de adjetivo e não de uma EG. Alguns anotadores testaram as funcionalidades da ferramenta e constataram que Processo de construc ¸ão de um corpus anotado com Entidades Geológicas visando REN Tabela 1. Resultado das Entidades Geol ógicas no estudo de caso. Classes Entidades Para este estudo de caso, o anotador finalizou as suas considerac ¸ões ao expor que, devido ao tipo de texto ser uma tese, não foi possível realizar a anotac ¸ão em único momento. Então, para solucionar essa questão, foi inserido no IdENGeo, a nova funcionalidade \"Atualizar Texto\" (descrita na sec ¸ão 4.1), com o objetivo de facilitar o trabalho manual. Considerac ¸ões Finais Este artigo descreve o processo de anotac ¸ão manual de EG, a fim de construir o GeoCorpus com o propósito de que, a partir dele, seja realizada a tarefa de REN. Apresentamos a ferramenta de anotac ¸ão e um experimento inicial sobre a tarefa. O domínio do GeoCorpus é Geologia e Bacia Sedimentar Brasileira é a subárea que o especializa com o objetivo de torná-lo mais eficaz na identificac ¸ão das EG. A construc ¸ão do corpus iniciou com a escolha do domínio, a determinac ¸ão de uma subárea, a decisão das EG e de suas classes e os textos que o compõem. Em síntese, a metodologia que envolveu a sua anotac ¸ão consistiu da identificac ¸ão e classificac ¸ão dos termos considerados como EG, além da conferência de algumas EG já classificadas no texto. A ferramenta IdENGeo tem por objetivo auxiliar na tarefa de REN, de modo que o trabalho de anotac ¸ão seja mais simples e eficiente. O processo de anotac ¸ão e o uso da ferramenta foram analisados com um estudo de caso da anotac ¸ão de um texto. Essa tarefa resultou num total de 549 EG distribuídas nas classes que semanticamente condisseram com o assunto que o texto abordou. Dois importantes desafios deste trabalho são: primeiro, a grande dificuldade de encontrar anotadores com disponibilidade de classificar os textos para gerar um corpus de referência; segundo, a confianc ¸a na anotac ¸ão, ou seja, conseguir especialistas que tenham conhecimento na subárea definida para anotar os textos. Processo de construc ¸ão de um corpus anotado com Entidades Geológicas visando REN Como trabalhos futuros, iremos finalizar a anotac ¸ão completa do corpus. Atualmente, estamos na etapa de gerac ¸ão da anotac ¸ão que está sendo feita manualmente por geólogos, entre eles professores, doutorandos e alunos de graduac ¸ão do curso de Geologia da UNISINOS do 6 o semestre. Pretende-se melhorar a ferramenta de anotac ¸ão com a modificac ¸ão do acesso da \"func ¸ão filtro\" e a visualizac ¸ão do \"menu classificac ¸ão das EG\". Ainda, a conclusão do GeoCorpus gerará um recurso que será utilizado em sistemas de aprendizado máquina para o REN Geológicas. O fruto desse corpus é elemento fundamental para uma tese que está em desenvolvimento. Sua disponibilidade é relevante para a pesquisa em Geologia, para tarefas de PLN, como relac ¸ões entre EG e resoluc ¸ão de correferência. Destaca-se também a relevância econômica com a explorac ¸ão do petróleo, uma vez que o GeoCorpus compreende um conjunto de textos sobre bacias sedimentares brasileiras. A partir delas, surgem combustíveis fósseis como carvão mineral, folhelhos oleígenos ou betuminosos, gás natural e petróleo. Através do processo exploratório nas bacias sedimentares, podese identificar que algumas rochas sedimentares presentes nessas bacias, são consideradas reservatórios de petróleo e de gás.",
    "abstract": "This article presents the building process of GeoCorpus, developed for the Geology domain, more specifically for the Bacia Sedimentar Brasileira subarea. The annotation is focused on Geological Entities in Portuguese text, and aims at Named Entity Recognition in the proposed domain. A case study validated both the annotation process and a tool which supported the specialists in the identification and classification of Geological Entities. Resumo. Este artigo apresenta o processo de construc ¸ão do GeoCorpus, desenvolvido para o domínio de Geologia, mais especificamente, para a subárea Bacia Sedimentar Brasileira. A anotac ¸ão restringe-se às Entidades Geológicas contidas nos textos em Português e visa o Reconhecimento de Entidades Nomeadas no domínio proposto. Um estudo de caso validou o processo de anotac ¸ão desse corpus e de uma ferramenta que auxiliou os especialistas na identificac ¸ão e classificac ¸ão das Entidades Geológicas.",
    "countries": [
        "Brazil"
    ],
    "languages": [
        "Portuguese"
    ],
    "numcitedby": "0",
    "year": "2017",
    "month": "October",
    "title": "Processo de constru{\\c{c}}{\\~a}o de um corpus anotado com Entidades Geol{\\'o}gicas visando {REN} (Building an annotated corpus with geological entities for {NER})[In {P}ortuguese]"
}