{
    "article": "Aiming at facilitating the research on quality estimation (QE) and automatic post-editing (APE) of machine translation (MT) outputs, especially for those among Asian languages, we have created new datasets for Japanese to English, Chinese, and Korean translations. As the source text, actual utterances in Japanese were extracted from the log data of our speech translation service. MT outputs were then given by phrase-based statistical MT systems. Finally, human evaluators were employed to grade the quality of MT outputs and to post-edit them. This paper describes the characteristics of the created datasets and reports on our benchmarking experiments on word-level QE, sentencelevel QE, and APE conducted using the created datasets. Introduction Technologies of machine translation (MT) have been dramatically improved in the last decades; however, the strict requirements for high-quality translations in real-world applications (Hutchins and Somers, 1992) have not yet fulfilled by MT systems alone. 1 Thus, in practice, techniques of computer-aided translation (CAT) have been widely used to provide satisfiable translations for such requirements. For instance, manual post-editing of MT outputs has become a prevalent translation work-flow in translation services (ISO/TC27, 2017). Quality estimation (QE) of MT outputs also plays a critical role in CAT to reduce human effort, thereby increasing productivity (Specia et al., 2010) . To facilitate and encourage the research on QE tasks concerning several different levels of granularity, i.e., word, phrase, sentence, and document levels, and automatic post-editing (APE), WMT workshops and conferences (henceforth, WMT) have created datasets specialized for these tasks (Bojar et al., 2014 (Bojar et al., , 2015 (Bojar et al., , 2016 (Bojar et al., , 2017)) , mainly focusing on European languages. 2 As a result, they have successfully led to the rapid enhancement of QE/APE technologies. However, to the best of our knowledge, such a resource for Asian languages have never emerged, and QE/APE for Asian languages have been less studied. Aiming at facilitating this line of research, we have created new datasets 3 consisting of the 5-tuples shown in Figure 1 . While the tuples of first two elements, i.e., source text and human translation, compose ordinary parallel corpus used to train (data-driven) MT systems, the remaining three are specific to this kind of QE/APE datasets. So far, we have regarded Japanese (Ja) as the source language, and English (En), Chinese (Zh), and Korean (Ko) as the target languages. In addition to cover these new language pairs, we also aim to improve our speech translation service 4 with QE/APE technologies. To this end, we have used actual utterances for the source texts, accumulated by the speech translation service, with our best effort to clean and anonymize the data. In the remainder of this paper, we first describe the procedure of creating our QE/APE datasets for Ja→En, Ja→Zh, and Ja→Ko translation tasks in Section 2. Then, in Section 3, we present statistics of the created datasets, observations, and remaining issues. Section 4 describes our benchmarking  experiments on word-level QE, sentence-level QE, and APE conducted using the created datasets. Finally, Section 5 summarizes this paper. Procedure of Corpus Construction We have created our QE/APE datasets, regarding Japanese as the source language. We have so far regarded English, Chinese, and Korean as the target languages, considering that the speakers of these languages hold the largest proportion of visitors to Japan (Japan National Tourism Organization, 2017). Following the procedure in previous studies (Snover et al., 2006; Potet et al., 2012) and practices in WMT (Bojar et al., 2014 (Bojar et al., , 2015 (Bojar et al., , 2016)) , we determined the following five-step process. For the latter three tasks (detailed in Sections 2.3, 2.4 and 2.5, respectively), we allocated adult native speakers of the target language who also understand Japanese. Collecting Japanese utterances (src) First, we collected the following two sets of utterances in Japanese that have been used with our speech translation service. Travel-related utterances (travel): From the log data that our speech translation service accumulates, we randomly sampled 20,000 identical transcribed segments 5 that were identified as Japanese by its automatic speech recognition (ASR) module. Most segments were spoken language and related to travel and tourism, even though we had no restriction to the input of our users. Utterances in hospital (hospital): We employed the role-play dialogs of health care providers, such as doctors and nurses, and patients, containing 2,225 identical segments of utterances. They were surely spoken language, although they were manually written and more formal than those in the travel domain. We have been examining the installation of our speech translation service into several practical situations where such system helps cross-lingual communication between humans. For this purpose, we have manually created role-play dialogs between Japanese and non-Japanese speakers. The hospital data is one of them. The extracted segments, especially those in the travel domain, include ungrammatical ones, nonunderstandable ones, and those containing inappropriate expressions with respect to social standards. We therefore asked a native Japanese speaker to filter out such segments. As a result, 8,783 and 1,676 segments in the travel and hospital domains were retained, respectively. Many segments do not have an explicit subject, as Japanese is a pro-drop language; even obligatory arguments can be missing. For instance, in the src segment in Figure 1 , both the subject \"I\" and the direct object \"ticket\" are omitted. However, we cannot recover them as our speech translation service does not record any discourse elements of individual utterances. Generation of MT outputs (hyp) The collected Japanese segments (src) were then translated by our in-house MT systems, which implement a phrase-based statistical MT (Koehn, 2009) . The Ja→En translations were obtained in 2013, with the system trained on 736k sentence pairs. The Ja→Zh and Ja→Ko translations were generated later in 2016, with the systems trained on 1.44M and 1.40M sentence pairs, respectively. Table 1 summarizes the statistics of src and hyp. These segments are relatively shorter than sentences in written texts, such as news articles and patent documents. Manual translation (ref ) Reference translations were manually given, referring only to the source segments (src). As each src was not attributed with its specific context, we asked the translators to imagine some context as long as it is reasonable considering the domain. On the contrary, we also asked to avoid adding too much contents that cannot be specified only from the src. For the src which has more than one interpretation, only one translation is given rather than enumerating all the possible interpretations. Manual grading of MT output (grade) The quality of MT output (hyp) with respect to its source (src) was graded according to a standard presented in Table 2 , which is compatible 6 with the \"Acceptability\" criterion in Goto et al. (2013) . In case the evaluator cannot understand the meaning of src, she/he is allowed to refer to the corresponding reference translation (ref ), with an advice that it is not only the correct translation. Manual post-editing of MT output (pe) Human workers were asked to post-edit MT outputs (hyp), i.e., to produce pe, under the following guidance. (1) Refer only to src and hyp basically. Refer also to ref if necessary. (2) Make each hyp grammatical and semantically appropriate with respect to its src, i.e., the quality of pe must be \"A\" or \"S\" in Table 2 . (3) Perform minimal edits, as we use pe for the reference of computing HTER (Snover et al., 2006) . The workers were also informed that we consider the following four edit operations equally. Deletion of a word: Delete an unnecessary word: e.g., \"the an\" → \"the\" Insertion of a word: Insert a missing but necessary word: e.g., \"We will stay at hotel.\" → \"We will stay at the hotel.\" Substitution of a word: Substitute a word with another word. Change of inflection and conjugation is also regarded as this operation: e.g., \"Can you teach me the way to the station?\" → \"Can you tell me the way to the station?\" Shift of a word or a phrase: Change the word order by moving a single word or a sequence of consecutive words: e.g., \"I'll send a card my friend.\" → \"I'll send my friend a card.\" 7 Consistency check Note that the last two tasks, i.e., grading and post-editing of MT outputs, were performed completely separately. Now, discrepancies between grade and pe were resolved in this final step. When both grade and pe for the same pair of src and hyp were registered, we assessed them according to the following three criteria.  • If the grade is either \"S\" or \"A\" but pe is not identical to the given hyp, both grading and post-editing are performed again. • If the grade is either \"B,\" \"C,\" or \"D\" but pe is identical to hyp, both grading and postediting are performed again. • If hyp is closer to ref than to pe, i.e., TER(hyp, pe) > TER(hyp, ref), the number of edits is not minimal; 8 so post-editing is performed again. 9 As there could be a variety of translation options, seeking the complete minimality does not seem feasible. Nevertheless, we introduced the last constraint, because we need less-edited translations as pe. To compute TER scores using TER-COM, 10 we tokenized hyp, ref, and pe, using the tool in Moses 11 for English MeCab 12 with mecabko-dic 13 for Korean. For Chinese, we regarded each character as one token. Analyses of the Created Datasets This section describes characteristics of the created datasets, observations, and remaining issues. 8 This constraint can easily be satisfied by just copying ref to pe, but we prohibited this. 9 We asked to restart from hyp, because resuming from the submitted pe would make the total number of edits unclear. First, the results of manual grading are summarized in Table 3 . While MT outputs for the travel domain were much better than the hospital domain in the Ja→En task, the segments in the hospital domain were better translated by the Ja→Zh and Ja→Ko MT systems. Table 4 shows proximity in terms of BLEU (Papineni et al., 2002) and TER (Snover et al., 2006) , between translations obtained through different ways. (a) \"hyp against ref \" presents what is measured in standard evaluation of MT outputs. The scores in these rows reflect the distribution of MT outputs shown in Table 3 . On the other hand, (b) \"hyp against pe\" gauges the amount of post-edits. As we asked to perform only necessary edits to assure at least grade \"A,\" the scores in these rows should be good in general. Only the exception is the hospital domain in the Ja→En task. As most of the MT outputs were of low quality, the workers tended to abandon them rather than correcting them. Finally, (c) \"pe against ref \" rows demonstrate that these two types of translations were not necessarily highly similar. Nevertheless, pe were certainly better than hyp with respect to ref. Again, pe in the hospital domain in the Ja→En task show exceptionally good scores. We plan to make an in-depth analysis with this respect. The human judgment and the quantity of postedits (HTER) evaluate the translation quality from different aspects. Indeed, as illustrated in Figure 2 , many hyp that got grade \"B\" did not have smaller HTER score than those of grade \"D.\" Figure 3 exemplifies some discrepancies between grade and HTER score observed in the Ja→En dataset. The   hyp in the first two examples were graded \"D,\" while they were only slightly edited. The hyp in #1 failed to appropriately convey the meaning of negation. On the other hand, considering that the segment #2 is given by a health care provider, the possessor of \"首 (neck)\" must not be him/her (the utterer), but the patient (the hearer). In both cases, the error in hyp is critical, even though it can be corrected with a small number of edits. This suggests that sentence-level QE systems should be optimized according to appropriate criteria, depending on their application. There were also several examples that were graded \"B\" but were post-edited significantly. For instance, the hyp in #3 could be corrected by simply replacing the full stop with a tag question, i.e., \"isn't it?\" with a HTER score of 0.56. However, the worker also changed the syntactic structure of the main clause, increasing the HTER score. To avoid this kind of over-editing, the instruction in Section 2.5 should be improved. Benchmarking Using the created datasets, we conducted benchmarking experiments on word-level QE, sentencelevel QE, and APE. Common Settings First, each of the travel and hospital datasets was randomly partitioned into training, development, and test sets as shown in Table 5 . Although we believe that our datasets are useful for examining domain adaptation methods, in this paper, we report on experiments using the merger of data in the two domains. Table 6 summarizes the statistics of each partition in each task. 14 \"BAD%-WQE\" indicates the percentages of \"BAD\" tags for word-level QE (see Section 4.2 for details), while \"BAD%-SQE\" indicates the ratio of hyp that need post-editing, i.e., those graded either \"B,\" \"C,\" or \"D.\" For the QE/APE tasks, due to the scarcity of training data, even baseline approaches have employed external resources, such as parallel and monolingual corpora, in addition to the taskspecific training data. However, there is no publicly available parallel and monolingual data of spoken language in the language pairs of our concern. Therefore, we reluctantly employed an inhouse parallel corpus of daily life conversations (DLC). Its statistics are shown in Table 7 . Word-level QE (WQE) Given a pair of source text (src) and MT output (hyp), the task of word-level QE is to predict a sequence of tags with the same length as hyp, where each tag indicates how good the corresponding word in hyp is. While some previous studies, such as Bach et al. (2011) , addressed to gauge the quality of each word with a real-valued score, WMT adopted a coarse-grained binary tag, i.e., {OK, BAD}, presumably because this form of tags can be automatically generated as the byproduct of computing HTER score by comparing hyp with its post-edited version (pe) (Bojar et al., 2015) . Following the recent convention in WMT, we automatically generated a sequence of binary tags for each pair of src and hyp using TERCOM. As the evaluation metrics, we used F 1 score of detecting \"OK\" tags (F 1 -OK), that for \"BAD\" tags (F 1 -BAD), and their product (F 1 -mult) as in Bojar et al. (2016) . As a system for WQE, we adopted an implementation 15 based on a feed-forward neural net- work with its default setting. Following the investigation in Liu et al. (2017) , we also generated a set of pseudo training data using the DLC corpus as follows. Step 1. Phrase-based statistical MT systems for Ja→ * translation tasks were built from the first half of the DLC corpus using Moses. Step 2. Japanese sentences in the remaining half of the DLC corpus were decoded by the MT systems. Step 3. Tag sequences for the MT outputs were given in the same manner manually created data, except that we regarded reference translations in the second half of the DLC corpus as post-edited MT outputs. As presented in Table 8 , we generated much larger data than the manually created training data in Table 6 , although the pseudo training data tended to contain more \"BAD\" tags than the manually created data due to the independence between hyp and ref. Our experimental results are presented in Table 9 . The results for the Ja→En and Ja→Zh tasks are consistent to the observations in Liu et al. (2017) , i.e., pseudo training data improve F 1 -BAD scores. However, introduction of such data do not improve F 1 -BAD in the Ja→Ko task. Given a pair of source text (src) and MT output (hyp), the task of sentence-level QE is to predict how good the entire hyp is, with respect to src. We conducted experiments on both of the HTER prediction and binary classification tasks. Prediction of HTER In WMT, this task is to predict the HTER score, directly from (src, hyp) pair (Specia et al., 2015) , or indirectly through predicting the necessary edits in a similar manner to WQE (Kim and Lee, 2016) . We implemented a tool to extract a set of 17 features 16 of QuEst++ (Specia et al., 2015) , which is regarded as the baseline of this task. To compute the features based on language models, we used the corresponding part of the DLC corpus. To estimate the translation-related features, such as the number of translations per word in src, we trained a phrase-table on the DLC corpus using Moses. Following the findings in Shah et al. (2016) , we also incorporated the distributed representations of src and hyp. First, word embeddings with 300 dimensions were learned from each part of the DLC corpus using word2vec 17 with its default parameters. Then, the embedding for a given segment is computed by averaging the embeddings of its constituent words, assuming the additive compositionality (Mikolov et al., 2013) . During the computation, unknown words were mapped to a zero vector. Finally, values for each of 300 dimensions were regarded as additional features. The extracted features were used to train support vector regression (SVR) models with a radial basis function (RBF) kernel. 18 Hyper-parameters were optimized with respect to the development set, through a grid search to maximize the Pearson's correlation coefficient r between the predicted HTER and the gold HTER. Table 10 justifies that sentence embeddings obtained by such a naive way 19 can improve the performance of predicting HTER score, irrespective of the evaluation metrics: Pearson's correlation coefficient r, mean average error (MAE), and root mean squared error (RMSE). Binary Classification We assume that users of speech translation services are usually not competent in the target language. Thus, when we consider directly delivering the MT outputs to such users, their quality in terms of our grade seems more intuitive than HTER. We evaluated how well the same feature sets in Section 4.3.1 can predict the grade, using support vector classifier (SVC) instead of SVR. Hyperparameters were optimized so that they maximize F 1 -mult on the development set. The systems (feature sets) were evaluated with the same metrics as in WQE. As presented in Table 11 , we obtained consistent results that baseline systems with QuEst++ features can be improved by incorporating the distributed representations of src and hyp. APE The task of APE is to automatically post-edit MT outputs (hyp). Although there are a number of methods that also refer to src (Béchara et al., 2011; Junczys-Dowmunt and Grundkiewicz, 2016) , we have so far examined only classic baseline methods based on phrase-based statistical MT. The first system (a) was trained only on the gold data (Simard et al., 2007a) using Moses. However, this system tended to deteriorate the translation quality in terms of BLUE and TER, presumably due to the scarcity of training data. Then, our second model (b) introduced identical pairs of sentences in the target side of our DLC corpus in order to conservatively retain grammatical fragment within hyp. By (re-)decoding the hyp using the multiple decoding path ability of Moses, 20 this model significantly improved the naive baseline system (a), but the translation quality was not consistently better depending on the language pair. Finally, we introduced in the third system (c) yet another phrase table learned from pseudo training data as proposed by Simard et al. (2007b) . Our pseudo training data were obtained in the same manner as those for WQE (see Section 4.2); we coupled each of the decoded result to its corresponding reference translation in the DLC corpus. As summarized in Table 12 , this model led to a slight but consistent improvement on both metrics in the all tasks. Conclusion Aiming to promote the research on quality estimation (QE) and automatic post-editing (APE) of MT outputs, especially for those among Asian languages, we have created new datasets for the Japanese to English, Chinese, and Korean translation tasks. This paper described the process of corpus creation and observations from the created datasets. We also presented our benchmarking experiments using the created datasets, for all of the tasks in our concern: word-level QE, two variants of sentence-level QE, and APE. Although the methods examined in this paper could be far from the state-of-the-art, we confirmed that the performance of these tasks can be improved by introducing features and pseudo training data that had been proven useful in the literature. Following the emergence of neural MT, we are now working on extending the datasets with translations of such systems. We are planning to further improve the performance on the QE/APE tasks, and to investigate applications of the technologies, including enhancing the functionality of our speech translation service, and filtering automatically harvested parallel sentences (Sennrich et al., 2016; Marie and Fujita, 2017) . Acknowledgments We are deeply grateful to the anonymous reviewers for their thorough and constructive comments. This work was conducted under the program \"Promotion of Global Communications Plan: Research, Development, and Social Demonstration of Multilingual Speech Translation Technology\" of the Ministry of Internal Affairs and Communications (MIC), Japan.",
    "abstract": "Aiming at facilitating the research on quality estimation (QE) and automatic post-editing (APE) of machine translation (MT) outputs, especially for those among Asian languages, we have created new datasets for Japanese to English, Chinese, and Korean translations. As the source text, actual utterances in Japanese were extracted from the log data of our speech translation service. MT outputs were then given by phrase-based statistical MT systems. Finally, human evaluators were employed to grade the quality of MT outputs and to post-edit them. This paper describes the characteristics of the created datasets and reports on our benchmarking experiments on word-level QE, sentencelevel QE, and APE conducted using the created datasets.",
    "countries": [
        "Japan"
    ],
    "languages": [
        "English",
        "Ko",
        "Korean",
        "Chinese",
        "Japanese"
    ],
    "numcitedby": "3",
    "year": "2017",
    "month": "November",
    "title": "{J}apanese to {E}nglish/{C}hinese/{K}orean Datasets for Translation Quality Estimation and Automatic Post-Editing"
}