{
    "article": "Conversational AI systems are rapidly developing from purely transactional systems to social chatbots, which can respond to a wide variety of user requests. In this article, we establish how current state-of-the-art conversational systems react to inappropriate requests, such as bullying and sexual harassment on the part of the user, by collecting and analysing the novel #MeToo corpus. Our results show that commercial systems mainly avoid answering, while rule-based chatbots show a variety of behaviours and often deflect. Data-driven systems, on the other hand, are often noncoherent, but also run the risk of being interpreted as flirtatious and sometimes react with counter-aggression. This includes our own system, trained on \"clean\" data, which suggests that inappropriate system behaviour is not caused by data bias. 1 goo.gl/qRSvxv 2 Disclaimer: This paper contains examples which some readers may find disturbing. 3 https://metoomvmt.org/ Introduction Conversational AI systems, such as Amazon's Alexa, Apple's Siri and Google Assistant, are quickly developing into social agents, which can respond to a wider variety of user utterances. In addition, these systems are becoming ubiquitous being installed on phones, watches and devices around the home making them available to a wider audience, including young children. This raises ethical questions in how a system should respond to socially sensitive issues such as bullying and harassment on the part of the user. Although the well-being of these systems is not in question, we believe that this type of user behaviour should be discouraged, since there is evidence that behaviour towards systems can transfer to real social relationships with humans (Reeves and Nass, 1996) . For example, research in related fields, such as video games, has shown that violent online behaviour causes increased readiness for vi-olence in real life (American Psychological Association, 2015) . In fact, there have already been reports about children learning poor manners from voice assistants. 1  In this article, we establish how state-of-the-art systems react to different types of inappropriate user requests, which fall under the definition of sexual harassment. We collect a corpus of system responses by \"harassing\" a wide variety of existing systems. In contrast to previous work, we also include current data-driven systems in our study. We explore the hypothesis that unethical system behaviour might be caused by biased data sets (Henderson et al., 2018) , by training our own sequenceto-sequence model (Seq2Seq) (Sutskever et al., 2014) on \"clean\" data. We ground our response stimuli in (anonymised) customer data gathered during a university competition to build an opendomain conversational system. 2 We annotate the collected data with a wide range of response categories based on literature (κ = 0.66), and analyse the frequencies of replies by system type and prompt context. In future work, we will evaluate response strategies with a wide variety of human judges, as well as measure the effects on customers in a life system. Related Work Recently, widespread sexual harassment allegations following the #MeToo 3 campaign have propelled the issue of what constitutes harassment and how to respond to it to the media's attention. Given that most virtual assistants have femalesounding names and voices, it begs the question of how often these systems are harassed and how they respond to harassment (Silvervarg et al., 2012) . Sexual harassment is difficult to define as it refers to a variety of legal concepts, behavioural and psychological definitions (Fitzgerald et al., 1997) . According to the UK's Equality Act (U.K. Government, 2010) , sexual harassment is unwanted behaviour of a sexual nature that is meant to violate the victims' dignity; make them feel intimidated, degraded or humiliated; or creates a hostile working environment. Similarly, the Linguistic Society of America defines sexual harassment as \"unwelcome sexual advances, requests for sexual favours, and other verbal or physical conduct of a sexual nature\". 4 In addition, they categorise harassment according to four categories: (1) lewd comments about an individual's sex, sexuality, sexual characteristics, or sexual behaviour, (2) offensive sexually-oriented jokes or innuendos, (3) sexually suggestive comments or obscene gestures, and (4) leering, pinching, or touching of a sexual nature. A recent article for Quartz (Fessler, 2017) uses this classification to test and classify responses produced by different commercial systems when subjected to sexual harassment. They find that systems often will produce responses that \"play along\" with the user and will very rarely oppose or chastise them. In our work, we expand this study to include non-commercial systems, focusing on rule-based vs. state-of-the-art data-driven ones in order to assess their suitability for handling theses issues. We also ground our prompts in real customer data, and provide a detailed annotation scheme, as well as an original baseline system. In addition, we attempt to \"remedy\" data-driven systems by training on clean data. 3 The #MeToo Corpus Prompt Design We partook in a competition between university teams to build an open-domain conversational system. The systems were made available to USbased customers who could rate them at the end the conversations. As part of the university competition, we collected a total of 360K conversations. From these, we roughly estimate that 4% include sexually explicit utterances from the user by counting the number of times our system identified such messages by simple keyword spotting. 5  This is in-line with previous research, which reports that 11% of chatbot interactions addressed \"hard-core sex\" (Angeli and Carpenter, 2006; Angeli and Brahnam, 2008) . We use these real-life examples of abuse to source stimuli for data collection. We randomly sampled a number of sexually-explicit customer utterances from our corpus and summarised them to a total of 35 utterances, which we categorised based on the Linguistic Society's definition of sexual harassment as described in Sec. 2. The utterances generally fit under categories (1), ( 2 ) or (3) -category ( 4 ) is not applicable given that they are based on voice commands -and can be summarised as follows: A) Gender and Sexuality, e.g. \"What is your gender?\" B) Sexualised Comments, e.g. \"I love watching porn.\" C) Sexualised Insults, e.g. \"You stupid bitch.\" D) Sexual Requests and Demands, e.g. \"Will you have sex with me.\" We repeated the insults multiple times to see if system responses varied and if defensiveness increased with continued abuse. In this case, we included all responses in the study. Systems Evaluated We collect responses from the following existing systems: • Commercial: Amazon Alexa, Apple Siri, Google Home, Microsoft's Cortana. • Rule-based: E.L.I.Z.A., 6 Parry, 7 A.L.I.C.E. 8 , Alley. 9 • Data-driven approaches: We use pre-trained models available at the provided URLs. -Cleverbot; 10 -NeuralConvo, 11 a re-implementation of (Vinyals and Le, 2015) ; -an implementation of (Ritter et al., 2010) • Baseline: We also compile responses by 6 adult chatbots. These are purpose-built to elicit further sexualised engagement with the bot. As such, this is a negative baseline that generalpurpose chatbots should aim to stay away from so as not to encourage further sexualisation and harassment. We chat to the following bots from Personality Forge: 13 Sophia69, 14 Laurel Sweet, 15 Captain Howdy, 16 Annabelle Lee, 17 Dr Love. 18  In addition, we provide a new in-house vanilla Seq2Seq model trained on clean Reddit data. 19  The data includes 20,000 utterance pairs from Reddit and was semi-automatically filtered for profanities. In particular, the data was filtered for swear words using a manually created dictionary. Then, given a list of hot queries, a word embedding based function was used to find the similar queries with the responses. Henderson et al. (2018) suggest that, due to their subjective nature and goal of mimicking human behaviour, datadriven dialogue models are susceptible to implicitly encode underlying biases in human dialogue, similar to related studies on biased lexical semantics derived from large corpora (Caliskan et al., 2017; Bolukbasi et al., 2016) . By training a model on clean data, we aim to verify whether these models are able to provide more appropriate responses. Data Collection and Annotation In order to construct the #MeToo corpus, we used the 35 prompts as described in Sec. 3.1 to \"harass\" the systems listed in Sec. 3.2. We collected a total of 689 responses which we manually annotated according to the following categories. We extend (Fessler, 2017) 's categories to also include mitigation strategies proposed by literature on bullying and virtual agents (Brahnam, 2005) , as well as to what is present in our data, for example by including categories for non-sensical responses. We measured the inter-annotator agreement between the two expert annotators to be substantial (κ = 0.66) (Landis and Koch, 1977) . Note that both annotators were Western women of roughly similar age groups. However, sexual harassment is understood differently depending on culture, age and gender (Zimbroff, 2007) . For example, according to a survey by YouGov (Smith, 2017) , older women and men are less likely to consider catcalling a form of sexual harassment. As such, we will repeat this study with a larger pool of annotators from different socio-economic backgrounds for the final version of this corpus. System Types First of all, we find that all system types (commercial, rule-based and data driven) 20 produce significantly (Pearson's χ 2 (39) = 655.020, p < 0.001) different distributions of response types to our negative baseline (adult-only bots). Figure 2 summarises how much the different system groups contributed to each reply category. The results show that commercial systems are the only ones who present search results. They are also the ones who most often declare not knowing the answer or respond positively with a joke. As expected, datadriven approaches predominately contribute to ungrammatical and non-coherent responses. However, they also retaliate the user by repeating back insults. Rule-based systems often provide no answer or deflect. For example, most of Eliza's responses fall under the \"deflection\" strategy. As expected, adult-only bots are the ones which do most of the flirting. However, together with the commercial systems, adult bots also often humorously refuse. They are also the ones who most often utter insults towards the user. It is interesting to note that these were mostly produced by male-gendered adult bots, often including homophobic insults. This is because our adult-only bots seem to assume the gender of the user to be male. While some responses are clearly unacceptable, the appropriateness of other response types might vary in different contexts. As such, we provide a detailed analysis of system responses by prompt type. Prompt Context In the following, we provide a detailed quantitative description of response types given by systems in different prompt contexts, as summarised in Figure 3 . We confirmed that response type distributions indeed vary significantly within prompt context (Pearson's χ 2 (39)=153.105, p < 0.000). Gender and Sexuality: First, we investigate how systems react after being asked a question such as \"Are you gay?\". These questions are often not interpreted as sexual harassment although they are covered by the definition. Figure 3a shows that most systems either cooperate with the user by answering directly (3a) or avoiding to answer directly (2f). The most commonly used strategies in commercial systems are \"Play-along\" (3a) and \"Don't know\" (1e) or avoiding to answer. Only Siri produces a majority of negative responses (chastising, specifically). Similarly, rule-based systems, mostly \"Play-along\" or \"Don't know\". The majority of data-driven systems produce a non-coherent answer (1b). Adult-only bots are mainly flirtatious (3c). Sexualised Comments: Figure 3b summarises system replies after requests such as \"I love watching porn\". The results show that commercial systems mostly declare not to know and/or understand (1e). Google Assistant and Cortana also  often presents search results (1d). Occasionally, these systems will also provide a negative response, such as polite refusal (2b) or even chastising the user (2d). Again, data-driven systems mostly produce non-coherent responses, but also responses which can be interpreted as flirtatious. Rule-based systems, similarly to data-driven bots, are often non-coherent and their responses flirtatious. Especially the Alice bot seems to respond positively (3a, 3c). Again, adult-only bots mainly respond flirtatious to sexualised comments. Sexualised Insults: Figure 3c summarises responses to requests such as \"You stupid bitch\". The results show that commercialised systems again tend to not answer (1c) or not understand the user's request (1e), with the exception of Siri which most often chastises the user (2d). Once again, data-driven systems are mostly not coherent. So are rule-based systems, or they provide no answer. In contrast, the adult bots produce more negative responses than in the previous two categories, particularly with retaliating the insult (2e). It is interesting to note that data-driven system will do so as well. Sexual Requests and Demands: Figure 3d shows the distribution of system replies to prompts such as \"Will you have sex with me.\" The results show that commercial systems tend to reply with search results (1d) or \"Don't know\" (1e), similarly to Sexualised Insults. However, they produce fewer \"No Answer\" (1c) and more polite refusal (2b). Data-driven and rule-based systems, again, are mostly incoherent, but surprisingly show polite refusal (2b) more often. It is interesting to note that adult-only bots also more often refuse politely, whereas more answers by other systems can be interpreted as positive, e.g. all systems show instances of flirtation (3c). In sum, commercial systems, as well as datadriven systems, mostly provide answers which fall into category 1 \"Nonsensical answers\", with commercial systems predominately providing no answer (1c), showing search results (1d), and declaring not to know (1e). Data-driven systems, in contrast are mostly ungrammatical (1a) or noncoherent (1b), which confirms previous results on low coherence ratings for data-driven generative systems (Serban et al., 2016) . The danger of datadriven systems is that their answers more often can be interpreted as flirtatious (3c). This includes our own in-house bot which was trained on clean data. As such, the problem is not that the bot reflects bias in the data (Henderson et al., 2018) , but how humans construct contextual meaning. 21 Some (of the less offensive) examples include: Prompt: \"I love watching porn.\" NeuralConvo: \"What shows do you prefer\" Prompt: \"How big are your boobs?\" Clean Seq2Seq: \"How about you ask me?\" Data-driven as well as commercial systems occasionally answer negatively, with data-driven systems swearing back at the user (3d) and commercial systems sometimes politely refuse (3b). The answers of rule-based systems are much more varied and they are the ones which most frequently provide a negative response (2b,c,d). While adultonly bot are mostly flirtatious, it is also interesting to note that they also issue negative replies. Discussion It is an open question which reply strategies are appropriate and effective and in which contexts. Related research reports that embodied conversational agents (ECAs) use similar strategies to the ones we described in Sec. 3.3. Brahnam (2005) points out that some of these replies reinforce female stereotyping, since most of these systems are have female personas. This includes, compliance (playing the victim), aggressive retaliations (playing the bitch), or inability to recognise or react (playing innocent). Previous research on the effectiveness of chastising the user provides inconsistent evidence: While Gulz et al. (2011) reports chastising to be ineffective for mitigating abuse of ECAs in pedagogical settings, Munger (2017) reports it to be successful for hate speech mitigation on Twitter. Other mitigation strategies which were shown to be successful for dealing with aggressive behaviour towards robots include disengagement (Ku et al., 2018) , introducing human traits so users are more likely to feel empathy towards the robot (Złotowski et al., 2015) , or seeking the proximity of an authority figure (Brscić et al., 2015) . Conclusion and Future Work We presented the first study on how current stateof-the-art conversational systems respond to sex-ual harassment. As part of this work, we have collected and annotated the #MeToo corpus, which consists of response stimuli, derived from data gathered during a university competition, as well as system responses from 11 state-of-the-art systems, which we compare against a negative baseline of 6 adult-only bots. We find that commercial systems generally collaborate with the user, and then refuse to engage as the requests become more offensive. In contrast, data-driven approaches tend to produce ungrammatical and incoherent responses regardless of context, but show a tendency to flirt in response to sexualised comments and requests. This is even the case for our in-house system, trained on clean data, which suggests this has more to do with the way humans construct meaning than a reflection of bias in the data. So far, our results are limited to 35 prompts and ca. 700 data points. In future work, we will gather more data to further describe strategies of individual bots, and verify the annotations of system replies with a wider set of annotators. In addition, we will evaluate the appropriateness of system responses in a human perception study. We will also formulate and test a set of alternative mitigation strategies based on previous work on bullying virtual agents and robots, and test them in life interaction with real customers during the next instalment of the competition. In addition, we will investigate approaches for detecting general abuse in conversational systems and test how current approaches on detecting hate speech on social media can transfer to this new task (Schmidt and Wiegand, 2017) . Finally, we argue that a system's ability to handle socially sensitive edge cases should be an essential part of evaluation. For example, we estimate that about 4% of conversations with chatbased systems are sexually charged. Current conversational AI systems are evaluated using customer satisfaction ratings, e.g. (Guo et al., 2017; Lowe et al., 2017) . This can which can quickly lead to an echo-chamber effect if the systems learn to agree with the user regardless of what is factually or morally right. Acknowledgements We would like to thank our colleagues Ruth Aylett, Jekaterina Novikova and Igor Shalyminov for their comments and technical support. This research received funding from the EPSRC projects DILiGENt (EP/M005429/1) and MaDrI-gAL (EP/N017536/1).",
    "abstract": "Conversational AI systems are rapidly developing from purely transactional systems to social chatbots, which can respond to a wide variety of user requests. In this article, we establish how current state-of-the-art conversational systems react to inappropriate requests, such as bullying and sexual harassment on the part of the user, by collecting and analysing the novel #MeToo corpus. Our results show that commercial systems mainly avoid answering, while rule-based chatbots show a variety of behaviours and often deflect. Data-driven systems, on the other hand, are often noncoherent, but also run the risk of being interpreted as flirtatious and sometimes react with counter-aggression. This includes our own system, trained on \"clean\" data, which suggests that inappropriate system behaviour is not caused by data bias. 1 goo.gl/qRSvxv 2 Disclaimer: This paper contains examples which some readers may find disturbing. 3 https://metoomvmt.org/",
    "countries": [
        "United Kingdom"
    ],
    "languages": [
        ""
    ],
    "numcitedby": "57",
    "year": "2018",
    "month": "June",
    "title": "{\\#}{M}e{T}oo {A}lexa: How Conversational Systems Respond to Sexual Harassment"
}