{
    "article": "Automatic natural language generation systems need to use the contextually-appropriate verbs when describing different kinds of facts or events, which has triggered research interest on verb selection for data-to-text generation. In this paper, we discuss a few limitations of the current task settings and the evaluation metrics. We also provide two simple, efficient, interpretable baseline approaches for statistical selection of trend verbs, which give a strong performance on both previously used evaluation metrics and our new evaluation. Introduction The authors of financial headlines often need to use appropriate verbs to describe a percentage change, sometimes also revealing its intensity. For instance, the verb climb in the headline Microsoft's profit climbed 28% expresses an upward direction, as well as the magnitude, of a percentage change. Likewise, an automatic natural language generation systems for data-to-text generation under similar scenarios should also properly select verbs as well. In earlier systems, neutral verbs such as increase and decrease that only describes the direction of changes were preferred for simplicity. However, the generated sentences can be more natural if automatic NLG systems could use a more diverse set of verb choices suitable in the context like human writers could do. Due to the vagueness of word meaning and variations in word usage, data-driven methods are believed to be a reasonable choice for automatic systems (Reiter, 2018) . Recently, there indeed exist several studies working towards this direction, with a special focus on statistical or probabilistic methods for selecting verbs to describe trends in percentages. In the most typical task settings, * Work done during internship at MSRA. a dataset is extracted from some sentences in a corpora describing percentage changes, with the form of D = {(x 1 , v 1 ), ..., (x N , v N )}, where x i is the numeric value of the percentage change (e.g. 12.5%) and v i is the verb used by human writers in the original sentence to describe the percentage change. Rising trends and falling trends were typically collected separately. The task is to train a verb selector f (•) aiming at mapping a new input percentage x * to a verb v * , or a distribution of appropriate verbs from which a verb could be randomly selected to form an utterance. Thomson Reuters' NLG system (Plachouras et al., 2016) for macro-economic indicator and merger-and-acquisition deals data includes a submodule for trend verb selection (Smiley et al., 2016) . For each verb, their system estimates the interquartile range (IQR) of its associated percentage changes from the corpus. Given a new percentage change, their method randomly selects a verb from those verbs whose IQRs could cover the specified percentage value. One more recent work (Zhang et al., 2018) proposed a Bayesian probabilistic model by estimating the prior probability of each verb as well as the likelihood of seeing the percentage change given the verb. Their evaluation based on the mean reciprocal ranking (MRR) of the humanwritten verb suggests significant superiority over the Thomson Reuters' approach. However, we notice that naively outputing the most frequently used verbs for upward / downward direction can perform surprisingly high in terms of a few automatic metrics on the dataset used by Zhang et al. (2018) . In this paper, we try to point out a few limitations of currently used evaluation metrics, and provide two simple, efficient and interpretable baseline approaches that achieve results competitive to prior approaches in both previous metrics and our new evaluation strategies. Systems in Comparison The scope of this study is mainly a slightly closer investigation of approaches compared in the recent study by Zhang et al. (2018) . For selfcontainedness, we briefly describe the systems in comparison. The datasets we used to derive or train these systems are those collected and reported by Zhang et al. (2018) . 1  Thomson Reuters: The method adopted by Smiley et al. (2016) as aforementioned. Neural Networks: A feed-forward neural network with hidden layers and rectified linear unit activations, trained with 2 regularization. Detailed settings were following Zhang et al. (2018) . Bayesian Models: The method proposed by Zhang et al. (2018) , which is a generative model of the posterior P (v|x) inferred by the Bayes rule: P (v|x) ∝ P (x|v)P (v), (1) where the likelihood P (x|v) (conditioned on a given verb v) and the verb prior P (v) are estimated from corpus statistics. Zhang et al. (2018) formulated the likelihood model using either kernel density estimation (KDE) or a Beta distribution, while the prior was estimated by frequency ratio with the Jelinek-Mercer smoothing (Jelinek, 1980) on a uniform distribution over all verbs V: P (w) = λ freq(v) v freq(v ) + (1 − λ) 1 |V| . ( 2 ) The choice of λ dictates the trade-off between accuracy and diversity. In our study, we also introduce two more straightforward baseline approaches that are simpler, more efficient, and more interpretable than non-parametric estimators such as KDE. The Frequency Baseline: The simplest baseline that directly samples a verb based on the overall frequency distribution was ignored in previous studies when calculating the metrics. In our study, we would like to investigate how different the previous systems perform when compared with this baseline in metrics. Decision Tree Baseline: One simple improvement of the frequency baseline is segmenting the range of x into groups, and separately calculate frequency distributions within each group. To keep the baseline simple, we only split the range 1 Retrieved from: https://goo.gl/gkj8Fa ; We only use the WSJ and Reuters subsets in English in this study. into two groups, which is equivalent to a decision tree with a depth of one. We use information gain as the splitting criterion (Safavian and Landgrebe, 1991). See Figure 1 for a visualization of the split point, which roughly depicts a group of moderate changes versus another group for larger changes. Experiments The Original Automatic Metrics The automatic metrics reported by Zhang et al. (2018) aim at evaluating accuracy and diversity. The accuracy for verb selection is reflected by the Mean Reciprocal Rank (Voorhees et al., 1999; Radev et al., 2002, MRR) of the reference verb: MRR = 1 |T | (x i ,v i )∈T 1 rank (v i ) , (3) where T denotes the held-out test set: T = {(x 1 , v 1 ), .., (x M , v M )}. For diversity, the number of distinct verbs (richness) and the relative abundance (evenness) in the selected outputs are reported, along with the well-known Inverse Simpson Index aka Simpsons Reciprocal Index (Simpson, 1949) that takes both aspects into account: D = ( R i=1 p 2 i ) −1 , where R is the total number of distinct selected verbs. Evenness is calculated as D/R. Table 1 listed the MRR results along with the difference of top-1 system output with the most frequent baseline. We also calculate the Jensen-Shannon Divergence (Wong and You, 1985; Osterreicher and Vajda, 2003, JSD) , which is defined to be the mean of KL divergences in two directions, to measure how different the probability distributions are compared with the frequency distribution. We mostly reproduce the results from (Zhang 1. The frequency baseline is not distinguishable from the Bayesian methods in terms of MRR; 2. Systems achieving high MRR in fact yield neglectable difference with the frequency baseline in terms of the top-1 output and JSD. For automatic metrics measuring diversity, we list the results in Table 2 . By correcting an error in the codes from Zhang et al. (2018) where they amplified the differences between two systems by dropping cases that both yield the same verbs, the results are slightly different from what was originally reported. Bayesian models with low smoothing factor (λ) now defeat (not significantly) the Thomson Reuters in the sense of both richness and evenness. Other systems, including the neural network, our two new baselines, and Bayesian models with high smoothing factor has lower diversity, but not goes to zero as stated by Zhang et al. (2018) . Almost all the models have exactly the same level of richness. This said, diversity metrics alone cannot reflect quality in selection, as a system could always select every candidate verb with equal probabilities for maximal diversity. We need better ways to simultaneously evaluate appropriateness and comprehensiveness. Alternative Evaluation Our observation of the frequency baseline is reasonable in the sense that it in theory minimises the Bayes risk (Berger, 2013) if the conditional likelihood has tiny subtle differences and is overwhelmed by an overall prior of verb choice, and a number of systems in comparison with high MRR in fact reduce to this baseline by certain degree. More intuitively, the most frequently used verbs in the corpora are rise and fall, which are often correct but less informative. For each numerical value of percentage, there could be multiple verb choices that are plausible to human writers, while some verbs may not be appropriate. Since neither MRR nor diversity metrics could address this point, we conduct some alternative evaluations by collecting a gold-standard set of multiple plausible candidate verbs on Amazon Mechanical Turk (AMT), using the WSJ subset of the original dataset. Following Smiley et al. (2016) , we restricted raters to those located in the United States, with an approval rating above 95% and 1,000 or more HITs approved.  We construct natural language utterances using uniformly sampled percentage values and all the verbs in the dataset (11 verbs describing upward changes and 14 for downward changes in total), and using one consistent subject (Net Profits) to reduce the potential variance brought by different subjects which is beyond the scope of this study. AMT workers will try to annotate each sentence with one of the three degrees of appropriateness: • 3 (Appropriate): The verb is among the most suitable ones to describe the percentage • 2 (Okay): The verb could be used to describe the percentage, although it might not be one of the most appropriate choices • 1 (Not Appropriate): The verb is not naturally used to describe the percentage See supplementary notes for a screenshot of the annotation interface. For either upward and downward verbs, we uniformly random sampled 100 different percentage changes from the interval [0, 100], which results in 12,500 judges in total. The resulting corpus has the format that each percentage change is paired with a list of candidate verbs, each of which has five judges from five different workers. We treat any verb with more than three judges rated 3 as one appropriate verb. This crowdsourced dataset could be used to evaluate each system on the ability to select multiple plausible verbs, treating verb selection as an ordinary classification task. We randomly leave out 20% of this dataset as the development set, and the rest for the final test set evaluation. For systems giving probability distributions on verbs (as opposed to deterministic selections), it is natural to threshold the accumulated value to decide which verbs to include as the finally selected candidates, with the threshold determined on the development set. We calculate the performance in terms of the precision, recall and F1 measure of all the annotated appropriate verbs, and the results are displayed in Table 3 . The values of the cross-entropy loss as we calculated follow similar trends, as included in the supplementary notes. We can observe that under the new evaluation protocol, the results from the two baseline approaches are more competitive than those reflected by MRR. The frequency baseline is surprisingly strong, indicating that authors of the standard corpora might favor more neutral verbs that could be applicable for almost all percentage values. A slightly more crafted decision tree marginally brings further performance increase. Meanwhile, we can also notice that models achieving higher diversity scores (cf. ing around 50. This suggests that models may have learned rather flat distributions over verbs, with an implication that although these models have higher diversity on selecting verbs, they actually have lower diversity on selecting appropriate verbs. Given the current F1 values around 50 to 60, there still exists room for improvements over simple baselines for more precise selection. Discussion For the task of trend verb selection for data-to-text generation, our observations suggest that the evaluation results for current automatic metrics should be interpreted with caveats. Automatic verb selection systems that achieves good accuracy as reflected by high mean reciprocal ranks could in fact hardly yield real difference compared with just outputting the most frequently used verbs in overall statistics. More complex likelihood modelling using kernel density estimation could not produce more diverse selection of all plausible verbs as it behaves similar to a frequency baseline, while being slightly less interpretable compared with simpler frequency based approaches such as a shallow decision tree. One source of this issue should be the lack of good definition of appropriateness, as the difference in various verbs is often vague (see Figure 1 for an instance, where the used range for a number of verbs could almost span the entire range of the percentages). It also remains an open problem for a more thorough, rigorous, systematic treatment in terms of experimental design and evaluation protocol, given that this work and previous relevant studies have all just temporarily ignored the potential impact of different subjects in a sentence on verb selection for the simplicity of problem settings. In this study, we focus on a few issues with recent work on trend verb selection in describing various kinds of percentages, with experiments conducted on samples collected from financial news data. We believe that similar caveats should exist in lexical choice problems appeared in other domains as well, such as various kinds of phrases in weather forecasts (Reiter et al., 2005; Ramos-Soto et al., 2014; Li et al., 2016) and in sports match reports (van der Lee et al., 2017; Wiseman et al., 2017; Qin et al., 2018) , and hopefully the field will be exploring on some more principled, domain-agnostic approaches in the future. Acknowledgments We thank all three anonymous reviewers for helpful comments on our submitted draft.",
    "abstract": "Automatic natural language generation systems need to use the contextually-appropriate verbs when describing different kinds of facts or events, which has triggered research interest on verb selection for data-to-text generation. In this paper, we discuss a few limitations of the current task settings and the evaluation metrics. We also provide two simple, efficient, interpretable baseline approaches for statistical selection of trend verbs, which give a strong performance on both previously used evaluation metrics and our new evaluation.",
    "countries": [
        "Netherlands"
    ],
    "languages": [
        "English"
    ],
    "numcitedby": "1",
    "year": "2019",
    "month": "October{--}November",
    "title": "A Closer Look at Recent Results of Verb Selection for Data-to-Text {NLG}"
}