{
    "article": "In some cases, to make a proper translation of an utterance in a dialogue, the system needs various information about context. In this paper, we propose a statistical dialogue analysis model based on speech acts for Korean-English dialogue machine translation. The model uses syntactic patterns and N-grams reflecting the hierarchical discourse structures of dialogues. The syntactic pattern includes the syntactic features that are related with the language dependent expressions of speech acts. The N-gram of speech acts based on hierarchical recency approximates the context. Our experimental results with trigram showed that the proposed model achieved 78.59 % accuracy for the top candidate and 99.06 % for the top four candidates even though the size of the training corpus is relatively small. The proposed model can be integrated with other approaches for an efficient and robust analysis of dialogues. Introduction Recently, special concerns are paid to research on dialogue machine translation. Many different aspects of dialogue, however, make it difficult to translate spoken language with conventional machine translation techniques. One of the reasons is that a surface utterance may represent several ambiguous meanings depending on context. That means such utterance can be translated into many different ways depending on context. Interpreting this kind of utterances often requires the analysis of contexts. Therefore, the discourse structure of a dialogue plays a very important role in translating the utterances in the dialogue. Discourse structures of dialogues are usually represented as hierarchical structures which *This research is supported in part by the ministry of information and communication of Korea. reflect embedding subdialogues (Grosz and Sidner 1986) . Many researchers have studied the way how to analyze dialogues. One of the representative approaches is the plan-based method (Litman et al. 1987; Caberry 1989) . Considering that our dialogue translation system is to be combined with the speech system to develop an automatic translating telephone, however, the plan-based approach has some limitations. In an automatic translating telephone environment, the system must make one correct translated target sentence for each source sentence and must be able to respond in real time. However, the plan inference is computationally expensive and is hard to be scaled up. In order to overcome such limitations, we have focused on defining minimal approach which uses knowledgebase as small as possible while it can handle ambiguous utterances. This paper presents an efficient discourse analysis model using statistical speech act processing for Korean-English dialogue machine translation. In this model, we suggest a probabilistic model which uses surface syntactic patterns and the N-gram of speech act reflecting the hierarchical structures of dialogues to decide the speech act of an input sentence and to maintain a discourse structure. The proposed model consists of two steps : (1) identifying the syntactic pattern of an utterance (2) calculating the plausibility for possible speech acts and discourse relations. After presenting some motivational examples in section 2, we discuss the statistical speech act .processing model to analyze discourse structure in section 3. In section 4, we describe a method to analyze dialogue structure using the proposed statistical speech act processing. We discuss experimental results for the proposed model in section 5. Finally, we draw some conclusions. Motivation Translation of dialogues often requires the analysis of contexts. That is, a surface utterance may be translated differently depending on context. In this section, we present some motivational examples. The word 'yey q in Korean has a number of English expression such as 'yes', 'no', 'O.K:', 'Hello', 'thanks', and so on (Jae-woong Choe 1996) . When the speech act of the utterance 'yey' is response, it must be translated as 'yes' or 'no'. On the other hand, when the speech act of the utterance is accept, it must be translated as 'O.K.'. It is even used as greeting or opening in Korean. In this case, 'Hello' is an appropriate expression in English. The verb 'kulehsupnita' in Korean, also, may be translated differently depending on context. Kulehsupnila is used to accept the previous utterance in Korean. In this case, it must be translated differently depending on context. To differentiate such cases, a translation system must analyze the context of a dialogue. Since a dialogue has a hierarchical structure than a linear structure, the discourse structure of a dialogue must be analyzed to reflect the context in translation. There are the previous plan-based approaches for analyzing context in dialogues. Since it is very difficult to have a complete knowledge, it is not easy to find a correct analysis using such knowledge bases. In this paper, we propose a statistical dialogue analysis model based on speech acts for dialogue machine translation. Such model is weaker than the dialogue analysis model which uses many difference source ,of knowledge. However, it is more efficient and robust, and easy to be scaled up. We believe that this kind of minimal approach is more appropriate for a translation system. Statistical Speech Act Processing We construct a statistical dialogue model based on speech acts as follows. Let D denote a dialogue which consists of a sequence of n utterances, U1, U2 ... Serve Serve_to May Intend Figure 1 : A Syntactic Pattern P(UilUt,U2,...,U i-l) means the probability that Ui will be uttered given a sequence of utterances U1,U2,...,Ui-1. As shown in the equation ( 1 ), we can approximate P(UilU1, U2,..., Ui-1) by the product of the sentential probability P(UilSi) and the contextual probability P(SilS1,S2,...,Si-1) (Nagata and Morimoto 1994) . In subsequent sections, we describe the details for each probability. P(UitU~, U2,..., U,_,) ( P(U, IS~)P( S,[S1, $2 ..... S,_a ). Sentential Probability There is a strong relation between the speaker's speech act and the surface utterances expressing that speech act (Allen 1989 ; Andernach 1996) . That is, the speaker utters a sentence which most well expresses his/her intention (speech act). This sentence allows the hearer to infer what the speaker's speech act is. However, a sentence can be used as several speech acts depending on the context of the sentence. The sentential probability P(Ui ISi) represents the relationship between the speech acts and the features of surface sentences. In this paper, we approximate utterances with a syntactic pattern, which consists of the selected syntactic features. We decided the syntactic pattern which consists of the fixed number of syntactic features. Sentence Type, Main-Verb, Aux-Verb, Clue-Word are selected as the syntactic features since they provide strong cues to infer speech acts. The features of a syntactic pattern with possible entries are shown in figure 1 . • Sentence Type represents the mood of an utterance. Assert, YN-Quest, WH-Quest, Imperative are possible sentence types. • Main-Verb is the type of the main verb in the utterance. PA is used when the main verb represents a slate and PV for the verbs of type • Aux-Verb represents the modality such as Want, Possible, Must, and so on. • Clue-Word is the special word used in the utterance having particular speech acts, such as Yes, No, O.K., and so on. We extracted 167 pairs of speech acts and syntactic patterns from a dialogue corpus automatically using a conventional parser. As the result of applying these syntactic patterns to all utterances in corpus, we found that the average number of speech act ambiguity for each utterance is 3.07. Table 1 gives a part of the syntactic patterns extracted from corpus. Since a syntactic pattern can be matched with several speech acts, we use sentential probability, P(UilSi) using the probabilistic score calculated from the corpus. Equation (2) represents the approximated sentential probability. F denotes the syntactic pattern and freq denotes the frequency count of its argument. (Fi, Si) fTeq(Si) P(U~IS,) ~ P(LIS,) = freq (2) Contextual Probability The contextual probability P(SilS1, $2,..., Si-1) is the probability that n utterances with speech act Si is uttered given that utterances with speech act $1, $2, • •., Si-1 were previously uttered. Since previous speech acts constrain possible speech acts in the next utterance, contextual information have an important role in determining the speech act of an utterance. For example, if an utterance with ask-ref speech act uttered, then the next speech act would be one of response, request-conf, and reject. In this case, response would be the most likely candidate. The following table shows an example of the speech act bigrams. Si--1 Si Ratio This table shows that response is the most likely candidate speech act of the following utterance of the utterances with ask-refspeech act. Also, requestconfirm and ask-if are probable candidates. Since it is impossible to consider all preceding utterances $1, $2,..., Si-1 as contextual information, we use the n-gram model. However, simply using n utterances linearly adjacent to an utterance as contextual information has a problem due to subdialogues which frequently occurred in a dialogue. Let's consider an example dialogue. In dialogue 3, utterances 3-4 are part of an embedded segment. In utterance 3, the speaker asks for the type of rooms without responding to B's ques-Dialogue 3 1. A : I would like to reserve a room. B : What kind of room do you want? 3. A : What kind of room do you have? 4. B : We have single and double rooms. A : A single room, please. request-act ask-ref ask-ref response response tion (utterance 2). This subdialogue continues up to the utterance 4. As shown in the above example, dialogues cannot be viewed as a linear sequence of utterances. Rather, dialogues have a hierarchical structure. Therefore, if we use n utterances linearly adjacent to an utterance as a context, we cannot refleet the hierarchical structure of a dialogue in the model. Therefore, we approximate the context for an utterance as speech acts of n utterances which is hierarchically recent to the utterance. An utterance A is hierarchically recent to an utterance B if A is adjacent to B in the tree structure of the discourse (Walker 1996) . Equation ( 3 ) represents the approximated contextual probability in terms of hierarchical recency in the case of using trigram. In this equation, Ui is adjacent to Uj and Uj is adjacent to Uk in the discourse structure, where 1 _< j < k _< i-1 . P(SilS1,S2 .... ,&-l) '~' P(SilSj,S~). (3) Now we can define a discourse structure analysis model with the statistical speech act processing. Formally, choose Si which maximizes the following probability max P( F~IS~ )P( S~ISj, Sk ). (4) S, where Si is a possible speech act for the utterance Ui. Uj and Uk are the utterances which Uj is hierarchically adjacent to Ui, and Uk to Uj, where 1 <_j<k<_i-1. In equation ( 4 ), one problem is to search all possible Uj that Ui can be connected to. We use the dialogue transition networks (DTN) and a stack for maintaining the dialogue state efficiently. The dialogue transition networks describe possible flow of speech acts in dialogues as shown in figure 2 (Seo et al. 1994 , Jin Ah Kim et al. 1995) . Since DTN is defined using recursive transition networks, it can handle recursively embedded subdialogues. It works just like the RTN parser (Woods 1970 ). If a subdialogue is initiated, a dialogue transition network is initiated and a current state is pushed on the stack. On the other hand, if a subdialogue is ended, then a With DTN and the stack, the system makes expectations for all possible speech acts of the next utterance. For example, let us consider dialogue 3. Figure 3 shows the transitions with the dialogue 3. In In this state, some cases can be expected for the next utterance. The first case is to clarify the utterance 5. The second case is to return to the utterance 1. The last case is to introduce a new subdialogue. Therefore, if we assume that ask-if and request-confirm are possible from the syntactic pattern of the next utterance, then the following table can be expected for the next utterance from the dialogue transition networks. Uk Uj U~ (0:-:init) (0:-:init) (6:B:ask-if) (2:B:ask-ref) (5:A:response) (6:B:ask-if) (2:B:ask-ref) (5:A:response) (6:B:request-conf) (0:-:init) (l:A:request-act) (6:B:ask-if) Since DTN has the same expressive power as ATN(Augmented Transition Network) grammar, we believe that it is not enough to cover the whole phenomenon of dialogues. However, considering the fact that the utterances requiring context for translation is relatively small, it is practically acceptable for dialogue machine translation. 5 Experiments and Results In order to experiment the proposed model, we used 70 dialogues recorded in real fields such as hotel reservation and airline reservation. These 70 dialogues consist of about 1,700 utterances, 8,319 words total. Each utterance in dialogues was annotated with speech acts (SA) and with discourse structure information (DS). DS is an index that represents the hierarchical structure of discourse. Table 2 shows the distribution of speech acts in this dialogue corpus. The following shows a part of an annotated dialogue corpus. We test two models in order to verify the efficiency of the proposed model. Model-I is the proposed model based on linear recency, where an utterance U/ is always connected to the previous utterance Ui-1. Model-II is the model based on hierarchical recency. Table 3 shows the average accuracy of two models. Accuracy figures shown in table 3 are computed by counting utterances that have a correct speech act and a correct discourse relation. In the closed experiments, Modelq achieved 68.48 % accuracy for the top candidate and 76.30 % for the top four candidates. In contrast, the proposed model, Model-II, achieved 78.59 % accuracy for the top candidate and 99.06 % for the top four candidates. Errors in Model-I occurred, because the hierarchical structure of dialogues was not considered. Although dialogue corpus are relatively small, the experimental results showed that the proposed model is efficient for analyzing dialogues. 6 Conclusions In this paper, we described an efficient dialogue analysis model with statistical speech act processing. We proposed a statistical method to decide a speech act of a sentence and to maintain a discourse structure. This model uses the surface syntactic patterns of the sentence and N-gram of speech acts of the sentences which are discourse structurally recent to tile sentence. Our experimental results with trigram showed that the proposed model achieved 78.59 % accuracy for the top candidate and 99.06 % for the top four candidates although the size of the training corpus is relatively small. This model is weaker than the dialogue analysis model which uses many difference source of knowledge. However, it is more efficient and robust, and easy to be scaled up. We believe that this kind of statistical approach can be integrated with other approaches for an efficient and robust analysis of dialogues.",
    "abstract": "In some cases, to make a proper translation of an utterance in a dialogue, the system needs various information about context. In this paper, we propose a statistical dialogue analysis model based on speech acts for Korean-English dialogue machine translation. The model uses syntactic patterns and N-grams reflecting the hierarchical discourse structures of dialogues. The syntactic pattern includes the syntactic features that are related with the language dependent expressions of speech acts. The N-gram of speech acts based on hierarchical recency approximates the context. Our experimental results with trigram showed that the proposed model achieved 78.59 % accuracy for the top candidate and 99.06 % for the top four candidates even though the size of the training corpus is relatively small. The proposed model can be integrated with other approaches for an efficient and robust analysis of dialogues.",
    "countries": [
        "South Korea"
    ],
    "languages": [
        "English",
        "Korean"
    ],
    "numcitedby": "22",
    "year": "1997",
    "month": "",
    "title": "A Dialogue Analysis Model with Statistical Speech Act Processing for Dialogue Machine Translation"
}