{
    "article": "The paper presents an entropy-based approach to segment a corpus into words, when no additional information about the corpus or the language, and no other resources such as a lexicon or grammar are available. To segment the corpus, the algorithm searches for separators, without knowing a priory by which symbols they are constituted. Good results can be obtained with corpora containing \"clearly perceptible\" separators such as blank or new-line. Introduction The paper presents an approach to segment a corpus into words, based on entropy. We assume that the corpus is not annotated with additional information, and that we have no information whatsoever about the corpus or the language, and no linguistic resources such as a lexicon or grammar. Such a situation may occur e.g. if there is a (sufficiently large) corpus of an unknown or unidentified language and alphabet. 1 Based on entropy, we search for separators, without knowing a priory by which symbols or sequences of symbols they are constituted. Over the last decades, entropy has frequently been used to segment corpora [Wolff, 1977 , Alder, 1988 , Hutchens and Alder, 1998, among many others] . and it is commonly used with compression techniques. Harris [1955] proposed an approach for segmenting words into morphemes that, although it did not use entropy, was based on an intuitively similar concept: Every symbol of a word is annotated with the count of all possible successor symbols given the .substring that ends with the current symbol, and with the count of all possible predecessor symbols I Such a corpus can be electronically encoded with arbitrarily defined symbol codes. given the tail of the word that starts with the current symbol. Maxima in these counts are used to segment the word into morphemes. All steps of the present approach will be described on the example of a German corpus. In addition, we will give results obtained on modified versions of this corpus, and on an English corpus. The Approach 2.1 The Corpus We assume that any corpus C can be described by the expression: c = S. T IS+ T]* 3, (1) There must be at least one token T (\"word\") which is a string of one or more symbols s : T = s+ (2) Different tokens T must be separated form each other by one or more separators S which are strings of zero or more symbols s : S = s* (3) Separators can consist of blanks, new-line, or \"'real\" symbols. They can also be empty strings. Recoding the Corpus We will describe the approach on the example of a German corpus. First, all symbols s (actually all character codes) of the corpus are recoded by strings of \"'visible\" ASCII characters. For example: 2 2In this example, \\ denotes that the current line is not finished yet but rather continues on the next Ihle. If the language and the alphabet are unknown or unidentified, the symbols of the corpus can be encoded by arbitrarily defined ASCII strings. Information and Entropy We estimate probabilities of symbols of the corpus using a 3rd order Markov model based on maximum likelihood. The probability of a symbol s with respect to this model M and to a context c can be estimated by: f(s, M, c) p(slM, c) = (4) ](U,c) The inIormation of a symbol s with respect to the model M and to a context c is defined by: I(s]U, c) = -log2 p(slU, c) (5) Intuitively, information can be considered as the surprise of the model about the symbol s after having seen the context c. The more the symbol is unexpected from the model's experience, the higher is the value of information [Shannon and Weaver, 1949] • The entropy of a context c with respect to this model M expresses the expected value of information, and is defined by: g(Af, c) = Zp(s]M,c ) I(slM, c) (6) sEE Monitoring entropy and information across a corpus shows that maxima often correspond with word 3Note that blanks become \"BL\" and new-lines become \"NL\". boundaries [Alder, 1988, Hutchens and Alder, 1998, among many others] . More exactly, maxima in left-to-right entropy HLR and information ILR often mark the end of a separator string S, and maxima in right-to-left entropy Hn• and information IR~ often mark the beginning of a separator string, as can be seen in Figure 1 . Here, an information value is assigned to every symbol. This value expresses the information of the symbol in a given left or right context. An entropy value is assigned between every two symbols. It expresses the model's uncertainty after having seen the left or right context, but not yet the symbol• When going from left to right, all end of a separator, is often marked by a maximum in entropy because the next word to the right can start with almost any symbol, and the model has no \"idea\" what it will be. There is also a maximum in information because the first symbol of the word is (more or less) unexpected; the model has no particular expectation. Similarly, when going from right to left, a beginning of a separator is often marked by a maximum in entropy because the word next to the left call end with almost any symbol. There is also a maximum in information because the last symbol of the word is (more or less) unexpected; the model has no particular expectation. Usually, there is no maximum at a beginning of a separator, when going from left to right, and no maximum at a separator ending, when going from right to left, because words often have \"typical\" beginnings or endings, e.g. prefixes or suffixes• This means, when we come from inside a word to the beginning or end of this word then the model will anticipate a separator, and since the number of alternative separators is usually small, the model will not be \"surprised\" to see a particular one. On the other side, when we come from inside a separator to the beginning or end of this separator, although the model will expect a word, it will be \"surprised\" about any particular word because the uumber of alternative beginnings or endings of words is large. It also may be observed that the maxima in one direction are bigger then the maxima in the other direction due to the fact that a particular language may have e.g. stronger constraints on endings than on beginnings of words: A language may employ suffixes with most words in a corpus, which limits the number of endings, but rarely use prefixes, which allows a word to start with almost any symbol Thresholds Not all maxima correspond with word boundaries. Hutchens and Alder [1998] apply a threshold of 0.5 log2 [1~][ to select among all maxima, those that represent boundaries. The present approach uses two thresholds that are based on the corpus data and contain no other factors: The first threshold van is the average of all values of the particular function, HLR, HI{L, ILR, or II{L, across the corpus. The second threshold Vm,~ is the average of all maxima of the particular function. All graphs of Figure 1 contain both thresholds (as dotted lines). To decide whether a value v of HLa, HRL, ILR, or II{n should be considered as a boundary, we use the four functions: bo(v) : v>T.,~ (7) b,(v) : v ~vatt (S) b2(v) : ismax(v) (9) b3(v) : ~ismin(v) (10) Detection of Separators To find a separator, we are looking for a strong boundary to serve as a beginning or end of the separator. In the current example, we have chosen as a criterion for strong boundaries: (bo(h) A •2(h)) A (bi(i) V b3(i)) = (11) ((h > rma=(H)) A ismax(h)) A ((i > Tan(I)) V -~isrnin(I)) Here H and I mean either HLR and ILR if we are looking for the end of a separator, or HRL and Inn if we are looking for the beginning of a separator. The variables h and i denote values of these functions at the considered point. Once a strong boundary is found, we search for a weak boundary to serve as an ending that matches the previously found beginning, or to serve as a beginning that matches the previously found ending. For weak boundaries, we use the criterion: (51 (h) A b2(h)) A (bz(i) V b3(i)) = (12) ((h > Tall(H)) A ismax(h)) A ((i > raU(I)) V ~ismin(I)) If a matching pair of boundaries, i.e. a beginning and an end of a separator, are found, the separator i is marked. In Figure 1 this is visualized by ] for empty and { } for non-empty separators. The search for a weak boundary that matches a strong one is stopped (without success) either after a certain distance 4 or at a breakpoint. For example, if we have the beginning of a separator and search for a matching end then the occurrence of another beginning will stop the search. As a criterion for a breakpoint we have chosen: (bl (h) A b~(h) ) V (bl (i) A b2(i) ) = ((h > Tau(H)) A ismax(h)) V ((i > ran(I)) A ismax(i)) ( 13 ) If the search for a matching point has been stopped for either reason, we need to decide whether the initially found strong boundary should be marked despite the missing match. It will only be marked if it is an obligatory boundary. Here we apply the criterion: (bo(h) A b2(h)) A (bo(i) A b2(i)) = ((h > rma=(H)) A ismax(h)) A ((i >_ rrnax(I)) A ismax(i)) (14) In Figure 1 these unmatched obligatory boundaries are visualized by {u or }u. Each of the four criteria, for strong boundaries, weak boundaries, break points, and obligatory boundaries, can be built of any of the four functions boo to b30 (eq.s 7' to 10). Validation of Separators All separator strings that have a matching beginning and end marker are collected and counted. Separators from a German corpus (truncated list) 4In the example, the maximal separator length is set to 6. This seems sufficient because we found no separators longer than 3 so far (Tables 1 to 5 ). Alias fsepar fcontezt Table 1 shows such separators collected from the German example corpus. Column 5 contains the strings that constitute the separators, column 2 shows the count of these strings as separators, colunm 3 says in how may different contexts s the separators occurred, colunm 4 shows the total count of the strings in the corpus, and column 1 contains aliases furtheron used to denote the separators. In Table 1 all separators are sorted with respect to column 3. From these separators we retain those that are above a defined threshold relative to the number of different contexts of the top-most separator. In all examples throughout this article, we are using a relative threshold of 0.5, which means in this case (Table 1 ) that the top-most two separators, \"BL\" and \"NL\" that occur ifi 1484 and 850 different contexts respectively, are retained. 6 In the corpus, all separators that have been retained (Table 1 ) and that have at least one detected boundary (Fig. 1 ), are validated and marked. For the above corpus section this leads to: Due to the approach, the precision for BL and NL is 100 %. A string which is different from BL and NL cannot be marked as a separator in the above example. If empty string separators were admitted, the precision would decrease. 5As context of a separator, we consider the preceding and the following symbol. 6In the Tables 1 to 5 the retained separator strings are separated by a horizontal line form the others. 3 More Examples We applied the approach to modified versions of the above mentioned German corpus and to an English corpus. German with Empty String Separators For this experiment, we remove all original separators, \"BL\" and \"NL\", from the above German corpus: FiirInstandsetzungundNeubaude r Kanalisationdfirftenindenn$ch stenzehnJ ahrenBetr~igein Millia rdenhSheausgegebenwerden. All eininden alt enBundesl~indernmfi ssenbiszurJahrhundertwendedie Kommunenkmdesinsgesamtkmla ngenKanal-undLeitungsnetzess anieren. From this corpus, we collected the separators in German with Modified Separators For the next experiment, we chmlged all original separators, \"BL\" and \"NL\", in the above German corpus into a string from the list { ........ , \"--\", ,,#,,, -# #,,, ,,__ _,,, ,,# #,, ,,_ _,, ~ :7 - From this corpus, we collected the separators in English Corpus On an English corpus where all original separators have been preserved: s In the days when the spinning-wheels \\ hummed busily in the farmhouses and even great ladies clothed \\ in silk and thread lace had their toy spinning-wheels \\ of polished oak there might be seen in \\ districts far away among the lanes or deep in the bosom of the hills certain \\ pallid undersized men who by the side of the brawny \\ country-folk looked like the remnants of a disinherited race. we measured the information and entropy shown in Figure 2 , collected the separators in    Sln this example, \\ denotes that the current line is not finished yet but rather continues on the next line\" Conclusion and Future Investigations The paper attempted to show that entropy and information can be used to segment a corpus into words, when no additional knowledge about the corpus or the language, and no other resources such as a lexicon or grammar are available. To segment the corpus, the algorithm searches for separators, without knowing a priory by which symbols or sequences of symbols they are constituted. Good results were obtained with a German and an English corpus with \"clearly perceptible\" separators (blank and new-line). Precision and recall decrease if the original separators of these corpora are removed or changed into a set of different co-occurring separators. So far, only separators and their frequencies have been taken into account. Future investigations may include: • the use of frequencies of tokens and their different alternative contexts, to validate these tokens and the adjacent separators, and • a search for criteria (based on the corpus itself and on the obtained result) to evaluate the \"quality\" of segmentation, thus enabling a selfoptimizing approach. Acknowledgements Many thanks to the anonymous reviewers of my article and to my colleagues. [ Wolff, 1977] J. G. Wolff. The discovery of segments in natural language. British Journal o.f Psychology, 68:97-106, 1971.",
    "abstract": "The paper presents an entropy-based approach to segment a corpus into words, when no additional information about the corpus or the language, and no other resources such as a lexicon or grammar are available. To segment the corpus, the algorithm searches for separators, without knowing a priory by which symbols they are constituted. Good results can be obtained with corpora containing \"clearly perceptible\" separators such as blank or new-line.",
    "countries": [
        "France"
    ],
    "languages": [
        "German",
        "English"
    ],
    "numcitedby": "29",
    "year": "1999",
    "month": "",
    "title": "Experiments in Unsupervised Entropy-Based Corpus Segmentation"
}