{
    "article": "Tombstone inscriptions represent a linguistic genre which yields insights in culture and language. Creating corpora from tombstones is thus a complementary approach for the study of languages and cultures. For the annotation of tombstone corpora, we propose TSML, the Tombstone-Markup-Language, developed during the massive annotation of Taiwanese tombstones and a number of tombstones from China, Indonesia and Europe. We discuss our conceptual framework in the annotation of tombstones and derive successively and present preliminary research data to show how the usefulness of the annotations. Finally, we will encourage researchers to participate in the specification of TSML to obtain soon an annotation language for annotations across cultures and languages. From Tombstones to Corpora Tombstone inscriptions represent a linguistic genre which, due to the moment it represents, allows for profound insights in culture and language. When the trivia of life don't matter anymore and the cullets of life are swept together in a few strokes in marble, language is frequently the only agent and the only trace in a battle between conflicting identities, social relations, conceptual systems, mythologies and religions. Plate 1 to 4: From left to right, a sinicized aborigine tomb, a Japanese-style Han tomb, a christianized Han tomb and a de-sinicized aborigine tomb. Tombstones can be found worldwide. Their form and content follow ethnic and religious traditions, cf. Rath 1986 , Frembgen 1998 ,The Hindu 2005) . Notwithstanding global trends, tombstone preserve very local customs. Even on a small island like Taiwan, tombstones in the North and South, East and West are different, blending the flavors of ethnic or religious traditions with local craftsmanship (cf. Clark 1989 Clark /1992 ). In addition, traditions in contact borrow from each other and create particular forms as shown in Plates 1 to 4. Research on tombstones thus backs the study of language and culture. Creating a corpus of tombstones, as opposed to other research designs used with to tombstones, requires most investments, but is also the most rewarding strategy. First, a corpus can reveal facts, such as local, temporal, ethnic, religious, social or gender-related differences, that cannot be learned from individual tombstones. In addition, a corpus, when properly balanced, paves the way to innumerable investigations beyond the initial motivation for the construction of the corpus. Third, a corpus with digital recordings such as photos as integral part can be continuously annotated, opening new perspectives with each new annotation. Finally, corpora from different resources can be used in comparative studies. Tombstone corpora cannot bridge the gap between the rapid extinction of cultures and languages (Wurm 1991) and the missing research activities in language documentation. Although one might hope that tombstones will still be recoverable after the death of a culture, factors like urbanization, industrialization, tourism and construction work or acid rain threaten the existence of these mute witnesses. Although after 100 years one might still find individual tombstones, any systematic comparison across regions, ethnicities or time periods would be difficult. Our study on Taiwanese tombstones confirms the precarious state, showing a massive loss of tombstones of the time before 1950. Figure 1: The density of tombstones compared to the density of the population in Taiwan through time. The lack of older tombstones cannot be explained through a smaller population in earlier times. Data are based on 3000 tombstones from 30 graveyards. Annotating Tombstones Different grass-root activities have sprung up, e.g. in the US and Australia, to preserve the cultural heritage of tombstones by photographing or transcribing them (e.g. http://www.rootsweb.com/~cemetery/). However, the nature of the transcriptions determines the use one can make of them, cf. Debartolo Carmack 2002. Unstructured transcriptions, for example, leave too much ambiguity for automatic analysis. The word 'Brown' might be a name or a color, 'Miller' a name or profession. 'Brown' thus should be annotated as 'name' and 'Miller' as 'profession'. To achieve this we use textual segments as 'date', 'location', 'epitaph' which describe the arrangement of the inscription. The knowledge of the textual segments allows for the determination of reference systems, references and meanings. Reference systems and references, as opposed to textual or editorial annotations, constitute a conceptual framework for corpus annotation which are important for cross-cultural and cross-linguistic comparisons. XML (Bray et al. 2004 ) is, without question, the best supported annotation meta-language. To our knowledge, however, no XML language for tombstone corpora has been developed so far. EpiDoc for example, aims at the annotation of Epigraphs (Anderson et al 2007) and developed a rich scheme for the textual elements on the basis of TEI (Sperberg-McQueen & Burnard 2002) . However, EpiDOC yet does not provide an annotation framework beyond the text, such as the description of graves, graveyards or their ethnic and religious environments. In addition, EpiDoc stresses the individuality of the object, given the function of the epitaphs as revelation of the individual personality (cf. Edgette 1989 Edgette /1992)) . A corpus, however, serves a different purpose. In a corpus the individual stone, as well as any other individual feature is meaningless. When annotating a corpus, we annotate only those features which, beyond the purposes of data management and data retrieval, enter a system of meaningful oppositions (cf. Fages 1968) . In terms of statistics, a feature is not annotated as long as there is no conjecture of a correlation with another feature. TSML is thus basically designed , for the annotation of features of correlation, developed on the basis of our experience with the massive annotation of Taiwanese tombstones and some tombstones from other countries. 2.1.TSML, Basic Structure Simplicity, uniformity and flexibility of TSML is achieved by using the <div> element in combination with a type-attribute as shown in Figure 2 . We do not specify any constraints on the hierarchy of div-types as there are tombs without graveyards, tombs within tombs, graveyards without tombs, tombs in a church, tombstones without tombs and a tombstone-side, for example as photo, without the stone. Symbols, images, photos, maps can be at all levels, as well as texts which can be within the images, on the grave or on the tombstone.  For all div-elements, attributes are assumed to be inherited (to cascade) from the mother divelement to the daughter div-element in the absence of a more specific value. The information contained by some of these attributes cannot be seen on the tomb or tombstone directly and must be inferred or measured from other sources (GPS, compass, map, archives). The number of tombstones in this div. 2.2.Balanced Data A corpus should be balanced (Biber et al. 1998) . Although for a tombstone corpus, criteria of balancedness might be better to define than for a text corpus, e.g. collecting one photo per 1000 tombs, balancedness through sampling is impossible to achieve. Nobody knows all graveyards and how many tombs there are and those that we find may be inaccessible or decayed. In addition, naïve balancedness is not what we want. We want a tombstone corpus to have different granularities for different subset of the data. Graveyards of minorities are photographed and annotated exhaustively. In relatively uniform Han-communities of major cities samples are taken. Under uniform sampling conditions, no comparison inside smaller groups would be possible. We therefore introduce weights to achieve a numerical balancedness. A weight, stipulates how many items of the population are represented by one sampled item. Using the given, estimated or interpolated values or inhabitants ly and life-expectancy ly for a locality l and a year y, we estimate population-of-tombs ly inhabitants ly /life-expectancy ly . Then, population-of-tombs ly /sample-size ly yields the weight for the graves of a location. The weight of these graveyards for larger geographic or administrative units can be derived by multiplying the weight of the smaller unit with the quotient of population-of-tombs larger unit /population-of -tombs smaller unit . Additional refinements in this calculus handle different locations sharing one graveyard and, graveyards associated with locations of different hierarchical levels. To sum up, although the details of this model can be refined this kind of calculated balancedness based on census data with the possibility to have different granularities in different sub-corpora is conceptually superior to the sampling for text corpora. Lost Data Like any historic document, tombstones or images may become unreadable. If something is totally unreadable, this has to be marked as unreadable as opposed to not yet annotated. If something is partially readable, say like the given name Deb?rah, where ? stands for the unreadable, we almost for certain recognize the name, but we would falsify the data if we would write that we have read Deborah. It would equally be suboptimal to encode the entire name as unreadable, as this data loss cannot be made up by every corpus user, e.g. for a foreign language like Hebrew: ְ ‫דּ‬ ? ‫ָה‬ ‫וֹר‬ . In TSML we thus keep track of what the interpretations of the decaying traces are. Interpretations can be complemented with probabilities. As readability, especially of Chinese characters or Egyptians hieroglyphs might vary below the level of a character at the level of a radical or stroke, we cannot rely on character indices as for the annotation of the American National Corpus (cf. Ide & Romary 2006 ). If, for example, we can read a vertical stroke in a position where we expect a Chinese number, we might interpret this as 一(1) or if an additional scratch we see is a vertical stroke, as 十(10). Such phenomena can be described by the use of the <analysis> and <interpretation> element in combination. The <analysis> element provides a syntagmatic analysis of the mother element while repeating its content. Those elements marked as include='yes' 'belong to the type analyzed (<analysis type='xxx', here the markers of a 3 rd person singular subject). The <interpretation> element list possible paradigmatic choices. Preferences in their selection are marked by selected='yes'/'no' or probability='0.8'. <div type='p'>min guo 5 <interpretation> <div type='c' language='' writing-direction='' probability='' selected='yes'>1 <analysis type='c'> <div type='stroke' include='yes' >--</div> </analysis> </div> <div type='c' language='' writing_direction='' probability='' selected='no'>10 <analysis type='c'> <div type='stroke' include='yes' display='superimpose'>--</div> <div type='stroke' include='yes' display='superimpose'>|</div> </analysis> </div> </interpretation> </div> At this level we describe single characters, as shown here for the hypothetical case that the first character of a date might be read as 1 or 7 and the second is completely unreadable. 2.4.Meaningful Data The content of the div-elements may have a reference. The name of a person and a photo may have the same reference. Sometimes tombstones are bilingual, containing in two languages the same references. The references, like times, persons and places are entities which across time lead an imagined or real existence independently from the grave or the tombstone and which are referred or alluded to in the tomb or tombstone. Relations among references are treated as references. Temporal references are obtained by translating the date we find in a specific calendar uniformly into the corresponding date of a calendar of reference. This calendar of reference might or might not be among the reference systems. In the same way we can map the names of a city onto a reference system of imagined or real cities, or personal names to a reference repository of persons. The interest in annotating references derives from the historical, geographical or sociological facts they reflect. Such facts might be apprehended through tombstones or they provide background information for the interpretation of other data on the tombstones. The references to time on the tombstone, for example, can be used to analyze historical developments in the form and content of tombstones. We identify reference systems with social mediators which shape experience and awareness for members of a culture. For a description of mediation as psychological process see, among others, Wertsch 1988 . Thus, for some researchers looking at tombstones, neither the exact date (which we will call reference), nor the exact wording (which we will call meaning) of a date might be interesting, but instead what kind of calendar is used. The calendar is a social construct which mediates psychological processes. Similarly, researchers might be interested in whether symbols taken from a Christian symbol repository or from a Jewish symbol repository instead of the symbol used (the meaning) or what the symbol means (the reference). The way that people are referred to, or the language and the writing system, all are additional, all too obvious reference systems that merit an analysis. We hypothesize that whichever reference system is used, it reflects the social and psychological reality of the community and the different reference systems (calendar, language, names etc) do not cooccur randomly. In our research on Taiwanese tombstones, still another reference system, that of the local origin is of central importance. Many Taiwanese families actually have the possibility to chose between the Tanghao, a mythological place name in North China, a place name in South China from where the ancestors immigrated (Jiguan) or the place name in Taiwan where the family lived (Taiwan diming). The name might not be important for an analysis, the reference system of the origin however hints on identities communities maintain. In addition, we expect the reference system (tanghao/jiguan/taiwan diming) to cluster with other reference systems, such as the calendar (Japanese/Chinese/Republican/Gregorian).  Another, important category for analysis are meanings. Meanings derive from reference types, where reference types are intentional abstractions of references, for example, 'person', 'father', 'date', 'date of birth' etc as they can be apprehended from the DTD. Thus, while 'Bill, father of John' has a reference which represents this fact, 'X, father of Y' has a reference type, here that element in the DTD that describes 'father of'-relations. Reference types are annotated if we want to analyze and compare the different meaningful components of a tombstone (symbols, words, expressions, arrangement) across regions, cultures and languages. If we annotate these meaningful component with a reference type, for example, 'father of', we can access all meaningful expressions with the reference type in their context. Note, that this model requires all quasi-equivalent expressions, which in corpus-linguistic approaches might be simply defined by a synset, to be defined in relation to references within the XML This might be too strong a claim and imply that that one has to invoke the apparatus of the reference system during annotation, even if the reference system allows for one reference only. We can tweak this by making the reference type obligatory and the reference system optional as in <div type= 'text'   ref_type='location' ref_system='tanghao' ref_id='12' value='Longxi'>, in  The relation between the reference type, reference and the meaning can be described as follows. The meaning of a component without a reference derives from its reference type ('honorific') and the difference between this component (<div type='text' ref_type='honorific' value='xiankao'>) and all others with the same reference type. If there is a reference, the meaning of a component derives from its reference ('9') and the difference between this component (<div type='image' ref_type='state of defunct' ref_system='Chinese symbols' ref_id='9' value='bat'>) and all others with the same reference. In addition to linguistic expressions, symbols, colors or arrangements may have references and thus can be grouped into reference types. During the annotation process the color of a segment <div color='green'> might be elaborated into <div type='color' value='green' ref_type='state of defunct' ref_type='...' ref_id='...'>. Given the formulaic nature of tombstones, meanings and references are not necessarily transparent, even for members of that linguistic or cultural community, and thus have to be annotated. Conclusion Just more text. And more text in second indented paragraph.",
    "abstract": "Tombstone inscriptions represent a linguistic genre which yields insights in culture and language. Creating corpora from tombstones is thus a complementary approach for the study of languages and cultures. For the annotation of tombstone corpora, we propose TSML, the Tombstone-Markup-Language, developed during the massive annotation of Taiwanese tombstones and a number of tombstones from China, Indonesia and Europe. We discuss our conceptual framework in the annotation of tombstones and derive successively and present preliminary research data to show how the usefulness of the annotations. Finally, we will encourage researchers to participate in the specification of TSML to obtain soon an annotation language for annotations across cultures and languages.",
    "countries": [
        "France",
        "Taiwan"
    ],
    "languages": [
        "Japanese",
        "Chinese",
        "Hebrew"
    ],
    "numcitedby": "4",
    "year": "2007",
    "month": "November",
    "title": "From Tombstones to Corpora: {TSML} for Research on Language, Culture, Identity and Gender Differences"
}