{
    "article": "Short utterances serve a multitude of different communicative functions in interactive speech and have attracted due attention in recent research in dialogue acts. This paper presents a quantitative description of three short utterances i.e. that's right, that's true, that's correct and their variations based on the Switchboard Dialogue Act Corpus. Particularly, it offers an overview to account for how they are deployed by native speakers in daily conversation. At the same time, it attempts to provide a comparative account of that's right and that's true, showing that while almost 75% of them are mutually exchangeable, they nonetheless exhibit preferences in interactive speech. This insight is expected to form a useful approach towards automatic dialogue act tagging. Introduction Dialogue act (DA), defined as \"communicative activity of a dialogue participant, interpreted as having a certain communicative function and semantic content\" (ISO 24617-2, 2012: 2), plays a key role in the interpretation of the communicative behaviour of dialogue participants and offer valuable insight into the design of human-machine dialogue system (Bunt et al. 2010) . With the goal of facilitating automatic DA tagging, this paper describes a corpus-based investigation into that's right, that's true, that's correct and their variations in the Switchboard Dialogue Act (SWBD) Corpus, in order to answer questions about the communicative functions they mainly perform in daily conversation. These utterances deserve our particular attention in research considering that, like other brief responses (e.g. Oh, Uh huh, Mm, Okay), they serve as important feedback to the main speaker and they usually occur as overlapping speech. They are particularly problematic to interpret because they demonstrate a drastically different functional or pragmatic meaning from the semantic meaning of the component tokens. Consider Example 1. This is one excerpt retrieved from the targeted corpus, which will be further illustrated in section 2. A and B, two speakers, are talking about books and literature, where B is describing one of her daughter's book, \"real easy to follow\". The last utterance PACLIC 28 ! 379 that's right can be interpreted as serving both assessment/appreciation and agreement functions. The speaker B considers that what has been stated by A is right, not false, in which right is used as the evaluative adjective. Also, he implies his agreement with the interlocutor where that's right is used as a whole. Therefore, on the one hand, the semantic meaning of that's right makes it much closer to personal judgments and assessments, that is, the opinion is \"right, not false\". On the other hand, it is often used as a whole, indicating speaker's agreement, which goes beyond lexical meanings. However, past studies rarely specify various usage for that's right, that's true and that's correct in a systematic fashion, and just sporadically describe one or two cases to illustrate one or two facets for them, without capturing a full picture of how they are used with empirical evidence. To be more exact, for the studies that do discuss usage for that's right, Gardner (2001) believes that that's right is exactly the same as right when responding to a preceding question, the synonym for \"that's correct\". This point has been further elaborated in that right is deemed \"a truncated version of that's right\" when acting as \"an epistemic confirmation token\", \"in a sense close to one of its dictionary meanings, namely 'correct'\" (Gardner, 2004: 4) . The studies indicate that that's right, right, that's correct, and correct are similar and can be alternatively used as the confirmation token oriented to a prior question. At this regard, however, Stenström (1987: 104) asserts that that's right is much stronger than right in degree of emphasis and involvement when severing as a response move to the same type initiating move. In addition, when responding to a previous declarative, that's right has been considered to realize the functions of seeking confirmation (Tui, 1994) , showing agreement (Stenström, 1987; Tui, 1994; Gardner, 2001) as well as making assessments (Tao, 2003) . Therefore, that's right has been considered to indicate a wide variety of intentions in interaction. With regard to that's true, it has received little attention, and only McCarthy (2003) makes brief description that as a syntactically independent token, true seems to prefer the clausal option (that's true) to independent occurrence (true). In terms of that's correct, it has been left largely unexamined and unspecified regarding the usage. Considered semantic meanings of the three short utterances (i.e. that's right, that's true and that's correct), they largely embody in their key words right, true and correct. As is shown in dictionaries, the three words have similar lexical meanings and are often used to paraphrase each other. For instance, Longman Dictionary of Contemporary English (2009, fifth edition) defines them as follows: Correct: having no mistakes; right (p.379) Right: true/correct (p.1504) True: not false, based on facts and not imagined or invented (p.1891-1892) Thus, this paper aims to bring together the disparate findings on the uses of the three short utterances as well as their variations, attempting to depict an overview of them: how they are deployed by native speakers in daily conversation. At the same time, a comparative view has been concentrated on that's right/true, to seek to the circumstance in which they are mutually exchangeable and in which they are distinct. In this way, it is expected to form a useful approach towards automatic detection of DAs. This paper is structured as follows. Section 2 briefly introduces the SWBD DA corpus, then section 3 presents how the data has been processed before statistical analysis. Section 4 is related to general figures for the three short utterances and their variations, followed by a comparative study (section 5). Section 6 draws conclusions to this paper. Corpus Resource This study uses the Switchboard Dialogue Act Corpus 1 , which comprises 1,155 transcribed telephone conversations, totaling in 223,606 utterances or 1.5 million word tokens (Fang et al., 2011) . In this corpus, the segmented unit for utterances is defined as \"slash-unit\", which can be complete or incomplete, ranging from \"a sentence\" to \"a smaller unit\" (Meteer et al., 1995: 16) . Moreover, all these segmented utterances have been annotated with DA information, such as \"aa\" (accept), \"ba\" (assessment/appreciation), etc., to denote functions of particular utterances according to the SWBD-1 available online www.ldc.upenn.edu DAMSL coding scheme (Jurafsky et al., 1997) As can be seen, the first utterance has been coded with \"sv\", a DA tag for statement-opinion, while the second one has been labeled as \"aa\", a code for accept. In the current study, investigation of various functions will be conducted based on the DA tags which have been coded for each utterance. Data Pre-processing For the benefit of the current work, that's right, that's true and that's correct, and their variations are retrieved from the corpus accordingly. Variations in the current study are defined with a series of factors taken into account. Firstly, variations of the same token share the key words and present in similar patterns, for instance, it's true, this is true and true are all considered as variations of that's true, since they contain the same key word true with similar patterns. Consequently, the whole utterances have similar semantic meanings. Secondly, cases (e.g. it's true) embedded with adverbs and formulaic terms are still regarded as variations, because adverbs and formulaic terms are often used to enhance or emphasize emotions or attitudes, but not to change the meaning of the whole utterance. That's really true and I think that's certainly true are cases in point, where really and certainly are adverbs, and I think is the formulaic term. They are used to emphasize the attitude of the speaker. Formulaic terms refer to expressions such as \"I think\" and \"I believe\", which display in the form of \"I + predicate\", to express the speaker's subjectivity in spoken discourse (Baumgarten and House, 2010) . Also, they have been recognized as one type of \"engagement\", dealing with \"sourcing attitudes and the play of voices around opinions in discourse\" in the appraisal framework (Martin and White, 2005: 35) . Thirdly, the negative form and interrogative form, e.g. that's not true, is that true? are excluded, since their meanings and primary functions are apparently distinct from those of that's true. Fourthly, cases subsequently followed by thatclauses or prepositional phrases are excluded from the current work either, for instance It's true, followed by a that-clause, is not used independently any more. Such cases are not concerned with at this moment. Finally, it is necessary to reconsider the independent token right since it is often used as acknowledging token in the literature (e.g. Gardner, 2004; 2007) , different from that's right. As a consequence, right is not treated as a variant of that's right in this stage, which will be verified by the statistical information later. Thus, the final list can be identified as shown in Table 1 , where similar patterns take one-to-one correspondence. Apparently, that's true has more different types of variations than the other two. Variations of that's right Variations of that's true Variations of that's correct Descriptive Statistics That's right, that's true and that's correct are in effect synonymous concerning the dictionary meaning, while in the corpus, they do vary regarding their frequency information. (1) That's right and variations (2) That's true and variations (3) That's correct and variations Total 911 920 21 (1), ( 2 ) and (3) in the following will be used to stand for the three sets of utterances respectively. Table 2 Statistical information of the three sets It is obvious that the total occurrence of ( 1 ) and ( 2 ) are almost the same, both of which far exceed that of (3). Beyond this, a range of functions have been identified for each of them, of which \"aa\", \"ba\", \"s\", \"na\" and \"b\" 3 are the most significant ones, all together accounting for over 98% in each set. Table 3 sets out these functions and their relative frequencies in performing each of them. 3 Top five functions of three sets 3 In the coding scheme SWBD-DAMSL, there are very specific definitions for each of them. Accept (aa), one subtype of agreement, indicates the speaker explicitly accepts a proposal, or makes agreements with previous opinions (Jurafsky et al., 1997: 37) . Assessment/appreciation (ba) is defined as \"a backchannel/continuer which functions to express slightly more emotional involvement and support than just 'uh-huh'\" (Jurafsky et al., 1997: 48) . Statement (s) divides into \"descriptive/narrative/personal\" statements (sd) and \"other-directed opinion statements\" (sv), both with the primary purpose of making claims about the world (including answers to questions) (Allen and Core, 1997: 10 ). Affirmative answer (na) is one subclass of answers, which indicates affirmative answers that are not \"yes\" or a variant (Jurafsky et al., 1997: 50) . Acknowledgement (b) is usually \"referred to in the CA literature as a 'continuer'\" (Jurafsky et al., 1997: 42) . A glance at the table establishes that these top five functions together account for a large proportion among a series of functions performed by each particular set. In particular, accept overwhelmingly occurs in all the three sets, followed by assessment/appreciation. However, set (3) displays some slight distinction from (1) and (2) in the way that its proportion of assessment/appreciation is around 10% higher than that of sets (1) (2), but approximately 10% lower in accept. In the description to follow, the major concern is to seek similarities and distinctions within each set. That's right and its variations That's right and its variations frequently occur in daily speech, which can be seen in Table 4 It is perceptible that the simple token that's right overwhelmingly occurs compared to a range of variations, which may be indicative of the significance of economy in casual talk. By contrast, formulaic terms and adverbs are not so often attached with that's/it's right, accounting for less than 3% (2.2%+0.6%) and 4% (2.9%+0.6%+0.4%) respectively, which implies that such additional emphasis of stance and attitudes is not common in daily conversation. Noticeably, it's right appears 4 times, and this is right never occurs in the corpus. Hence that, it and this are similar lexical items but they have their own particular preference in some circumstance: when prefacing \"be + right\", that is more often used than it and this. Regarding a variety of functions they serve, that's right and its variation totally perform twelve different functions in the corpus, but the top five are extremely significant which can be seen in Table 5, together constituting over 60% in each row. Strikingly, that's right does exhibit some slight distinction from its variations in that that's right can respond to a prior question and acknowledge to what has been uttered, while its variations cannot do so.  Moreover, when formulaic terms are attached previously, the whole utterance has greater likelihood to function as statement. It is noted that the top three functions of that's right are exactly those functions analyzed and discussed in the literature, that is, agreement, assessments and affirmative answers. But with the empirical evidence, it can be further observed that agreement is much more remarkable than the other two. In addition, it's right is a special token in the table in that it clearly prefers statement to accept, which should not have been counted as a variant of that's right. Yet, considered the limited occurrence (4 times), it is not pervasive enough to determine what kind of functions it exactly serves, so it remains in this set. In the future, a larger spoken corpus will be in demand for examining such tokens. That's true and its variations Likewise, Table 6 exhibits basic frequency information of set (2). Different from set (1), that's true has much more variations than that's right in terms of types and tokens, which is illustrated by the statistics that variations of that's true make up 29% of set (2) while those of that's right just accounts for 6.5% of set (1). It needs to be noted that the symbol \"*\" in Table 6 means that the adverb in that's + adverb + true is able to move freely, not restricted to the middle position, such as \"probably that's true\", or \"that's true also\". This, however, has not been perceived for that's right.   Concerning a range of functions they perform, that's true and its variations totally have nine different functions in the corpus, among which the top five are displayed in Table 7 . Overall, the distribution here shares a large number of similarities with that of set (1) in Table 5 . In particular, accept, assessment/appreciation and statement are considerably significant, while affirmative answer and acknowledgement are comparatively less crucial, only occurring in that's true, that's + adverb + true and true. When that's true is attached with formulaic terms, the likelihood to function as accept declines accompanying with greater proportion in statement. The exceptional token is it's true, which itself prefers both accept and statement. In this sense, it's true is distinguished from that's true which overwhelmingly deals with accept. By contrast, this is true is relatively consistent with that's true in primary functions they serve. Thus, in the pattern \"THAT/IT/THIS + BE + TRUE\", that, it and this indicate their particular preference as well. That's correct and its variations That's correct and its variations are used infrequently, with a total occurrence of 21 in the whole corpus. As a consequence, there are far less variations in this set. Table 8 shows the basic frequency information, and   As can be seen in Table 8 , that's correct occurs more frequently than its variations, accounting for 62% in set (3), which is lower than that of that's right (93%) and that's true (71%). Moreover, formulaic terms and adverbs are not so frequent, either, which suggests bare tokens such as that's correct and correct are preferred by native speakers. Considered a range of functions performed Table 9 , accept and assessment/appreciation are remarkable compared to statement, affirmative answer and acknowledgement with one occurrence for each. To summarize, an overview of utterances in the three sets has presented with empirical evidence. Generally, they share quite a lot of similarities in terms of primary functions they serve. In addition, two points need to be further elaborated. One is that, right is assumed to be used in a way different from that's right in conversation, which is further confirmed by the evidence that 73% of right serve acknowledgement while that's right prefers accept with 76% of its total occurrence in the corpus. This can be observed in Table 10 , where their top five functions have been listed respectively. Also, 16% of that's right can be used as assessment/appreciation, whereas the single right only occurs 11 times (0.2%) as assessment/appreciation. Hence, in general, right and that's right are two different cases in interactive speech.  The second point is that, that, it and this have their particular preference to the pattern \"THAT/IT/THIS+BE+RIGHT/TRUE/CORRECT\" , which can be summarized as follows. That > Ø > it > this It means that the ones on the left side take priority over those on the right: that more likely occurs than this, and the symbol Ø signals no pronoun occurs. This is highly consistent with Tao's finding (2003: 202) \"that is more likely to be used as a turn initiator than this\". A Comparative Study According to the previous statistical analysis, it is noted that that's right, that's true and that's correct account for quite a large proportion in each particular set. The previous observation has also shown that the total occurrence of that's correct is much fewer than the other two, and therefore, a comparative study will concentrate on that's right and that's true, and examine the condition where they are mutually exchangeable with each other and where they are distinct from each other. Figures 1 and 2 respectively fill out their primary functions and their preceding contexts 4 . By Figure 1 , apparently that's right and that's true both exhibit considerable preference to accept and assessment/appreciation which together make up over 90% for both cases. It is meant that over 90% of their tokens perform the two same functions. However, some slight difference between them can be perceived as well. That's right is used to perform all these five functions, while that's true cover four of them and cannot be not used to answer a question. At the same time, that's true shows far greater likelihood to serve statement compared to that's right. By contrast, that's right is almost ten times more likely than that's true to function as acknowledgement. In order to see whether their previous contexts could offer useful cues to differentiate the occurrence of that's right and that's true, a specific view is taken into the previous contexts when they act as accept and assessment/appreciation, because the two functions together make up a large proportion of the total occurrence. Figure 2 It is clear that statement is the most overwhelming previous function, accounting for over 80% previous contexts of that's right/true when they act as accept and assessment/appreciation. It seems that the previous contexts offer little cues to differentiate them, since both are so often preceded by statement. According to Figures 1 and 2 , it is possible that almost 75% of that's right/true are mutually exchangeable since over 90% of their occurrence contributes to accept and assessment/appreciation, in which over 80% of the previous contexts are statement. This can be further validated by the chi-square test, which aims to test if that's right and that's true have no difference in the distribution of different functions. Table 11 shows the frequency distribution of that's right/true in accept, assessment/appreciation and other functions.   Chi-Square Tests In Table 12 , the value of pearson chi-square is 0.130, and the p-value is 0.937 which is larger than 0.05. It manifests that the difference between that's right and that's true is not significant in the distribution of primary functions according to the frequency information observed in the corpus. In summary, the statistical analysis above demonstrates that that's right and that's true are used almost the same in interactive speech, in which nearly 75% of their total occurrence are interchangeable. This is further confirmed by the significant test which explicitly shows no significance in the distribution of primary functions, and their previous contexts supply little cues for the distinction. In some cases, however, they have their own preference and differ from each other. For instance, that's true has never been found to answer a previous question in the corpus, while 3% of that's right can perform this function. Moreover, that's true shows much greater likelihood to serve statement whereas that's right is almost ten times more likely than that's true to be acknowledgement. Specifically, when the preceding utterance is a statement or a question, the current utterance is more likely to serve statement if it is realized by that's true; it has greater possibility to be acknowledgement or an affirmative answer if it is realized by that's right. This kind of preference is expected to facilitate DA tagging. Conclusions This paper presented a quantitative investigation of three short utterances (i.e. that's right, that's true, that's correct) and their variations in the Switchboard Dialogue Act Corpus. Particularly, it offered an overview to account for how they are used in daily conversation with empirical evidence. By the current investigation, it has been observed that that's right/true and their variations much more frequently occur than that's correct and its variation. In terms of primary functions served in interactive speech, they consistently exhibit great preference to accept, assessment/appreciation, statement, affirmative answer and acknowledgement, among which, accept and assessment/appreciation together account for quite a large proportion. Regarding their variations, that, it and this are similar lexical items but they indicate their particular preference to this pattern \"THAT/IT/THIS+BE+RIGHT/TRUE/CORRECT\" . Moreover, formulaic terms and adverbs are not so frequently embedded. When formulaic terms are attached, the whole utterances have greater likelihood to be statement. Also, we have specified some crucial issues for that's right and that's true, which are clearly useful to the detection of DAs. It has been discovered that almost 75% of that's right and that's true are mutually exchangeable, which has been verified by the chi-square that their difference is not significant in the distribution of primary functions. Moreover, the previous contexts offer little cues to differentiate that's right and that's true. In this sense, they are two short utterances with similar meanings and uses. But in some cases, they display their particular preference: that's right has fewer variations compared to that's true, and covers a wide range of functions in the corpus; that's true has never been found to answer a previous question in the corpus, while 3% of that's right can do that. Moreover, that's true shows much greater likelihood to serve statement whereas that's right is more likely to be acknowledgement. Such kind of empirical analysis will provide the insights and bases for automatic DA tagging. In addition, we believe that it also tells second language learners how to use these three shore utterances under specific contexts. Acknowledgements Research described in this paper was supported in part by grant received from the General Research Fund of the University Grant Council of the Hong Kong Special Administrative Region, China (Project no. CityU 142711) and City University of Hong Kong (Project nos. 6354005, 7004091,  9610283, 7002793, 9610226, 9041694, and  9610188).",
    "abstract": "Short utterances serve a multitude of different communicative functions in interactive speech and have attracted due attention in recent research in dialogue acts. This paper presents a quantitative description of three short utterances i.e. that's right, that's true, that's correct and their variations based on the Switchboard Dialogue Act Corpus. Particularly, it offers an overview to account for how they are deployed by native speakers in daily conversation. At the same time, it attempts to provide a comparative account of that's right and that's true, showing that while almost 75% of them are mutually exchangeable, they nonetheless exhibit preferences in interactive speech. This insight is expected to form a useful approach towards automatic dialogue act tagging.",
    "countries": [
        "Hong Kong"
    ],
    "languages": [
        "English"
    ],
    "numcitedby": "1",
    "year": "2014",
    "month": "December",
    "title": "A Quantitative View of Short Utterances in Daily Conversation: A Case Study of Thats right, Thats true and Thats correct"
}