{
    "article": "This paper explores the possibility of presenting additional contextual information as a method of answer presentation Question Answering. In particular the paper discusses the result of employing Bag of Words (BoW) and Bag of Concepts (BoC) models to retrieve contextual information from a Linked Data resource, DBpedia. DBpedia provides structured information on wide variety of entities in the form of triples. We utilize the QALD question sets consisting of a 100 instances in the training set and another 100 in the testing set. The questions are categorized into single entity and multiple entity questions based on the number of entities mentioned in the question. The results show that both BoW (syntactic models) and BoC (semantic models) are not capable enough to select contextual information for answer presentation. The results further reveals that pragmatic aspects, in particular, pragmatic intent and pragmatic inference play a crucial role in contextual information selection in the answer presentation. Introduction Answer Presentation is the final step in Question Answering (QA) which focuses on generating an answer which closely resemble with a human provided answer (Perera, 2012b; Perera, 2012a; Perera and Nand, 2014a) . There is also a requirement to associate the answer with additional contextual information when presenting the answer. This paper focus of exploring methods to extract additional contextual information to present with the extracted factoid answer. We provide a classification if questions based on the type of the answer required and the number of entities that mentioned in the questions. The question classification is illustrated in Fig. 1 . Firstly, question can be categorized based on the information need where questions may require a definition as the answer or a factoid answer which is an information unit (Perera, 2012a; Perera and Nand, 2014a) . The definitional questions need definitions which include both direct and related background information and there is no need to further expand the answer with contextual information. So far the way factoid questions presentation involved only the answer itself without contextual information. Recently, Mendes and Coheur (2013) argued that even factoid questions need to present additional information. An advantage of presenting contextual information is that answer is justified by the information provided, so that users can conclude that the answer that is acquired by the system is one that they are searching for. The rest of the paper is structured as follows. Section 2 explores BoW and BoC models to rank contextual information. Section 3 focuses on presenting the experimental framework. Section 5 presents information on related work and we conclude the paper in Section 6. Content selection using weighted triples This section presents models to rank triples focusing on open domain questions as communicative goals. Open domain questions require knowledge from different domains to be aggregated which making it more challenging compared to simply generating a content for given single theme topic. Our objective is to select a set of triples which can be used to generate a more informative answer for a given question. We investigate the problem from two perspectives; as a Bag of Words (BoW) and as a Bag of Concepts (BoC). In the following sections, we discuss the strategy used for ranking and the details on the supporting utilities including domain corpus, reference corpus, triple retrieval, and threshold based selection. The high level design of the framework used to experiment BoW and BoC is shown in the Fig. 2 . The model utilizes two corpora (domain and reference) and selectively used based on the requirement. The domain corpus is constructed using search snippets collected from the web by using information from the question and answer as query terms. The reference corpus represents knowledge about general domain. The model also has utility functions to retrieve triples using SPARQL queries, filter the duplicates, and to perform basic verbalization. The problem as a Bag of Words We utilized token similarity, Term Frequency -Inverse Document Frequency (TF-IDF), and Residual Inverse Document Frequency (RIDF) in two flavours which are widely used in information retrieval tasks. The following sections describes these models in detail. Token similarity Token similarity ranks the triples based on the appearance of the terms in triple and the question being considered. In particular we employ the cosine similarity (1) to calculate the similarity between the tokenized and stopwords removed question/answer and the triple. sim cosine ( − → Q , − → T ) = − → Q • − → T | − → Q || − → T | = Σ n i=1 Q i T i Σ n i=1 Q 2 i Σ n i=1 T 2 i (1) Here, Q and T represent the question and the triple respectively. Term Frequency -Inverse Document Frequency (TF-IDF) The TF-IDF (2) is used to rank term (t) from the question and answer present in the triple (T). A triple is then associated with a weight which is the sum of the weights assigned to the triple terms. T F − IDF (Q, T ) = i∈Q,T tf i .idf i = i∈Q,T tf i .log 2 N df i (2) Where tf represents the term frequency, N stands for number of documents in the collection and df is the number of documents with the corresponding term. Q represents the question, however in our experiment we tested the possibility of utilizing a domain corpus instead of the original question or the question with the answer. Okapi BM25 Okapi ranking is an extension to the TF-IDF that is based on the probabilistic retrieval framework. The Okapi ranking function can be defined as follows: Okapi(Q, T ) = i∈Q,T log N df i . (k 1 + 1) tf i,T k 1 (1 − b) + b L T Lave + tf i,T . (k 3 + 1) tf i,Q k 3 + tf i,Q (3) Where, L T and L ave represent the length of the triple and average of length of a triple respectively. The Okapi also uses set of parameters where b is usually set to 0.75 and k 1 and k 3 range between 1.2 and 2.0. The k 1 and k 3 can be determined through optimization or can be set to range within 1.2 and 2.0 in the absence of development data (Manning and Schutze, 1999). Residual Inverse Document Frequency (RIDF) The idea behind the RIDF is to find content words based on actual IDF and predicted IDF. The widely used methods to IDF prediction is Poisson and K mixture. However, K mixture tends to fit very well with content terms. On the other hand, Poisson deviates from the IDF remarkably and provides noncontent words. Given term frequencies in triple collection, predicted IDF can be used to measure the RIDF for a triple as follows: RIDF = i∈T idf i − idf i = i∈T idf i − log 1 1 − P (0; λ i ) (4) Where λ i represents the average number of occurrences of term and P (0; λ i ) represents the Poisson prediction of df where term will not be found in a document. Therefore, 1 − P (0; λ i ) can be interpreted as finding at least one term and can be measured using: P (k; λ i ) = e −λ i λ k i k! (5) Based on the same RIDF concept, we can moderate this to work with term distribution models that fits well with actual df such as K mixture. The definition of the K-mixture is given below. P (k; λ i ) = (1 − α)δ k,0 + α β + 1 β β + 1 k (6) In K-mixture based RIDF we interpreted the deviation from predicated df to mark the term as a noncontent term. The problem as a Bag of Concepts This section explains two BoC models which can rank triples utilizing the semantic representation of the triple collection. In particular, we employ two widely accepted BoC models; Latent Semantic Analysis (LSA) and adoption of Log Likelihood Distance (LLD) using two corpora. The following sections describe them in detail. Latent Semantic Analysis This method analysed how triples in the collection can be ranked concept-wise and retrieved related to the question and answer where triples are represented in a semantic space. Such a ranking can expose the original semantic structure of the space and its dimensions (Manning and Schutze, 1999). In particular, we employed the Latent Semantic Indexing (LSI) for each collection of triples associated with the question. Corpus based Log Likelihood Distance (LLD) The idea behind the implementation of this method is to identify domain specific concepts (compared to the general concepts) and rank triples which contain such concepts. For this we employed a domain corpus (see Section 2.3) and a general reference corpus (see Section 2.4). The model extracts concepts which are related to the domain on the basis of their frequency in domain corpus and general reference corpus. A term that is more frequently seen in a domain corpus compared to the general reference corpus implies that the term is a concept that is used in the domain being considered (Perera and Nand, 2014b; Perera and Nand, 2014c) . We utilized the log likelihood distance (He et al., 2006; Gelbukh et al., 2010) to measure the importance as mentioned below: W t = 2 × f dom t × log f dom t f exp dom t + f ref t × log f ref t f exp ref t (7) where, f f exp dom t = s dom × f dom t + f ref t s dom + s ref (8) f exp ref t = s ref × f dom t + f ref t s dom + s ref (9) where, s dom and s ref represent total number of tokens in domain corpus and reference corpus respectively. Next, we can calculate the weight of a triple ( subject, predicate, object ) by summing up the weight assigned to each term of the triple Domain Corpus The domain corpus is a collection of text related to the domain of the question being considered. However, finding a corpus which belongs to the same domain as the question is challenge on its own. To overcome this, we have utilized an unsupervised domain corpus creation based on a web snippet extraction. The input to this process is a set of extracted key phrases from a question and its answers. Reference Corpus The reference corpus is an additional resource utilized for the LLD based contextual information selection. We used the British National Corpus (BNC) as the reference corpus. The selection is influenced by the language used in the DBpedia, British English. However, what is important for the LLD calculation is a term frequency matrix. We have first performed stopword filtering on the BNC and this operation reduced the original size of BNC (100 million words) to 52.3 million words. Next, the term frequency matrix is built using a unigram analysis. Triple retrieval The model employs the Jena RDF framework for the triple retrieval. We have implemented a Java library to query and automatically download necessary RDF files from DBpedia. Threshold based selection After associating each triple with a calculated weight, we then need to limit the selection based on a particular cut-off point as the threshold (θ). Due to the absence of knowledge to measure the θ at this stage, it is considered as a factor that needs to be tuned based on experiments. Further discussion on selecting the θ can be found in Section 4. 3 Experimental framework Dataset We used the QALD-2 training and test datasets, but removed questions which marked as \"out of scope\" by dataset providers and those for which DBpedia triples did not exist. Table 1 provides the statistics of the dataset, including the distribution of questions in two different question categories, single entity and multiple entity questions. We have also built a gold triple collection for each question for the purpose of evaluation. These gold triples were selected by analysing community provided answers for the questions in our dataset. Table 1 shows the statistics for both training and testing datasets. Results and discussion The evaluation is carried out using gold triples as described in Section 3.1. The definitions of precision (P), recall (R) and F-score (F*) are given below: P = |triples selected ∩ triples gold | |triples selected | (10) R = |triples selected ∩ triples gold | |triples gold | (11) F * = 2P R P + R (12) The threshold (θ) (measure as a percentage from the total triple collection) value for the ranked triples was experimentally chosen to using the training dataset. This threshold value was then used to select triples which were relevant for the testing dataset. The value was experimentally determined by using a combination of precision and recall value form the training data. For an accurate model, the precision is expected to remain constant until it starts selecting the irrelevant triples after which the precision will gradually decrease. Correspondingly, the recall value will increase until the threshold point after which the model will start selecting irrelevant triples, which will start pushing the recall value down. Hence the optimum θ value will be the point at the maximum point for both recall and precision which is the maximum score. Using the θ identified from training set, we can then test the model using testing dataset. When measuring the θ based on the training dataset it is also important to measure the proportion of gold triples compared to the number of total triples. A set of statistics related to this calculation is shown in Table 2 . are 68.89% for single entity types and 30.43% from the multiple entity types. Furthermore, the maximum and minimum percentages are also near values to the receptive mean values. This encompasses that there is a possibility to find a threshold value for both single and multiple entity types questions. Fig. 3 depicts the evaluation performed on the single entity question category in training dataset using five BoW models under investigation. The results show that the maximum F-score obtained when θ is set to 100%. This shows that these models unable to accurately differentiate between the relevant and relevant triples. The BoW models consider only the words The corresponding evaluation performed on the single entity question category in training dataset using BoC models is shown in Fig. 4 . Latent Semantic Indexing (LSI) has performed poorly and has not managed to identify a global maximum. However, the Log Likelihood Distance (LLD) has identified a global maximum with a θ value of 78%. Furthermore, it has also shown the expected behaviour with an increase in θ value. When this threshold value was used to extract triples from the test dataset the results were encouraging. Table 3 shows that LLD has achieved F-score of 0.76 for the testing dataset with a 0.72 precision value. The LLD model outperforms the other models in this context mainly because it also incorporates the domain knowledge (provided through a domain corpus as explained in Section 2.2.2). Fig. 5 and Fig. 6 depict the evaluation performed on the multiple entity question category from training dataset, for both Bag of Words and Bag of Concepts models. RIDF-Kmixture and Okapi have completely failed without any success in identifying the relevant triples. The Cosine, TF-IDF, and RIDF-Poisson have also not identified the optimum threshold (see Fig. 5 ). From the BoC models, the LSI method has also failed entirely. The LLD mode has identified a local maximum at θ = 48, however the model has not behaved as expected. Furthermore, the global maximum identified at θ = 100 implies that the model can identify all relevant triples only when the total triple collection is retrieved. This confirms that although a Bag of Concepts model such as LLD performed well in the single entity type questions, none of the models performed well in contextual information selection for multiple entity type questions. Analysis of the erroneous triples for this experi-ment revealed that for multiple entity type questions it is important to identify the intent entity from the question. The information from the intent of the question can be used to factor in a weight correction for the triples. This leads to the study the Bag of Narrative (Cambria and White, 2014) model which is essentially based on pragmatic aspects of the language. Section 4 discusses this aspect in detail. Pragmatic aspect in contextual information selection We introduce two pragmatic based concepts that need to be studied in contextual information selection approaches, derived from psycholinguistics. • Pragmatic intent (Byram and Hu, 2013) of a question in the perspective of contextual information and, • Pragmatic inferences (Byram and Hu, 2013; Tomlinson and Bott, 2013) that can be drawn based on already known information. Pragmatic Intent The pragmatic intent of a question in our problem can be defined as the entity that a user is actually intending to know more about. This concept deviates from the two early approaches in query classification; Broder's taxonomy (Broder, 2002) (classifying queries as informational, transactional, and navigational) and question typologies (Li and Roth, 2006) (determining the answer type for a question). Consider the examples given in Table 4 , where in each question multiple entities are mentioned. The entities are numbered and pragmatic intent is tagged (with code :i). In Q 1 , Marc Mezvinsky is the pragmatic intent of the question which is also the expected answer. The same rule applies for Q 2 , Q 3 , and Q 4 . However, in Q 5 and Q 6 the pragmatic intent is a part of the question ([MI6] and [Natalie Portman]), but not the answer. This variation makes it difficult to identify the pragmatic intent of a question compared to the question target identification. When presenting contextual information to the user, the information related to the pragmatic intent together with information that is shared by pragmatic intent and other entities need to be given the priority. Pragmatic inference The pragmatic inference is the interpreting information based on the context that it operates on. For example, a storyteller will not mention every incident or fact that happened in a narrative, thus some parts may be left for the reader to interpret using common sense knowledge, open domain knowledge, and knowledge that is already mentioned in the narrative. Applying this well-established psycholinguistic theory in our approach, we noticed several scenarios where we can improve the contextual information by eliminating information that can be pragmatically inferred and prioritizing information that needs for the context. Consider the question (Q 7 ), answer and the triple provided in Table 5 . Using the question and its answer we can infer the following two facts encoded in the triples. • F 1 : Brooklyn Bridge, located in, New York • F 2 : Brooklyn Bridge, crosses, East River As humans, we can infer that if Brooklyn Bridge is located in New York and if it crosses the East River, then East river must flow through New York, hence it is co-located. Therefore, the triple in Table 5 becomes unimportant for the context because it is already inferred by F 1 and F 2 which can be derived from question and its answer. The pragmatic inference can also be used to prioritize the information using semantic relations that entities contain. For example consider the two scenarios illustrated in Table 6 where important contextual information can be inferred based on the semantic relationship of the pragmatic intent and entities. In Q 8 the relation between the entity \"Virgin Group\" and its co-founders (\"Richard Branson\" and \"Nik Powell\") is in the form of launching a new organization. This makes the information such as cur- 2 rent positions which are held by its co-founders to be prioritized over other information which is not strongly related to the context of the question. Next, Q 9 is related to Michael Jordan's marriage. When retrieving contextual information for this question the basic information about his wives such as personal names becomes more important for the context of the question. 5 Related work Benamara and Dizier (2003) present the cooperative question answering approach which generates natural language responses for given questions. In essence, a cooperative QA system moves a few steps further from ordinary question answering systems by providing an explanation of the answer. However, this research lacks the investigation to the information needs of different questions and the process of utilizing cohesive information for the explanation, without redundant text. Bosma (2005) incorporates the summarization as a method of presenting additional information in QA systems. He coins the term, an intensive answer to refer to the answer generated from the system. The process of generating an intensive answer is based on the summarization using rhetorical structures. Several other summarization based methods for QA such as Demner-Fushman and Lin ( 2006 ) and Yu et al. (2007) also exist with slightly varying techniques. Vargas-Vera and Motta (Vargas-Vera and Motta, 2004) present an ontology based QA system, AQUA. Although AQUA is primarily aimed at extracting answers from a given ontology, it also contributes to answer presentation by providing an enriched answer. The AQUA system extracts ontology concepts from the entities mentioned in the question and present those concepts in aggregated natural language. Conclusion This study has examined the role and effectiveness of syntactic and semantic models in contextual information selection for answer presentation. The results showed that the semantic models (e.g., LLD) performed the best for single entity based questions, however the performance dropped for multiple entity questions. An analysis of the multi-entity questions showed that in order to improve performance there is a need to integrate pragmatic aspects into the ranking framework. Further work needs to be done to establish a framework to model pragmatic aspects in contextual information selection. We have already launched the development of the pragmatic framework as discussed in Section 4. Future work will introduce diverse methods of answer presentation in question answering system utilizing contextual information (Perera and Nand, 2015b; Perera et al., 2015; Perera and Nand, 2015a; Perera and Nand, 2015c) .",
    "funding": {
        "defense": 0.0,
        "corporate": 0.0,
        "research agency": 0.0,
        "foundation": 1.9361263126072004e-07,
        "none": 0.9997033120205857
    },
    "reasoning": "Reasoning: The provided text does not mention any specific funding sources for the research conducted in the article. Without explicit mention of support from defense, corporate entities, research agencies, foundations, or an indication of the absence of funding, it is not possible to accurately determine the funding sources based on the information given.",
    "abstract": "This paper explores the possibility of presenting additional contextual information as a method of answer presentation Question Answering. In particular the paper discusses the result of employing Bag of Words (BoW) and Bag of Concepts (BoC) models to retrieve contextual information from a Linked Data resource, DBpedia. DBpedia provides structured information on wide variety of entities in the form of triples. We utilize the QALD question sets consisting of a 100 instances in the training set and another 100 in the testing set. The questions are categorized into single entity and multiple entity questions based on the number of entities mentioned in the question. The results show that both BoW (syntactic models) and BoC (semantic models) are not capable enough to select contextual information for answer presentation. The results further reveals that pragmatic aspects, in particular, pragmatic intent and pragmatic inference play a crucial role in contextual information selection in the answer presentation.",
    "countries": [
        "New Zealand"
    ],
    "languages": [],
    "numcitedby": 1,
    "year": 2015,
    "month": "October",
    "title": "Selecting Contextual Peripheral Information for Answer Presentation: The Need for Pragmatic Models",
    "values": {
        "building on past work": "This study has examined the role and effectiveness of syntactic and semantic models in contextual information selection for answer presentation. Bosma (2005) incorporates the summarization as a method of presenting additional information in QA systems. Vargas-Vera and Motta (Vargas-Vera and Motta, 2004) present an ontology based QA system, AQUA. AQUA system extracts ontology concepts from the entities mentioned in the question and present those concepts in aggregated natural language.",
        "performance": "An analysis of the multi-entity questions showed that in order to improve performance there is a need to integrate pragmatic aspects into the ranking framework."
    }
}