{
    "article": "Emotions are found to be frequently involved in the exclamative sentences. This paper aims to examine the interaction between exclamative sentences and emotions in Chinese social media. We propose that exclamative sentences can express all kinds of emotions besides surprise. Fear emotion is mostly expressed in exclamative sentences. Lexical features, structural features and discourse features are analyzed to reveal a full picture of linguistic cues in emotion expressions in exclamative sentences. We believe that this study could provide a new approach for the study of sentence types in Mandarin Chinese, which is also crucial for people to understand the expressions of human emotions. Introduction Exclamative sentences are often related to highlighting emotion information, especially the sense of surprise. As one of the main four sentence types, the study of exclamative sentences in Mandarin Chinese is often neglected. The current study aims to examine the interaction between exclamative sentences and different emotion types based on an emotion corpus of Chinese social media Weibo. We explore the representations of emotions in terms of lexical features, structural features and discourse feature when exclamative sentences are employed. This paper is organized as follows. In Section 2, we give an overview of the previous studies in rela-tion to emotion expression and exclamative sentences. Section 3 presents the corpus data and annotation scheme. In Section4, we report the data analysis. Finally, we conclude the paper in Section 5. Related Work Emotion Analysis Emotions are part of people's daily life and have been studied in many different disciplines, but the definition of emotion is diverse and debatable (James, 1884; Watson, 1924; Cannon, 1929; Plutchik, 1962; Bowlby, 1969; Lazarus, 1975; Frijda, 1986; Ortony et al., 1988; Harkins and Wierzbicka, 2001) . The classification of emotion is another contentious issue. Researchers have proposed different approaches to grouping the basic emotions (Plutchik, 1980; Ekman, 1984; Turner, 2000; Sabini and Silver, 2005; Keltner et al., 2014; Scheff, 2015) . In our study, we will follow the emotion classification proposed by Turner (2000) . He identified five primary emotions, namely happiness, sadness, fear, anger and surprise. Emotion words are normally classified into two types: expressive emotion words and descriptive emotion words (Köveces, 2000) . Expressive emotion words express emotions directly, while descriptive emotion words are words that describe emotions. There are two ways to express emotions: explicit and implicit (Lee, 2015) . Explicit emotion refers to the emotion-related information which is presented by emotion keywords, while it is conveyed via inferences or connotation instead of emotion keywords in implicit emotion. Implicit emotions can be signaled by means of lexical cues (e.g. adjectives, verbs, adverbs and conjunctions) and syntactic patterns. The text-based emotion processing and analysis in linguistics is a popular research area in recent years. Researchers explore emotions in texts in order to find out the linguistic cues in emotion expressions in Chinese, such as figurative language (Hsiao and Su, 2010; Huang et al., 2005; Lee 2017 ), codeswitching (Lee and Wang, 2015) , discourse markers (Gao and Lee, 2018) , right-dislocation (Lee and Lai 2018) and rhetorical question (Lau and Lee, 2018) . These linguistic analyses can help enhance the theory as well as the classification and detection of emotion. Exclamative Sentences Exclamative sentences convey that something is surprising or noteworthy in some way (Zanuttini and Porter, 2003) . They often include \"a statement of an event or state and some special features indicating the speaker's strong emotion about the event or state, which causes surprise, admiration, or even skepticism\" (Zhan and Bai, 2016: 410) . The study of Chinese exclamative sentences has a long history, which can be traced back to Mashi Wentong (Ma, 1898 (Ma, /2000)) . But he didn't give a clear definition of the exclamative sentence. Li (1924 Li ( /2001 ) classified sentences into five categories, and it is the first time that exclamative sentences have been treated as an independent sentences type in the history of Chinese grammar. Lv (1942) defined the exclamative sentences, and he believed that the core function of exclamative sentences is to express emotions. Huang (1958) divided exclamative sentences into five subcategories: (1) exclamative sentences are composed of interjections; (2) exclamative sentences are composed of a noun and 啊 a; (3) some exclamative sentences have only one or two words, but they contain rich connotation; (4) slogans, greetings or wishes; (5) some adverbs or sentence-final particles are included in the exclamative sentences. Zhu (1994) applied three aspects theory to analyze exclamative sentences. Lv (1998) argued that there were three emotion marks in exclamative sentences. They are mark of self, mark of others and mark of content. In general, the study of Chinese exclamative sentence mainly focuses on the use of interjections or sentence-final particles (Li, 1994; Zhu, 1994; Wang, 2002; Du, 2005) . Exclamative Sentences and Emotions Most of the studies indicate that exclamative sentences contain strong emotions (Li, 1924; Gao, 1948; Lv, 1942; Huang, 1958; Zhu, 1982) . In particular, exclamative sentences are considered to involve unexpectedness, i.e., a sense of surprise (Milner, 1978) . However, Badan and Cheng (2015) argued that exclamatives do not always imply a sense of surprise. Exclamatives in Mandarin appear to mark surprise and non-surprise by different types of exclamatives. Data Collection and Annotation Corpus Data The corpus data were retrieved from one of the most popular social media platforms in Mainland China Sina Weibo. Sina Weibo has 340 million monthly active users and occupies 56.5% of China's microblogging market in terms of active users. People can share their ideas and thoughts and express their emotions and attitudes via Weibo in real-time. The corpus was comprised of 13,262 posts randomly extracted from Sina Weibo (Lee and Wang 2015) . After removing posts that contained noise (as in (1)), advertisement (as in (2)), and the short posts less than 10 words (as in (3)), the manual annotation was carried out. ( (2) 6/14 飞 日本 Paul Joe 搪瓷隔离 不输 cpb 还便宜好多 6/14 fēi rìběn Paul Joe tángcígélí June 14 th fly to Japan Paul Joe foundation bù shū cpb hái piányi hǎo duō NEG lose cpb also cheap very much '(I will) fly to Japan on June 14 th . The foundation of Paul Joe as better as CPB, and it is also cheaper a lot.' (3) 分享图片 fēnxiǎng túpiàn share picture 'Share the picture' There are 6,056 posts (46%) with emotions. Five emotions were annotated, namely, happiness, sadness, fear, anger and surprise (Lee et al., 2013) . In order to qualify the quality of the annotation, two annotators were asked to annotate 1,000 posts. Then we used Cohen's Kappa coefficient to calculate the inter-annotator agreement. The Kappa Score is k=0.692. Then we extracted 2,000 posts with emotions for our analysis. The distribution of each kind of emotion types is shown in Figure 1 . Annotation Scheme In order to facilitate our analysis, we designed an annotation scheme and annotated 688 posts. The first step was to search for the exclamative sentences in the posts. Then we needed to identify whether it expresses emotion(s). Data Analysis In this section, we present some observations and statistics in terms of lexical features, syntactic feature and discourse features. Lexical Features Some adverbs, interrogative expressions, sentencefinal particles, and interjections can be used to express people's feelings and emotions in exclamative sentences. Table 3 adverb, interrogative expression, pronoun, sentence-final particle and interjection. Although these lexical items can be used in exclamative sentences to help evoke emotions, they have different performances. Fear emotion has the highest frequency occurring in exclamative sentences, while surprise emotion is the lowest one. This proves that exclamative sentences can be used to express all kinds of emotions, and the surprise emotion may be the least one. Sentence-final particle is the most common method in exclamative sentences to mark emotions, and it often collocate with adverbs. For example, there are two exclamative sentences in (5): 声音好 大啊！shēngyīn hǎo dà a! 'How loud the sound it is!' and 太厉害拉！tài lìhài la! 'How amazing they are!'. 声音好大啊！shēngyīn hǎo dà a! 'How loud the sound it is!' use adverb 好 hǎo 'very' and sentence-final particle 啊 a 'SFP' to form the exclamative and it expresses fear emotion, while the exclamative sentence 太厉害拉！tài lìhài la! 'How amazing they are!' includes adverb 太 tài 'too' and sentence-final particle 拉 la 'SFP' to mark surprise emotion. Therefore, adverbs and sentence-final particles in exclamative sentences are efficient to indicate and intensify emotions. (5) 杂这才发现我家的鱼吐水像打 kiss，声 音好大啊！太厉害拉！ zá zhè cái fāxiàn wǒ jiā de yú why this just find my home DE fish tǔ shuǐ xiàng dǎ kiss, spray water look like make kiss, shēngyīn hǎo dà a! tài lìhài la! sound so loud SFP! too amazing SFP! 'Why do I just find that my fishes look like kiss when they spray water? How loud the sound it is! How amazing they are!' Interjection is another lexical feature that can be used to indicate emotions strongly and implicitly. Interjections are considered a context-sensitive peripheral class that typically encode pragmatic meanings (Cuenca, 2000) . Norrick (2007) argued that interjections are often associated with exclamatives as items which signal both surprise and either positive or negative affect. For instance, 靠 kào 'cor' is the interjection which expresses surprise, excitement, admiration, or alarm. It is a cue in (6) to indicate a specific emotion-surprise. The following sequence is also an exclamative sentence 哥真滴败 了！gē zhēn dī bài le! 'How disappointed I am!' to intensify the surprise emotion. Therefore, interjections not only mark emotions, but also elicit exclamative sentences to intensify emotions. ( 6 'He also said that many of his friends also lived very well even though their wives knew they were gay after their marriage. As long as they were kind to their wives and didn't have affairs with other men explicitly, they'll be fine. Cor! How disappointed I am!' Structural Feature Exclamative sentences have some structural features to mark emotions as well. We found two structural features in our data: (1) reduplication; (2) NP + SFP! + S. Reduplication is the use of the same word, phrase, speech sound etc. in a poem, speech etc. (Ruse and Hopton 1992) . Reduplication is a way to express the speaker's strong emotion in an exclamative sentence (Zhan and Bai, 2016) . There are 23 posts in our dataset which employ reduplications in excalmative sentences to express emotions. The two exclamative sentences 真多啊！真多啊！zhēn duō a! zhēn duō a! 'What a big amount of money! What a big amount of money!' are the reduplication of 真 多啊！zhēn duō a! 'What a big amount of money!' in (7) to indicate strong sadness emotion. The user wants to express the strong sadness emotion because she/he has to give a big amount of money to many people at the end of the year. Discourse Feature Code-switching and slogan and blessing are two discourse features in our dataset. We will mainly discuss code-switching in this part because slogan and blessing often involve happiness emotion. Code-switching text means that there is more than one language contained in the text (Adel et al., 2013; Auer, 2013) . Code-switching posts are very popular in Chinese social media Weibo. Emotions can be expressed by either monolingual or bilingual text in the code-switching posts. As shown in Figure 2 , happiness (35.5%) is the most frequent emotion expressed by English, followed by anger (26.9%), fear (21.8), sadness (13.2%) and surprise (2.6%). Figure 2 : Emotions expressed by English For example, the anger emotion is expressed by English exclamative sentence 'what a fucking day!!!!!' and the code-switching text 简直是 fuck fuck fuck!!! jiǎnzhí shì fuck fuck fuck!!! in (9). The emotion which is expressed by another language is strong and direct. In addition, Lee (2017) argued that the repetition of exclamation marks, question marks, or the mix of two in conjunction can express strong emotion. In (9), the reduplication of punctuation can also function to intensify the emotion expressed through exclamative sentences. ( The punctuation can also be placed in the middle of a word or phrase to emphasize and intensify emotion (as in ( 10 )). Conclusion This paper observes the emotion expressions in exclamative sentences. We believe that the exclamative sentences can obtain all kinds of emotions besides surprise. Lexical features, structural features and discourse features are examined to show the close relationship between them. Firstly, some adverbs, interrogative expressions, sentence-final particles, and interjections are identified to regard them as linguistic cues to express emotions in exclamative sentences. The lexical items co-occur with the exclamative sentences in most cases (63.2%) and these exclamative sentences obtain different kinds of emotions. Then two structural features are analyzed: (1) reduplication; (2) NP + SFP! + S. These structures are often presented in exclamative sentences to mark emotions. Lastly, the discourse features are examined. Code-switching and the reduplication of punctuation can function to express and intensify emotions. We believe that the linguistic account of this study could provide a better understanding of the representations of human emotions, which is also essential for study of other disciplines. Acknowledgement",
    "abstract": "Emotions are found to be frequently involved in the exclamative sentences. This paper aims to examine the interaction between exclamative sentences and emotions in Chinese social media. We propose that exclamative sentences can express all kinds of emotions besides surprise. Fear emotion is mostly expressed in exclamative sentences. Lexical features, structural features and discourse features are analyzed to reveal a full picture of linguistic cues in emotion expressions in exclamative sentences. We believe that this study could provide a new approach for the study of sentence types in Mandarin Chinese, which is also crucial for people to understand the expressions of human emotions.",
    "countries": [
        "Hong Kong"
    ],
    "languages": [
        "Mandarin",
        "Mandarin",
        "Chinese"
    ],
    "numcitedby": "0",
    "year": "2018",
    "month": "1{--}3 December",
    "title": "Exclamative Sentences in Emotion Expressions in {M}andarin {C}hinese: A Corpus-based Approach"
}