{
    "article": "In this paper, we present Osaka University MT systems submitted to WAT 2018 shared translation tasks and analysis of their performances. For the ASPEC Japanese-English task, we use our rewarding model on neural machine translation (NMT) and preordering model on phrase-based statistical machine translation (PBSMT). For the Myanmar-English task, we further apply our mixed fine tuning method for domain adaptation on NMT. We report the translation results on these two tasks, where the rewarding model performs the best. Introduction This paper describes our systems submitted to WAT 2018 shared translation task (Nakazawa et al., 2018) and analyzes these systems. This year, Osaka University participated in two tasks: the ASPEC Japanese-English and Myanmar-English tasks. We use three different methods that we have been proposed in the past. For the first system, we use the rewarding model boosting target words in the decoder of NMT (Takebayashi et al., 2018) . It predicts target words that are promising to be used in a correct translation and rewards them to give them better chances to be output. For the second system, we preorder source sentences before translation so that the word order becomes similar to target sentences, which is applied to PBSMT (Kawara et al., 2018) . For the third system, we use our mixed fine tuning method (Chu et al., 2017) . It is a domain adaptation method that uses out-of-domain data to leverage for in-domain translation. The rewarding and preordering models are applied to both the ASPEC Japanese-English and Myanmar-English tasks, while mixed fine tuning is only applied to the Myanmar-English task because it is designed for low-resource translation. We first describe statistics of datasets provided in the translation tasks in Section 2. Then, we present the details of the rewarding model, preordering model, and mixed fine tuning, as well as our internal evaluation results in Sections 3, 4, and 5, respectively. Finally, we analyze the official results of the shared tasks in Section 6 and conclude this paper in Section 7. Datasets We conduct English-to-Japanese, Japanese-to-English, English-to-Myanmar, and Myanmar-to-English translation, referred to as En-Ja, Ja-En, En-My, and My-En for short, hereafter. Table 1 shows statistics of the datasets provided in the ASPEC (Asian Scientific Paper Excerpt Corpus) (Nakazawa et al., 2016) Japanese-English and Myanmar-English tasks. The ASPEC Japanese-English task is of a scientific domain, providing 3M, 1,790, and 1,812 sentences for training, development, and test, respectively. The Myanmar-English task provides two corpora, namely, the ALT (Asian Language Treebank) and UCSY (NLP Lab, University of Computer Studies, Yangon). The ALT corpus extracted from the Wikinews, providing 18k, 993, and 1,007 sentences for training, development, and test, respectively. The UCSY is a mixed domain corpus, which is supplementary for this task and pro- vides 208k sentences for training only. 3 Rewarding Model Model We employed the rewarding model using bilingual dictionaries (Takebayashi et al., 2018) to address the adequacy problem in NMT. Our model rewards target words that are promising to be used in correct translations by boosting their probabilities to be output by a decoder as shown in Figure 1 . Specifically, it first predicts a set of target words D f 2e that are promising to be used in translations by looking up bilingual dictionaries. Then, it rewards a target word y j if it is contained in D f 2e by adding weight to the logarithm of the posterior probability p(•) of the decoder given a source sentence X: Q(y j |y <j , X) = log p(y j |y <j , X) + λr y j , (1) where λ is the weight of reward that will be tuned using a development set. This means that our model boosts the probabilities of predicted words that might have been slipped away during beam search in the conventional decoder. We use a simple binary rewarding that performed the best in Takebayashi et al. (2018) : r y j = 1 (y j ∈ D f 2e ), 0 (otherwise). (2) Finally, a target word is output as: y j = arg max y j Q(y j |y <j , X). Experiments For the ASPEC Japanese-English task, we used the first 2M parallel sentence pairs among the entire 3M pairs sentences for training following Morishita et al. (2017) , because the remaining 1M sentences were noisy. As preprocessing, we segmented Japanese sentences using MeCab, 1 and tokenized and truecased the English sentences with the truecase.perl script in Moses 2 . We further split the words into sub-words using joint BPE (Sennrich et al., 2016) with 32, 000 merge operations. The vocabulary sizes of the Japanese and English side were 28, 852 and 22, 340, respectively. For the Myanmar-English task, we simply concatenated the available ALT and UCSY corpora for training. We tokenized and truecased the English corpus, and used the tokenized and romanized Myanmar corpus released by the organizers. We used the mlpnlp-nmt system 3 that is an LSTM based encoder-decoder NMT model with attention, which achieved the best translation performance in human evaluations for both the Ja-En, and En-Ja tasks at WAT 2017 (Nakazawa et al., 2017) . We implemented our rewarding model on top of the mlpnlp-nmt system. We followed the hyperparameter settings of Morishita et al. (2017) . We used 2-layer LSTMs for both the encoder and decoder with the beam size of 5. Stochastic gradient descent was used as the learning algorithm, with an initial learning rate of 1.0. The mini batch size was 128. For the rewarding model, accurate prediction of D f 2e is crucial. We used the GIZA++ toolkit 4 on the training corpus to automatically create a bilingual dictionary. We applied the \"grow-diag-finaland\" heuristic and obtained lexical translation probabilities using Moses. 5 We then pruned translation pairs with low probabilities by δ. λ in Equation ( 1 ) was tuned on the development sets from 0.1 to 1.0 by 0.1 interval. The threshold δ was tuned on 0, 0.0001, 0.001, 0.01 and 0.1 for the Japanese-English task and 0 and 0.001 for the Myanmar-English task. We selected the best combination among all combinations of δ and λ on the development set for each model. Table 2 shows the BLEU scores of each task on the test sets. We can see that the rewarding model improves the BLEU score for 0.57 points and 1.07 s 0 s j+1 y j ! \" #-1 ! \" # ! \" #+1 … … … … Encoder Decoder x i-1 x i x i+1 s j … … x 1 x 2 x n Word Prediction Rewarding Model Softmax layer D f2e … y j-1 y j $ % \" i-1 % \" i % \" i+1 Figure 1 : Rewarding model at decoding step j: predicted target words D f 2e are rewarded to have better chances to be output at each decoding time step. Note that the attention model is omitted for clarity. En-Ja Ja  points in the En-Ja and Ja-En tasks, respectively. However, there are no significant differences between the mlpnlp-nmt and the proposed model in the En-My and My-En tasks. We think the reason for this is that word alignments between English and Myanmar are not reliable because the size of the corpus is too small, which significantly degrades the word prediction quality. Hence, the rewarding model could not reward correct words. Table 3, 4 show that the precision and recall of unigram calculated by comparing the translation hypotheses against the reference translations on WAT 2018 AS-PEC Japanese-English and Myanmar-English tasks, respectively. We can see that the recall increase 1.19 and 1.43 in exchange of decreasing the precision on En-Ja and Ja-En tasks, respectively. However, there are no significant differences between the mlpnlpnmt and the proposed model in the En-My and My-En tasks. 4 Preordering Model En-My Model The word order between source and target languages significantly influences the translation quality in MT. Preordering, arranging words of source sentences so that the order is similar to that of the target language before translation, can effectively address this problem and significantly improves BLEU score of PBSMT (Nakagawa, 2015) . Although NMT has been shown its strong performance in translation, it requires a large amount of training corpus, which is not the case for the Myanmar-English task. Hence, we use our preordering model with PBSMT for WAT submission. We applied the preordering model based on recursive neural networks (RvNN) (Kawara et al., 2018) to En-Ja and Ja-En translation for ASPEC and En-My translation for the Myanmar-English tasks. 6 We first parse source sentences to obtain their syntax trees with a parser, then assign either Inverted (I) or Straight (S) labels at each node of the source syn- tax tree to indicate whether the node should be reordered or not. Gold labels are automatically determined to achieve the highest Kendall's τ computed based on word alignment links. RvNN predicts labels at the node in test time and reorders source sentences. We then train a PBSMT system with reordered source sentences. Figure 2 shows an example of the labeled parse tree of the English sentence \"My parents live in London.\" RvNN learns to predict correct labels for nodes of a source syntax tree. For example, at the VP node of \"live in London,\" its child nodes of \"live\" and \"in London\" are inverted to have the same word order with the Japanese counterpart. Experiments We used Stanford CoreNLP 7 for tokenization and POS tagging, Enju 8 for parsing of English, and MeCab 9 for tokenization and Ckylark for parsing 10 of Japanese. Myanmar corpus was tokenized and romanized by organizers. For the En-My translation, we concatenated the ALT and UCSY corpora for training. For word alignment, we used MGIZA. 11 Source-to-target and target-tosource word alignments were calculated using IBM model 1 and hidden Markov model, and they were combined with the intersection heuristic following Nakagawa (2015). We used 100k sentences sampled from training corpus for preordering. The embedding size and hidden size were set to 200. The vocabulary size was set to 50k. We used Adam (Kingma and Ba, 2015) with a weight decay (10 −4 ) and gradient clipping (5) for optimization. The mini batch size was set to 500. For PBSMT, we used Moses. 12 We trained the 5gram language model on the target side of the training corpus with KenLM. 13 Tuning was performed by minimum error rate training (Och, 2003) . We repeated tuning and testing of each model 3 times and reported the average of scores. The distortion limit of PBSMT system trained by preordered sentences was set to 0, while that without preordering was set to 20. Table 5 shows the results. We can see that the preordering model improves the results on the PB-SMT (4.62, 1.99, 1.22 for En-Ja, Ja-En, En-My, respectively). Translation quality of the En-My task is improved less than the En-Ja task (1.22 point and 4.62 point, respectively). We think this is caused by unbalanced corpus sizes of ALT and UCSY. The ALT corpus, from which the test set was derived, is significantly smaller than the UCSY corpus. This makes the English-Myanmar translation task difficult. Domain Adaptation Method It has been known that vanilla NMT performs poorly for domain specific translation in low-resource scenarios (Chu and Wang, 2018) . The WAT 2018 Myanmar-English task is a low-resource setting that only contains 18k in-domain training sentences for the ALT task. However, it also provides the UCSY out-of-domain corpus, containing 208k training sentences. This is a proper domain adaptation setting, where out-of-domain data can be leveraged for indomain translation. In this work, we applied the domain adaptation method of mixed fine tuning (see Figure 3 ) for the WAT 2018 Myanmar-English task. Mixed fine tuning is a transfer learning based approach proposed by Chu et al. (2017) . We first train an NMT model on the resource-rich out-of-domain (i.e., UCSY) corpus till convergence. Then we resume training on the in-domain (i.e., ALT) and out-of-domain (i.e., UCSY) mixed corpus, which simply concatenates the corpora of two domains by appending artificial tokens that indicate the domains and by oversampling the corpus of the resource-poor domain (i.e., ALT). This prevents over-fitting and enables smooth domain transition. Experiments For English, we tokenized and true-cased the sentences using the tokenizer.perl and truecase.perl scripts in Moses. For Myanmar, we used the transcribed and tokenized data released by the organizers. For the NMT system, we used the open source implementation of the Transformer model (Vaswani et al., 2017) in tensor2tensor 14 . We used the Transformer because it is the current state-of-the-art NMT model. For training, we used the default model settings corresponding to transformer base single gpu in the implementation and to base model in (Vaswani et al., 2017) . We compared the MT performance with vanilla NMT, which was trained on the indomain data only using the Transformer. We trained 100k steps for the vanilla NMT system. For mixed fine tuning, we trained the out-of-domain and fine tuning models for 200k and 200k steps, respectively. As development and test data were not provided for  the UCSY corpus, we randomly sampled 1, 043 and 1, 043 sentences from the corpus for development and test, respectively. Note that we removed the development and test sentences from the UCSY corpus for training. Table 6 shows the results. We can see that mixed fine tuning significantly improves the results on the My-En direction (10.18 BLEU points higher) but performs worse than vanilla NMT on the En-My direction (2.83 BLEU points lower). We think the reason for this is that Myanmar sentences were tokenized into writing units and romanized and thus has a very small vocabulary. This makes the output word embeddings good enough for the En-My translation direction when training on the in-domain data only. Mixed fine tuning on the mixed data decreases the quality of word output word embeddings due to the mix of domains, leading to the drop in BLEU scores.  and reference sentences. RIBES is calculated based on uni-gram precision and similarity the word order between system output and reference sentence. AMFM is calculated based on both adequacy and fluency, which is designed to decouple semantic and syntactic components of the translation process to provide a balanced view of translation quality. Because human evaluation was restricted to 2 systems of each team, we report human evaluation results of ASPEC En-Ja and Ja-En tasks for the rewarding and preordering systems, and a result of the My-En task for the rewarding and mixed fine tuning systems, and En-My tasks for all systems. We can see that in terms of BLEU score and human evaluation, the rewarding model performed best among our three systems for all languages. In terms of AMFM, preordering and mixed fine tuning achieved 3.4 and 4.11 points higher scores than the rewarding model in the En-My and My-En tasks, respectively. Official Results on WAT 2018 Our rewarding model outperformed the organizer's baseline of NMT with attention for 1.64 BLEU points on En-Ja task. However, the organizer's baseline of the Transformer achieved 2.78 and 1.87 higher BLEU points than the rewarding model on En-Ja and Ja-En, respectively. Because the rewarding model can be easily applied to different NMT decoders, we will apply it to the Trans-former for further improvement. For En-My and My-En translations, our rewarding model is comparable to the organizer's baseline (En-My) and 3.06 BLEU points lower (My-En) due to the poor word alignment quality as discussed in Section 3.2. There are significant gaps between our results and those of the best systems. These best systems ensemble multiple systems, while all of our results are from a single system. Ensembling multiple systems would improve our results, which is the future work. Conclusion We have described our systems submitted to WAT 2018 shared translation tasks. Among which, the rewarding model showed the best performance. As future work, we first plan to conduct system combination of these three systems. Secondly, we will apply the rewarding model to the decoder of the Transformer in order to further improve its translation quality. Acknowledgments This work was supported by NTT communication science laboratories and Grant-in-Aid for Research Activity Start-up #17H06822, JSPS. References Chenhui Chu and Rui Wang. 2018",
    "abstract": "In this paper, we present Osaka University MT systems submitted to WAT 2018 shared translation tasks and analysis of their performances. For the ASPEC Japanese-English task, we use our rewarding model on neural machine translation (NMT) and preordering model on phrase-based statistical machine translation (PBSMT). For the Myanmar-English task, we further apply our mixed fine tuning method for domain adaptation on NMT. We report the translation results on these two tasks, where the rewarding model performs the best.",
    "countries": [
        "Japan"
    ],
    "languages": [
        "Japanese",
        "English"
    ],
    "numcitedby": "3",
    "year": "2018",
    "month": "1{--}3 December",
    "title": "{O}saka {U}niversity {MT} Systems for {WAT} 2018: Rewarding, Preordering, and Domain Adaptation"
}